       IDENTIFICATION DIVISION.
       PROGRAM-ID. PDSNA13.
       AUTHOR. Nicola.
      *--------------------------------------------------------------*
      *--------------------------------------------------------------*
      *  ------------>>>>>>> VERSIONE  CICS  <<<<<<<-----------      *
      *                      27.10.2010                              *
      *  ------------>>>>>>> VERSIONE  CICS  <<<<<<<-----------      *
      *--------------------------------------------------------------*
      *--------------------------------------------------------------*
      *                                                              *
      *  Ad ogni variazione aggiorna WK_VERSION  <--------           *
      *                                                              *
      *--------------------------------------------------------------*
      * CODICE APPLICAZIONI PARTICOLARI:       aggiornare            *
      * G21 ANTICIPO NASPI                                           *
      * G96 RIVERSAMENTO ANPAL    CALCOLO IMPORTO DALLA DECORRENZA   *
      *                           SENZA SOSPENSIONI CODSOS 59        *
      * G97 TIROCINIO GIOVANI     CALCOLO TRA DUE DATE               *
      * G98 INCENTIVO AL REMPIEGO CALCOLO MENSILE                    *
      * G99 Incentivo al reimpiego calcolo totale                    *
      *                                                              *
      *                                                              *
      *--------------------------------------------------------------*
      *$ OPTION      *SRCDBG                                         *
      *                                                              *
      * >Le istruzioni per la gestione dei dati del modello 730 sono *
      *  momentaneamente commentate.                                 *
      *                                                              *
      *                                                              *
      * 1° rilascio: xx/05/2015 -   Autore: NICOLA                   *
      *--------------------------------------------------------------*
      * Ultima variazione   Data:      19/02/2024                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifiche controllo esito elaborazione di     *
      *                definizione senza pagamento                   *
      *     -- variazione   Data:      16/02/2024                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifiche ed implementazioni L353- per        *
      *                redditi compatibili                           *
      *     -- variazione   Data:      09/02/2024                    *
      *       Autore: Nicola                                         *
      *       Motivo:- implementazione codice attività CD per        *
      *                anticipazione naspi                           *
      *     -- variazione   Data:      13/01/2024                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica per pagare naspi con reddito 2023    *
      *                a zero e senza dichiarazione 2024             *
      * Ultima variazione   Data:      10/01/2024                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica limite reddito subordinato att.      *
      *                compatibile dal 2024                          *
      *                gestione qualifica 'U' per DISCOLL           *
      *     -- variazione   Data:      05/01/2024                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica per errore controllo presenza reddito*
      *                anno corrente su pagamento anno precedente    *
      *     -- variazione   Data:      10/10/2023                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica IC-/OC-PMEUITRSIE pic s9(05)v99      *
      *                x trattenute sindacali anticipazione naspi    *
      *     -- variazione   Data:      07/06/2023                    *
      *       Autore: Nicola                                         *
      *       Motivo:- forzato ic-dcocodfis x definizione            *
      *     -- variazione   Data:      19/05/2023                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione sospensioni 59 per anticipazione     *
      *     -- variazione   Data:      18/05/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita storicizzazione dati TDSAUTLA nella  *
      *                tabella TDSSAUT0.                             *
      *     -- variazione   Data:      16/05/2023                    *
      *       Autore: Nicola                                         *
      *       Motivo:- forzato ic-dcocodfis x definizione            *
      *                                anticipazione deceduti        *
      *     -- variazione   Data:      20/04/2023                    *
      *       Autore: Nicola                                         *
      *       Motivo:- forzato ic-dcocodfis in ic-codfisarca per    *
      *               anomalia calcolo anticipazione deceduti        *
      * * * *                                                        *
      *     -- variazione   Data:      28/09/2022                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita la gestione dell'iban estero.        *
      *               (completata a marzo 2023)                      *
      *     -- variazione   Data:      22/09/2022                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica esame risposta verifica certifica-   *
      *                zione coppia IBAN - CF                        *
      *                                                              *
      *     -- variazione   Data:      18/05/2022                    *
      *       Autore: Elena                                          *
      *       Motivo:- modificati i limiti di reddito da lavoro auto-*
      *                nomo, subord e parasubord ai fini della con-  *
      *                servazione dello stato di disoccupazione.     *
      *     -- variazione   Data:      28/02/2022                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Scrittura periodi effettivi per DISCOLL con   *
      *                data cessazione nel 2022                      *
      *     -- variazione   Data:      01/12/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione Anticipo NASPI codice attività = Q   *
      *                da non tassare - aggiornamenti                *
      *     -- variazione   Data:      19/10/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione Anticipo NASPI codice attività = Q   *
      *                da non tassare                                *
      *     -- variazione   Data:      27/09/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- nei mesi da agosto a dicembre le elaborazioni *
      *                non possono avviarsi prima delle ore 01:30    *
      *                per necessità relative al conguaglio 730      *
      *     -- variazione   Data:      14/09/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo BUNUS covid incompatibili  *
      *                memorizzo gg lav ultimi 12 mesi x naspi       *
      *     -- variazione   Data:      06/07/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione somme decalage                       *
      *     -- variazione   Data:      07/06/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo pag < 10 euro              *
      *                se è il primo bisogna effettuarlo.....        *
      *     -- variazione   Data:      11/05/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Verifica titolarità cf - iban                 *
      *                consentito pagamento se CAB e IBAN non validi *
      *               (caso chiusura sportello bancario)             *
      *     -- variazione   Data:      30/04/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Neutralizzazione naspi < 30 gg ultimi 12 mesi *
      *           periodo dal 01/01 al 23/03_2021 = Y - lista blocchi*
      *     -- variazione   Data:      19/04/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Riattiv.controllo titolarita per IBAN  UBI    *
      *     -- variazione   Data:      02/04/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Sospeso controllo titolarita per IBAN  UBI    *
      *     -- variazione   Data:      27/03/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Verifica titolarità e controllo  SCUP x IBAN  *
      *                modificata RDSUT28 x controllo SCUP x CF      *
      *     -- variazione   Data:      29/01/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- esclusione G98 e G99 da alcuni controlli      *
      *     -- variazione   Data:      21/01/2021                    *
      *       Autore: Nicola                                         *
      *       Motivo:- CORREZIONE SE TDSAUTLA SOLO ANNO SUCCESSIVO
      *     -- variazione   Data:      15/12/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- esclusione record TDSAUTLA precedenti e       *
      *                successivi periodo prestazione........        *
      *     -- variazione   Data:      02/12/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- sbloccato pagamento effettivo x domande con   *
      *               record TDSAUTLA fino a 40 .............        *
      *              - controllo RDSNA12 sempre .............        *
      *     -- variazione   Data:      16/11/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- aumento da 5 a 40 ricorrenze gestite TDSAUTLA *
      *               (solo x simulazione)...................        *
      *     -- variazione   Data:      13/10/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione dcoflasu 62 e 70 proroga DL104/2020  *
      *              - gestione dcoflasu nuovi + reiezioni/revoche   *
      *              - modifica controllo sussidi revocati/restituiti*
      *     -- variazione   Data:      05/10/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione dcoflasu 09                          *
      *     -- variazione   Data:      15/09/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione dcoflasu 99                          *
      *              - inizializzazione campi verifica telematico    *
      *     -- variazione   Data:      22/07/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione proroghe DL34/2020 con decadenza     *
      *              - eliminazione chiamata pop730 per modifica GF  *
      *     -- variazione   Data:      23/06/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione flag h_dcoflasu x prest.incompatibili*
      *                gestione proroga NASPI e DISCOLL -  DL34/2020 *
      *     -- variazione   Data:      09/03/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica gestione dati ANF per limitare       *
      *                caricamento record superflui.                 *
      *     -- variazione   Data:      20/01/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica gestione  INSERT  INTO TDSREPOR      *
      *                per proseguire anche in caso di errore        *
      *                per G21,  G96,  G97,  G98                     *
      *     -- variazione   Data:      22/10/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Gestione pagamento domanda con CF collegato   *
      *                di soggetti che hanno conguagli/assistenza/730*
      *              - esclusione dati ANF successivi    in L30......*
      *     -- variazione   Data:      30/09/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica gestione nel caso di variazione CF   *
      *                di soggetti che hanno richiesto assistenza 730*
      *                perchè nn viene gestita dalla Piattaforma Fisc*
      *     -- variazione   Data:      29/07/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- blocco pagamento dal 05/03/2019 per domande   *
      *                con csc  =  30103                             *
      *     -- variazione   Data:      24/05/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- esclusione DCOINT / inclusione DCOFLASU       *
      *     -- variazione   Data:      09/05/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- scrittura periodi effettivi sempre....        *
      *     -- variazione   Data:      18/04/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Variazione limite a 5000 euro dal 2017        *
      *                lavoro accessorio.                            *
      *     -- variazione   Data:      11/04/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- controllo csc 30103 - msg 909 del 2019        *
      *     -- variazione   Data:      28/02/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Asteriscato 'cancel PDSNA02' test su 42 --> ok*
      *     -- variazione   Data:      07/02/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Asteriscato 'cancel PDSNA42'                  *
      *     -- variazione   Data:      30/01/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- controllo gestione per ANF diretti  ......    *
      *              - controllo domande definite a zero   ......    *
      *              - controllo domande definite indebite e se..    *
      *                AADMODARR = 9 (avvisato f.gonzales) elaborare *
      *              - trascrizione PMEINDUIM se indebita  ......    *
      *     -- variazione   Data:      02/01/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- verifica gg detrazione >  gg prestazione      *
      *     -- variazione   Data:      30/11/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica gestione per AUTREDGEFF              *
      *                modifica ULPEDAL/ULPEAL per ANFdiretti....    *
      *     -- variazione   Data:      20/09/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- blocco pagamento < 10 euro domande in L       *
      *     -- variazione   Data:      07/08/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Nuovi controlli su recuperi                   *
      *     -- variazione   Data:      31/07/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Memorizzo Periodo Effettivo per Anticipazione *
      *     -- variazione   Data:      28/03/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- escludo da calcolo domanda con AUTPROGR > 5   *
      *                in attesa di adeguamento procedurale          *
      *              - modifica controllo dati recuperi / acconti    *
      *     -- variazione   Data:      28/02/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica L15-SCARTARE - pag.reale singolo     *
      *             :- controllo data simulazione                    *
      *             :- modifica limite pag.effettivo da 1000 a 2000  *
      *             :- commentata cancel rdsut28                     *
      *     -- variazione   Data:      13/02/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- commentata CANCEL di RDSUT10 (x calcolo date) *
      *        variazione   Data:      09/02/2018                    *
      *       Autore: Nicola                                         *
      *       Motivo:- sezione L15-SCARTARE  per limitare call ..02  *
      *     -- variazione   Data:      04/12/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Controllo correlato L14-  E25-                *
      *     -- variazione   Data:      24/11/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- limite blocchi pagamenti 1000                 *
      *     -- variazione   Data:      27/10/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo E25-  e RDSPD13            *
      *     -- variazione   Data:      25/09/2017                    *
      *       Motivo:- memorizzo eccezioni    statistiche per NASPI  *
      *     -- variazione   Data:      28/08/2017                    *
      *       Motivo:- memorizzo informazioni statistiche per NASPI  *
      *                in h_n0codice9  e  h_n0importo9               *
      *     -- variazione   Data:      22/08/2017                    *
      *       Motivo:- modifica gestione x Codice Fiscale Collegato  *
      *                H_PMESTAPAG  =  'C'                           *
      *     -- variazione   Data:      10/08/2017                    *
      *       Motivo:- sblocco domande DISCOLL cessazione > 06/2017  *
      *     -- variazione   Data:      08/08/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Gestione riduzione chiamate ARCA ( E311 )     *
      *     -- variazione   Data:      25/07/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Gestione riduzione chiamate ARCA ( E311 )    *
      *     -- variazione   Data:      30/05/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- sblocco domande DISCOLL cessazione 2017       *
      *     -- variazione   Data:      11/05/2017                    *
      *       Autore: giuseppe                                       *
      *       Motivo:- gestione AUTLAV esodati                       *
      *     -- variazione   Data:      15/03/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- controllo giorni prestazione stagionali       *
      *     -- variazione   Data:      08/03/2017 ripristino CANCEL  *
      *     -- variazione   Data:      07/03/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- commento CANCEL                               *
      *     -- variazione   Data:      17/01/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- determino DTRUPA per primi pagamenti gennaio  *
      *     -- variazione   Data:      11/01/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- sblocco pagamento Stagionali 2016             *
      *     -- variazione   Data:      28/09/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Gestione pagamenti < di euro 2,01 con recupero*
      *                su indennità                   .............. *
      *     -- variazione   Data:      15/09/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Selezione rec.ANF da passare a PDSRD02        *
      *     -- variazione   Data:      14/09/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- sblocco controllo dati ANF del 05/09/16       *
      *     -- variazione   Data:      08/09/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica per definizione con pagamento        *
      *                indennità ed ANF indebiti ................... *
      *     -- variazione   Data:      05/09/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- controllo pagamenti ANF senza ANFprest        *
      *     -- variazione   Data:      29/08/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- blocco pagamento ANF per Tunisini             *
      *                Gestione ANF diretti indebiti                 *
      *     -- variazione   Data:      27/07/2016                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Anticipo Naspi inserito controllo pagamento   *
      *                solo dopo decorrenza  domanda NASPI           *
      *     -- variazione   Data:      13/06/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo recupero (imp. negativi)   *
      *     -- variazione   Data:      09/05/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- sblocco domande DISCOLL cessazione 2016       *
      *     -- variazione   Data:      20/04/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione E28 per eliminazione msg squadratura *
      *     -- variazione   Data:      04/03/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- commentate modifiche del 03/02/2016           *
      *     -- variazione   Data:      03/02/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica x conguaglio prestazioni pagate x    *
      *                gennaio 2016 ridotte del 30%                  *
      *     -- variazione   Data:      08/01/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica x sospensioni tutte dopo fine teorico*
      *     -- variazione   Data:      11/12/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica per stagionali 2015                  *
      *     -- variazione   Data:      30/11/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica per impostare/richiedere DCO DTCODO  *
      *     -- variazione   Data:      26/11/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica per impostare/richiedere DCO DTCODO  *
      *     -- variazione   Data:      13/11/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica per definizione domande con teorico  *
      *                minore del pagato (routin2 FPFinsiel ricalcolo*
      *              - Modifica per coordinate bancarie e blocco IBAN*
      *              - Controllo CF validato in TDSBLKPA             *
      *     -- variazione   Data:      05/11/2015                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Blocco iban                                   *
      *     -- variazione   Data:      02/11/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- variazioni per errore calcolo int. legali     *
      *              - variazione per deceduti                       *
      *     -- variazione   Data:      01/10/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- variazioni per inconveniente tabella OC-      *
      *                AUT LA priva di indice-progressivo            *
      *     -- variazione   Data:      08/09/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- variazioni per gestione attività compatibili  *
      *     -- variazione   Data:      29/05/2015                    *
      *       Autore: Nicola                                         *
      *       Motivo:- In produzione solo per DISCOLL - cotido = Q   *
      *--------------------------------------------------------------*
      * Funzione :  Calcolo domande  DISCOLL  e  NASpI               *
      *                                                              *
      * PGM Chiamante : -------->  PDSxxx1                           *
      * PGM chiamati:                                                *
      *             PDSNA02    per calcolo pagam. DISCOLL e NASpI    *
      *             PDSNA42    per test calcolo DISCOLL e  NASpI     *
      *             PDSPD16    per gestione lavori struttura         *
      *             RDSUT11    per msg a video                       *
      *             RDSUT13    per decodifica comuni                 *
      *             RDSUT15    per Anagrafica                        *
      *             RDSUT28    per Blocco Pagamento per CF           *
      *             RDSJOB1    per modifica cola lavori              *
      *             RDSUSR1    per identif. utente                   *
      *             RDSERR0    per mappa errori                      *
      *             RDSOR12    per strutture attive                  *
      *             PNPGFD0    per gestione fiscale                  *
      *             RNPYEAR    per data                              *
      *                                                              *
      * Dati ricevuti :  Nessuno.                                    *
      * Dati passati  :  Nessuno.                                    *
      *                                                              *
      * ARCHIVI        :  Input/Output                               *
      *  2  RIEPILOGO  -   TDSRPG00   -  Riepilogo pagamenti G00     *
      * ARCHIVI        :  Input                                      *
      *  3  ANTIC. NASPI   TDS.....   -  Anticipazione NASPI         *
      *  4  RIMPATRIATI-   TDSRIFRS   -  Tabella NON necessaria      *
      * ARCHIVI        :  Input/Output                               *
      *  5  DATICOMUNI -   LFDATCO2   -  logico su dati-comuni       *
      *  6  RECUPERI       TDSRECUP   -  File recuperi               *
      *  7  EFFEROGATI     LFPEERE1   -  Logico su ADSPEERE          *
      *  8  SITUAZIODO     TDSSITDO   -  Situazione domanda          *
      *  9  PAGAMENTI      TDSPAGME   -  Archivio pagamenti          *
      * 10  APPOGGIO       TDSAPNA0   -  Arch. app. pagam. NASpI     *
      * ARCHIVI        :  Input                                      *
      * 11  LRIEPILOGO -   LDSRPG01   -  logico su riepilogo-pagament*
      * 12  ANAGRAFICI     TDSDATAN   -  File dati anagrafici        *
      * 13  DELEGHE        LFDELSI1   -  Logico su ADSDELSI          *
      * 14  DATIANF        LFMODAN1   -  Logico si ADSMODAN          *
      * 15  DSCOMUNI       TDSDACOD   -  File dati comuni DS         *
      * 16  SOSPENSIONI    LFSOSPE1   -  vista Tabella sospensioni   *
      * 17  TEOEROGABI     LFPEERT1   -  LF Periodi erogabili teorici*
      * 18  PENSIONI       TDSPENSI   -  Pensioni                    *
      * nn  L02COMUNI  -   LFDATCO2   -  logico su dati-comuni       *
      *                :  Output                                     *
      * 19  STAMPA         SDSPD13    -  File di stampa              *
      * ARCHIVI        :  Input                                      *
      *                               -  Tabella NON necessaria      *
      * 20  REGIMECEE      TDSREINC   -  Tabella NON necessaria      *
      * 21  EDILI          TDSEDILI   -  Tabella NON necessaria      *
      * 22  MARITTIMI      TDSMARIT   -  Tabella NON necessaria      *
      * 24  DISCOLL    -   TDSDICOL   -  tabella specifica parasubor.*
      *     NASPI      -   TDSNASPI   -  tabella specifica NASPI    .*
      * 25  AUTLA      -   TDSAUTLA   -  attività autonoma           *
      * 26  ASPRI      -   TDSASPRI   -  Dati contribuzione ridotta  *
      * ARCHIVI        :  Input/Output                               *
      * 23  ANFDI      -   TDSANFDI   -  ANF diretti                 *
      *--------------------------------------------------------------*
      *   NOME PGM:   PDSNA13                                        *
      *    Programma NuovaASpI                numero 13              *
      *--------------------------------------------------------------*
      * Display file :                                               *
      * 01  VIDEO          MDSPD13    -  File video                  *
      *--------------------------------------------------------------*
      * Printer file :                                               *
      * 19  STAMPA         SDSPD13    -  Printer file                *
      *--------------------------------------------------------------*
      *                                                              *
      * Descrizione funzionale : Gestione calcolo generalizzato      *
      *            domande  DISCOLL  ed  NASpI                       *
      *                                                              *
      *--------------------------------------------------------------*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.

       SPECIAL-NAMES.
      *SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
      *                                                              *

       I-O-CONTROL.
      *
       DATA DIVISION.
      *
       FILE SECTION.
      *                                                              *
       WORKING-STORAGE SECTION.
      * anticipazione
       01  WRK-PMEINDUIME         PIC  9(7).9(2).
      *
       01  WRK-DCODTADEC          PIC  9(8).
      *
       01  WRK-CONTA-SOS          PIC S9(7)V9(2) USAGE COMP-3.
280817 01  WRK-CONTA-BLKPA        PIC S9(7)V9(2) USAGE COMP-3.
      *
      * AREA APPOGGIO PER STAMPE
      *
       01  WK-RPT-KEY.
           05  WK-RPT-SEDE        PIC 9(04).
           05  WK-RPT-CEOP        PIC 9(02).
           05  WK-RPT-MATRICOLA   PIC 9(08).
           05  WK-RPT-DTA-PRE     PIC X(10).
           05  WK-RPT-ORA-PRE     PIC X(08).
      *
      * PER CHIAMATA CICS
      *
       01  WDFHCOMMAREA                PIC X(1).
       01  WDFHEIBLK                   PIC X(85).
      *
      * COMODO PER CHIAMATA CALL
      *
       01  PDSAU41                    PIC X(08) VALUE 'PDSAU41 '.
       01  PDSPD05                    PIC X(08) VALUE 'PDSPD05 '.
       01  PDSPD07                    PIC X(08) VALUE 'PDSPD07 '.
       01  PDSPD08                    PIC X(08) VALUE 'PDSPD08 '.
       01  PDSPD13                    PIC X(08) VALUE 'PDSPD13 '.
       01  PDSPD16                    PIC X(08) VALUE 'PDSPD16 '.
      *n1  PDSRD21                    PIC X(08) VALUE 'PDSRD21 '.
      *n1  PDSRD22                    PIC X(08) VALUE 'PDSRD22 '.
      *n1  PDSRD23                    PIC X(08) VALUE 'PDSRD23 '.
       01  PDSNA02                    PIC X(08) VALUE 'PDSNA02 '.
       01  PDSNA42                    PIC X(08) VALUE 'PDSNA42 '.
       01  RDSCONT                    PIC X(08) VALUE 'RDSCONT '.
       01  RDSPD13                    PIC X(08) VALUE 'RDSPD13 '.
       01  RDSNA12                    PIC X(08) VALUE 'RDSNA12 '.
       01  RDSNA13                    PIC X(08) VALUE 'RDSNA13 '.
131115*01  RDSUT09                    PIC X(08) VALUE 'RDSUT09 '.
131115 01  PITIBAN2                   PIC X(08) VALUE 'PITIBAN2'.
       01  RDSUT10                    PIC X(08) VALUE 'RDSUT11 '.
       01  RDSUT14                    PIC X(08) VALUE 'RDSUT15 '.
271014*01  RDSUT18                    PIC X(08) VALUE 'RDSUT18 '.
       01  RDSUT27                    PIC X(08) VALUE 'RDSUT27 '.
       01  RDSUT28                    PIC X(08) VALUE 'RDSUT28 '.
       01  PDSLOCK                    PIC X(08) VALUE 'PDSLOCK '.
270321 01  PNBTCFIB                   PIC X(08) VALUE 'PNBTCFIB'.
270321 01  PNBTBLC2                   PIC X(08) VALUE 'PNBTBLC2'.
      *
       01  L-NUM-RIGA                 PIC 9(04) VALUE 0 .
      *
       01  WK-TIMESTAMP-DATA-ORA.
           05  WK-AA                         PIC X(4).
           05  WK-MM                         PIC X(2).
           05  WK-GG                         PIC X(2).
           05  WK-H                          PIC X(2).
           05  WK-M                          PIC X(2).
           05  WK-S                          PIC X(2).
270921 01  W-T-HH-MM.
           05  W-T-HH                        pic x(2)    value '00'.
           05  W-T-MM                        pic x(2)    value '01'.
270921 01  W-HH-MM   redefines W-T-HH-MM     pic 9(4).
      *---------------------------- GESTIONE DATA DB2 -----------------*
       01  WW-DB2-DATA.
           05  WW-DB2-GG                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-MM                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-AA.
               10  WW-DB2-SEC                PIC X(2)    VALUE '00'.
               10  WW-DB2-ANNO               PIC X(2)    VALUE '01'.
       01  WK-DB2-DATA REDEFINES WW-DB2-DATA PIC X(10).
      *
      *---------------------------- GESTIONE ORA PRE-FILE -------------*
       01  WW-DB2-TIME.
           05  WW-DB2-HH                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-T-MM                   PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-SS                     PIC X(2)    VALUE '01'.
      *
      *** PER IL TRASFERIMENTO DELLA DATA NEL CORRISPONDENTE CAMPO DELLA
      ***  TABELLA DB2 E' NECESSARIO UTILIZZARE UN CAMPO NON SOTTOLIVEL-
      ***  LATO, PER CUI SI MUOVERA'  'WK'.
      *
       01  WK-DB2-TIME REDEFINES WW-DB2-TIME PIC X(8).
      *
       01  R-STAMPA.
           02  filler                 pic x(200).
      *
       01  W-PERIODI.
           03   ANNO-DAL-IN1      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN1    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN1       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN1     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN2      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN2    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN2       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN2     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN3      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN3    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN3       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN3     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN4      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN4    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN4       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN4     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN5      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN5    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN5       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN5     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN6      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN6    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN6       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN6     PIC S9(6)V USAGE COMP-3.
      *
      *
      *----------------------------------------------------------------*
      *    A R E A   D I   C O M U N I C A Z I O N E    S  Q  L        *
      *----------------------------------------------------------------*
      *
           EXEC SQL INCLUDE SQLCA  END-EXEC.
      *
      *---------------------------- COPY PER GESTIONE ABEND -----------*
      *
           COPY             DSWABNDB.
      *
      *---------------------------- TRACCIATI TABELLE DB2 DI PROGRAMMA *
      *
      *--1---------------------  Riepilogo dati pagamenti            *
      *   RIEPILOGO
          EXEC SQL INCLUDE TDSRPG00 END-EXEC.
      *--2---------------------  Dati specifici Anticipazione Aspi   *
      *   ANTICIPAZIONE ASPI E MINIASPI
          EXEC SQL INCLUDE TDSANTAS END-EXEC.
      *--3---------------------  Dati specifici Rimpatr.Frontal.Stagio*
      *   RIMPATRIATI
      *n  EXEC SQL INCLUDE TDSRIFRS END-EXEC.
      *--4---------------------  Dati comuni tutte prestazioni       *
      *   DATICOMUNI
          EXEC SQL INCLUDE TDSDATCO END-EXEC.
      *--5---------------------  Tabella Recuperi/acconti          *
      *   RECUPERI
          EXEC SQL INCLUDE TDSRECUP END-EXEC.
      *--6---------------------  Periodi erogati effettivi           *
      *   EFFEROGATI
      * LFPEERE1  VIEW
          EXEC SQL INCLUDE TDSPEERE END-EXEC.
      *--7---------------------  Situazione domanda                  *
      *   SITUAZIODO
          EXEC SQL INCLUDE TDSSITDO END-EXEC.
      *--8---------------------  Dati ultimo pagamento               *
      *GG PAGAMENTI
          EXEC SQL INCLUDE TDSPAGME END-EXEC.
      *--9---------------------  File appoggio                       *
      *   APPOGGIO
          EXEC SQL INCLUDE TDSAPNA0 END-EXEC.
      *-10---------------------  Dati ANAgrafici                     *
      *   ANAGRAFICI
          EXEC SQL INCLUDE TDSDATAN END-EXEC.
      *-11---------------------  Deleghe sindacali                   *
      * DELEGHE
          EXEC SQL INCLUDE TDSDELSI END-EXEC.
      *-12---------------------  Dati Assegno Nucleo Familiare       *
      *   DATIANF
          EXEC SQL INCLUDE TDSMODAN END-EXEC.
      *-13---------------------  File dati comuni Disoccupazione     *
      *   DSCOMUNI
          EXEC SQL INCLUDE TDSDACOD END-EXEC.
      *-14---------------------  Tabella H-SOSpensioni               *
      *   SOSPENSIONI
          EXEC SQL INCLUDE TDSSOSPE END-EXEC.
      *-15---------------------  Periodi erogabili teorici           *
      *   TEOEROGABI
          EXEC SQL INCLUDE TDSPEERT END-EXEC.
      *-16---------------------  H-PENsioni                          *
      *   PENSIONI
          EXEC SQL INCLUDE TDSPENSI END-EXEC.
      *-17---------------------  Regime internazionale + CEE         *
      *   REGIMECEE
      *n  EXEC SQL INCLUDE TDSREINC END-EXEC.
      *-18---------------------  Speciale   Edili                    *
      *   EDILI
      *n  EXEC SQL INCLUDE TDSEDILI END-EXEC.
      *-19---------------------  Speciale   Marittimi                *
      *   MARITTIMI
      *n  EXEC SQL INCLUDE TDSMARIT END-EXEC.
      *-20---------------------  Tabella Recuperi/acconti          *
      *   ANFDIR
          EXEC SQL INCLUDE TDSANFDI END-EXEC.
      *-21---------------------  Tabella appoggio Stampe           *
      *   TDSREPOR
          EXEC SQL INCLUDE TDSREPOR END-EXEC.
      *-22---------------------  Tabella  NASPI                    *
      *   TDSNASPI
          EXEC SQL INCLUDE TDSNASPI  END-EXEC.
      *-22b--------------------  Tabella  DISCOLL                  *
      *   TDSDICOL
          EXEC SQL INCLUDE TDSDICOL  END-EXEC.
      *-23---------------------  Tabella ASPI LAvoratori AUTonomi  *
      *   TDSAUTLA
          EXEC SQL INCLUDE TDSAUTLA END-EXEC.
      *-24---------------------  Tabella ASPRI (perc.sett.riduz.)  *
      *   TDSASPRI
          EXEC SQL INCLUDE TDSASPRI END-EXEC.
      *-25---------------------  Tabella BLOCCO(blocco pag. CF  )  *
      *   TDSBLKPA
          EXEC SQL INCLUDE TDSBLKPA END-EXEC.
220218*-26---------------------  Tabella TDSLOCK0                  *
      *   TDSLOCK0
          EXEC SQL INCLUDE TDSLOCK0 END-EXEC.
180523*-27---------------------  Tabella TDSSAUT0                  *
      *   TDSSAUT0
          EXEC SQL INCLUDE TDSSAUT0 END-EXEC.
      *
      ******************************************************************
      *       DECLARE DEI CURSORI
      ******************************************************************
      *
      * FLAG SELEZIONE CURSORE
      * 1  = 1 RANGE
      * 2=2 RANGE
      * ...
      *
       01  WK-CURS          PIC X VALUE '1'.
      *
       01  C-IND            PIC 9.
      *
           EXEC SQL
              DECLARE  CURSDCO1 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')    and
               ((H_DCOPESTDI = 'S'  and  H_DCOULESPP =     'L')
                or  (H_DCOANFRIC =     'K'))    and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO2 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')    and
               ((H_DCOPESTDI = 'S'  and  H_DCOULESPP =     'L')
                or  (H_DCOANFRIC =     'K'))    and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO3 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')    and
               ((H_DCOPESTDI = 'S'  and  H_DCOULESPP =     'L')
                or  (H_DCOANFRIC =     'K'))    and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO4 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')    and
               ((H_DCOPESTDI = 'S'  and  H_DCOULESPP =     'L')
                or  (H_DCOANFRIC =     'K'))    and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO5 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')    and
               ((H_DCOPESTDI = 'S'  and  H_DCOULESPP =     'L')
                or  (H_DCOANFRIC =     'K'))    and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO6 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')    and
               ((H_DCOPESTDI = 'S'  and  H_DCOULESPP =     'L')
                or  (H_DCOANFRIC =     'K'))    and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN6 AND :NUMERO-AL-IN6  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN6  AND   :ANNO-AL-IN6))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO1 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')   and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO2 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')   and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO3 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')   and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO4 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')   and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO5 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')   and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO6 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
      *g         H_DCOCOTIDO  in  ('U', 'Q')    and
                 H_DCOCOTIDO  in  ('U', 'Q', 'T')   and
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN6 AND :NUMERO-AL-IN6  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN6  AND   :ANNO-AL-IN6))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURRECUP CURSOR   WITH HOLD FOR
              SELECT
                H_RECCHIDOM,
                H_RECPROREC,
                H_RECTOREEE,
                H_RECTORERE,
                H_RECCOREAL,
                H_RECCORENU,
                H_RECIMPRAE,
                H_RECCAUREC,
                H_RECTIPREC,
                H_RECCHDDVI,
                H_RECIMUREE,
                H_RECDTESRE,
                H_RECNUMRAT,
                H_RECCODBIL,
                H_RECIIRPEF,
                H_RECCOSEDE
               FROM    TDSRECUP
               WHERE
                H_RECCHIDOM =  :H-RECCHIDOM
            AND H_RECCOSEDE =  :H-RECCOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURDELEG CURSOR   WITH HOLD FOR
              SELECT
                H_DSICHIDOM,
                H_DSIDTINIS,
                H_DSIDTFIIS,
                H_DSICODSIN,
                H_DSICATSIN,
                H_DSICOSEDE
               FROM    TDSDELSI
               WHERE
                H_DSICHIDOM =  :H-DSICHIDOM
            AND H_DSICOSEDE =  :H-DSICOSEDE
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURANF CURSOR   WITH HOLD FOR
              SELECT
                H_ANFCOSEDE,
                H_ANFCODFIS,
                H_ANFDTDEVA,
                H_ANFCHIDOM,
                H_ANFCONUFA,
                H_ANFNUMFIG,
                H_ANFNUMGEN,
                H_ANFPREINV,
                H_ANFTIPINV,
                H_ANFFIGMIN,
                H_ANFTIPNUC,
                H_ANFREDFAE,
                H_ANFANRIRE,
                H_ANFTABELLA,
                H_ANFIMPMENS,
                H_ANFIMPGIOR
               FROM    TDSMODAN
               WHERE
                H_ANFCHIDOM =  :H-ANFCHIDOM
            AND H_ANFCODFIS =  :H-ANFCODFIS
            AND H_ANFCOSEDE =  :H-ANFCOSEDE
           ORDER BY  H_ANFDTDEVA
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURFDIR CURSOR   WITH HOLD FOR
              SELECT
                    H_AADCHIDOM,
                    H_AADPROANF,
                    H_AADCOSEDE,
                    H_AADDAL,
                    H_AADAL,
                    H_AADRECUP,
                    H_AADIMPSPE,
                    H_AADPREDOM,
                    H_AADSTAPAG,
                    H_AADDATASTA,
                    H_AADMODARR
               FROM    TDSANFDI
               WHERE
                H_AADCHIDOM =  :H-AADCHIDOM
            AND H_AADCOSEDE =  :H-AADCOSEDE
            ORDER BY  H_AADPROANF
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURSOSP CURSOR   WITH HOLD FOR
              SELECT
                H_SOSCOSEDE,
                H_SOSCODFIS,
                H_SOSDTINSOS,
                H_SOSCHIDOM,
                H_SOSDTFISOS,
                H_SOSCODSOS,
                H_SOSDTCOM
               FROM    TDSSOSPE
               WHERE
                H_SOSCHIDOM  =  :H-SOSCHIDOM
            AND H_SOSDTINSOS <  :H-SOSDTINSOS
            AND H_SOSCOSEDE  =  :H-SOSCOSEDE
            ORDER BY H_SOSDTINSOS
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURGABI CURSOR   WITH HOLD FOR
              SELECT
                H_PETCODFIS,
                H_PETCOSEDE,
                H_PETCHIDOM,
                H_PETPEERTD,
                H_PETCOTIPR,
                H_PETPEERTA,
                H_PETNUGITE
               FROM    TDSPEERT
               WHERE
                H_PETCHIDOM =  :H-PETCHIDOM
            AND H_PETCODFIS =  :H-PETCODFIS
            AND H_PETCOSEDE =  :H-PETCOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURPENS CURSOR   WITH HOLD FOR
              SELECT
                H_PENCOSEDE,
                H_PENCODFIS,
                H_PENCATPEN,
                H_PENPROPEN,
                H_PENCHIDOM,
                H_PENDTDEPE,
                H_PENIMPPEE
               FROM    TDSPENSI
               WHERE
                H_PENCHIDOM =  :H-PENCHIDOM
            AND H_PENCOSEDE =  :H-PENCOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURREC43 CURSOR   WITH HOLD FOR
              SELECT
                H_RECCHIDOM,
                H_RECPROREC,
                H_RECTOREEE,
                H_RECTORERE,
                H_RECCOREAL,
                H_RECCORENU,
                H_RECIMPRAE,
                H_RECCAUREC,
                H_RECTIPREC,
                H_RECCHDDVI,
                H_RECIMUREE,
                H_RECDTESRE,
                H_RECNUMRAT,
                H_RECCODBIL,
                H_RECIIRPEF,
                H_RECCOSEDE
               FROM    TDSRECUP
               WHERE
                H_RECCHIDOM =  :H-RECCHIDOM
            AND H_RECCOSEDE =  :H-RECCOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CUREFFER CURSOR   WITH HOLD FOR
              SELECT
                H_PEECODFIS,
                H_PEEPEERED,
                H_PEECOTIPR,
                H_PEEPEEREA,
                H_PEENUGIEE
               FROM    TDSPEERE
               WHERE
                H_PEECHIDOM =  :H-PEECHIDOM
            AND H_PEECOSEDE =  :H-PEECOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURAUTASPI CURSOR   WITH HOLD FOR
              SELECT
                H_AUTCOSEDE,
                H_AUTCHIDOM,
                H_AUTPROGR,
                H_AUTDATADAL,
                H_AUTDATAAL,
                H_AUTREDTEO,
                H_AUTREDEFF,
                H_AUTREDGTEO,
                H_AUTREDGEFF,
                H_AUTNUMGRID,
                H_AUTTIPOATT,
                H_AUTDATARED,
                H_AUTTIPOACQRED,
180523          H_AUTDTLIMRED
               FROM    TDSAUTLA
               WHERE
                H_AUTCHIDOM =  :H-AUTCHIDOM
            AND H_AUTCOSEDE =  :H-AUTCOSEDE
      *     ORDER BY H_AUTPROGR
            ORDER BY H_AUTDATADAL
           END-EXEC.
      *                                                              *
       01  INVIO                 pic  x     value spaces.
      *------------------------------ Flag lettura (Valori S o N)
       01  WL-TABPIENA           pic x     value  'N'.
       01  WL-DATICOMUNI         pic x     value  'N'.
       01  WL-RECUPERI           pic x     value  'N'.
       01  WL-PAGAMENTI          pic x     value  'N'.
       01  WL-SITUAZIODO         pic x     value  'N'.
       01  WL-ANFDIR             pic x     value  'N'.
       01  WL-AUTLASPI           pic x     value  'N'.
      *------------------------------ Flag Sospensioni
       01  WL-SOSPE              pic x     value  'N'.
      *------------------------------ Flag scrittura (Valori S o N)  *
       01  WS-APPOGGIO           pic x     value  'N'.
       01  WS-RIEPILOGO          pic x     value  'N'.
      *---------------------------------- Key APPOGGIO x I39-        *
       01  WB-DOMANDA            pic 9(10) value  zeros.
       01  WB-DOMANDA-R  redefines  WB-DOMANDA.
           03  WB-ANNO           pic 9(4).
           03  WB-NUMERO         pic 9(6).
      *----------------------------------AREE COMODO STAMPA          *
       01 W-MBN024 PIC  9(8)V9(2).
      *----------------------------------AREE COMODO STAMPA          *
      *
       01  W-STAMPAD.
            06 S2N001 PIC  9(4).
            06 S2N002 PIC  9(6).
            06 S2A003 PIC X(28).
            06 S2D004 PIC  9(8).
            06 S2A005 PIC X(10).
            06 S2A006 PIC X(32).
            06 S2A007 PIC X(10).
            06 S2D008 PIC  9(8).
            06 S2D009 PIC  9(8).
      *
       01  R-STAMPAE.
            06 R4ANNDOM            PIC  9(4).
            06 R4NUMDOM            PIC  Z(6).
            06 R4NOMECOGNOME       PIC  X(28).
            06 R4PMEINDUIME        PIC -Z(6).9(2).
            06 R4PMEANFUIME        PIC -Z(6).9(2).
            06 R4PMEULIRN1E        PIC -Z(6).9(2).
            06 R4PMEUITRSIE        PIC -Z(6).9(2).
            06 R4PMEAIMULASE       PIC -Z(6).9(2).
            06 R4DCODTADEC         PIC X(1).
            06 R4PMEULPEDAL        PIC  9(8).
            06 R4PMEULPEAL         PIC  9(8).
            06 R4OSMIMPGSTE        PIC -Z(3).9(2).
      *     06 R4N022              PIC -Z(3).9(2).
            06 R4PMEULPEGG         PIC  Z(4).
            06 R4PMEINLEPRE        PIC -Z(6).9(2).
            06 R4PMEINLEANE        PIC -Z(6).9(2).
      *
       01  W-STAMPAE.
            06 S4N001 PIC  9(4).
            06 S4N002 PIC  9(6).
            06 S4A003 PIC X(28).
            06 S4N005 PIC S9(6)V9(2).
            06 S4N006 PIC S9(6)V9(2).
            06 S4N007 PIC S9(6)V9(2).
            06 S4N008 PIC S9(6)V9(2).
            06 S4N009 PIC S9(6)V9(2).
            06 S4A010 PIC X(01).
            06 S4D011 PIC  9(8).
            06 S4D012 PIC  9(8).
            06 S4N021 PIC S9(3)V9(2).
            06 S4N022 PIC S9(3)V9(2).
            06 S4N023 PIC  9(4).
            06 S4N025 PIC S9(6)V9(2).
            06 S4N026 PIC S9(6)V9(2).
      *
       01  W-STAMPAS.
            06 S5A000 PIC X(22).
            06 S5N001 PIC  9(2).
            06 S5A002 PIC X(22).
            06 S5A003 PIC X(25).
            06 S5N004 PIC  9(6).
            06 S5N005 PIC S9(10)V9(2).
            06 S5N007 PIC S9(10)V9(2).
            06 S5N006 PIC S9(10)V9(2).
            06 S5N008 PIC S9(10)V9(2).
            06 S5N009 PIC S9(10)V9(2).
            06 S5N011 PIC  9(6).
            06 S5N012 PIC S9(10)V9(2).
      *
       01  R-STAMPAS.
      *     06 R5A000 PIC X(22).
            06 R5N001 PIC  9(2).
      *     06 R5A002 PIC X(22).
      *     06 R5A003 PIC X(25).
            06 R5N004 PIC  Z(6).
            06 R5N005 PIC -Z(10).9(2).
            06 R5N007 PIC -Z(10).9(2).
            06 R5N006 PIC -Z(10).9(2).
            06 R5N008 PIC -Z(10).9(2).
            06 R5N009 PIC -Z(10).9(2).
            06 R5N011 PIC  Z(5)9.
            06 R5N012 PIC -Z(09)9.9(2).
      *
       01   VO-DSPFM13B.
                   06 MBN090 PIC  9(4).
                   06 MBA099 PIC X(10).
                   06 MBN002 PIC  9(10).
                   06 MBA003 PIC X(2).
                   06 MBA051 PIC  9(13).
                   06 MBA004 PIC X(31).
                   06 MBN005 PIC  9(8).
                   06 MBA052 PIC X(16).
                   06 MBA006 PIC X(24).
                   06 MBN007 PIC  9(5).
                   06 MBA008 PIC X(23).
                   06 MBA009 PIC X(2).
                   06 MBA010 PIC X(33).
                   06 MBN012 PIC  9(8).
                   06 MBN013 PIC  S9(9)V9(2).
                   06 MBN014 PIC  S9(9)V9(2).
                   06 MBN015 PIC  9(4).
                   06 MBN016 PIC  S9(8)V9(2).
                   06 MBN017 PIC  S9(8)V9(2).
                   06 MBN018 PIC  9(4).
                   06 MBN019 PIC  S9(8)V9(2).
                   06 MBN020 PIC  S9(8)V9(2).
                   06 MBN029 PIC  S9(8)V9(2).
                   06 MBN030 PIC  S9(8)V9(2).
                   06 MBA031 PIC X(23).
                   06 MBN032 PIC  S9(8)V9(2).
                   06 MBA042 PIC X(33).
                   06 MBN033 PIC  S9(8)V9(2).
                   06 MBN034 PIC  S9(8)V9(2).
                   06 MBN021 PIC  S9(8)V9(2).
                   06 MBN022 PIC  S9(8)V9(2).
                   06 MBN023 PIC  S9(8)V9(2).
                   06 MBN024 PIC  S9(8)V9(2).
                   06 MBN025 PIC  S9(8)V9(2).
                   06 MBN026 PIC  S9(9)V9(2).
                   06 MBA041 PIC X(33).
                   06 MBN301 PIC  S9(8)V9(2).
                   06 MBN302 PIC  S9(9)V9(2).
      *
       01   RO-DSPFM13B.
               05 RIGA-13B-1 .
                   06 RBN090 PIC  9(4).
                   06 RBA099 PIC X(10).
                   06 RBN002 PIC  9(10).
                   06 RBA003 PIC X(2).
                   06 RBA051 PIC  9(13).
                   06 RBA004 PIC X(31).
                   06 RBN005 PIC  9(8).
                   06 RBA052 PIC X(16).
                   06 RBA006 PIC X(24).
                   06 RBN007 PIC  9(5).
                   06 RBA008 PIC X(23).
                   06 RBA009 PIC X(2).
                   06 RBA010 PIC X(33).
                   06 RBN012 PIC  9(8).
               05 RIGA-13B-2 .
                   06 RBN013 PIC  -9(9).9(2).
                   06 RBN014 PIC  -9(9).9(2).
                   06 RBN015 PIC  9(4).
                   06 RBN016 PIC  -9(8).9(2).
                   06 RBN017 PIC  -9(8).9(2).
                   06 RBN018 PIC  9(4).
                   06 RBN019 PIC  -9(8).9(2).
                   06 RBN020 PIC  -9(8).9(2).
                   06 RBN029 PIC  -9(8).9(2).
                   06 RBN030 PIC  -9(8).9(2).
                   06 RBA031 PIC X(23).
                   06 RBN032 PIC  -9(8).9(2).
                   06 RBA042 PIC X(33).
                   06 RBN033 PIC  -9(8).9(2).
                   06 RBN034 PIC  -9(8).9(2).
               05 RIGA-13B-3 .
                   06 RBN021 PIC  -9(8).9(2).
                   06 RBN022 PIC  -9(8).9(2).
                   06 RBN023 PIC  -9(8).9(2).
                   06 RBN024 PIC  -9(8).9(2).
                   06 RBN025 PIC  -9(8).9(2).
                   06 RBN026 PIC  -9(9).9(2).
                   06 RBA041 PIC X(33).
                   06 RBN301 PIC  -9(9).9(2).
                   06 RBN302 PIC  -9(9).9(2).
      *----------------------------------------------File status     *
       01  STATO-FILE.
         03  W-FST-NOINI.
           05  FST-ADSRPG00         pic S9(9)  VALUE ZEROES.
           05  FST-LDSRPG01         pic S9(9)  VALUE ZEROES.
           05  FST-LFDATCO2         pic S9(9)  VALUE ZEROES.
           05  FST-SDSPD13          pic XX  value spaces.
         03  W-FST-SIINI.
           05  FST-ADSANTAS         pic S9(9)  VALUE ZEROES.
           05  FST-ADSORSAM         pic S9(9)  VALUE ZEROES.
           05  FST-ADSRIFRS         pic S9(9)  VALUE ZEROES.
           05  FST-ADSRECUP         pic S9(9)  VALUE ZEROES.
           05  FST-LFPEERE1         pic S9(9)  VALUE ZEROES.
           05  FST-ADSSITDO         pic S9(9)  VALUE ZEROES.
           05  FST-ADSPAGME         pic S9(9)  VALUE ZEROES.
           05  FST-TDSAPNA0         pic S9(9)  VALUE ZEROES.
           05  FST-ADSDATAN         pic S9(9)  VALUE ZEROES.
           05  FST-LFDELSI1         pic S9(9)  VALUE ZEROES.
           05  FST-LFMODAN1         pic S9(9)  VALUE ZEROES.
           05  FST-ADSDACOD         pic S9(9)  VALUE ZEROES.
           05  FST-LFSOSPE1         pic S9(9)  VALUE ZEROES.
           05  FST-LFPEERT1         pic S9(9)  VALUE ZEROES.
           05  FST-ADSPENSI         pic S9(9)  VALUE ZEROES.
           05  FST-L02COMUNI        pic S9(9)  VALUE ZEROES.
           05  FST-ADSREINC         pic S9(9)  VALUE ZEROES.
           05  FST-ADSEDILI         pic S9(9)  VALUE ZEROES.
           05  FST-ADSMARIT         pic S9(9)  VALUE ZEROES.
           05  FST-ADSANFDI         pic S9(9)  VALUE ZEROES.
           05  FST-TDSNASPI         pic S9(9)  VALUE ZEROES.
           05  FST-TDSDICOL         pic S9(9)  VALUE ZEROES.
           05  FST-TDSAUTLA         pic S9(9)  VALUE ZEROES.
           05  FST-TDSASPRI         pic S9(9)  VALUE ZEROES.
220218     05  FST-TDSLOCK0         pic S9(9)  value zeroes.
280922     05  FST-TDSIBES          pic S9(9)  value zeroes.
      *                                                              *
      *--------------------------------------------Contatori         *
       01  W-CONTATORI.
           02  W-LINE               pic 99   value  zeros.
           02  CHIUDIFILE           pic 99   value  zeros.
           02  CTR-VIDEO            pic 99   value  zeros.
           02  CTR-ATT-PAGME        pic 9(8) value  zeros.
           02  CTR-LET-DATCO        pic 9(8) value  zeros.
           02  CTR-ELA-DATCO        pic 9(8) value  zeros.
           02  CTR-SCR-DATCO        pic 9(8) value  zeros.
           02  XXX-REC   redefines CTR-SCR-DATCO.
               03  filler           pic 9(7).
               03  UNI-SCR-DATCO    pic 9.
           02  CTR-LET-DATAN        pic 9(8) value  zeros.
           02  CTR-ELA-DATAN        pic 9(8) value  zeros.
           02  CTR-SCR-DATAN        pic 9(8) value  zeros.
           02  CTR-LET-APPO         pic 9(8) value  zeros.
           02  CTR-SCR-APPO         pic 9(8) value  zeros.
           02  CTR-IMPREVISTI       pic 9(8) value  zeros.
           02  CTR-PAGATE           pic 9(8) value  zeros.
           02  CTR-DEFINITE         pic 9(8) value  zeros.
           02  CTR-INDEBITE         pic 9(8) value  zeros.
      *------------------------------------------- Per operazioni    *
       01  RISULT                    PIC 99   value zeros.
       01  RESTO                     PIC 9.
           88  BISESTILE                      value 0.
       01  GG-FEBBRAIO               PIC 99   value 28.
      *------------------------------------------- Per controllo date*
       01  W8-AAAAMMGG               PIC 9(8) value zeros.
       01  R8-AAAAMMGG  redefines  W8-AAAAMMGG.
           02  W8-AAAA               PIC 9(4).
           02  W8-MMGG.
               03  W8-MM             PIC 99.
               03  W8-GG             PIC 99.
       01  D8-GGMMAAAA.
           02  D8-GG                 PIC 99   value zeros.
           02  D8-MM                 PIC 99   value zeros.
           02  D8-AAAA               PIC 9(4) value zeros.
       01  D6-GGMMAA                 PIC 9(06) value zeros.
       01  R6-GGMMAA  redefines  D6-GGMMAA.
           03  W6-GG                 pic 9(02).
           03  W6-MM                 pic 9(02).
           03  W6-AA                 pic 9(02).
       01  W-VALTOZAC                pic x(10) value spaces.
      *
       01  A8-AAAAMMGG               PIC 9(8) value zeros.
       01  B8-AAAAMMGG  redefines  A8-AAAAMMGG.
           02  A8-AAAA               PIC 9(4).
           02  A8-MMGG.
               03  A8-MM             PIC 99.
               03  A8-GG             PIC 99.
      *------------------------------------------------- Per gestione*
       01  W-NOINIZIALIZZARE.
           03  W-NOMEDIR            pic x(30) value spaces.
           03  W-PROGRESSIVO        pic 9(3)  value zeros.
           03  W-CONGUAGLIO         pic 9(2)  value zeros.
           03  W-PROCEDURA          pic x(3)  value 'G19'.
           03  W-PAGAMINCORSO       pic x     value spaces.
      *                =  'S' (pagamento in corso)  oppure  =  'N'o  *
           03  WIC-DOMANDA          pic 9(10) value  zeros.
           03  RIC-DOMANDA  redefines  WIC-DOMANDA.
               05  WIC-ANNO         pic 9(4).
               05  WIC-NUMERO       pic 9(6).
           03  W-VALUTA             pic x     value 'E'.
           03  W-ERRORE             pic x     value 'N'.
      *           se = 'S'  allora è errore                          *
           03  W-XPDSNA02           pic x     value 'Y'.
      *           se = 'Y'   allora  passare a PDSNA02               *
      *           se  altri valori ==> errore I/O archivi            *
           03  W-CONTINUA           pic x     value spaces.
      *           se = 'S'  allora continua perform, ......          *
           03  W-NIK                pic x     value 'N'.
      *           se = 'S'  allora ----> .................           *
           03  W-AS400             pic x     value 'N'.
      *           se = 'S'  allora ----> .................           *
           03  W-FINE-ELABORA       pic x     value spaces.
      *           se = 'S'  allora fine elaborazione                 *
           03  W-FLAGYNCORSO        pic x   value  spaces.
      *           se = 'S'  allora Flag elab.Yn corso su ADS3STOP    *
           03  W-FINE-INTERVALLO    pic x     value spaces.
      *           se = 'S'  allora fine intervallo                   *
           03  W-SCELTA             pic x     value spaces.
      *           se = S   record selezionato per l'elaborazione     *
      *           se = N   non elabora record                        *
           03  W-PAGARE             pic x     value spaces.
      *           se = S   domande già in pagamento (pag. Successivi)*
      *           se = P   elabora solo prime liquidazioni           *
      *           se = T   elabora tutti i record pagabili           *
           03  FLG-COMMIT           pic x(01) value  spaces.
      *           se = S   esegui commit                             *
      *           se = N   esegui rollback                           *
           03  W-PMEIND             pic x     value  spaces.
      *           se = S   indennità presente in PME                 *
      *           se = N   non presente indennità in PME             *
           03  W-AGGPAGME           pic x     value  spaces.
      *           se = N   non aggiornare ADSPAGME                   *
           03  W-DIF-FISCALE        pic s9(10)v9(2) value zeroes.
           03  W-FINE-TEORICO       pic  9(08)  value zeros.
           03  W-TOGG-TEORICO       pic  9(04)  value zeros.
           03  W-CONTOREC.
             05  W-CONTOALFA        pic x(03) value spaces.
             05  W-CONTONUME        pic 9(05) value zeroes.
131115     03  W-COORDINATE.
             05  W-IBAN             pic x(04) value spaces.
             05  W-COOBAN           pic x(23) value spaces.
080915     03  W-AUTTIPOATT-DUP     pic x(01) value 'N'.
           03  W-AUTTIPOATT         pic x(01) value spaces.
           03  W-RED-AUT-CORR       pic x(01) value 'N'.
130124     03  W-RED-AUT-MENO1      pic x(01) value 'N'.
      *           se = N   non presente reddito anno precedente      *
      *           se = Z   reddito anno precedente a Zero            *
      *           se = M   reddito anno precedente maggiore di Zero  *
200614     03  W-DTRUPA             pic 9(08) value zeroes.
200614     03  W-GGTUPA             pic 9(04) value zeroes.
131115     03  W-SET-DTADEC         pic x(01) value 'N'.
030216     03  W-RICALC-0116        pic x(01) value 'N'.
280817     03  W-N0CODICE9.
             05  W-NASFLGRIT        pic x(02) value spaces.
             05  W-FLGTDSBLKPA      pic x(01) value spaces.
280817     03  W-N0IMPORTO9         pic 9(08) value zeroes.
300421     03  W-NASGGLAV12         pic 9(03) value  zeros.
101019     03  WCF-COLLEGATO        pic x(01) value spaces.
101019     03  WCF-WL-PAG           pic x(01) value spaces.
101019     03  WCF-STAPAG           pic x(01) value spaces.
101019     03  WCF-CODFIS           pic x(16) value spaces.
101019     03  WCF-CHIDOM           pic x(13) value spaces.
      *
030314 01  T3-ATT-AUTONOMA.
           02  T3-ELEMENTO     occurs  40 times.
               03  T3-ANNO-RED       pic  9(4).
               03  T3-DTDA-AUT       pic  9(8).
               03  T3-DTAL-AUT       pic  9(8).
               03  T3-REDD-TEO       pic  9(9)v9(2).
               03  T3-REDD-EFF       pic  9(9)v9(2).
030314         03  T3-TIPO-ATT       pic  x(1).
      *
080915 01  T3-BAK-AUTONOMA.
           02  BAK-ELEMENTO    occurs  40 times.
               03  B-ANNO-RED        pic  9(4).
               03  B-AUTDATADAL      pic  9(8).
               03  B-AUTDATAAL       pic  9(8).
               03  B-AUTREDTEO       pic  9(9)v9(2).
               03  B-AUTREDEFF       pic  9(9)v9(2).
               03  B-AUTREDGTEO      pic  9(7)v9(2).
               03  B-AUTREDGEFF      pic  9(7)v9(2).
               03  B-AUTNUMGRID      pic  9(4).
080915         03  B-AUTTIPOATT      pic  x(1).
      *
180522* variabili per i limiti di reddito
       01 W-REDD-AUT                pic  9(9)v9(2)   value zeros.
       01 W-REDD-SUB                pic  9(9)v9(2)   value zeros.
      *
180523* variabili per storicizzare tdsautla e mancanti in CDSNA13.
       01 W-TAB-AUT.
         03 W-EL-AUT      occurs  40   times.
           05 W-AUTREDTEO           pic  9(9)v9(2)   value zeros.
           05 W-AUTREDEFF           pic  9(9)v9(2)   value zeros.
           05 W-AUTDATARED          PIC  S9(8)V USAGE COMP-3 VALUE ZERO.
           05 W-AUTTIPOATT2         PIC  X(01)       VALUE SPACES.
           05 W-AUTTIPOACQRED       pic  x(01)       value spaces.
           05 W-AUTDTLIMRED         PIC  S9(8)V USAGE COMP-3 VALUE ZERO.
      *
       01  W-DAINIZIALIZZARE.
           03  W-DECORRENZA         pic  9(08)  value zeros.
           03  W-ANNOINIZANF        pic  9(04)  value zeros.
           03  W-ANNOFINEANF        pic  9(04)  value zeros.
           03  W-DCOULESPP          pic  x(01)  value spaces.
           03  W-DCOULESSP          pic  x(01)  value spaces.
           03  W-DATMORTE           pic  9(08)  value zeros.
           03  W-PETPEERTA          pic  9(08)  value zeros.
           03  W-ANFDIRETTI         pic  x(01)  value 'N'.
      *           se = S   si pagamento ANF su domanda definita      *
           03  W-FRONTALIERI        pic  x(01)  value 'N'.
      *           se = S   si Conguaglio DS su domanda definita      *
           03  W-DATI-PAGME         pic  x(01)  value 'N'.
      *           se = S   si Presenza dati precedente pagamento     *
           03  W-SALTA              pic  x(01)  value 'N'.
      *           se = S   si salto                                  *
      *           se = N   no salto                                  *
           03  W-SCRIVO             pic  x(01)  value 'N'.
      *           se = N   non scrivo su mappa                       *
      *           se = S   scrivo su mappa                           *
           03  W-CALCOLI            pic 9(10)   value zeros.
           03  W-CHK-CAMPI          pic x(50)   value spaces.
      ******* i due seguenti da utilizzare                           *
           03  W-ELABORA            pic x(01)   value 'N'.
      *           se = 'N'  non  elaborare                           *
      *           se = 'S'  allora elabora                           *
           03  W-CAMBIATO           pic x(01)   value 'N'.
      *           se = S   record modificato da riscrivere           *
      *           se = N   nessuna modifica                          *
           03  UPD-ANFRIC           pic x(01)   value spaces.
           03  W-INDEB-IND          pic  S9(10)v9(2) value zeros.
           03  W-INDEB-ANF          pic  S9(10)v9(2) value zeros.
           03  W-LAVSOSPESO         pic  x(01)  value 'N'.
      *           se = S   si tratta di lavoratore sospeso non licenz*
           03  W-IMP-GPA10099       pic  9(09)v9(4) value zeros.
           03  W-ABB-NUMERAT        pic  9(06)       value  zeros.
           03  W-ABB-DENOMIN        pic  9(03)       value  zeros.
           03  W-ABBATTIMENTO       pic  9(03)v9(02) value  zeros.
           03  W-RIDPERC-ABB        pic  9(03)v9(02) value  zeros.
           03  W-DATAPIU7           pic  9(08)  value zeros.
050916     03  W-ANF-DA062015       pic  x(01)  value  'N'.
           03  BAK-PMEANFTOTE       pic  s9(05)v99  value  zeros.
050916     03  BAK-PMEANFTOGG       pic  9(04)  value  zeroes.
050916     03  W-DCDCSC             pic  9(05)  value  zeroes.
131020*------------------------------campi verifica proroga covid19  *
           03  W-CHK-PROROGA        pic x(50)   value spaces.
           03  W-ERR-PROROGA        pic x       value 'N'.
230620*------------------------------campi per verifiche telematico  *
       01  W-VERIFICA-TELE.
           03  CNT-C100             pic s9(7)v9(2)  usage comp-3
                                                value  zeroes.
           03  W-COD-FISC           pic  x(16)  value  spaces.
230620     03  W-DCOFLASU           pic  9(02)  value  zeroes.
131020     03  CNT-C069             pic s9(7)v9(2)  usage comp-3
                                                value  zeroes.
      *----------------------------------------------- Per intervalli*
       01  W-INTERVALLI.
           02  W-DOMANDA-DAL        pic 9(10) value zeros.
           02  R-DOMANDA-DAL  redefines  W-DOMANDA-DAL.
               03  W-DAL-ANNO       pic 9(4).
               03  W-DAL-NUMERO     pic 9(6).
           02  W-DOMANDA-AL         pic 9(10) value zeros.
           02  R-DOMANDA-AL   redefines  W-DOMANDA-AL.
               03  W-AL-ANNO        pic 9(4).
               03  W-AL-NUMERO      pic 9(6).
      *---------------------------- Data odierna (6:   gg mm aa)     *
      *                                          (8: aaaa mm gg)     *
       01  DATA-ODIERNA.
           02  W6-ODIERNA           pic 9(6)   value zeros.
           02  R6-ODIERNA  redefines  W6-ODIERNA.
               03  W6-ODIGG         pic 99.
               03  W6-ODIMM         pic 99.
               03  W6-ODIAA         pic 99.
           02  W8-ODIERNA           pic 9(8)   value zeros.
           02  R8-ODIERNA  redefines  W8-ODIERNA.
               03  W8-ODIAA         pic 9999.
               03  W8-ODIMM         pic 99.
               03  W8-ODIGG         pic 99.
           02  W4-ANNO-1            pic 9(4)   value zeros.
      *----------------------------------------Indici tabelle        *
       01  INDICI.
           02  N1                    pic 999   value zeros.
           02  NDC1                  pic 999   value zeros.
           02  NDC2                  pic 999   value zeros.
           02  NDC3                  pic 999   value zeros.
           02  NDT2                  pic 999   value zeros.
           02  IND1                  pic 999   value zeros.
           02  I-ANF                 pic 9(03) value zeros.
           02  I-SOS                 pic 9(03) value zeros.
           02  CNT-SOS               pic 9(03) value zeros.
           02  IO-PET                pic 9(03) value zeros.
           02  IS-PET                pic 9(03) value zeros.
           02  I-PEN                 pic 9(03) value zeros.
           02  I-AUT                 pic 9(03) value zeros.
      *------------------------------Tabella 1: Tipo prestazioni     *
      *                                                              *
       01  X1-CHEPRESTA.
           02  X1-CHELEMEN     occurs 8  times.
               03  X1-PRESTAZIONE    pic  x.
       01  W-PRESTAZIONE             pic  xx    value spaces.
       01  W-DECODIFICA              pic  x(50) value spaces.
       01  W-CODICEUNO               pic  99    value zeros.
       01  W-CODICEDUE               pic  99    value zeros.
      *------------------------------Tabella 2: Intervalli da elabora*e
       01  T2-INTERVALLI.
           02  T2-ELEMENTO     occurs  6  times.
               03  T2-ANNO-DAL       pic  9(4).
               03  T2-NUMERO-DAL     pic  9(6).
               03  T2-ANNO-AL        pic  9(4).
               03  T2-NUMERO-AL      pic  9(6).
      *                                                              *
      *-------------------------------- Per compattamento Cognome/Nom*
       01  FLD-1                  value spaces.
           02  BT-1  occurs 32       pic X.
       01  FLD-2                 value spaces.
           02  BT-2  occurs 32       pic X.
      *-------------------------------- Campi comodo dati anagrafici *
       01  W-ANAGRAFICI.
           03  WIC-COGNOME           pic  x(36)     value spaces.
           03  WIC-NOME              pic  x(36)     value spaces.
           03  WIC-ACQUISITO         pic  x(36)     value spaces.
           03  WIC-DTNASCITA         pic  9(08)     value zeroes.
           03  WIC-DANCOCORE         pic  x(36)     value spaces.
           03  WIC-DANSIPRRE         pic  x(02)     value spaces.
           03  WIC-DANIND            pic  x(52)     value spaces.
           03  WIC-DANCAP            pic  9(05)     value zeroes.
      ****rivedere                                                   *
           03  W-COMUNE              pic  x(36)     value zeroes.
           03  W-PROVINCIA           pic  x(02)     value spaces.
      *--------------------- Per segnalare coordinate inesatte       *
       01  W-COMPATTO                pic  x(28)     value zeroes.
       01  R-COMPATTO  redefines  W-COMPATTO.
           03  W10-COMPATTO          pic  x(10).
           03  W-ERR-COOBAN          pic  x(18).
      *--------------------- Campi per utilizzo stringhe/numeri      *
       01  W-ALFANUMERICI.
           02 W-2CIFRE               pic 99     value zeros.
           02 R-2STRINGA  redefines  W-2CIFRE
                                     pic xx.
           02 W-8CIFRE               pic 9(8)   value zeros.
           02 R-8STRINGA  redefines  W-8CIFRE
                                     pic x(8).
      *-------------------- Campi per conversione in EURO            *
       01  W-EURO                   pic   9(4)v9(2)  value zeros.
       01  W-IMPORTO-EURO           pic  S9(8)v9(8)  value zeros.
       01  W-IMPORTO-LIRE           pic  S9(10)      value zeros.
       01  W-ASSEGNO-EURO           pic  S9(10)v9(2) value zeros.
       01  W-DIFFERENZA             pic  S9(10)v9(2) value zeros.
       01  W-SQUADRATURA            pic  Z,ZZZ,ZZ9.99- value zeros.
       01  R-SQUADRATURA      redefines  W-SQUADRATURA
                                    pic  x(12).
       01  W-E-CALCOLI              pic  S9(10)v9(4) value zeros.
       01  W-IMP-RIDUZI             pic  9(9)v9(2)   value zeros.
      *01  W-CHKCAMPI               pic  x(100) value  spaces.
280922 01  W-IBEIBAEST              pic  x(27)  value  spaces.
280922 01  W-IBECHIDOM              pic  x(13)  value  spaces.
280922 01  W-IBECOSEDE              pic  x(4)   value  spaces.
      *                                                              *
      *-----------------Definizioni necessarie alle routine usate    *
      *------------------------------ Per programma PNPGF00 e PNPGF80*
      *01  PER-PNPGFD0.
      *    COPY  CNPGF001  OF  PCBLIB-PCBCPY.
      *------------------------------------- Per programma calcolo   *
      *---------------------- NON CANCELLARE !!!!!!
      *01  PER-PDSOR98-I.
      *    copy  CDSOR021   of  PCBLIB-PCBCPY.
      *01  RITORNO                   pic 9.
      *    Dove se RITORNO  =  '1' Domanda non interessata dal calcolo
      *         se          =  '2' Calcolo già effettuato
      *         se          =  '3' Manca uno dei periodi
      *         se          =  '4' Manca importo del pagamento
      *         se          =  '5' Anno prestazione fuori tabella
      *         se          =  '6' Non permane lo stato di disoccupaz.
      *         se          =  '7' Uno o piu' date errate
      *         se          =  '8' DS56 non stampato o non acquisito
      *         se          =  '9' Errore nel calcolo dell'IRPEF
      *01  C-CHIAMANTE               pic x(8)  value spaces.
      *------------------------------ Data finale calcolo prestaz.   *
       01  W-CALCOLO-AL              pic 9(8)  value zeros.
       01  R-CALCOLO-AL  redefines  W-CALCOLO-AL.
           02  R-ANNO-AL             pic 9(4).
           02  R-MESE-AL             pic 9(2).
           02  R-GIORNO-AL           pic 9(2).
       01  W-CALCOLO-AL-PIU1         pic 9(8)  value zeros.
       01  W-CALCOLO-AL-REALE        pic 9(8)  value zeros.
      *                                                              *
      *-----------------------------------------Per pgm calcolo ?
       01  PER-CALCOLO.
           copy  CDSNA13.
      *-------AREA SPECIFICA PER ANTICIPAZIONE ASPI                  *
           03   AREA-CALCOLO-AA.
      *-------------------------------------- Tabella TDSANTAS       *
             05  IC-AASASPI           pic  x(13).
             05  IC-AASATTDAL         pic  9(08).
             05  IC-AASDTFINE         pic  9(08).
      *
      *--Chiamata POP per annullamento recupero------------ 'POP'
      *----------------- commentata per modifica GF                  *
220720*    COPY POPCSIN.
      *
      *---------------------------------------------------- 'RDSUSR1'*
       01  PER-RDSUSR1.
           02  ID-LAVORO               pic x(10).
           02  ID-UTENTE               pic x(10).
      *---------------------------------------------------- 'RDSUT11'*
       01  PER-RDSUT11.
           02  RDSUT11-STRINGA       pic X(100)  value spaces.
      *-----------------------------------------Per routine 'RDSUT14'*
      *01  PER-RDSUT14.                                              *
           copy CDSUT14.
271014*-----------------------------------------Per routine 'RDSUT18'*
      *-------------------area commentata in data 27/10/2014         *
      *01  PER-RDSUT18.
      *    06  L-TABELE-SOS.
      *      07  L-ELEMENTO-SOS  occurs 200  times.
      *        09  L-SOSDTINSOS  pic  9(08).
      *        09  L-SOSDTFISOS  pic  9(08).
      *        09  L-SOSCODSOS   pic  X(02).
      *    06  LK-DCODTDECPP     pic  9(08).
      *    06  LK-DCODTADEC      pic  9(08).
      *    06  LK-PROCEDURA      pic  X(03).
271014*01  R18-RC                pic 9  value zeros.
      *---------------------------------------------------- 'RDSUT28'*
       01  PER-RDSUT28.
          02 LK-CODFIS            PIC X(16).
      *  risposta: S/N
          02 LK-RISP                 PIC X.
271014*--------------------------------------Per CONTROLLO SOSPENSIONI
      *01  R-SOSDTIN.
      *    02  SOS-ANNO-IN             pic 9(4).
      *    02  SOS-MESE-IN             pic 9(2).
271014*    02  SOS-GIORNO-IN           pic 9(2).
      *-----------------------------------------Per routine 'RNPYEAR'*
      *01  PER-RNPYEAR.                                              *
      *    copy CNPYEAR .
      *--------------------------------------------- x PDSPD16       *
       01  AREALINK-1.
           03 C-CODICE-SEDE           pic 9(04)  value zeros.
           03 C-NOME-SEDE             pic x(22)  value spaces.
           03 C-CODICE-STOP           pic 9(02)  value zeros.
           03 C-NOME-STOP             pic x(22)  value spaces.
           03 C-PROCEDURA             pic x(03)  value spaces.
           03 C-TIPOCALCOLO           pic x(01)  value spaces.
      *                       = 'S'  simulazione x lista contrrollo  *
      *                       = 'R'  reale x pagamento prestazione   *
           03 C-RICHIESTA             pic x(01)  value spaces.
      *                    se =  I - lettura Informazioni            *
      *                       =  C - richiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
           03 C-PROGRESSIVO           pic 9(03)  value zeros.
           03 C-RETCODE               pic x      value spaces.
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
       01  AREALINK-2.
           03 C-DIRIGENTE             pic x(30)  value spaces.
           03 C-ELABINCORSO           pic x      value spaces.
      *              se =  Y - Elaboraz. Yn corso medesima struttura *
      *                 =  K - Elaboraz. Kompletata                  *
           03 C-CONGUAGLIO            pic 9(2)   value zeros.
      *
      *-----------------------------------------per routine 'RDSERR0'*
      *01  PER-RDSERR0.
      *    COPY  CDSERR0   OF  PCBLIB-PCBCPY.
      *
      *------------------------------------Per routine  RDSOR12      *
      *----rivedere
       01 PER-RDSOR12.
           02 R12-CODICE-SEDE         pic 9(4)   value zeros.
           02 R12-CODICE-STOP         pic 9(2)   value zeros.
           02 R12-NOME-SEDE           pic x(22)  value spaces.
           02 R12-NOME-STOP           pic x(22)  value spaces.
           02 R12-BLOCCO              pic 9(2)   value zeros.
           02 R12-TIPO                pic x(30)  value spaces.
           02 R12-RTCD                pic 9      value zeros.
      *------------------ in input
      *    se R12-RTCD  =  5 controllo  password                     *
      *    se           =  6 controlla strutture attive              *
      *    se           =  8 funzioni particolari                    *
      *------------------ in output                                  *
      *    se R12-RTCD  =  9 Elaborazione non eseguita               *
      *    se           =  1 Elaborazione completata correttamente   *
      *    se           =  2 Elaborazione errata per motivi vari     *
      *------------------ se in input la richiesta = 6 allora in output
      *    se PXX-RTCD  =  1 in PXX-BLOCCO trovo numero strutture attiv
      *------------------------------------Per routine  RDSUT13  ----*
       01 PER-RDSUT13.
          02 R13-CODICECOMUNE          pic 9(6).
          02 R13-NOMECOMUNE            pic x(23).
          02 R13-PROVINCIA             pic xx.
          02 R13-RETCODE               pic xx.
      *     *decodifica = 00  -  comune trovato                      *
      *                 = 47  -  comune NON trovato                  *
      *     *  codifica = 00  -  comune trovato                      *
      *                 = 47  -  comune NON trovato                  *
      *                 = 60  -  trovato più di un comune            *
      *                 = 61  -  trovati più di 40 sinonimi          *
      *                 = 98  -  errore nei parametri                *
      *                 = 99  -  errore generico                     *
          02 R13-RTCD-COCO             pic x(4).
          02 R13-DESC-COCO             pic x(50).
      *-----------------------------------------per routine 'RDSUT09'
131115*01  PER-RDSUT09.
      *    03  AREA-INPUT.
      *        05  R09-COOBAN         pic  x(23).
      *    03  AREA-OUTPUT.
      *        05  R09-RC             pic  9(01).
131115*        05  R09-ERRMSG         pic  x(60).
131115*---------------------------------------per routine 'PITIBAN2' *
       01  PER-PITIBAN1.
           03  V-OK-IBAN               pic x(02)  value spaces.
           03  V-IBAN                  pic x(34)  value spaces.
           03  V-MSG-IBAN              pic x(75)  value spaces.
       01  P-COORDINATE.
           03  P-PAESE               PIC XX.
           03  P-CIN-1               PIC 99.
           03  P-BBAN.
               05  P-CIN-2               PIC X.
               05  P-CODABI-A            PIC 9(5).
               05  P-CODCAB-A            PIC 9(5).
               05  P-CCLIENTE-A          PIC X(12).
           03  FILLER                PIC X(07) VALUE SPACES.
      *---------------------------------------per routine 'RDSUT10'  *
      *------------------ Att. formato date gg mm aa ----------------*
       01  PER-RDSUT10.
           02  R10-DATA-I              pic 9(6).
           02  R10-DATA-F              pic 9(6).
           02  R10-GIORNI              pic 9(4).
           02  R10-GIORNI-INDS         pic 9(4).
           02  R10-GIORNI-DANF         pic 9(4).
           02  R10-RC                  pic 9  value zeros.
      *----------------------------------------per routine 'RDSPD13'*
       01  PER-RDSPD13.
           03  LDCOCODFIS             pic  X(16).
           03  LDATAODIERNA           pic  9(08).
           03  LPAGAMENTO             pic  x(01).
           03  LSEDE-RDSPD13          pic  x(04).
           03  LDCOCHIDOM             pic  x(13).
      *--------------------------per routine 'PDSPD05'/'PDSPD08'     *
       01  LC-RETCODE                 pic x(01).
      *------------------ in output
      *    se L-RETCODE =  N elaborazione Non eseguita
      *                 =  C elaborazione Completata Correttamente
      *                 =  E elaborazione Errata per motivi vari
      *I---------------23/07/2013  per PDSPD05----------------------*
       01  LC-TAB-ANF.
         05  LC-EL-ANF      occurs  20  times.
           07  LC-ANFDTDEVA        pic  9(08).
           07  LC-ANFCONUFA        pic  9(02).
           07  LC-ANFNUMFIG        pic  9(02).
           07  LC-ANFPREINV        pic  x(01).
           07  LC-ANFTIPINV        pic  x(01).
           07  LC-ANFFIGMIN        pic  9(02).
           07  LC-ANFTIPNUC        pic  x(01).
           07  LC-ANFREDFAE        pic  9(06)v9999.
           07  LC-ANFANRIRE        pic  9(04).
      *F---------------23/07/2013  ---------------------------------*
      *n---------------------------------------per pgm.    'PDSRD22'*
      *n1  L22-AREA.
      *n   03  L22-CODFIS              pic x(16).
      *n   03  L22-CHIDOM              pic x(13).
      *n   03  L22-RTCD                pic x(01).
      *n   03  L22-CODICE-SEDE         pic x(04).
      **................... se L22-RTCD = 'C' posizione Corretta     *
      **................... se L22-RTCD = 'N' da Non aggiornare      *
      **................... se L22-RTCD = 'E' esito errato           *
      **
      *n---------------------------------------per pgm.    'PDSRD23'*
      *n   L23-AREA.
      *n   03  L23-CODFIS              pic x(16).
      *n   03  L23-CINQUANTA           pic x(01).
      **................... valori possibili 'S' e 'N'               *
      *n   03  L23-CHIDOM              pic x(13).
      *n   03  L23-RTCD                pic x(01).
      *n   03  L23-CODICE-SEDE         pic x(04).
      **................... se L23-RTCD = 'C' posizione Corretta     *
      **................... se L23-RTCD = 'N' da Non aggiornare      *
      **................... se L23-RTCD = 'E' esito errato           *
      **
      *----------------------------------------per routine 'PDSLOCK'*
      *01  PER-PDSLOCK.
       01 L-AREA-LOCK.
          05 K-MATRICOLA             pic x(08).
          05 K-NDOMUS                pic x(13).
          05 K-TIPO-DOMANDA          pic x(02).
          05 K-TIPO-RICHIESTA        pic x(02).
          05 K-CENTRO-OPERATIVO      pic x(02).
          05 K-RETURN-CODE           pic x(02).
          05 K-RETURN-MESSAGE        pic x(60).
          05 K-IS-LOCKED             pic x(01).
          05 K-TIPO-OPERAZIONE       pic x(01).
          05 K-ESITO-LOCK-UNLOCK     pic x(02).
          05 K-LOCK-UNLOCK-MESSAGE   pic x(60).
          05 K-AUTO-COMMIT           pic x(01).
          05 K-CODICESEDE            pic x(04).
          05 FILLER                  pic x(26842).
      *-----------------------------------------Per routine 'PDSPD13'*
       01  PER-PDSPD13.
           03  Z-MATRICOLA            pic s9(08).
           03  Z-RETCODE              pic  x(01).
      *-----------------------------------------Per routine 'RDSCONT'*
       01  PER-RDSCONT.
           03  Q-CONTO                pic  x(08).
           03  Q-DESCRCONTO           pic  x(80).
           03  Q-RETCODE              pic  9(02).
      *-----------------------  se = 00  --> ok                      *
      *-----------------------  se = 01  --> ko - conto non valorizz.*
      *-----------------------  se = 02  --> ko - conto non trovato  *
      *-----------------------  se = 99  --> ko - vedi msg           *
           03  Q-MSG                  pic  x(80).
           03  Q-FILLER               pic  x(130).
      *-----------------------------------------Per routine 'RDSUT27 *
           copy CDSUT27.
      *-----------------------  se = OK  --> CONVENZIONE ATTIVA      *
      *-----------------------  se = KO  --> CONVENZIONE NO ATTIVA   *
      *------------------ Servizio SCUP --------Per routine 'PNBTBLC2*
270321     copy PNLKBLC2.
      *------------------ Servizio titolarità --Per routine 'PNBTCFIB*
270321     copy PNLKCFIB.
      *--------------------------------------------------------------*
      *CONSTANT SECTION.
      *77 WK_VERSION     pic s9(9) comp-5  value is 20091007.
      *--------------------------------------------------------------*
      *----------------------------------AREA COMODO MESSAGGI ERRORE *
       01  VO-DSPFM134.
               05 DSPFM134-O .
                   06 M4A011 PIC X(67).
                   06 M4A012 PIC X(67).
                   06 M4A013 PIC X(67).
                   06 M4A014 PIC X(67).
      *==============================================================*
       01  L-AREA.
               05 L-CODICE-SEDE           pic 9(04).
               05 L-NOME-SEDE             pic x(22).
               05 L-CODICE-STOP           pic 9(02).
               05 L-NOME-STOP             pic x(22).
               05 L-PROCEDURA             pic x(03).
               05 L-TIPOCALCOLO           pic x(01).
      *                       = 'S'  simulazione x lista contrrollo  *
      *                       = 'R'  reale x pagamento prestazione   *
               05 PAGA-ELABO-IN           PIC X(01).
      *S/T/P------------------------------------ Elabora Singola
               05 L-RICHIESTA             pic x(01).
      *                    se =  I - lettura Informazioni            *
      *                       =  C - RIChiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
               05 L-PROGRESSIVO           pic 9(03).
               05 L-RETCODE               pic x(01).
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
       01  LAREA-D.
               05  LCODOPE                pic x(02).
               05  LLIVAUTO               pic x(01).
               05  LMATRICOLA             pic x(08).
      *
       01  PARAMETRI-IN.
               05 DATA-ELABO-IN.
                  07 DATA-ELABO-AA           PIC 9(04).
                  07 DATA-ELABO-MM           PIC 9(02).
                  07 DATA-ELABO-GG           PIC 9(02).
      *1---------------------------------------- Elabora tutte
      *2---------------------------------------- Elabora Da A
      *3---------------------------------------- Elabora Singola
               05 TIPO-ELABO-IN           PIC X(01).
      *------------------------------Tabella 1: Tipo prestazioni     *
               05  T1-ELEMENTO     occurs 8  times.
                  07  T1-PRESTAZIONE    pic X(2).
               05 PERIODI-IN-LK.
                  07 ELE-PERIODI OCCURS 6.
                     09 ANNO-DAL-IN-LK    PIC  9(4).
                     09 NUMERO-DAL-IN-LK  PIC  9(6).
                     09 ANNO-AL-IN-LK     PIC  9(4).
                     09 NUMERO-AL-IN-LK   PIC  9(6).
      *
      *--------------------------------------------------------------*
      *-------------------------------------------------------------*
      *-CODICE DI RITORNO :
      *-------------------------------------------------------------*
      *-  00  OK -R-  Calcolo Reale -OUT-MESSAGGIO
      *-  01  OK -S-  Simulaz.    Da A          -
      *-  02  OK -S-  Simulaz.   SINGOLA DOMANDA-
      *-  03  OK -S- LLIVAUTO=5  SINGOLA DOMANDA-
      *-------------------------------------------------------------*
      *-  90
      *-  96  CALCOLO ERRATO                    -  OUT-MESSAGGIO
      *-  99  DB2 ERROR                         -  OUT-MESSAGGIO
      *-
      *==============================================================*
       LINKAGE SECTION.
      *
      *--------------------------------------------------------------*
       01  COMMAREADS.
           02  K-AREA.
               05 K-CODICE-SEDE           pic 9(04).
               05 K-NOME-SEDE             pic x(22).
               05 K-CODICE-STOP           pic 9(02).
               05 K-NOME-STOP             pic x(22).
               05 K-PROCEDURA             pic x(03).
               05 K-TIPOCALCOLO           pic x(01).
      *                       = 'S'  simulazione x lista controllo   *
      *                       = 'R'  reale x pagamento prestazione   *
               05 KAGA-ELABO-IN           PIC X(01).
      *S---------------------------------------- ELABORA PAGAM. SUCC.
      *P---------------------------------------- ELABORA PRIME LIQUID.
      *T---------------------------------------- ELABORA TUTTE
               05 K-RICHIESTA             pic x(01).
      *                    se =  I - lettura Informazioni            *
      *                       =  C - RIChiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
               05 K-PROGRESSIVO           pic 9(03).
               05 K-RETCODE               pic x(01).
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
           02  KAREA-D.
               05  KCODOPE                pic x(02).
               05  KLIVAUTO               pic x(01).
               05  KMATRICOLA             pic x(08).
      *
           02  KARAMETRI-IN.
      *------------------------------------DATA DI ELABORAZIONE
               05 KATA-ELABO-IN           PIC 9(08).
      *1---------------------------------------- Elabora tutte
      *2---------------------------------------- Elabora Da A
      *3---------------------------------------- Elabora Singola
               05 KIPO-ELABO-IN           PIC X(01).
      *------------------------------Tabella 1: Tipo prestazioni     *
               05  K1-ELEMENTO     occurs 8  times.
                  07  K1-PRESTAZIONE    pic X(2).
               05 KERIODI-IN.
                  07 KLE-PERIODI OCCURS 6.
                     09 KNNO-DAL-IN-LK    PIC  9(4).
                     09 KUMERO-DAL-IN-LK  PIC  9(6).
                     09 KNNO-AL-IN-LK     PIC  9(4).
                     09 KUMERO-AL-IN-LK   PIC  9(6).
           02  FILLER                        PIC X(26784).
      *-
      *LINKAGE SECTION.
      *-
      *==============================================================*
       PROCEDURE  DIVISION
                            USING  COMMAREADS.
       MAIN.
      *
      *    DISPLAY '**** pdsna13 **** '.
      *
           move spaces   to COMMAREADS-OUT.
      *
           MOVE   K-AREA       TO L-AREA.
           MOVE   KARAMETRI-IN TO PARAMETRI-IN.
           MOVE   KAREA-D      TO LAREA-D.
      *
           MOVE   K-PROCEDURA  TO OUT-PROCEDURA.
      *
           perform  I00-INIZIALI      thru  I00-EX.
      *                                                              *
           perform  C00-CENTRALI      thru  C00-EX.
      *                                                              *
           perform  F00-FINALI        thru  F00-EX.
      *                                                              *
           MOVE   COMMAREADS-OUT  TO COMMAREADS.
      *                                                              *
220218     perform  F00-DELETE-TDSLOCK0  thru  F00-EX-DELETE-TDSLOCK0.
      *
160222     display 'elena pdsna13  out-messaggio: ' out-messaggio.
           GOBACK.
      *
       MAIN-EX.
           exit.
      *                                                              *
       B20-PERSTART.
      *
           MOVE  'B20-PERSTART' TO  WABNDB-LABEL.
           move  'N'                  to  W-ERRORE.
           move  zeros                to  FST-LFDATCO2.
      *--------------------------------- Chiave record iniziale      *
           move  L-CODICE-STOP   to H-DCOCENOPE
           move  zeros           to H-DCOANVEPR
                                    H-DCONDVEPR
                                     WIC-DOMANDA.
           move  W-DOMANDA-DAL   to  WIC-DOMANDA.
           subtract  1          from WIC-DOMANDA.
           move  WIC-ANNO        to H-DCOANVEPR  .
           move  WIC-NUMERO      to H-DCONDVEPR  .
      *--------------------------------  File dati comuni (LFDATCO2) *
           PERFORM  B20-DB2-DECL-CURS    THRU  B20-DB2-DECL-CURS-EX.
      *
           PERFORM  B20-DB2-FETCH    THRU  B20-DB2-FETCH-EX.
           IF  SQLCODE =    0
               move  'S'              to   WL-DATICOMUNI
               move  H-DCOANVEPR      to   WIC-ANNO
               move  H-DCONDVEPR      to   WIC-NUMERO
               add  1                 to   CTR-LET-DATCO
           ELSE
               PERFORM DATICOMUNI-DB2-CLSCUR THRU
                       DATICOMUNI-DB2-CLSCUR-EX
               move  'N'              to   WL-DATICOMUNI
               move  '96'             to  OUT-STATUS
               perform  T18-TESTO18   thru  T18-EX
               perform  W10-MSGERRORE thru  W10-EX
           END-IF.
       B20-EX.
           exit.
      *
       C00-CENTRALI.
      *
           if  W-ERRORE  =  'N'
           then
               continue
           else
               go  to  C00-EX
           end-if.
      *
           if  TIPO-ELABO-IN  <  3
           then
               perform  B20-PERSTART     thru  B20-EX
               if  FST-LFDATCO2  =  0
               then
                   move  'N'    to  W-FINE-INTERVALLO
                   perform  E00-ELABORA       thru  E00-EX
                     until  W-FINE-INTERVALLO  =  'S'
               end-if
           end-if.
      *
           move  'S'   to  W-FINE-ELABORA.
           perform  E60-SINCRONIZZO  thru  E60-EX.
       C00-EX.
           exit.
      *
       E00-ELABORA.
      *
           MOVE  'E00-ELABORA ' TO  WABNDB-LABEL.
      *
           if  WL-DATICOMUNI  =  'S'
           then
               perform  E20-ELABORA20  thru  E20-EX
           end-if.
      *
           if  W-NIK  =  'S'
           then
               if  W-CHK-CAMPI  = spaces
               then
                   continue
               else
                   perform  S20-ELENCA       thru  S20-EX
               end-if
            end-if.
      *-------------------------------------Sincronizzo ogni record
           if  WL-DATICOMUNI  =  'S'
           then
      *        if  WS-APPOGGIO  =  'S'
      *        then
                   perform  E60-SINCRONIZZO  thru  E60-EX
      *        end-if
               if  W-FINE-INTERVALLO  =  'S'
               then
                   go  to  E00-EX
               end-if
           end-if.
      *-------------------------
           perform  E15-INIZIALIZZO  thru  E15-EX
241117*------------------------- limite 1000 pagamenti per blocco    *
           if  L-TIPOCALCOLO  =  'R'
           then
               if  CTR-PAGATE  > 1999
               then
                   perform  DATICOMUNI-DB2-CLSCUR
                      thru  DATICOMUNI-DB2-CLSCUR-EX
                   move  'N'  to  WL-DATICOMUNI
                   move  'S'  to  W-FINE-INTERVALLO
                   perform  E60-SINCRONIZZO  thru  E60-EX
                   go  to  E00-EX
               end-if
241117     end-if.
      *
      *-----------------
           PERFORM  B20-DB2-FETCH    THRU  B20-DB2-FETCH-EX.
           IF SQLCODE =    0
               move  'S'         to  WL-DATICOMUNI
               move  H-DCOANVEPR to  WIC-ANNO
               move  H-DCONDVEPR to  WIC-NUMERO
               add  1            to  CTR-LET-DATCO
                                     CTR-VIDEO
           ELSE
               PERFORM DATICOMUNI-DB2-CLSCUR
                  THRU DATICOMUNI-DB2-CLSCUR-EX
               move  'N'         to  WL-DATICOMUNI
               move  'S'         to  W-FINE-INTERVALLO
               perform  E60-SINCRONIZZO  thru  E60-EX
           END-IF.
      *
       E00-EX.
           exit.
      *
       E15-INIZIALIZZO.
      *
           initialize    IC-AREA
                         OC-AREA.
           initialize    W-ANAGRAFICI
                         W-FST-SIINI
                         W-DAINIZIALIZZARE
150920                   W-VERIFICA-TELE
                         VO-DSPFM13B
                         W-STAMPAD.
      *
      *n   initialize    DCLTDSORSAM
      *n                 DCLTDSRIFRS
           initialize    DCLTDSNASPI
                         DCLTDSDICOL
                         DCLTDSASPRI
                         DCLTDSAUTLA
                         DCLTDSRECUP
                         DCLTDSPEERT
                         DCLTDSSITDO
                         DCLTDSPAGME
                         DCLTDSAPNA0
                         DCLTDSDATAN
                         DCLTDSDELSI
                         DCLTDSMODAN
                         DCLTDSDACOD
                         DCLTDSSOSPE
                         DCLTDSPEERE
                         DCLTDSPENSI.
      *n                 DCLTDSREINC
      *n                 DCLTDSMARIT.
           move  'Y'     to  W-XPDSNA02.
           move  'N'     to  WL-RECUPERI
                             WL-SITUAZIODO
                             WL-PAGAMENTI
                             WL-AUTLASPI
                             WL-ANFDIR.
      *                      WL-EFFEROGATI
      *                      WL-TEOEROGABI.
           move  'N'     to  WS-APPOGGIO.
           move  spaces  to  W-CHK-CAMPI.
      *    move  spaces  to  UPD-ANFRIC.
150515     move  'N'     to  W-ANFDIRETTI
                             W-FRONTALIERI
                             W-DATI-PAGME
                             W-SALTA
                             W-SCRIVO
                             W-ELABORA
                             W-CAMBIATO
150515                       W-LAVSOSPESO .
       E15-EX.
           exit.
      *
       E20-ELABORA20.
      *------------------------------------------ Compresa ?
           if  WIC-DOMANDA    <  W-DOMANDA-DAL
           then
               go  to  E20-EX
           end-if
      *------------------------------------------ Codice struttura
           if H-DCOCENOPE                   is  numeric
           then
               continue
           else
               move
                   'valore di DCOCENOPE/ADSDATCO non numerico.        '
                          to  W-CHK-CAMPI
               go  to  E20-EX
           end-if.
           if H-DCOCENOPE                   =  L-CODICE-STOP
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Stato disoccupazione
      *----- Verifica sospesa per consentire definizione domande.
      *    if H-DCOPESTDI                   =  'S'
      *    then
      *        continue
      *    else
      *        go  to  E20-EX
      *    end-if.
      *---------------------------------- Impostazione esito   ------*
      *-------rivedere ---------------->  ANTICIPAZIONE ASPI MINIASPI*
           if L-PROCEDURA                   =  'G21' OR
                                            =  'G98' OR
                                            =  'G99'
      *                                or   =  'Gnn'
GAL         if H-DCOCOTIDO              not  =  'T'
              move 'L'                       to  H-DCOULESPP
              move 'S'                       to  H-DCOPESTDI
              move  H-DCODTADEC              to  WRK-DCODTADEC
              move 0                         to  H-DCODTADEC
GAL         end-if
           end-if.
           if L-PROCEDURA                   =  'G97' or
                                            =  'G96'
              move 'L'                       to  H-DCOULESPP
              move 'S'                       to  H-DCOPESTDI
              move 0                         to  H-DCODTADEC
              move W8-ODIERNA                to  H-DCODTCODO
              move WRK-DCODTADEC             to  H-DCODTADEC
           end-if.
           move H-DCOULESPP                  to  W-DCOULESPP.
           move H-DCOULESSP                  to  W-DCOULESSP.
      *---------------------------------- Gestione per ANF/diretti   *
      *    move  'N'      to  W-ANFDIRETTI.
           if H-DCOANFRIC    =  'K'   and
              H-DCOCOTIDO    =  'U'
           then
               perform  E22-ELABORA22    thru  E22-EX
           end-if.
      *---------------------------------- Conguaglio Frontalieri     *
      *    move  'N'      to  W-FRONTALIERI.
      *    if H-DCOCOTIDO                   = '2 '   and
      *       H-DCOFLASU                    =  1
      *    then
      *        perform  E23-ELABORA23    thru  E23-EX
      *    end-if.
      *------------------------------------------ Esito  prestazione
           if  W-DCOULESPP  =  'L'
      *n   or  W-DCOULESSP  =  'L'
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Tipo prestazione
           if H-DCOCOTIDO                   =  spaces
           then
               move
                   'valore di DCOCOTIDO/ADSDATCO non presente.        '
                          to  W-CHK-CAMPI
               go  to  E20-EX
           end-if.
           if H-DCOCOTIDO                   =  'Q '
                                        or  =  'U '
GGA                                     or  =  'T '
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Ordinaria
           if H-DCOCOTIDO                   =  'Q '
                                        or  =  'U '
GGA                                     or  =  'T '
               if  W-DCOULESPP  =  spaces
               then
                   move
                   'valore di DCOULESPP/ADSDATCO non presente.        '
                          to  W-CHK-CAMPI
                   go  to  E20-EX
               end-if
      *        if H-DCOULESPP                   =  'L'
               if  W-DCOULESPP  =  'L'
               then
                   if H-DCODTULPP                   is numeric
                   then
                       continue
                   else
                       move
                   'valore di DCOULESPP/ADSDATCO non numerico.        '
                              to  W-CHK-CAMPI
                       go  to  E20-EX
                   end-if
                   if ( H-DCODTULPP   >  20150131    and
                        H-DCOCOTIDO   =  'Q' )
                      or
                      ( H-DCODTULPP   >  20150430    and
                        H-DCOCOTIDO   =  'U' )
                      or
                      ( H-DCODTULPP   >  20150430    and
                        H-DCOCOTIDO   =  'T' )
                   then
                       continue
                   else
      *                go  to  E20-EX
                       move  'S'  to  W-SALTA
                   end-if
               else
      *            go  to  E20-EX
                   move  'S'  to  W-SALTA
               end-if
           end-if.
      *------------------------------------------ Speciale
      *n   if H-DCOCOTIDO                   =  '3 '
      *n                                or  =  '8 '
      *n       if H-DCOULESSP                   =  spaces
      *n       if  W-DCOULESSP  =  spaces
      *n       then
      *n           move
      *n           'valore di DCOULESSP/ADSDATCO non presente.        '
      *n                  to  W-CHK-CAMPI
      *n           go  to  E20-EX
      *n       end-if
      *        if H-DCOULESSP                   =  'L'
      *n       if  W-DCOULESSP  =  'L'
      *n       then
      *n           if H-DCODTULSP                   is numeric
      *n           then
      *n               continue
      *n           else
      *n               move
      *n           'valore di DCODTULSP/ADSDATCO non numerico.        '
      *n                      to  W-CHK-CAMPI
      *n               go  to  E20-EX
      *            end-if
      *n           if H-DCODTULSP                   >  19990630
      *n           then
      *n               continue
      *n           else
      *                go  to  E20-EX
      *n               move  'S'  to  W-SALTA
      *n           end-if
      *n       else
      *            go  to  E20-EX
      *n           move  'S'  to  W-SALTA
      *n       end-if
      *n   end-if.
      *------------------------------------------ Doppio trattamento
      *n   if H-DCOCOTIDO                   =  '0 '
      *n                                or  =  '5 '
      *n                                or  =  '9 '
      *        if H-DCOULESPP                   =  spaces   and
      *           H-DCOULESSP                   =  spaces
      *n       if  W-DCOULESPP  =  spaces   and
      *n           W-DCOULESSP  =  spaces
      *n       then
      *n           move
      *n           'valore di DCOULESPP-DCOULESSP/ADSDATCO no presente'
      *n                  to  W-CHK-CAMPI
      *n           go  to  E20-EX
      *n       end-if
      *        if H-DCOULESPP                   =  'L'   or
      *           H-DCOULESSP                   =  'L'
      *n       if  W-DCOULESPP  =  'L'   or
      *n           W-DCOULESSP  =  'L'
      *n       then
      *n           if (H-DCODTULPP                is not  numeric) and
      *n              (H-DCODTULSP                is not  numeric)
      *n           then
      *n               move
      *n           'valore di DCODTULPP-DCODTULSP/ADSDATCO no numerico'
      *n                      to  W-CHK-CAMPI
      *n               go  to  E20-EX
      *n           end-if
      *n           if H-DCODTULPP                   >  19990630   or
      *n              H-DCODTULSP                   >  19990630
      *n           then
      *n               continue
      *n           else
      *                go  to  E20-EX
      *n               move  'S'  to  W-SALTA
      *n           end-if
      *n       else
      *            go  to  E20-EX
      *n           move  'S'  to  W-SALTA
      *n       end-if
      *n   end-if.
      *------------------------------------------ Prestaz.da elaborare?
           move  'N'         to  W-SCELTA.
      *I---------29/05/2013 - Consento elab. di una sola prestazione  *
      *    perform  varying  NDC1  from 1  by 1
      *      until NDC1         >  8        or
      *            T1-PRESTAZIONE(NDC1)  =  spaces
      *        if H-DCOCOTIDO                   =  T1-PRESTAZIONE(NDC1)
               if H-DCOCOTIDO                   =  T1-PRESTAZIONE(1)
               then
      *            move  11   to  NDC1
                   move  'S'  to  W-SCELTA
               end-if.
      *    end-perform.
      *F--------------------------------------------------------------*
      *
           add   1    to  CTR-ELA-DATCO.
      *------------------------------------------ Continuo?
           if  W-SALTA   =  'S'   or
               W-SCELTA  =  'N'
           then
               go  to  E20-EX
           end-if.
      *------------------------------------------ Leggo archivi       *
           move  'N'    to  W-ERRORE.
           perform  L10-LETTURA     thru  L10-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  E20-EX
           end-if.
      *
           add   1    to  CTR-ELA-DATAN.
      *--------Necessaria dopo verifica pagamenti 1°liqui/tutte/già pag
           if  W-SALTA   =  'S'   or
               W-SCELTA  =  'N'
           then
               go  to  E20-EX
           end-if.
      *--------------------------------------- Verifica Blocco pagamento
           move  H-DCOCODFIS                  to  LK-CODFIS.
           move  'N'                          to  LK-RISP.
           CALL  RDSUT28  USING
                 WDFHEIBLK  WDFHCOMMAREA
                 PER-RDSUT28.
280218*    cancel  RDSUT28.
           if  LK-RISP =  'S'
           then  move
               'Pagamenti bloccati x il Codice Fiscale: vedi SCUP '
                        to  W-CHK-CAMPI
               go  to  E20-EX
           end-if.
      *------------------------------------------ Anagrafica         *
           move  'N'    to  W-ERRORE.
220817     if  IC-PMESTAPAG  =  'C'
           then
               perform  E31-ANAGRAFICA   thru  E31-EX
               if  W-ERRORE  =  'S'
               then
                   perform  S20-ELENCA   thru  S20-EX
                   go  to  E20-EX
               end-if
220817     else
250717         perform  E311-NO-ARCA     thru  E311-EX
220817     end-if.
      *------------------------------------------ Calcolo
           perform  E24-CALCOLO      thru  E24-EX.
      *
           if  OC-RETCODE  equal  zeroes
           then
      *----------------------------------------- Verifica            *
               perform  J10-QUADRATURA     thru  J10-EX
               if  W-ERRORE  =  'S'
               then
                   if  W-NIK  =  'S'
                   then
                       perform  S20-ELENCA       thru  S20-EX
                       go  to  E20-EX
                   else
                       go  to  E20-EX
                   end-if
               end-if
               move   'C'    to  L-RETCODE
               perform  E30-AGGIORNA     thru  E30-EX
           else
               if  W-NIK  =  'S'
               then
                   perform  S20-ELENCA       thru  S20-EX
               end-if
           end-if.
       E20-EX.
           EXIT.
      *
       E22-ELABORA22.
      *    if H-DCOPESTDI                   =  'S'
      *    then
      *        continue
      *    else
      *        go  to  E22-EX
      *    end-if.
           if  (H-DCOULESPP                  =  'D')  and
               (H-DCOULESSP                  =  'D'   or
               H-DCOULESSP                   =  ' '   or
               H-DCOULESSP                   =  'R')
           then
               move  'S'   to  W-ANFDIRETTI
           end-if
      *n
      *n   if  (H-DCOULESSP                  =  'D')  and
      *n       (H-DCOULESPP                  =  'D'   or
      *n       H-DCOULESPP                   =  ' '   or
      *n       H-DCOULESPP                   =  'R')
      *n   then
      *n       move  'S'   to  W-ANFDIRETTI
      *n   end-if.
           if  W-ANFDIRETTI  =  'S'
           then
               if H-DCOULESPP                   =  'D'
               then
                   move  'L'  to  W-DCOULESPP
               end-if
      *n       if H-DCOULESSP                   =  'D'
      *n       then
      *n           move  'L'  to  W-DCOULESSP
      *n       end-if
           end-if.
       E22-EX.
           EXIT.
      *
       E221-ELABORA221.
           if  (H-DCOULESPP                 =  'D')  and
               (H-DCOULESSP                 =  'D'   or
               H-DCOULESSP                  =  ' '   or
               H-DCOULESSP                  =  'R')
           then
               move  'S'   to  W-ANFDIRETTI
           end-if.
      *n
      *n   if  (H-DCOULESSP                 =  'D')  and
      *n       (H-DCOULESPP                 =  'D'   or
      *n       H-DCOULESPP                  =  ' '   or
      *n       H-DCOULESPP                  =  'R')
      *n   then
      *n       move  'S'   to  W-ANFDIRETTI
      *n   end-if.
           if  W-ANFDIRETTI  =  'S'
           then
               if H-DCOULESPP                  =  'D'
               then
                   move  'L'  to  W-DCOULESPP
               end-if
      *n       if H-DCOULESSP                  =  'D'
      *n       then
      *n           move  'L'  to  W-DCOULESSP
      *n       end-if
           end-if.
       E221-EX.
           EXIT.
      *
      *E23-ELABORA23.
      *n   if  (H-DCOULESPP                  =  'D')  and
      *n       (H-DCOULESSP                  =  ' ')
      *n   then
      *n       move  'S'   to  W-FRONTALIERI
      *n   end-if
      *n   if  W-FRONTALIERI  =  'S'
      *n   then
      *n       if H-DCOULESPP                   =  'D'
      *n       then
      *n           move  'L'  to  W-DCOULESPP
      *n       end-if
      *n   end-if.
      *E23-EX.
      *n   EXIT.
      *n
      *E231-ELABORA231.
      *n   if  (H-DCOULESPP                 =  'D')   AND
      *n       (H-DCOULESSP                 =  ' ')
      *n   then
      *n       move  'S'   to  W-FRONTALIERI
      *n   end-if.
      *n   if  W-FRONTALIERI  =  'S'
      *n   then
      *n       if H-DCOULESPP                  =  'D'
      *n       then
      *n           move  'L'  to  W-DCOULESPP
      *n       end-if
      *n   end-if.
      *E231-EX.
      *n   EXIT.
      *
       L10-LETTURA.
      *---------------------------------------- Codici prestazione   *
           move  zeroes  to  W-CODICEUNO
                             W-CODICEDUE.
           if H-DCOCOTIDO                   =  spaces
           then
               move
                   'valore di DCOCOTIDO/ADSDATCO non presente.        '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L10-EX
           end-if.
           evaluate H-DCOCOTIDO
             when  'U '
                        move   35     to  W-CODICEUNO
             when  'Q '
                        move   36     to  W-CODICEUNO
             when  'T '
                        move   37     to  W-CODICEUNO
             when  other
                        move  'S'  to  W-ERRORE
                        go  to  L10-EX
           end-evaluate.
      *---------------------------------------- Dati comuni
           perform  L11-DATICOMUNI     thru  L11-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Pagamenti
           perform  L13-PAGAMENTI      thru  L13-EX.
           if  W-ERRORE  =  'S'   or
               W-SCELTA  =  'N'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Recuperi
           perform  L16-RECUPERI       thru  L16-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Situazione
           perform  L19-SITUAZIODO     thru  L19-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Dati anagrafici
           perform  L22-ANAGRAFICI     thru  L22-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Deleghe sindacali
           perform  L25-DELEGHE        thru  L25-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Dati A.N.F.
      *I------------------------------- new dal 23/07/2013           *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35)
           then
               initialize  LC-TAB-ANF
      *F------------------------------- new dal 23/07/2013           *
               perform  L28-DATIANF  thru  L28-EX
           end-if.
      *------------------------ Vengono gestiti solo i dati ANF
      *------------------------ che risultano corretti.
      *    if  W-ERRORE  =  'S'
      *    then
      *        go  to  L10-EX
      *    end-if.
      *---------------------------------------- Dati A.N.F. diretti *
           if  W-ANFDIRETTI  =  'S'
           then
               perform  L281-ANFDIRETTI    thru  L281-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *---------------------------------------- Dati comuni DS/Ord.
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35
                        or  =   36)
           then
               perform  L31-DSCOMUNI       thru  L31-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *---------------------------------------- Dati NASPI          *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35)
           then
               perform  L33-NASPI          thru  L33-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *---------------------------------------- Dati DISCOLL        *
           if (W-CODICEUNO  =   36)
           then
               perform  L34-DISCOLL        thru  L34-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *---------------------------------------- Dati aut. NASPI     *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35
                        or  =   36)
           then
               perform  L35-AUTASPI        thru  L35-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *--------------------------------- Anticipazione NASPI
      * per anticipazione il codiceuno =  37
           if  (W-CODICEUNO  =   37 )
           then
               perform  L41-ANTNASPI        thru  L41-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *-
      *--------------------------------- Anticipazione NASPI
      * per anticipazione il codiceuno =  37
           if  (W-CODICEUNO  =   37 )
           then
               perform  L42-DECANTNASPI        thru  L42-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *-
      *--- NON necessaria...campi a default --- Dati Ord/Sanmarino
      *n   if  (W-DCOULESPP  =  'L')   and
      *n       (W-CODICEUNO  =   20)
      *n   then
               perform  L36-ORDSANMARINO    thru  L36-EX.
      *n       if  W-ERRORE  =  'S'
      *n       then
      *n           go  to  L10-EX
      *n       end-if
      *n   end-if.
      *--------------------------------- Rimpatriati Frontalieri Stagio
      *--- NON necessaria...campi a default --- Dati Rimpatriati
      *n   if  (W-DCOULESPP  =  'L')   and
      *n       (W-CODICEUNO  =   21)
      *n   then
               perform  L37-RIMPATRIATI     thru  L37-EX.
      *n       if  W-ERRORE  =  'S'
      *n       then
      *n           go  to  L10-EX
      *n       end-if
      *n   end-if.
      *-------------------------????----------- Dati ASPRI new      *
      *-------------------------non previste riduzioni              *
      *    if (W-CODICEUNO  =   35)
      *    then
      *        perform  L38-ASPRI          thru  L38-EX
      *        if  W-ERRORE  =  'S'
      *        then
      *            go  to  L10-EX
      *        end-if
      *    end-if.
      *--------------------------------- Regime Internazionale - CEE
      *    if  (W-DCOULESSP  =  'L')   and
      *        (W-CODICEDUE  =  22)
      *    then
               perform  L40-REGIMECEE       thru  L40-EX.
      *        if  W-ERRORE  =  'S'
      *        then
      *            go  to  L10-EX
      *        end-if
      *    end-if.
      *---------------------------------------- Edili
      *n   if  (W-DCOULESSP  =  'L'  )   and
      *n       (W-CODICEDUE  =  23   or   =  24)
      *n   then
               perform  L43-EDILI           thru  L43-EX.
      *n       if  W-ERRORE  =  'S'
      *n       then
      *n           go  to  L10-EX
      *n       end-if
      *n   end-if.
      *---------------------------------------- Marittimi            *
      *n   if  (W-DCOULESPP  =  'L')   and
      *n       (W-CODICEUNO  =  25)
      *n   then
               perform  L46-MARITTIMI       thru  L46-EX.
      *n       if  W-ERRORE  =  'S'
      *n       then
      *n           go  to  L10-EX
      *n       end-if
      *n   end-if.
      *---------------------------------------- Sospensioni          *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35 or 36)
           then
               perform  L49-SOSPENSIONI    thru  L49-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *--------------------------------- Periodi erogabili Teorici   *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35 or 36)
           then
               perform  L52-TEOEROGABI     thru  L52-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *--------------------------------- Pensioni                    *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35 or 36)
           then
               if H-DCOPENS                      =  'S'
               then
                  perform  L55-PENSIONI   thru  L55-EX
                  if  W-ERRORE  =  'S'
                  then
                      go  to  L10-EX
                  end-if
               end-if
           end-if.
      *--------------------------------- Periodi erogati effettivi   *
      *    perform  L58-EFFEROGATI     thru  L58-EX.
      *    if  W-ERRORE  =  'S'
      *    then
      *        go  to  L10-EX
      *    end-if.
230620*-----------------proroga--------- Verifica pagamento sussidi  *
131020     if (IC-DCOFLASU     =  60  or  62  or  70)
               and
              (W-CODICEUNO     =  35   or   36)
           then
               move  IC-DCOCODFIS      to  W-COD-FISC
               perform  L68-SUS-LD     thru  L68-EX
               if  W-ERRORE  =  'S'
               then  go  to  L10-EX
               end-if
               if  CNT-C100  >  zeroes
               then  go  to  L10-EX
               end-if
131020     end-if.
131020*        if  L-TIPOCALCOLO   =  'R'
131020*        then
      *            if  CNT-C100  >  zeroes
      *            then  go  to  L10-EX
      *            end-if
      *            then  perform   E391-DB2-UPD-DATCO
      *                     thru   E391-DB2-UPD-DATCO-EX
      *            then
131020*                move  W-DCOFLASU     to  IC-DCOFLASU
      *                move  IC-DCODTDECSP  to  IC-DCODTADEC
131020*                move  zeroes         to  IC-DCODTDECSP
      *            end-if
      *------------------ le seguenti 6 commentate il 131020         *
220720*            if  (IC-DCODTADEC  >   zeroes)   and
      *                (IC-DCODTADEC  <=  IC-DCODTDECSP)
      *            then
      *                move  W-DCOFLASU     to  IC-DCOFLASU
      *                move  zeroes         to  IC-DCODTDECSP
220720*            end-if
      *        else
      *            if  W-ERRORE  =  'S'
      *            then  go  to  L10-EX
      *            end-if
      *        end-if
230620*    end-if.
       L10-EX.
           EXIT.
      *
       L11-DATICOMUNI.
      *---------------------------------------- Codice DOMUS         *
           if H-DCOCHIDOM                     is  numeric
           then
               move H-DCOCHIDOM                   to  IC-DCOCHIDOM
           else
               move
                   'valore di DCOCHIDOM /ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Codice struttura     *
           move H-DCOCENOPE                   to   IC-DCOCENOPE.
      *
           move  WIC-DOMANDA    to  IC-DOMANDA.
           if  TIPO-ELABO-IN  =  3
           then
               move  WB-DOMANDA    to  IC-DOMANDA
           end-if.
      *---------------------------------------- Codice domanda       *
           if H-DCOCOTIDO                    =  spaces
           then
               move
                   'valore di codice tipo domanda non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
           move H-DCOCOTIDO                   to  IC-DCOCOTIDO.
      *---------------------------------------- Codice fiscale       *
           if H-DCOCODFIS                    =  spaces
           then
               move
                   'valore di codice fiscale      non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
           move H-DCOCODFIS                   to  IC-DCOCODFIS.
      *---------------------------------------- Data domanda         *
           if H-DCODTPRDO                    is  not  numeric
           then
               move
                   'data presentazione domanda non corretta.          '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
           move H-DCODTPRDO                   to  IC-DCODTPRDO.
      *---------------------------------------- Pensionato?          *
      *    if H-DCOPENS                      =  spaces
      *    then
      *        move
      *            'valore di DCOPENS   /ADSDATCO non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
           move H-DCOPENS                     to  IC-DCOPENS.
      *---------------------------------------- Richiesta ANF        *
      *    if H-DCOANFRIC                    =  spaces
      *    then
      *        move
      *            'valore di DCOANFRIC /ADSDATCO non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
           move H-DCOANFRIC                   to  IC-DCOANFRIC
                                                  UPD-ANFRIC.
290816     if  H-DCOANFRIC  =  'T'
           then  move  'N'                    to  IC-DCOANFRIC
290816     end-if.
      *---------------------------------------- Data Richiesta ANF   *
      *    if H-DCOANFRIC                    =  'K'
      *    if  W-ANFDIRETTI  =  'K'
      *    then
      * Att. DCODTANFPD non presente in tabella                      *
      *        if H-DCODTANFPD                   is  numeric
      *        then
      *            move H-DCODTANFPD                  to  IC-DCODTANFPD
      *        else
      *            move
      *            'valore di DCODTANFPD/ADSDATCO non presente.       '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            go  to  L11-EX
      *        end-if
      *    end-if.
      *---------------------------------------- Codice x DL 35/2005  *
      *---------  = 7 (per gg da 270 a 300), 8(per gg da 180 a 210)  *
           if H-DCOINT                       is  numeric
           then
               move H-DCOINT                      to  IC-DCOINT
           else
               move
                  'valore di DCOINT    /ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Decadenza            *
           if H-DCODTADEC                    is  numeric
           then
               move H-DCODTADEC                   to  IC-DCODTADEC
           else
               move
                  'data decadenza non corretta.                      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Esito 1° prestazione *
      *n   if  (H-DCOULESPP                   =  spaces)   or
           if  (H-DCOULESPP                   is  alphabetic)
           then
               move  W-DCOULESPP  to  IC-DCOULESPP
           else
               move
                  'valore di esito 1° prestazione non presente.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Esito 2° prestazione *
           if  (H-DCOULESSP                   =  spaces)
      *n    or (H-DCOULESSP                   is  alphabetic)
           then
               move  W-DCOULESSP  to  IC-DCOULESSP
           else
               move
                  'valore di esito 2° prestazione non previsto.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data  1°pr.          *
           if H-DCODTULPP                    is  numeric
           then
               move H-DCODTULPP                   to  IC-DCODTULPP
           else
               move
                  'valore di data esito prestazione 1 non corretta.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data  2°pr.          *
           if H-DCODTULSP        =  0
      *    if H-DCODTULSP                    is  numeric
           then
               move H-DCODTULSP              to  IC-DCODTULSP
           else
               move
                  'valore di data esito prestazione 2 non previsto.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data decorrenza PP   *
           if H-DCODTDECPP                   is  numeric
           then
               move H-DCODTDECPP                  to  IC-DCODTDECPP
           else
               move
                  'data decorrenza prestazione 1 non corretta.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data decorrenza SP   *
           if H-DCODTDECSP                   is  numeric
           then
               move H-DCODTDECSP             to  IC-DCODTDECSP
230620*    else
      *        move
      *           'data esito prestazione 2 non prevista.            '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
230620*        go  to  L11-EX
           end-if.
      *---------------------------------------- W-DECORRENZA         *
           move  zeros        to  W-DECORRENZA.
           if H-DCODTDECPP                  >  zeros
           then
      *n       if H-DCODTDECSP                 >  zeros
      *n       then
      *n           if H-DCODTDECPP                    >
      *n                    H-DCODTDECSP
      *n           then
      *n               move H-DCODTDECSP
      *n                                      to  W-DECORRENZA
      *n           else
      *n               move H-DCODTDECPP
      *n                                      to  W-DECORRENZA
      *n           end-if
      *n       else
                   move H-DCODTDECPP
                                          to  W-DECORRENZA
      *n       end-if
      *n   else
      *n           move H-DCODTDECSP
      *n                                  to  W-DECORRENZA
      *n   end-if.
      *n
           if  W-DECORRENZA  equal  zeros
           then
               move
                  'Decorrenza prestazione non presente.              '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L11-EX
           end-if.
280922*--------------------------------- Iban estero                 *
           IF H-DCOIBAN = 'EEEE' and  H-DCOCOOBAN = ' '
             perform  L59-IBANESTERO     thru  L59-EX

             if  W-ERRORE  =  'S'
             then
                 go  to  L10-EX
             end-if
           END-IF.
      *----------------------------------------  Patronato
           move H-DCOCODPAT                   to  IC-DCOCODPAT.
131115*---------------------------------------- Coordinate bancarie
      *    if  H-DCOCOOBAN  = 'H0608501004000000021353'
      *    then
      *        move
      *          'IBAN BLOCCATO SU RICHIESTA A.G'
      *                      to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
131115*---------------------------------------- Coordinate bancarie
      *    if H-DCOCOOBAN                   equal  spaces
      *    then
      *        move  zeroes                       to  R09-RC
      *    else
      *        move H-DCOCOOBAN                   to  R09-COOBAN
      *        move  9                            to  R09-RC
      *        CALL  RDSUT09  USING
      *              WDFHEIBLK  WDFHCOMMAREA
      *              PER-RDSUT09
      *        cancel  RDSUT09
      *        if  R09-RC  =  zeros
      *        then
      *            move H-DCOCOOBAN               to  IC-DCOCOOBAN
      *            move H-DCOIBAN                 to  IC-DCOIBAN
      *        end-if
      *    end-if.
131115*-----------------new
           move  spaces    to  W-IBAN
                               W-COOBAN.
           move  spaces    to  P-PAESE
                               P-CIN-2
                               P-CCLIENTE-A.
           move  zeros     to  P-CIN-1
                               P-CODABI-A
                               P-CODCAB-A.

280922* se l'iban estero è > 27 bytes il pagamento viene bloccato.
280922* Sono interessati gli iban di Cipro, Ungheria e Polonia.
280922     IF H-DCOIBAN  = 'EEEE'
280922       IF W-IBEIBAEST(1:2) = 'CY' or 'HU' or 'PL'
280922          MOVE 'Pagamento bloccato per IBAN ESTERO > 27 caratteri'
280922                      to  W-CHK-CAMPI
280922          move  'S'  to  W-ERRORE
280922          go  to  L11-EX
280922       END-IF
280922     END-IF.

280922* per iban estero non va chiamata la routine di controllo
280922* formale
280922     IF H-DCOIBAN  not = 'EEEE'
             if  H-DCOCOOBAN  =  spaces
             then
                 continue
             else
               move  H-DCOIBAN     to  W-IBAN
               move  H-DCOCOOBAN   to  W-COOBAN
      **       move  'IT'          to  P-PAESE
      **       move  zeros         to  P-CIN-1
      **       move  H-DCOCOOBAN   to  P-BBAN
               if  W-IBAN(1:2)   =  'IT'
               then  continue
               else  move
               'IBAN non utilizzabile per il pagamento prestazioni'
                            to  W-CHK-CAMPI
                 move  'S'  to  W-ERRORE
                 go  to  L11-EX
               end-if
               if  W-COORDINATE  =  'IT33H0608501004000000021353'
               then
                   move
               'IBAN bloccato su richiesta Autorità Giudiziaria.  '
                              to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
                   go  to  L11-EX
               end-if
               if  W-COORDINATE  =  'IT01T36000032000A9H00000037'  or
                   W-COORDINATE  =  'IT98T36000032000A9H00000037'
               then
                   move
               'IBAN non utilizzabile per il pagamento prestazioni'
                              to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
                   go  to  L11-EX
               end-if
      **-
               move  spaces        to  V-OK-IBAN
                                       V-MSG-IBAN
               move  W-COORDINATE  to  V-IBAN
               call  PITIBAN2
                   using  V-OK-IBAN  V-IBAN  V-MSG-IBAN
               end-call
               cancel  PITIBAN2
      **%%solo per test elena
      **%%     move 'OK'  to V-OK-IBAN
      **-
               if  V-MSG-IBAN(1:2)  =  'IT'
               then
                   move  V-MSG-IBAN     to  W-CHK-CAMPI
                   move  'S'            to  W-ERRORE
                   go  to  L11-EX
               end-if
               if  V-OK-IBAN        =  'OK'
               then
                   move H-DCOCOOBAN     to  IC-DCOCOOBAN
                   move H-DCOIBAN       to  IC-DCOIBAN
               else
                   move  V-MSG-IBAN     to  W-CHK-CAMPI
                   move  'S'            to  W-ERRORE
                   go  to  L11-EX
               end-if
131115       end-if
280922     end-if.
      *------------------------------ Controllo SCUP x IBAN          *
270321     if  IC-DCOCOOBAN  =  spaces
280922       AND H-DCOIBAN  not = 'EEEE'
           then  continue
           else
               perform  L11S-SCUP-X-IBAN  thru  L11S-EX
               if  W-ERRORE  =  'S'
               then  go  to  L11-EX
               end-if
270321     end-if.
      *---------------------------------------- Data  compl. domanda *
           if H-DCODTCODO                    is  numeric
           then
               continue
           else
               move
                  'data completamento domanda non corretta.          '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
261115     move  zero       to  W-DATAPIU7.
021115     if H-DCODTCODO        >  zeroes
           then
               move H-DCODTCODO                   to  IC-DCODTCODO
           else
               perform L11-X-DTCODO thru L11-X-DTCODO-EX
               if  W-ERRORE  =  'S'
               then  go  to  L11-EX
               end-if
261115*        move W8-ODIERNA                    to  IC-DCODTCODO
021115     end-if.
      *---------------------------------------- Data valuta
           move H-DCODTVIR                    to  IC-DCODTVIR.
      *----------------------------------------  Stato disoccupazione*
           move H-DCOPESTDI                   to  IC-DCOPESTDI.
           if  W-ANFDIRETTI  =  'S'
      *n   OR  W-FRONTALIERI =  'S'
           then
               move  'S'                      to  IC-DCOPESTDI
           end-if.
      *---------------------------------------- ex  gestione codice 5*
      *       H-DCOFLASU   - per le NASPI è impostato = 0
240519*    il valore ascii della U-naspi è 85 -
240519*    l'istruttoria e variazione dovranno impostarlo = 85
240519*    in caso di pagamento verrà reimpostato a 0-zero
230620*    if H-DCOFLASU         =  0
      *                      or  =  85
      *    then
      *        move H-DCOFLASU                    to  IC-DCOFLASU
230620*----- emergenza COVID19- per la proroga DL34/2020 naspi e     *
      *----- discoll viene utilizzato flag dcoflasu, la cui gestione *
      *----- con '85' non è mai stata implementata dalla variazione  *
      *----- inoltre bisogna gestire le incompatibilità.
      *
           if H-DCOFLASU  is  numeric
230620     then  move  H-DCOFLASU   to  IC-DCOFLASU
           else  move
                  'valore di DCOFLASU /TDSDATCO  non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *
131020     if  (IC-DCODTADEC  >  zeroes)   and
               (IC-DCODTADEC  <= IC-DCODTDECSP)
           then
               move
              'Decade ante proroga: ripristinare periodi teorici.'
      *       'Proroga bloccata, presente decadenza antecedente  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
131020     end-if.
131020     if  IC-DCOFLASU  =  00
                        or  =  09
                        or  =  10
                        or  =  19
                        or  =  20
                        or  =  21
                        or  =  45
                        or  =  46
                        or  =  54
                        or  =  55
                        or  =  60
                        or  =  62
                        or  =  70
                        or  =  99
           then  continue
           else  move
              'valore di DCOFLASU  /ADSDATCO non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
131020     end-if.
      *
131020     move  spaces  to  W-CHK-PROROGA.
           move  'N'     to  W-ERR-PROROGA.
           evaluate  IC-DCOFLASU
             when  09  move
                'Proroga 1 bloccata, Sussidio Integrato su REM.    '
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  10  move
                'Proroga 2 bloccata, Sussidio Integrato su REM.    '
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  19  move
                'Proroga 1 bloccata, presente domanda pensione.    '
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  20  move
                'Proroga bloccata per sussidio stagionali diversi  '
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  21  move
                'Proroga 2 bloccata, presente APE social/Lav.Precoc'
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  45  move
                'Proroga 1 bloccata, erogati sussidi incompatibili.'
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  46  move
                'Proroga 2 bloccata, erogati sussidi incompatibili.'
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  54  move
                'Proroga1 bloccata, erogato bonus LD incompatibile.'
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
             when  55  move
                'Proroga2 bloccata, erogato bonus LD incompatibile.'
                             to  W-CHK-PROROGA
                 move  'S'   to  W-ERR-PROROGA
131020     end-evaluate.
      *
230620*    if  L-TIPOCALCOLO  =  'S'
      *    then
      *        evaluate  IC-DCOFLASU
051020*          when  09  move
      *           'Proroga bloccata, Sussidio Integrato su REM.      '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
051020*            go  to  L11-EX
      *          when  19  move
      *           'Proroga bloccata, presente domanda pensione.      '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            go  to  L11-EX
240720*          when  20  move
      *           'Proroga bloccata per sussidio stagionali diversi  '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
240720*            go  to  L11-EX
      *          when  45  move
      *           'Proroga  bloccata, erogati sussidi incompatibili. '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            go  to  L11-EX
      *          when  54  move
      *           'Proroga  bloccata, erogato bonus LD incompatibile.'
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            go  to  L11-EX
      *          when  other  move
      *           'valore di DCOFLASU  /ADSDATCO non previsto.       '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            go  to  L11-EX
      *        end-evaluate
230620*    end-if.
      *------------------- verifica coerenza dati proroga covid19    *
131020     if  H-DCODTDECSP  =  0
           then
               if  H-DCOFLASU  =  00
                           or  =  09
                           or  =  10
                           or  =  19
                           or  =  20
                           or  =  21
                           or  =  45
                           or  =  46
                           or  =  54
                           or  =  55
                           or  =  99
               then  continue
               else  move
                  'impostazioni dati proroga non coerenti.           '
                                to  W-CHK-CAMPI
                     move  'S'  to  W-ERRORE
                     go  to  L11-EX
               end-if
131020     end-if.
131020     if  H-DCODTDECSP  >  0
               if  H-DCOFLASU  =  60
                           or  =  62
                           or  =  70
               then  continue
               else  move
                  'impostazioni dati proroga non coerenti.           '
                                to  W-CHK-CAMPI
                     move  'S'  to  W-ERRORE
                     go  to  L11-EX
               end-if
131020     end-if.
230620*    if   (H-DCODTDECSP  =  zeroes   and
      *          H-DCOFLASU  not  equal  60)
      *      or (H-DCODTDECSP  >  zeroes
      *         and  H-DCOFLASU  =  60)
      *    then  continue
      *    else  move
      *        'impostazioni dati proroga non coerenti.           '
      *                   to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  L11-EX
      *    end-if.
      *
230620     if H-DCODTDECSP  >  zeroes
           then
               if  H-DCODTDECSP  >  20200301  and
      *            H-DCODTDECSP  <  20200502
131020             H-DCODTDECSP  <  20200702
               then  continue
               else  move
                  'valore DCODTDECSP   non compatibile con la proroga'
                              to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
                   go  to  L11-EX
               end-if
           end-if.
           if H-DCODTDECSP  >  20200301  and
      *       H-DCODTDECSP  <  20200502
131020        H-DCODTDECSP  <  20200702
           then
               if  H-DCOFLASU  =  60
131020                     or  =  62
131020                     or  =  70
               then  continue
               else  move
                  'valore di DCOFLASU  non compatibile per la proroga'
                             to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L11-EX
               end-if
230620     end-if.
      *----------------------------------------  riliquidazione Front*
      *n   if  W-FRONTALIERI =  'S'
      *n   then
      *n       move  'R'                      to  IC-FRONTALIERI
      *n   else
               move  spaces                   to  IC-FRONTALIERI.
      *n   end-if.
      *----------------------------------------  tempo reale S/N/A/B *
           move  H-DCODORICO                  to  IC-DCODORICO.
           move  spaces                       to  IC-FLGANTICIP.
      *GGA TOLTA UPDATE---------- Necessaria al rollback in simulaz. *
       L11-EX.
           EXIT.
      *
021115 L11-X-DTCODO.
      *--------------------------- Calcolo Odierna + 7gg             *
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  W6-ODIERNA       to  R10-DATA-I.
           move     7             to  R10-GIORNI.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-F   to  D6-GGMMAA
               move  W6-GG        to  W8-GG
               move  W6-MM        to  W8-MM
               move  W6-AA        to  W8-AAAA
               add   2000         to  W8-AAAA
               move  W8-AAAAMMGG  to  W-DATAPIU7
           else
               move
                   'valore di W-DATAPIU7   non calcolato correttamente'
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L11-X-DTCODO-EX
           end-if.
           if  W-DATAPIU7  >  W8-ODIERNA
           then  continue
           else  move
                   'data   di W-DATAPIU7   non calcolata correttamente'
                             to  W-CHK-CAMPI
                 move  'S'  to  W-ERRORE
                 go  to  L11-X-DTCODO-EX
           end-if.
      *--------------------------- Calcolo gg tra DTPRDO e DATAPIU7  *
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  H-DCODTPRDO      to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-I.
           move  W-DATAPIU7       to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-F.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then  continue
           else  move
                   'Calcolo giorni per interessi non effettuabile.    '
                             to  W-CHK-CAMPI
                 move  'S'  to  W-ERRORE
                 go  to  L11-X-DTCODO-EX
           end-if.
261115     if  R10-GIORNI  <  120
           then
      *        move  H-DCODTPRDO  to  IC-DCODTCODO
301115         move  11111111     to  W-DATAPIU7
           else
               move  99999999     to  W-DATAPIU7
      *            'Errore calcolo: Data Completamento Domanda assente'
      *                      to  W-CHK-CAMPI
      *          move  'S'  to  W-ERRORE
      *          go  to  L11-X-DTCODO-EX
261115     end-if.
       L11-X-DTCODO-EX.
           EXIT.
      *------------------------------ Controllo SCUP x IBAN          *
270321 L11S-SCUP-X-IBAN.
      *****                           BLC2-IBAN = pic x(40)          *
           initialize  BLC2-INPUT
                       BLC2-INPUT2
                       BLC2-OUTPUT.
      ***** move  W-COORDINATE    to  BLC2-IBAN.
280922     IF H-DCOIBAN = 'EEEE'
280922       move  W-IBEIBAEST     to  BLC2-IBAN
280922     ELSE
             move  IC-DCOCOIBAN    to  BLC2-IBAN
280922     END-IF.

      ***** AG020 x DISCOLL  &  AG021 x Antic.NASPI
           move  'AG019'         to  BLC2-TIPO.
           move  'S'             to  BLC2-CRITERIO.
           move  'S'             to  BLC2-WRITE.
           call  PNBTBLC2
                   using  PNLKBLC2
           end-call.
      *    cancel  PNBTBLC2.
      *
           if  BLC2-IBAN-STATO  =  'NF'
           then  continue
           else move
               'Coordinate IBAN non utilizzabili: verifica in SCUP'
                           to  W-CHK-CAMPI
                move  'S'  to  W-ERRORE
      *         go  to  L11S-EX
           end-if.
       L11S-EX.
270321     EXIT.
      *
       L13-PAGAMENTI.
      *-------------------------------->  INCENTIVO GIOVANI          *
           if L-PROCEDURA                   =  'G97'
110517*                                  OR =  'G96'
               move 'N'      to WL-PAGAMENTI
               go to L13-EX
           end-if.
           move H-DCOCHIDOM  to H-PMECHIDOM .
           perform L13-DB2-SELECT thru L13-DB2-SELECT-EX.
      *---------------(Verifica scelte)-------- Già in pagamento?
           if  W-PAGARE  =  'S'
           then
               if  WL-PAGAMENTI  =  'N'
               then
                   move  'N'  to  W-SCELTA
                   go  to  L13-EX
               end-if
           end-if.
      *---------------------------------------- I liquidazioni ?
           if  W-PAGARE  =  'P'
           then
               if  WL-PAGAMENTI  =  'S'
               then
                   move  'N'  to  W-SCELTA
                   go  to  L13-EX
               end-if
           end-if.
      *---------------------------------------- Tutte le domande
      *    if  W-PAGARE  =  'T'
      *    then
      *        continue
      *    end-if.
           if  WL-PAGAMENTI  =  'S'
           then
               perform  L14-CHK-PAGAMENTI   thru  L14-EX
090218         perform  L15-SCARTARE        thru  L15-EX
           end-if.
      *GGA TOLTA UPDATE---------- Valida sempre o per lista controllo?
       L13-EX.
           EXIT.
      *
       L14-CHK-PAGAMENTI.
      *--------------------------------> Data ultima elaborazione    *
           if H-PMEDTELAB                   is  numeric
           then
               move  H-PMEDTELAB  to  IC-PMEDTELAB
           else
               move
                   'valore di PMEDTELAB /ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *--------------------------------> Controllo correlato in E25- *
041217     if  L-TIPOCALCOLO  =  'R'            and
               W8-ODIERNA     =  IC-PMEDTELAB   and
               (L-PROCEDURA   =  'G19'  or
                              =  'G20')

           then
               move
                   'Oggi non è possibile pagare la domanda.           '
                          to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
041217     end-if.
      *--------------------------------> Totale trattenute sindacali *
           if H-PMETOTRSIE                  is  numeric
           then
               move  H-PMETOTRSIE to  IC-PMETOTRSIE
           else
               move
                   'valore di PMETOTRSIE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultima trattenuta sindacale*
           if H-PMEUITRSIE                  is  numeric
           then
               move  H-PMEUITRSIE to  IC-PMEUITRSIE
           else
               move
                   'valore di PMEUITRSIE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultima ordinaria non corris*
060721*    utilizzato per memorizzare importo totale "decalage" NASPI
           if H-PMEUONNCOE                  is  numeric
           then
               move  H-PMEUONNCOE to  IC-PMEUONNCOE
           else
               move
                   'valore di PMEUONNCOE/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
060721     if H-PMEUONNCOE      >  0
           then
               if (W-CODICEUNO  =   35)
               then  continue
               else
                   move
                   'valore di PMEUONNCOE/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
                   go  to  L14-EX
               end-if
060721     end-if.
      *-------------------------------->  Stato pagamento            *
           move  H-PMESTAPAG                 to  IC-PMESTAPAG.
      *--------------------------------> Data riferimento ultimo calcol
           if H-PMEDTRICA                   is  numeric
           then
               move  H-PMEDTRICA  to  IC-PMEDTRICA
           else
               move
                   'valore di PMEDTRICA /ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
           if  W-ANFDIRETTI  =  'S'
      *n    or W-FRONTALIERI =  'S'
           then
               perform  L141-PMEDTRICA-1  thru  L141-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L14-EX
               end-if
           end-if.
      *-------------------------------->  Indennità totale           *
           if H-PMEINDTOTE                  is  numeric
           then
               move  H-PMEINDTOTE to  IC-PMEINDTOTE
           else
               move
                   'valore di PMEINDTOTE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
261115     if  W-DATAPIU7  =  99999999
           then
               if  IC-PMEINDTOTE  >  zeros
               then
      *            move  IC-DCODTPRDO  to  IC-DCODTCODO
301115             move  11111111      to  W-DATAPIU7
      *        else
      *            move
      *            'Errore calcolo: Data Completamento Domanda assente'
      *                      to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  L14-EX
               end-if
261115     end-if.
      *------------------- Anomalia ingestibile per domande migrate  *
      *------------------- come respinte e poi accolte (v.discordant)*
      *    if H-DCORECNUO   =                  'N'   and
      *        PMEINDTOTE                   =  0
      *    then
      *        if H-PMEINDTOTL                  =  0
      *        then
      *            move  'N'      to  W-PMEIND
      *        else
      *            move
      *            'valore di PMEINDTOTE/PMEINDTOTL  discordante.     '
      *                      to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  L14-EX
      *        end-if
      *    end-if.
      *    if H-DCORECNUO   =                  'N'   and
      *        H-PMEINDTOTE                 >  0
      *    then
      *        if H-PMEINDTOTL >  0
      *        then
      *            move  'S'      to  W-PMEIND
      *        else
      *            move
      *            'valore di PMEINDTOTE/PMEINDTOTL discordante.    '
      *                      to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  L14-EX
      *        end-if
      *    end-if.
      *-------------------------------->  Ultima indennità           *
           if H-PMEINDUIME                  is  numeric
           then
               move  H-PMEINDUIME to  IC-PMEINDUIME
           else
               move
                   'valore di PMEINDUIME/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *    if H-DCORECNUO   =                  'N'
      *    then
      *        if (H-PMEINDUIME                 =  0   and
      *            H-PMEINDUIML                 =  0)   or
      *           (H-PMEINDUIME                 >  0   and
      *            H-PMEINDUIML                 >  0)
      *        then
      *            continue
      *        else
      *            move
      *            'valore di PMEINDUIME/PMEINDUIML  discordante.     '
      *                      to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  L14-EX
      *        end-if
      *    end-if.
      *-------------------------------->  ANF Totale                 *
           if H-PMEANFTOTE                  is  numeric
           then
               move  H-PMEANFTOTE to  IC-PMEANFTOTE
           else
               move
                   'valore di PMEANFTOTE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *    if H-DCORECNUO   =                  'N'
      *    then
      *        if (H-PMEANFTOTE                 =  0   and
      *            H-PMEANFTOTL                 =  0)   or
      *           (H-PMEANFTOTE                 >  0   and
      *            H-PMEANFTOTL                 >  0)
      *        then
      *            continue
      *        else
      *            move
      *            'valore di PMEANFTOTE/PMEANFTOTL  discordante.     '
      *                      to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  L14-EX
      *        end-if
      *    end-if.
      *-------------------------------->  Ultimo importo ANF         *
           if H-PMEANFUIME                  is  numeric
           then
               move  H-PMEANFUIME to  IC-PMEANFUIME
           else
               move
                   'valore di PMEANFUIME/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Indennità: totale giornate *
           if H-PMEINDTOGG                  is  numeric
           then
               move  H-PMEINDTOGG to  IC-PMEINDTOGG
           else
               move
                   'valore di PMEINDTOGG/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  ANF: Totale giornate       *
           if H-PMEANFTOGG                  is  numeric
           then
               move  H-PMEANFTOGG to  IC-PMEANFTOGG
           else
               move
                   'valore di PMEANFTOGG/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ordinaria: totale lire     *
      *--- utilizzato per importo 30 gg in più del DL 35/2005  (*100)*
      *n   if H-PMEORDTOTL                  is  numeric
           if H-PMEORDTOTL       =  0
           then
               move  H-PMEORDTOTL to  IC-PMEORDTOTL
           else
               move
                   'valore di PMEORDTOTL/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ordinaria: totale euro     *
           if H-PMEORDTOTE                  is  numeric
           then
               move  H-PMEORDTOTE to  IC-PMEORDTOTE
           else
               move
                   'valore di PMEORDTOTE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ordinaria: ult.imp. lire   *
      *--- utilizzato per imp. del 10%  in più del DL 35/2005  (*100)*
      *n   if H-PMEORDUIML                  is  numeric
           if H-PMEORDUIML       =  0
           then
               move  H-PMEORDUIML to  IC-PMEORDUIML
           else
               move
                   'valore di PMEORDUIML/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ordinaria: ultimo importo  *
           if H-PMEORDUIME                  is  numeric
           then
               move  H-PMEORDUIME to  IC-PMEORDUIME
           else
               move
                   'valore di PMEORDUIME/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ordinaria: totale giornate *
           if H-PMEORDTOGG                  is  numeric
           then
               move  H-PMEORDTOGG to  IC-PMEORDTOGG
           else
               move
                   'valore di PMEORDTOGG/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Speciale : totale importo  *
      *n   if H-PMESPETOTE                  is  numeric
           if H-PMESPETOTE       =  0
           then
               move  H-PMESPETOTE to  IC-PMESPETOTE
           else
               move
                   'valore di PMESPETOTE/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Speciale : ultimo importo  *
      *n   if H-PMESPEUIME                  is  numeric
           if H-PMESPEUIME       =  0
           then
               move  H-PMESPEUIME to  IC-PMESPEUIME
           else
               move
                   'valore di PMESPEUIME/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Speciale : totale giornate *
      *n   if H-PMESPETOGG                  is  numeric
           if H-PMESPETOGG       =  0
           then
               move  H-PMESPETOGG to  IC-PMESPETOGG
           else
               move
                   'valore di PMESPETOGG/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Indennità: natalizia       *
      *n   if H-PMEIMINNAE                  is  numeric
           if H-PMEIMINNAE       =  0
           then
               move  H-PMEIMINNAE to  IC-PMEIMINNAE
           else
               move
                   'valore di PMEIMINNAE/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  A.N.F.   : natalizia       *
      *n   if H-PMEIMIANFE                  is  numeric
           if H-PMEIMIANFE       =  0
           then
               move  H-PMEIMIANFE to  IC-PMEIMIANFE
           else
               move
                   'valore di PMEIMIANFE/ADSPAGME non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Importo ultimo assegno     *
           if H-PMEIMULASE                  is  numeric
           then
               move  H-PMEIMULASE to  IC-PMEIMULASE
           else
               move
                   'valore di PMEIMULASE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultimo periodo DAL (SSAAMMGG)
           if H-PMEULPEDAL                  is  numeric
           then
               move   H-PMEULPEDAL to IC-PMEULPEDAL
           else
               move
                   'valore di PMEULPEDAL/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultimo periodo AL  (SSAAMMGG)
           if H-PMEULPEAL                   is  numeric
           then
               move  H-PMEULPEAL  to  IC-PMEULPEAL
           else
               move
                   'valore di PMEULPEAL /ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultimo periodo: giornate   *
           if H-PMEULPEGG                   is  numeric
           then
               move  H-PMEULPEGG  to  IC-PMEULPEGG
           else
               move
                   'valore di PMEULPEGG /ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Conguaglio fiscale    AP   *
           if H-PMECONFISE                  is  numeric
           then
               move  H-PMECONFISE to  IC-PMECONFISE
           else
               move
                   'valore di PMECONFISE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Addizionale comunale  AP   *
           if H-PMEADDCOME                  is  numeric
           then
               move  H-PMEADDCOME to  IC-PMEADDCOME
           else
               move
                   'valore di PMEADDCOME/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Addizionale regionale AP   *
           if H-PMEADDREGE                  is  numeric
           then
               move  H-PMEADDREGE to  IC-PMEADDREGE
           else
               move
                   'valore di PMEADDREGE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultima IRPEF netta AP      *
           if H-PMEULIRNSE                  is  numeric
           then
               move  H-PMEULIRNSE to  IC-PMEULIRNSE
           else
               move
                   'valore di PMEULIRNSE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Ultima IRPEF netta AC      *
           if H-PMEULIRN1E                  is  numeric
           then
               move  H-PMEULIRN1E to  IC-PMEULIRN1E
           else
               move
                   'valore di PMEULIRN1E/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Totale IRPEF netta AP      *
           if H-PMETOIRNPE                  is  numeric
           then
               move  H-PMETOIRNPE to  IC-PMETOIRNPE
           else
               move
                   'valore di PMETOIRNPE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Totale IRPEF netta AC
           if H-PMETOIRNCE                  is  numeric
           then
               move  H-PMETOIRNCE to  IC-PMETOIRNCE
           else
               move
                   'valore di PMETOIRNCE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Interessi legali Indennità *
           if H-PMEINLEPRE                  is  numeric
           then
               move  H-PMEINLEPRE to  IC-PMEINLEPRE
           else
               move
                   'valore di PMEINLEPRE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Interessi legali ANF       *
           if H-PMEINLEANE                  is  numeric
           then
               move  H-PMEINLEANE to  IC-PMEINLEANE
           else
               move
                   'valore di PMEINLEANE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Recupero 730               *
           if H-PMER730UIM                  is  numeric
           then
               move  H-PMER730UIM to  IC-PME730UIME
           else
               move
                   'valore di PMER730UIM/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Rec. tot. att. autonoma    *
           if H-PMEAUTTOTE                  is  numeric
           then
               move  H-PMEAUTTOTE to  IC-PMEAUTTOTE
           else
               move
                   'valore di PMEAUTTOTE/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Rec.tot.gg att.autonoma    *
           if H-PMEAUTTOGG                  is  numeric
           then
               move  H-PMEAUTTOGG to  IC-PMEAUTTOGG
           else
               move
                   'valore di PMEAUTTOGG/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Rec. ult. att. autonoma    *
           if H-PMEAUTUIME                  is  numeric
           then
               move  H-PMEAUTUIME to  IC-PMEAUTUIME
           else
               move
                   'valore di PMEAUTUIME/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *-------------------------------->  Rec.ult.gg att.autonoma    *
           if H-PMEULAUTGG                  is  numeric
           then
               move  H-PMEULAUTGG to  IC-PMEULAUTGG
           else
               move
                   'valore di PMEULAUTGG/ADSPAGME non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L14-EX
           end-if.
      *---------------------------- Verifica presenza dati           *
           if H-PMEDTRICA                   >  zeroes   or
               H-PMEINDTOTE                 >  zeroes   or
               H-PMEANFTOTE                 >  zeroes   or
               H-PMEULPEDAL                 >  zeroes
           then
               move 'S'    to  W-DATI-PAGME
           end-if.
       L14-EX.
           EXIT.
      *
       L141-PMEDTRICA-1.
           if  IC-PMEDTRICA  >  zeroes
           then
               continue
           else
               move
                   'data riferimento ultimo pagamento non presente.   '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L141-EX
           end-if.
      *--------------------------- Sottraggo un giorno a IC-PMEDTRICA*
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  IC-PMEDTRICA     to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-F.
           move     1             to  R10-GIORNI.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-I  to  D6-GGMMAA
               move  W6-GG       to  W8-GG
               move  W6-MM       to  W8-MM
               move  W6-AA       to  W8-AAAA
               add   2000        to  W8-AAAA
               if  W8-AAAAMMGG  >  W8-ODIERNA
               then
                   subtract  100  from  W8-AAAA
               end-if
               move  W8-AAAAMMGG  to  IC-PMEDTRICA
           else
               move
                   'valore di IC-PMEDTRICA non calcolato correttamente'
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L141-EX
           end-if.
       L141-EX.
           EXIT.
      *
090218 L15-SCARTARE.
      *----------------------------- Calcolo singolo
           if  TIPO-ELABO-IN  =  3
           then  go  to  L15-EX
           end-if.
      *----------------------------- Calcolo ANF diretto
           if  W-ANFDIRETTI   =  'S'
           then  go  to  L15-EX
           end-if.
      *----------------------------- Tipo prestazione
           if  L-PROCEDURA    =  'G19'
                          or  =  'G20'
      *                   or  =  'G21'
           then  continue
           else  go  to  L15-EX
           end-if.
      *----------------------------- Calcolo effettivo
           if  L-TIPOCALCOLO  =  'R'
           then
280218*--------effettivo:   Calcolo singolo
               if  TIPO-ELABO-IN  =  2
                   and  NUMERO-DAL-IN1  =  NUMERO-AL-IN1
                   and  ANNO-DAL-IN1    =  ANNO-AL-IN1
                   and  ANNO-DAL-IN2    =  zeros
                   and  ANNO-DAL-IN3    =  zeros
                   and  ANNO-DAL-IN4    =  zeros
                   and  ANNO-DAL-IN5    =  zeros
                   and  ANNO-DAL-IN6    =  zeros
               then  go  to  L15-EX
280218         end-if
      *--------effettivo:  data odierna(AAAAMM) > data ult. PP(AAAAMM)
               if  W8-ODIERNA(1:6)  >  IC-DCODTULPP(1:6)
               then  go  to  L15-EX
               end-if
      *--------effettivo:  stesso mese, solo se domanda variata
               if  W8-ODIERNA(1:6)  =  IC-DCODTULPP(1:6)
               then
                   if  IC-DCODTULPP   =  IC-PMEDTELAB
                   then  continue
                   else  go  to  L15-EX
                   end-if
               end-if
           end-if.
      *----------------------------- Calcolo simulato
           if  L-TIPOCALCOLO  =  'S'
           then
      *--------simulazione data fine calcolo > odierna
280218*        if  W-CALCOLO-AL     >  W8-ODIERNA
               if  KATA-ELABO-IN   >=  W8-ODIERNA
               then  go  to  L15-EX
               end-if
      *--------simulazione data odierna(AAAAMM) > data ult. PP(AAAAMM)
               if  W8-ODIERNA(1:6)  >  IC-DCODTULPP(1:6)
               then  go  to  L15-EX
               end-if
      *--------simulazione stesso mese, solo se domanda variata
               if  W8-ODIERNA(1:6)  =  IC-DCODTULPP(1:6)
               then
                   if  IC-DCODTULPP   =  IC-PMEDTELAB
                   then  continue
                   else  go  to  L15-ex
                   end-if
               end-if
           end-if.
      *
           move
               'DOMANDA SCARTATA - SEZIONE L15                    '
                         to  W-CHK-CAMPI.
           move  'S'  to  W-ERRORE.
      *    go  to  L15-EX.
090218 L15-EX.
           EXIT.
      *
       L16-RECUPERI.
      *
           move  'L16-RECUPERI' to  WABNDB-LABEL.
      *
           move  H-DCOCHIDOM to  H-RECCHIDOM  .
           move  zeros       to  H-RECPROREC  .
      *
      *----------rivedere ------------->  ANTICIPAZIONE ASPI MINIASPI*
           if L-PROCEDURA                   =  'G21' OR
                                            =  'G98' OR
                                            =  'G97' OR
                                            =  'G96' OR
                                            =  'G99'
      *                                     =  'Gnn'
              go to L16-EX
           end-if.

           perform  L16-DB2-DECL-CURS  thru  L16-DB2-DECL-CURS-EX.
      *
           move  zeros  to  NDC2.
           perform  varying  NDC1  from  1  by  1
                      until  NDC1  >  99
      *
           perform  L16-DB2-FETCH  thru  L16-DB2-FETCH-EX
           if  SQLCODE =  0
           then
               move  'S'  to  WL-RECUPERI
               perform  L17-CHKFLD-RECUPERI  thru  L17-EX
               if  W-ERRORE  =  'N'
               then
                   perform  L18-SOMMA-RECUPERI  thru  L18-EX
               else
                   perform  RECUPERI-DB2-CLSCUR  thru
                            RECUPERI-DB2-CLSCUR-EX
                   move  111    to  NDC1
               end-if
           else
               perform  RECUPERI-DB2-CLSCUR  thru
               RECUPERI-DB2-CLSCUR-EX
               move  111    to  NDC1
           end-if
      *
           end-perform.
      *GGA TOLTA UPDATE---------- Valida sempre o per lista controllo?
       L16-EX.
           EXIT.
      *
       L17-CHKFLD-RECUPERI.
      *-------------------------------->  Totale recupero da effettua*
           if  H-RECTOREEE                  is  not  numeric
           then
               move
                   'valore di RECTOREEE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Totale recupero residuo    *
           if H-RECTORERE                   is  not  numeric
           then
               move
                   'valore di RECTORERE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
130616     if  H-RECTORERE                  <  zeroes
           then
               move
                   'importo residuo recupero negativo; non gestibile. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
130616     end-if.
      *    if H-RECTORERE                   >  69999.00  and
      *       H-RECTORERE                   <  88888.00
           if  H-RECTORERE                  >  H-RECTOREEE
           then
               move
                   'Errore nei recuperi: residuo maggiore del totale. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
           if  H-RECTORERE                 =  zeroes
           then
               go  to  L17-EX
           end-if.
      *-------------------------------->  Conto (parte alfabetica)   *
           if  H-RECCOREAL                  =  spaces
           then
               move
                   'parte alfabetica del recupero non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Conto (parte numerica)     *
           if H-RECCORENU                   is  not  numeric
           then
               move
                   'parte numerica del recupero non corretta.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Controllo validità conto   *
           move  spaces                      to  W-CONTOALFA.
           move  zeroes                      to  W-CONTONUME.
           initialize  PER-RDSCONT.
           move H-RECCOREAL                  to  W-CONTOALFA.
           move H-RECCORENU                  to  W-CONTONUME.
      *
           move  W-CONTOREC  to  Q-CONTO.
           call  RDSCONT using
                    WDFHEIBLK  WDFHCOMMAREA
                    PER-RDSCONT
           end-call.
           cancel  RDSCONT .
      *
           if  Q-RETCODE  =  00
           then
               continue
           else
               if  Q-RETCODE  =  99
               then
                   move  Q-MSG  to  W-CHK-CAMPI
               else
                   move
                   'Valore di Conto Recupero non previsto o errato.   '
                                to  W-CHK-CAMPI
               end-if
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Importo rata               *
           if  H-RECIMPRAE                is  not  numeric
           then
               move
                   'valore di RECIMPRAE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Causale recupero           *
      *    if H-RECCAUREC                   =  spaces
280318     if  H-RECCAUREC  =  '1'  or
                            =  '2'  or
                            =  '3'
280318     then  continue
           else  move
                   'causale del recupero non gestita.                 '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Tipo    recupero           *
280318*    if H-RECTIPREC                  =  spaces
           if  H-RECTIPREC   =  'R'   or
                             =  'A'
           then  continue
280318     else  move
                   'tipo del recupero non gestito.                    '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
270114*-------------------------------->  Memorizzo x pag.a terzi    *
           if  H-RECCAUREC  =  '1'   and
               W-CONTOREC   =  'GPA10099'
           then
               move  H-RECTORERE  to  W-IMP-GPA10099
270114     end-if.
      *-------------------------------->  Importo ultimo recupero    *
           if  H-RECIMUREE                  is  not  numeric
           then
               move
                   'valore di RECIMUREE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
130616     if  H-RECIMUREE                  <  zeroes
           then
               move
                   'importo ultimo  recupero negativo; non gestibile. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
130616     end-if.
070818     if  (H-RECTORERE  +  H-RECIMUREE)  >  H-RECTOREEE
           then
               move
                   'Errore nei recuperi: residuo maggiore del dovuto. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
070818     end-if.
      *-------------------------------->  Numero rate                *
           if  H-RECNUMRAT                  is  not  numeric
           then
               move
                   'valore di RECNUMRAT /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Tassazione Si / No         *
280318*    if  H-RECCAUREC                  =  '2'
      *    then
      *        go  to  L17-EX
      *    end-if.
      *    if  H-RECIIRPEF                   =  spaces
           if  H-RECIIRPEF    =  'S'   or
                              =  'N'
           then  continue
280318     else  move
                   'applicazione IRPEF su recupero non contemplata.   '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *
280318     if  H-RECTIPREC    =  'R'   and
               H-RECIIRPEF    =  'S'
           then  move
                   'applicazione IRPEF su recupero non prevista.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
280318     end-if.
       L17-EX.
           EXIT.
      *
       L18-SOMMA-RECUPERI.
      *--------------------------------------- già recuperato su     *
      *    if H-RECTORERE                 >  69999.00
           if H-RECTORERE                 =  zeroes
           then
               go  to  L18-EX
           end-if.
           evaluate H-RECCAUREC
      *----------------------------------------- Prestazione (recupero)
             when  '1'
               if H-RECTORERE                 >  zeros
               then
                   if H-RECIIRPEF                 =  'N'
                   then
                       add  H-RECTOREEE     to  IC-RECTOREEE-1
                       add  H-RECTORERE     to  IC-RECTORERE-1
                       add  H-RECIMUREE     to  IC-RECIMUREE-1
                   end-if
      *----------------------------------------- Prestazione (acconto)
                   if H-RECIIRPEF                 =  'S'
                   then
                       add  H-RECTOREEE     to  IC-RECTOREEE-3
                       add  H-RECTORERE     to  IC-RECTORERE-3
                       add  H-RECIMUREE     to  IC-RECIMUREE-3
                   end-if
               end-if
      **       *--------------------- Anf (recup/acconto)
             when  '2'
               if H-RECTORERE                 >  zeros
               then
                   add  H-RECTOREEE     to  IC-RECTOREEE-2
                   add  H-RECTORERE     to  IC-RECTORERE-2
                   add  H-RECIMUREE     to  IC-RECIMUREE-2
               end-if
             when  other
               move  111    to  NDC1
               move  'S'    to  W-ERRORE
           end-evaluate.
       L18-EX.
           EXIT.
      *
       L19-SITUAZIODO.
      *
           move H-DCOCHIDOM  to H-STDCHIDOM .
      *
           perform  L19-DB2-SELECT  thru  L19-DB2-SELECT-EX.
           if  SQLCODE  =  zeros
           then
               move  'S'    to  WL-SITUAZIODO
           else
               move
                   'errore in lettura di ADSSITDO.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'    to  W-ERRORE
               go  to  L19-EX
           end-if.
      *-----rivedere ------------------>  ANTICIPAZIONE NASPI        *
           if L-PROCEDURA                   =  'G21' OR
                                            =  'G98' OR
                                            =  'G97' OR
                                            =  'G96' OR
                                            =  'G99'
      *                                     =  'Gnn'
              move 'L'                       to  H-STDESITPRU
           end-if.
      *-------------------------------->  Codice prima   prestazione *
           if H-STDCOTIPRU      =  35   or  36
                                or 37
           then
               move H-STDCOTIPRU   to  IC-STDCOTIPRU
           else
               move
                   'codice esito prestazione 1 non valido.            '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L19-EX
           end-if.
           if  H-STDCOTIPRU  =  W-CODICEUNO
           then
               continue
           else
               move
                   'esito prestazione 1 non correlato al  tipo domanda'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L19-EX
           end-if.
      *-------------------------------->  Codice seconda prestazione *
           if H-STDCOTIPRD                   =  zeros
      *n                                 or  =  22   or  24
           then
               move H-STDCOTIPRD         to  IC-STDCOTIPRD
           else
               move
                   'codice esito prestazione 2 non valido.            '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L19-EX
           end-if.
      *n   if H-STDCOTIPRD                   =  W-CODICEDUE
      *n   then
      *n       continue
      *n   else
      *n       move
      *n           'valore di STDCOTIPRD/ADSSITDO non del tipo domanda'
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L19-EX
      *n   end-if.
      *-------------------------------->  Data movim. II prestazione *
      *    if H-STDDTMOPRD                   is  numeric
      *    then
      *        move H-STDDTMOPRD                   to  IC-STDDTMOPRD
      *    else
      *        move
      *            'valore di STDDTMOPRD/ADSSITDO non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L19-EX
      *    end-if.
      *-------------------------------->  Esito       II prestazione *
      *    if H-STDESITPRD                   not  equal  spaces
      *    then
      *        move H-STDESITPRD                   to  IC-STDESITPRD
      *    else
      *        move
      *            'valore di STDESITPRD/ADSSITDO non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L19-EX
      *    end-if.
           if  (W-ANFDIRETTI  equal  'S')
      *n    or (W-FRONTALIERI equal  'S')
           then
               if  (H-STDESITPRU        not  equal  'A'   or
                    H-STDESITPRU        not  equal  'C'   or
                    H-STDESITPRU        not  equal  'L'   or
                    H-STDESITPRU        not  equal  'E'   or
                    H-STDESITPRU        not  equal  'I'   or
                    H-STDESITPRU        not  equal  'P')
                                         and
                   (H-STDESITPRD        not  equal  'A'   or
                    H-STDESITPRD        not  equal  'C'   or
                    H-STDESITPRD        not  equal  'L'   or
                    H-STDESITPRD        not  equal  'E'   or
                    H-STDESITPRD        not  equal  'I'   or
                    H-STDESITPRD        not  equal  'P')
               then
                   continue
               else
                   move
                   'valore di STD-ESITO /ADSSITDO non valido.         '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L19-EX
               end-if
           else
               if  (H-STDESITPRU                equal  'L')
      *n        or  H-STDESITPRD                equal  'L')
               then
                   continue
               else
                   move
                   'valore di STD-ESITO /ADSSITDO non valido.         '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L19-EX
               end-if
           end-if.
      *GGA TOLTA UPDATE---------- Valida sempre o per lista controllo?
       L19-EX.
           EXIT.
      *
       L22-ANAGRAFICI.
           move  H-DCOCODFIS  to  H-DANCODFIS.
           perform  L22-DB2-SELECT  thru  L22-DB2-SELECT-EX.
           if  SQLCODE  =  0
           then  continue
           else
               move
                   'errore in lettura di ADSDATAN.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
      *
      *------------------------------------- Codice comune residenza *
           if H-DANCCORE  is  numeric
           then
               if H-DANCCORE  >   zeros
               then
                   move H-DANCCORE             to  IC-DANCCORE
               else
                   move
                   'codice comune di residenza non presente.          '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L22-EX
               end-if
           else
               move
               'codice comune di residenza non valido.            '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
      *-------------------Xmappa ----------- Comune residenza        *
           if H-DANCOCORE                    =  spaces
           then
               move
                   'denominazione comune residenza non presente.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
           move H-DANCOCORE                    to  WIC-DANCOCORE.
      *------------------------------------- Provincia residenza
           if H-DANSIPRRE                    =  spaces
           then
               move
                   'sigla provincia di residenza  non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
           move H-DANSIPRRE                    to  WIC-DANSIPRRE.
      *------------------------------------- Indirizzo residenza
           if H-DANIND                       =  spaces
           then
               move
                   'indirizzo di residenza non presente.              '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
           move H-DANIND                       to  WIC-DANIND.
      *------------------------------------- C.A.P.
           if H-DANCAP                 is  numeric   and
              H-DANCAP                 >   zeroes
           then
               move H-DANCAP                   to  WIC-DANCAP
           else
               move
                   'codice avviamento postale residenza non valido.   '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
       L22-EX.
           EXIT.
      *
       L25-DELEGHE.
      *    move  zeros        to  W-FINESINDACATO
      *                           I-DEL.
           move  H-DCOCHIDOM  to  H-DSICHIDOM.
      *    move  zeros        to  H-DSIDTINIS .
      *
           perform  L25-DB2-DECL-CURS    thru  L25-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                         until  NDC1  >  99
      *
           perform  L25-DB2-FETCH    thru  L25-DB2-FETCH-EX
           if   SQLCODE = 0
           then
                perform  L26-CHKFLD-DELEGHE   thru  L26-EX
                if  W-ERRORE   =  'N'
                then
                    perform  L27-CARICA-DELEGHE   thru  L27-EX
                else
                    perform  DELEGHE-DB2-CLSCUR
                       thru  DELEGHE-DB2-CLSCUR-EX
                    move  111   to  NDC1
                end-if
           else
                 perform
                 DELEGHE-DB2-CLSCUR  thru  DELEGHE-DB2-CLSCUR-EX
                 move  111    to  NDC1
           END-IF
           end-perform.
       L25-EX.
           EXIT.
      *
       L26-CHKFLD-DELEGHE.
      *------------------------------------- Data fine   delega      *
           if H-DSIDTFIIS                 is  not  numeric
           then
               move
                   'valore di DSIDTFIIS /ADSDELSI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L26-EX
           end-if.
      *------------------------------------- Codice sindacato        *
           if H-DSICODSIN                 =  spaces
           then
               move
      *            'valore di DSICODSIN /ADSDELSI non presente.       '
050315            'Delega Sindacale errata: variare/cancellare dati. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L26-EX
           end-if.
      *------------------------------------- Categoria sindacato     *
           if H-DSICATSIN                 =  spaces
           then
               move
      *            'valore di DSICATSIN /ADSDELSI non presente.       '
050315             'Delega Sindacale errata: variare/cancellare dati. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L26-EX
           end-if.
       L26-EX.
           EXIT.
      *
       L27-CARICA-DELEGHE.
      *------------------------------------- Verifica convenzione    *
           initialize  PER-RDSUT27.
           move  spaces         to  LK-RETCODE.
           move  H-DSICODSIN    to  LK-CODSIN.
           move  H-DSICATSIN    to  LK-CATSIN.
           call   RDSUT27 USING
                      WDFHEIBLK  WDFHCOMMAREA
                      PER-RDSUT27
           end-call.
           cancel   RDSUT27 .
           if  LK-RETCODE  =  'OK'
           then
               continue
           else
               go  to  L27-EX
           end-if.
      *
           if H-DSIDTFIIS =  zeros
           then
               if  (H-DSICATSIN               =  '00')   or
                   (H-DSICODSIN               =  '00')
               then
                   continue
               else
                   move H-DSICODSIN                to  IC-DSICODSIN
                   move H-DSICATSIN                to  IC-DSICATSIN
                   move  111   to  NDC1
                   perform DELEGHE-DB2-CLSCUR
                      THRU DELEGHE-DB2-CLSCUR-EX
               end-if
           end-if.
       L27-EX.
           EXIT.
      *
       L28-DATIANF.
      *-------------------------------- new dal 9/6/2005             *
290816     if  H-DCOANFRIC  =  'T'
           then  go  to  L28-EX
290816     end-if.
050916     move  spaces      to  W-ANF-DA062015.
           move  zeros       to  BAK-PMEANFTOTE
050916                           BAK-PMEANFTOGG.
      *
150916     move  zeros       to  W-ANNOINIZANF
                                 W-ANNOFINEANF.
           move  W-DECORRENZA(1:4)
                             to  W-ANNOINIZANF.
           if  W-DECORRENZA(5:2)  >  6
           then  subtract  1  from  W-ANNOINIZANF
           else  subtract  2  from  W-ANNOINIZANF
150916     end-if.
      *
           move  zeros       to  NDC1
                                 I-ANF.
           move H-DCOCHIDOM  to H-ANFCHIDOM.
           move H-DCOCODFIS  to H-ANFCODFIS.
      *
           perform  L28-DB2-DECL-CURS  thru  L28-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                      until  NDC1  >  99
      *
             perform  L28-DB2-FETCH    thru  L28-DB2-FETCH-EX
             if  SQLCODE  =  0
             then
      *n         move 'S'            to  WL-TABPIENA
                 perform  L29-CHKFLD-DATIANF  thru  L29-EX
                 if  W-ERRORE   =  'N'
                 then
                     move 'S'        to  WL-TABPIENA
                     perform  L30-CARICOANF   thru  L30-EX
                 else
                     perform DATIANF-DB2-CLSCUR thru
                             DATIANF-DB2-CLSCUR-EX
                     move  111    to  NDC1
                 end-if
             else
                 perform  DATIANF-DB2-CLSCUR  thru
                          DATIANF-DB2-CLSCUR-EX
                 move  111    to  NDC1
             end-if
           end-perform.
      *
           if  WL-TABPIENA = 'N'
           then
               if  H-DCOANFRIC     =  'S'   or
                   H-DCOANFRIC     =  'K'
               then
      *----------------- Invece dell'errore correggo dato ADSDATCO   *
                   move  'N'   to  IC-DCOANFRIC
                                   UPD-ANFRIC
               end-if
           else
               move 'N'            to WL-TABPIENA
           end-if.
      *
050916     if  W8-ODIERNA  <  20160905
           then
               if  W-ANF-DA062015  =  'N'
               then
                   move  IC-PMEANFTOTE  to  BAK-PMEANFTOTE
                   move  IC-PMEANFTOGG  to  BAK-PMEANFTOGG
                   move  'N'            to  IC-DCOANFRIC
                   move  zeros          to  IC-PMEANFTOTE
                   move  zeros          to  IC-PMEANFTOGG
                   initialize   LC-TAB-ANF
                                IC-TAB-ANF
               end-if
050916     end-if.
       L28-EX.
           EXIT.
      *
       L29-CHKFLD-DATIANF.
      *------------------------------------- Data decorrenza validità*
           if H-ANFDTDEVA                 is  not  numeric
           then
               move
                   'valore di ANFDTDEVA /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *
050916     if  IC-DCODTDECPP  <  20160701
           then
               if  W-ANF-DA062015  =  'S'
               then  continue
               else
                   if  (H-ANFDTDEVA  >  20150630   and
                        H-ANFDTDEVA  <  20160701)
                   then  move  'S'  to  W-ANF-DA062015
                   else  move  'N'  to  W-ANF-DA062015
                   end-if
               end-if
050916     end-if.
140916     if  W8-ODIERNA  >  20160905
           then  move  'S'  to  W-ANF-DA062015
140916     end-if.
      *------------------------------------- Componenti nucleo       *
           if H-ANFCONUFA                 is  not  numeric
           then
               move
                   'valore di ANFCONUFA /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Numero figli            *
           if H-ANFNUMFIG                 is  not  numeric
           then
               move
                   'valore di ANFNUMFIG /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Numero figli minori     *
           if H-ANFFIGMIN                 is  not  numeric
           then
               move
                   'valore di ANFFIGMIN /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Tipo nucleo             *
           if H-ANFTIPNUC                 =  spaces
           then
               move
                   'valore di ANFTIPNUC /ADSMODAN non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Reddito familiare       *
           if H-ANFREDFAE                 is  not  numeric
           then
               move
                   'valore di ANFREDFAE /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Anno riferimento reddito*
           if H-ANFANRIRE                 is  not  numeric
           then
               move
                   'valore di ANFANRIRE /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
           if H-ANFANRIRE                 not  >  1987
           then
               move
                   'valore di ANFANRIRE /ADSMODAN non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Numero Tabella ANF      *
      *    if H-ANFTABELLA                is  not  alphabetic
      *    then
      *        move
      *            'valore di ANFTABELLA/ADSMODAN non valido.         '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  NDC1
      *        go  to  L29-EX
      *    end-if.
      *------------------------------------- Importo mensile ANF     *
           if H-ANFIMPMENS                is  not  numeric
           then
               move
                   'valore di ANFIMPMENS/ADSMODAN non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Importo Giorn.  ANF     *
           if H-ANFIMPGIOR                is  not  numeric
           then
               move
                   'valore di ANFIMPGIOR/ADSMODAN non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
       L29-EX.
           EXIT.
      *
       L30-CARICOANF.
150916     if  H-ANFDTDEVA  >  W-CALCOLO-AL
           then  go  to  L30-ex
           end-if.
           if  H-ANFANRIRE  <  W-ANNOINIZANF
           then  go  to  L30-ex
150916     end-if.
221019     if  IC-DCODTADEC >  zeroes
           then
               if  H-ANFDTDEVA  >  IC-DCODTADEC
               then  go  to  L30-ex
               end-if
           end-if.
           if  W-ANFDIRETTI =  'S'
           then
               if  H-ANFDTDEVA  >  IC-PMEDTRICA
               then  go  to  L30-ex
               end-if
221019     end-if.
      *
090320*    ----------------------------- verifica dati inutili    ---*
           if  H-ANFDTDEVA   >  IC-ANFDTDEVA(I-ANF)   and
               H-ANFIMPGIOR  =  IC-ANFIMPGIOR(I-ANF)
           then
               move zeroes               to  A8-AAAAMMGG
               move IC-ANFDTDEVA(I-ANF)  to  A8-AAAAMMGG
      *        move H-ANFDTDEVA          to  A8-AAAAMMGG
               if  A8-MM  >  6
               then  add   1         to  A8-AAAA
               end-if
                 move  01            to  A8-GG
                 move  07            to  A8-MM
               if  H-ANFDTDEVA   <   A8-AAAAMMGG
               then  go  to  L30-ex
               end-if
090320     end-if.
      *
           if  I-ANF  <  20
           then
               add  1  to  I-ANF
      *I-------------------------------- new dal 23/07/2013  --------*
               move H-ANFDTDEVA   to  IC-ANFDTDEVA(I-ANF)
                                      LC-ANFDTDEVA(I-ANF)
               move H-ANFCONUFA   to  IC-ANFCONUFA(I-ANF)
                                      LC-ANFCONUFA(I-ANF)
               move H-ANFNUMFIG   to  IC-ANFNUMFIG(I-ANF)
                                      LC-ANFNUMFIG(I-ANF)
      *n       move H-ANFPREINV   to  IC-ANFPREINV(I-ANF)
               move H-ANFPREINV   to  LC-ANFPREINV(I-ANF)
      *n       move H-ANFTIPINV   to  IC-ANFTIPINV(I-ANF)
               move H-ANFTIPINV   to  LC-ANFTIPINV(I-ANF)
               move H-ANFFIGMIN   to  IC-ANFFIGMIN(I-ANF)
                                      LC-ANFFIGMIN(I-ANF)
               move H-ANFTIPNUC   to  IC-ANFTIPNUC(I-ANF)
                                      LC-ANFTIPNUC(I-ANF)
               if  H-ANFREDFAE    >   zeroes
               then  move H-ANFREDFAE to  IC-ANFREDFAE(I-ANF)
                                          LC-ANFREDFAE(I-ANF)
               else  move  1.9999     to  IC-ANFREDFAE(I-ANF)
                                          LC-ANFREDFAE(I-ANF)
               end-if
               move H-ANFANRIRE   to  IC-ANFANRIRE(I-ANF)
                                      LC-ANFANRIRE(I-ANF)
      *F-------------------------------- new dal 23/07/2013  --------*
               move H-ANFTABELLA  to  IC-ANFTABELLA(I-ANF)
               if  H-ANFREDFAE    >   999111.00
               then  move zeroes      to  IC-ANFIMPMENS(I-ANF)
                                          IC-ANFIMPGIOR(I-ANF)
               else
                   move H-ANFIMPMENS  to  IC-ANFIMPMENS(I-ANF)
                   move H-ANFIMPGIOR  to  IC-ANFIMPGIOR(I-ANF)
               end-if
           else
               move
                   'Stabellamento per elementi ADSMODAN               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
           end-if.
      *
       L30-EX.
           EXIT.
      *
       L281-ANFDIRETTI.
290816     if  H-DCOANFRIC  =  'T'
           then  go  to  L281-EX
290816     end-if.
           move  zeros       to  NDC1.
           move  zeros       to  H-AADPROANF .
           move H-DCOCHIDOM  to  H-AADCHIDOM .
           perform  L281-DB2-DECL-CURS    thru  L281-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                      until  NDC1  >  99
      *
             perform  L281-DB2-FETCH      thru  L281-DB2-FETCH-EX
             if   SQLCODE  =  0
             then
                  move  'S'             to  WL-TABPIENA
                  if  H-AADSTAPAG    =  'K'
                  then
                      move  'S'    to  WL-ANFDIR
                      perform  L291-CHK-ANFDIR  thru  L291-EX
                      if  W-ERRORE   =  'N'
                      then
                          perform L301-FLD-ANFDIR     thru L301-EX
                          perform ANFDIR-DB2-CLSCUR   thru
                                  ANFDIR-DB2-CLSCUR-EX
                          move  111    to  NDC1
                      else
                          perform ANFDIR-DB2-CLSCUR   thru
                                  ANFDIR-DB2-CLSCUR-EX
                          move  111    to  NDC1
                      end-if
                  end-if
             else
                 perform ANFDIR-DB2-CLSCUR   thru
                         ANFDIR-DB2-CLSCUR-EX
                 move  111    to  NDC1
             end-if
           end-perform.
           if  W-ERRORE      =  'S'
           then  go  to  L281-EX
           end-if.
           if  IC-AADSTAPAG  =  'K'
           then
               continue
           else
               move  'S'  to  W-ERRORE
               move
                   'valore    record    /ADSANFDI non previsto '        '
                             to  W-CHK-CAMPI
           end-if.
      *
           if  WL-TABPIENA    = 'N'
           then
      *        move  'S'     to  W-ERRORE
               if  H-DCOANFRIC     =  'K'
               then
                   move  'S'   to  IC-DCOANFRIC
                                   UPD-ANFRIC
               end-if
           else
               move  'N'       to  WL-TABPIENA
           end-if.
      *GGA TOLTA UPDATE---------- Valida sempre o per lista controllo?
       L281-EX.
           exit.
      *
       L291-CHK-ANFDIR.
      *------------------------------------- Data decorrenza validità*
           if H-AADDAL                   is  not  numeric
           then
               move
                   'valore di ANDDAL    /ADSANFDI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L291-EX
           end-if.
      *------------------------------------- Data finale             *
           if H-AADAL                     is  not  numeric
           then
               move
                   'valore di AADAL     /ADSANFDI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L291-EX
           end-if.
      *------------------------------------- Importo da recuperare   *
           if H-AADRECUP                  is  not  numeric
           then
               move
                   'valore di AADRECUP  /ADSANFDI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L291-EX
           end-if.
           if H-AADRECUP  >  zeroes   and
              H-AADRECUP  =  IC-PMEANFTOTE
           then
               move
                   'verifica "Importo da Trattenere" in Pag.dir.ANF   '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L291-EX
           end-if.
      *------------------------------------- Stato del pagamento     *
           if H-AADSTAPAG                 is  not  =  'K'
           then
               move
                   'valore di AADSTAPAG /ADSMODAN non previsto.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L291-EX
           end-if.
300119*-- H-AADMODARR ---------------------- Modalità arrivo         *
      *-----valori attualmete gestiti  :  0  inserita da sede
      *-----                              1  da Contact Center
      *-----                              2  da WS patronato
      *-----                              1  da sportello cittadino
      *-----il valore 9 riservato per consentire pagamento di
      *-----richieste antecedenti novembre 2018 - gestione manuale
300119*------------------------------------- Definita a zero --------*
           if  IC-PMEINDTOTE  =  (IC-PMEINDUIME  *  (-1))
           then
               move
                   'la domanda è definita a zero/totalmente indebita.'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L291-EX
           end-if.
300119*----------------- Gestione domanda potenzialmente  indebita --*
050219*---------- L'indebito delle domande pagate a gennaio 2019   --*
      *---------- per ANFdiretti è stato recuperato/sistemato      --*
      *    if  IC-PMEINDUIME              =  zeros
      *    then
      *        move
      *            'PMEINDUIME=0 - segnalare errore a Masi Nicola     '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  NDC1
      *        go  to  L291-EX
050219*    end-if.
300119*--------------------------------- Gestione domanda indebita --*
           if  IC-PMEINDUIME              <  zeros
           then
               if  H-AADPREDOM            >  20181031   or
                   H-AADMODARR            =  9
               then  continue
               else  move
                   'domanda da verificare: segnalare a Masi Nicola    '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   move  111     to  NDC1
                   go  to  L291-EX
               end-if
300119     end-if.
       L291-EX.
           exit.
      *                                                              *
       L301-FLD-ANFDIR.
           move H-AADDAL      to  IC-AADDAL.
           move H-AADAL       to  IC-AADAL.
           move H-AADRECUP    to  IC-AADRECUP.
           move H-AADSTAPAG   to  IC-AADSTAPAG.
       L301-EX.
           exit.
      *                                                              *
       L31-DSCOMUNI.
      *
           move  H-DCOCHIDOM  to  H-DCDCHIDOM.
           perform  L31-DB2-SELECT  thru  L31-DB2-SELECT-EX.
           if  SQLCODE  =  zeros
           then  continue
           else
               move
                   'errore in lettura di ADSDACOD.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
      *------------------------------------- Codice uff.collocamento *
           if H-DCDCOUFCO                  is  not  numeric
           then
               move
                   'valore di DCDCOUFCO /ADSDACOD non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
           move H-DCDCOUFCO                  to  IC-DCDCOUFCO.
      *------------------------------------- Data cessazione attività*
           if H-DCDDTCALA                  is  not  numeric
           then
               move
                   'valore di DCDDTCALA /ADSDACOD non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
      *------------ Controllo Cessazione * DISCOLL                    *
           if  W-CODICEUNO  =  36
           then
               if  H-DCDDTCALA          >  20141231
090516*            H-DCDDTCALA          <  20160101
      *            H-DCDDTCALA          <  20170101
300517*            H-DCDDTCALA          <  20170701 * dal 09/08/2017
      *        if  H-DCDDTCALA          >  20111231 x test
               then  continue
               else
                   move
090817             'Cessazione attività avvenuta prima del 01/01/2015 '
090817*            'Cessazione attività non avvenuta entro il 30/06/17'
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L31-EX
               end-if
           end-if.
           if  W-CODICEUNO  =  35
           then
               if  H-DCDDTCALA          >  20150430
      *        if  H-DCDDTCALA          >  201nnnnn x test
               then  continue
               else
                   move
                   'Cessazione attività precedenta al 01/05/2015.     '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L31-EX
               end-if
           end-if.
           move H-DCDDTCALA                  to  IC-DCDDTCALA.
      *------------------------------------- Codice motivo cessazione*
           if H-DCDCOMOCE                  is  not  numeric
           then
               move
                   'valore di DCDCOMOCE /ADSDACOD non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
           if H-DCDCOMOCE                  =  zeros
           then
               move
                   'valore di DCDCOMOCE /ADSDACOD non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
           move H-DCDCOMOCE                  to  IC-DCDCOMOCE.
261113     if  H-DCDCOMOCE    =  65   or   68
           then
               move  "S"     to  W-LAVSOSPESO
           else
               move  "N"     to  W-LAVSOSPESO
261113     end-if.
      *------------------------------------- Qualifica prevalente    *
           if H-DCDQUAPRE                  =  spaces
           then
               move
                   'valore di DCDQUAPRE /ADSDACOD non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
      *------------------------------------- Qualifica prevalente    *
           if  H-DCDQUAPRE                  =  'F'
           then
               move 'O'                   to  IC-DCDQUAPRE
           else
               move H-DCDQUAPRE           to  IC-DCDQUAPRE
           end-if.
      *    move H-DCDQUAPRE                  to  IC-DCDQUAPRE.
      *----------------- Stagionali NASPI solo 2015 circ.194-2015    *
      *----------------- Stagionali NASPI del  2016 circ.224-2016    *
      *----------------- v. mail Restaino 30.11.2015                 *
           if  H-DCDQUAPRE  =  'B'
           then
               if  IC-DCDDTCALA  >  20150430   and
      *            IC-DCDDTCALA  <  20160101
110117             IC-DCDDTCALA  <  20170101
               then  continue
               else  move
                   'Qualifica NON valida per data cessazione         '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L31-EX
               end-if
           end-if.
      *------------------------------------- Qualifica x DISCOLL     *
           if  W-CODICEUNO      =  36
           then
               if  H-DCDQUAPRE   =  'C'
100124                       or  =  'U'
               then   continue
               else  move
                   'Qualifica lavoratore non valida per prestazione   '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L31-EX
               end-if
100124         if  H-DCDQUAPRE   =  'U'
               then
                   if  H-DCDDTCALA   >  20170630
                   then  continue
                   else  move
                   'Cessazione attività avvenuta prima del 01/07/2017 '
                                     to  W-CHK-CAMPI
                         move  'S'     to  W-ERRORE
                         go  to  L31-EX
                   end-if
               end-if
100124     end-if.
      *--3.9.13------ Verifica per esclusione lavoratori sospesi    *
271113*--Sospeso pagamento domande lav. sospesi diversi da apprend. *
      *--che sono il 'L' ma senza pagamento precedente              *
281113*--Sospendo tutte tranne Apprendisti                           *
121213*--sbloccare il pagamento di novembre 2013 per tutti i sospesi *
090114*--sbloccare il pagamento di dicembre 2013 per tutti i sospesi *
170114*--sbloccare completamente pagamento  2013 per tutti i sospesi *
           if  W8-ODIERNA  <  20990101
           then   continue
           else
             if  W-LAVSOSPESO   =  'S'
             then
               if  (H-DCDQUAPRE    =  'A')
               then
                 continue
               else
                  move
                 'Domanda non elaborabile: monitoraggio in corso.   '
                               to  W-CHK-CAMPI
                  move  'S'     to  W-ERRORE
                  go  to  L31-EX
               end-if
             end-if
           end-if.
280114*--pagare sospesi con data presentazione domanda < 01/10/2013  *
030314*--pagare sospesi con data presentazione domanda < 03/10/2013  *
020414*--pagare sospesi con data presentazione domanda < 13/10/2013  *
160414*--pagare sospesi con data presentazione domanda < 17/10/2013  *
120514*--pagare sospesi con data presentazione domanda < 01/11/2013  *
170614*--pagare sospesi2014 se data domanda            < 01/03/2014  *
280714*--pagare sospesi2014 se data domanda            < 09/03/2014  *
110914*--pagare sospesi2014 se data domanda            < 01/06/2014  *
090115*--pagare sospesi con data presentazione domanda del 2013      *
260115*--pagare sospesi con data presentazione domanda < 01/09/2014  *
050315*--pagare sospesi con data presentazione domanda < 15/09/2014  *
260315*--pag. sospesi 2015 con data presentaz. domanda < 01/02/2015  *
           if  W-LAVSOSPESO   =  'S'
           then
      *      if  IC-DCODTPRDO   <  20140101
             if  IC-DCODTPRDO   <  20150101
             then
      *          continue
               if  IC-DCODTPRDO   <  20140916
      *          or    IC-PMEINDTOTE  >  zeroes
               then
                   continue
               else
                   move
                  'Domanda non elaborabile: monitoraggio in corso.   '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L31-EX
               end-if
             end-if
      *      if  IC-DCODTPRDO   >  20131231
             if  IC-DCODTPRDO   >  20141231
             then
               if  IC-DCODTPRDO   <  20150201
      *            or  IC-PMEINDTOTE  >  zeroes
               then
                   continue
               else
                   move
                  'Domanda non elaborabile: monitoraggio in corso.   '
                             to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L31-EX
               end-if
             end-if
280114     end-if.
271113*n       if  WL-PAGAMENTI   =  'S'   and
      *n           IC-PMEINDTOTE  not  =  zeroes
      *n       then
      *n           continue
      *n       else
      *n           move
      *n           'Domanda non elaborabile: monitoraggio in corso.   '
      *n           'valore di DCDCOMOCE /Lavoratori sospesi non elab. '
      *n                     to  W-CHK-CAMPI
      *n           move  'S'     to  W-ERRORE
      *n           go  to  L31-EX
      *n       end-if
      *n     end-if
271113*n   end-if.
           if  H-DCDCOMOCE    =  66   or   67   or   69
           then
               move
                   'valore di DCDCOMOCE /Codice cessazione non valido.'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
      *s   if H-DCDQUAPRE     =  'A'
      *s   then
      *s       if  H-DCDCOMOCE    =  51
      *s                         or  65   or   67   or   68
      *s       then
      *s           move
      *s           'valore di DCDCOMOCE /Lavoratori sospesi non elab. '
      *s                     to  W-CHK-CAMPI
      *s           move  'S'     to  W-ERRORE
      *s           go  to  L31-EX
      *s       end-if
      *s   end-if.
      *-------------- Verifica per esclusione lavoratori A.L.T.      *
      *       A = Apprendista                                        *
      *       L = Socio coop. con rapporto lavoro subordinato        *
      *       L = Personale artistico con rapporto lavoro subordinato*
      *    if H-DCDQUAPRE     =  'A'   or   'L'   or   'T'
      *I----------------------------29/07/2013  test in collaudo     *
      *n   if H-DCDQUAPRE     =             'L'   or   'T'
      *n   then
      *n       if   W8-ODIERNA  <  29999999
      *n       if   W8-ODIERNA  <  20130101
      *n       then
      *n           move
      *n         'valore DCDQUAPRE-Attesa DL x qualif.-NON pagabile.'
      *n         'valore DCDQUAPRE-Qualif.non gestita -NON pagabile.'
      *n                   to  W-CHK-CAMPI
      *n           move  'S'     to  W-ERRORE
      *n           go  to  L31-EX
      *n       end-if
      *n   end-if.
      *F----------------------------29/07/2013  test in collaudo     *
      *-------------- verifica per conguaglio frontalieri            *
      *n
      *n   if  W-FRONTALIERI  =  'S'
      *n   then
      *n       if H-DCDQUAPRE                  =  'F'
      *n       then
      *n           continue
      *n       else
      *n           move
      *n           'valore di DCDQUAPRE /ADSDACOD <> F (Frontalieri)  '
      *n                     to  W-CHK-CAMPI
      *n           move  'S'     to  W-ERRORE
      *n           go  to  L31-EX
      *n       end-if
      *n   end-if.
      *------------------------------------- Rientro modello  DS56   *
           move H-DCDRIEDS56             to  IC-DCDRIEDS56.
110419*------------------------------------- Matricola Azienza       *
           if  H-DCDMAAZPR    is  numeric
           then  continue
           else  move
                   'valore di Matricola Azienda  non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L31-EX
           end-if.
      *--Matricola e CSC sono indispensabili per UNICARPE e quindi   *
      *--devono essere assolutamente presenti; dopo "bonifica" delle *
      *--NASPI  bisogna attivare il controllo.                       *
      *    if  H-DCDMAAZPR    =  zeroes
      *    then
      *        move
      *            'valore di Matricola Azienda  non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L31-EX
      *    end-if.
      *------------------------------------- Codice Stat.Contributivo*
           if  H-DCDCSC       is  numeric
           then  continue
           else  move
                   'valore di CSC  (Cod.Stat.Contr.)  non numerico.  '
                             to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 go  to  L31-EX
           end-if.
           move  H-DCDCSC    to  W-DCDCSC.
110419     if  W-DCDCSC       =  30103    and
290719         IC-DCODTDECPP  >  20190304
           then
                 move
                   'prestazione non erogabile; vedi msg 909 del 2019.'
                             to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 go  to  L31-EX
110419     end-if.
      *    if  H-DCDCSC       =  zeroes
      *    then
      *        move
      *            'valore di CSC  (Cod.Stat.Contr.)  non presente.  '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L31-EX
      *    end-if.
      *------------------------------------- Codice Autorizzazione   *
      *    if  H-DCDCA            equal spaces
      *    then
      *        move
      *            'valore di Codice Autorizzazione non presente.    '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L31-EX
110419*    end-if.
      *--------rivedere --------------->  ANTICIPAZIONE NASPI        *
           if L-PROCEDURA                   =  'G21' OR
                                            =  'G98' OR
                                            =  'G97' OR
                                            =  'G96' OR
                                            =  'G99'
      *                                ot   =  'Gnn'
           then
              move 'S'                      to  IC-DCDRIEDS56
           end-if.
       L31-EX.
           EXIT.
      *                                                              *
       L33-NASPI.
      *
           move  H-DCOCHIDOM  to  H-NASCHIDOM.
           perform  L33-DB2-SELECT  thru  L33-DB2-SELECT-EX.
           if  SQLCODE  =  zeros
           then  continue
           else
               move
                   'errore in lettura di TDSNASPI.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
      *------------------------------------- Giornate indennizzabili *
           if H-NASGIOIND                  is  not  numeric
           then
               move
                   'valore di NASGIOIND /TDSNASPI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
           if H-NASGIOIND                  >  zeros
           then  continue
           else
               move
                   'numero giorni spettanti di prestazione non present'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
           move H-NASGIOIND                  to  IC-NASGIOIND.
      **----- verifica giorni qualifica stagionali                    *
150317     if  IC-DCDQUAPRE  =  'B'
           then
               if  IC-DCDDTCALA  >  20150430   and
                   IC-DCDDTCALA  <  20160101
               then
                   if  IC-NASGIOIND  <  181
                   then  continue
                   else  move
                   'giorni teorici prestazione stagionali 2015 errati.'
                                       to  W-CHK-CAMPI
                         move  'S'     to  W-ERRORE
                         go  to  L33-EX
                   end-if
               end-if
               if  IC-DCDDTCALA  >  20151231   and
                   IC-DCDDTCALA  <  20170101
               then
                   if  IC-NASGIOIND  <  121
                   then  continue
                   else  move
                   'giorni teorici prestazione stagionali 2016 errati.'
                                       to  W-CHK-CAMPI
                         move  'S'     to  W-ERRORE
                         go  to  L33-EX
                   end-if
               end-if
150317     end-if.
130215*-------------------------------------per attivare ri-calcolo*
           if  WL-PAGAMENTI  =  'S'   and
250315         W-ANFDIRETTI  =  'N'   and
               IC-NASGIOIND  =  IC-PMEINDTOGG
           then  perform  L331-RICALCOLO  thru  L331-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L33-EX
               end-if
130215     end-if.
030216*------------------per ridurre tassazione conguaglio in 1    *
      *------------------giorno, elaborazioni 1 e 2 febbraio 2016  *
      *    move  'N'    to  W-RICALC-0116.
      *    if  WL-PAGAMENTI  =  'S'   and
      *        W-ANFDIRETTI  =  'N'   and
      *        IC-PMEDTRICA  =  20160131   and
      *       (IC-PMEDTELAB  =  20160201   or
      *        IC-PMEDTELAB  =  20160202)
      *    then  move  'S'  to  W-RICALC-0116
      *          perform  L331-RICALCOLO  thru  L331-EX
      *        if  W-ERRORE  =  'S'
      *        then
      *            go  to  L33-EX
      *        end-if
030216*    end-if.
      *------------------------------------- Retrib. gio. teo.spett. *
           if H-NASIMPGIOTE                is  not  numeric
           then
               move
                   'valore di NASIMPGIOTE/TDSNASPI non numerico.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
           if H-NASIMPGIOTE                =  zeros
           then
               move
                   'importo giornaliero teorico prestazione assente.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
           move H-NASIMPGIOTE                to  IC-NASIMPGIOTE.
      *------------------------------------- GG ds usufr. precedente *
           if H-NASGIOCOUT                 is  not  numeric
           then
               move
                   'valore di NASGIOCOUT/TDSNASPI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
           move H-NASGIOCOUT                 to  IC-NASGIOCOUT.
      *------------------------------------- x statistica: data acq. *
300421     move  zeroes  to  W-NASGGLAV12.
280817     move  spaces  to  W-NASFLGRIT
                             W-FLGTDSBLKPA .
280817     move  zeros   to  W-N0IMPORTO9 .
           if H-NASDTACQD    is  not  numeric
           then
               move
                   'valore di NASDTACQD /TDSNASPI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L33-EX
           end-if.
           move H-NASDTACQD      to   W-N0IMPORTO9.
      *------------------------------------- x statistica: flag rit. *
280817     move  H-NASFLGRIT      to  W-NASFLGRIT.
300421     move  H-NASGGLAV12     to  W-NASGGLAV12.
       L33-EX.
           EXIT.
130215*                                                              *
       L331-RICALCOLO.
      *------------ sottraggo 1 giorno per consentire ricalcolo      *
           if  IC-PMEDTRICA  >  zeroes
           then
               continue
           else
               move
                   'data riferimento ultimo pagamento non presente.   '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L331-EX
           end-if.
      *--------------------------- Sottraggo un giorno a IC-PMEDTRICA*
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  IC-PMEDTRICA     to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-F.
           move     1             to  R10-GIORNI.
030216*    if  W-RICALC-0116  =  'S'
      *    then  move     10      to  R10-GIORNI
030216*    end-if.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-I  to  D6-GGMMAA
               move  W6-GG       to  W8-GG
               move  W6-MM       to  W8-MM
               move  W6-AA       to  W8-AAAA
               add   2000        to  W8-AAAA
               if  W8-AAAAMMGG  >  W8-ODIERNA
               then
                   subtract  100  from  W8-AAAA
               end-if
               move  W8-AAAAMMGG  to  IC-PMEDTRICA
           else
               move
                   'valore di IC-PMEDTRICA non calcolato correttamente'
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L331-EX
           end-if.

      *--------------------------- Sottraggo un giorno a IC-PMEULPEAL*
           if  IC-PMEULPEAL  >  zeroes
           then
               continue
           else
               move
                   'valore di PMEULPEAL /ADSPAGME non presente.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L331-EX
           end-if.
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  IC-PMEULPEAL     to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-F.
           move     1             to  R10-GIORNI.
030216*    if  W-RICALC-0116  =  'S'
      *    then  move     10      to  R10-GIORNI
030216*    end-if.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-I  to  D6-GGMMAA
               move  W6-GG       to  W8-GG
               move  W6-MM       to  W8-MM
               move  W6-AA       to  W8-AAAA
               add   2000        to  W8-AAAA
               if  W8-AAAAMMGG  >  W8-ODIERNA
               then
                   subtract  100  from  W8-AAAA
               end-if
               move  W8-AAAAMMGG  to  IC-PMEULPEAL
           else
               move
                   'valore di IC-PMEULPEAL non calcolato correttamente'
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L331-EX
           end-if.
      *-------------------------------------------
030216*    if  W-RICALC-0116  =  'S'
      *    then
      *        if  IC-PMEINDTOGG  >  10
      *        then  subtract  10 from  IC-PMEINDTOGG
      *        else  move  zeros  to    IC-PMEINDTOGG
      *        end-if
      *        if  IC-PMEORDTOGG  >  10
      *        then  subtract  10 from  IC-PMEORDTOGG
      *        else  move  zeros  to    IC-PMEORDTOGG
      *        end-if
      *        go  to  L331-EX
030216*    end-if.
           if  IC-PMEINDTOGG  >  zeros
           then  subtract  1  from  IC-PMEINDTOGG
           end-if.
           if  IC-PMEORDTOGG  >  zeros
           then  subtract  1  from  IC-PMEORDTOGG
           end-if.
       L331-EX.
           EXIT.
      *                                                              *
       L34-DISCOLL.
      *
           move  H-DCOCHIDOM  to  H-DICCHIDOM.
           perform  L34-DB2-SELECT  thru  L34-DB2-SELECT-EX.
           if  SQLCODE  =  zeros
           then  continue
           else
               move
                   'errore in lettura di TDSDICOL.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L34-EX
           end-if.
      *------------------------------------- Mesi  totali            *
           if H-DICGIOIND                  is  not  numeric
           then
               move
                   'valore di DICGIOIND /TDSDICOL non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L34-EX
           end-if.
           if H-DICGIOIND                  >  zeros
           then  continue
           else
               move
                   'giorni spettanti DISCOLL non presenti.            '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L34-EX
           end-if.
           move H-DICGIOIND                  to  IC-DICGIOIND.
130215*----  riscivere per DisColl la seguente perform
      *    if  WL-PAGAMENTI  =  'S'   and
250315*        W-ANFDIRETTI  =  'N'   and
      *        IC-NASGIOIND  =  IC-PMEINDTOGG
      *    then  perform  L331-RICALCOLO  thru  L331-EX
      *        if  W-ERRORE  =  'S'
      *        then
      *            go  to  L34-EX
      *        end-if
      *    end-if.
      *------------------------------------- Retrib. gio. teo.spett. *
           if H-DICIMPGIO                  is  not  numeric
           then
               move
                   'valore di DICIMPGIO  /TDSDICOL non numerico.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L34-EX
           end-if.
           if H-DICIMPGIO                  =  zeros
           then
               move
                   'importo giornaliero spettante DISCOLL non presente'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L34-EX
           end-if.
           move H-DICIMPGIO                  to  IC-DICIMPGIO.
      *------------------------------------- GG ds usufr. precedente *
           if H-DICCOUTIL                  is  not  numeric
           then
               move
                   'valore di DICCOUTIL /TDSDICOL non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L34-EX
           end-if.
           move H-DICCOUTIL                  to  IC-DICCOUTIL .
       L34-EX.
           EXIT.
      *                                                              *
       L35-AUTASPI.
           move H-DCOCHIDOM  to  H-AUTCHIDOM .
           move  zeros       to  I-AUT.
      *                          W-AUTREDTEO.
           move  'N'         to  W-RED-AUT-CORR.
130124     move  'N'         to  W-RED-AUT-MENO1.
080915     move  'N'         to  W-AUTTIPOATT-DUP.
           move  spaces      to  W-AUTTIPOATT.
      *---- Calcolo   data teorica riferimento attuale pagamento NASPI*
200614     if  L-PROCEDURA                  =  'G19'
      *-- rivedere                   or     =  'G20'
           then  perform L35B-CALCOLA-DTRUPA  THRU  L35B-EX
               if  W-ERRORE  =  'S'
               then  go  to  L35-EX
               end-if
200614     end-if.
030314     initialize  T3-ATT-AUTONOMA.
080915     initialize  T3-BAK-AUTONOMA.
      *
           PERFORM  L35-DB2-DECL-CURS    THRU  L35-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                    until  (NDC1  >  99)
      *
             perform  L35-DB2-FETCH    thru  L35-DB2-FETCH-EX
             if  SQLCODE  =  0
             then
                  perform  L351-CHKFLD-AUTASPI     thru  L351-EX
                  if  (W-ERRORE   =  'N')
                  then
                       move  'S'           to  WL-AUTLASPI
                       perform  L352-CARICOAUT    thru  L352-EX
                  else
                       perform  AUTASPI-DB2-CLSCUR  thru
                                AUTASPI-DB2-CLSCUR-EX
                  end-if
              else
                  perform  AUTASPI-DB2-CLSCUR thru
                           AUTASPI-DB2-CLSCUR-EX
                  move  111    to  NDC1
             end-if
           end-perform.
200614     if  WL-AUTLASPI    =  'N'
           then  go  to  L35-EX
200614     end-if.
      *---- Controllo presenza reddito autonomo: no se anticipazione  *
040214     if  L-PROCEDURA                  =  'G21' OR
110517                                      =  'G96' OR
                                            =  'G98' OR
                                            =  'G99'
      *   rivedere                   or     =  'Gnn'
           then  go  to  L35-EX
040214     end-if.
      *------- Verifica limiti reddito att.autonoma; update istr.19/2 *
080915     if  W-AUTTIPOATT-DUP  =  'S'
               move
              'Presenti più righe/anno stessa attività autonoma. '
                         to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L35-EX
080915     end-if.

080915     perform  L3561-BAK-LIMITI-TIPO  thru  L3561-EX.
           if  W-ERRORE  =  'S'
           then  go  to  L35-EX
080915     end-if.
030314     perform  L3562-T3-LIMITI-ANNO   thru  L3562-EX.
           if  W-ERRORE  =  'S'
           then  go  to  L35-EX
030314     end-if.
190214*------- Implementato: v.mail Raffaella del 19 e 20 febb.2014   *
      *    if  (W-AUTREDTEO         >  4800.00   and
      *         W-AUTTIPOATT   not  =  'T')
      *         or
      *        (W-AUTREDTEO         >  8000.00   and
      *         W-AUTTIPOATT        =  'T')
      *    then
      *        move
      *            'NON pagabile: reddito Autonomo > limite annuo.    '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L35-EX
190214*    end-if.
270114*------- Verifica presenza reddito anno corrente                *
210121     if  IC-AUTDATADAL(1)  =  ZEROS
           then
               move  'S'        to  W-RED-AUT-CORR
210121     end-if.
270114     if  W-RED-AUT-CORR    =  'N'
           then
               move
                   'Errore: assente reddito autonomo anno corrente    '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L35-EX
270114     end-if.
      *---------------IMPLEMENTAZIONE SOSPESA
080915*    perform  L3510-RIELABORA-AUT  thru  L3510-EX.
       L35-EX.
           EXIT.
      *                                                              *
200614 L35B-CALCOLA-DTRUPA.
      *---------- Verifica data teorica riferimento attuale pagamento*
           if  IC-PMEDTRICA  >  0
           then  move  IC-PMEDTRICA  to W-DTRUPA
                 compute  W-GGTUPA   =  IC-NASGIOIND - IC-PMEINDTOGG
           else  move  IC-DCODTDECPP to W-DTRUPA
                 move  IC-NASGIOIND  to W-GGTUPA
           end-if.
           if  W-GGTUPA  =  zeros
           then  go  to  L35B-EX
           end-if.
      *--------------------------- Calcolo data teorica ultimo -AL   *
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  W-DTRUPA         to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-I.
           move  W-GGTUPA         to  R10-GIORNI.
      *
           call  RDSUT10  using
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-F  to  D6-GGMMAA
               move  W6-GG       to  W8-GG
               move  W6-MM       to  W8-MM
               move  W6-AA       to  W8-AAAA
               add   2000        to  W8-AAAA
               move  W8-AAAAMMGG to  W-DTRUPA
           else
               move
                   'Data teorica riferimento ultimo pagamento errata. '
                             to  W-CHK-CAMPI
               move  'N'     to  W-RED-AUT-CORR
               move  'S'     to  W-ERRORE
               go  to  L35B-EX
           end-if.
      *
           move  W8-ODIERNA  to  W8-AAAAMMGG.
           if  K-TIPOCALCOLO  =  'S'
           then
               move  KATA-ELABO-IN  to  W8-AAAAMMGG
               add   1              to  W8-AAAAMMGG
           end-if.
130124*    move  zeros       to  W8-AAAAMMGG(7:2).
           if  W-DTRUPA       >  W8-AAAAMMGG
           then
170117         if  W8-MM     =  1         and
050124             W8-GG     >  15        and
                   IC-PMEINDTOTE    =   zeros
               then  move  01      to   W8-MM
                     move  15      to   W8-GG
                     move  W8-AAAAMMGG  to  W-DTRUPA
                   go  to  L35B-EX
170117         end-if
               if  W8-MM  =  1
               then  subtract  1  from  W8-AAAA
                     move  12      to   W8-MM
                     move  31      to   W8-GG
                     move  W8-AAAAMMGG  to  W-DTRUPA
                   go  to  L35B-EX
               end-if
               subtract  1  from  W8-MM
               if  W8-MM  =  2
               then  move  28  to  W8-GG
               end-if
               if  W8-MM  =  4  or  6  or  9  or  11
               then  move  30  to  W8-GG
               end-if
               if  W8-MM  =  1  or  3  or  5  or  7
                         or  8  or  10  or  12
               then  move  31  to  W8-GG
               end-if
               move  W8-AAAAMMGG  to  W-DTRUPA
           end-if.
       L35B-EX.
200614     EXIT.
      *                                                              *
       L351-CHKFLD-AUTASPI.
      *------------------------------------- Numero progressivo rec. *
           if H-AUTPROGR                      is  not  numeric
           then
               move
                   'valore di AUTPROGR  /TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
           if H-AUTPROGR            >  zeros   and
161120        H-AUTPROGR            <  41
           then
               continue
           else
               move
                   'stabellamento dati attività autonoma/compatibile .'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
      *------------------------------------- Data Inizio attività AUT*
           if H-AUTDATADAL                    is  not  numeric
           then
               move
      *            'valore di AUTDATADAL/TDSAUTLA non numerico.       '
                   'data inizio attività autonoma errata. (AUTDATADAL)'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
           if H-AUTDATADAL                    >  zeros
           then
180419         move  zeros          to  A8-AAAAMMGG
180419         move  H-AUTDATADAL   to  A8-AAAAMMGG
           else
               move
                   'data inizio attività autonoma errata. (AUTDATADAL)'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
180419     if  A8-AAAA  <  2015
161120         or       >  (W8-ODIAA  +  1)
           then
               move
                   'Anno relativo ad attività autonoma non previsto.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
180419     end-if.
      *------------------------------------- Data Fine   attività AUT*
           if  H-AUTDATAAL                   is  not  numeric
           then
               move
      *            'valore di AUTDATAAL /TDSAUTLA non numerico.       '
                   'data fine attività autonoma non valida.(AUTDATAAL)'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
           if H-AUTDATAAL                     >  zeros
           then
               continue
           else
               move
                   'data fine attività autonoma non valida.(AUTDATAAL)'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
080915*------------------------------------- Verifica anno periodo   *
           move  H-AUTDATADAL   to  W8-AAAAMMGG.
           move  H-AUTDATAAL    to  W-8CIFRE.
           if W8-AAAA            =  W-8CIFRE(1:4)
           then
               continue
           else
               move
                   'Periodo attività autonoma superiore ad anno solare'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
080915     end-if.
      *------------------------------------- Verifica Anno Successivo *
130124*   la perfor seguente viene spostata dopo il test sui redditi***
270114*    perform  L353-ANNO-REDD-AUT   thru  L353-EX.
      *------------------------------------- Reddito Annuo  Teorico   *
           if H-AUTREDTEO                    is  not  numeric
           then
               move
                   'reddito teorico attività autonoma non valido.     '
      *            'valore di AUTREDTEO /TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
130515     if H-AUTREDTEO   <  zeroes
           then
               move
                   'reddito teorico attività autonoma non valido.     '
      *            'valore di AUTREDTEO /TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
190214*------- Implementato: v.mail Raffaella del 19 e 20 febb.2014   *
030314*------- modificata gestione: vedi tabella T3-ATT-AUTONOMA      *
      *    if  H-AUTREDTEO  >  zeroes
      *    then
      *        add  H-AUTREDTEO    to  W-AUTREDTEO
      *    end-if.
190214*------- Sbloccato: vedi mail Raffaella del 18/02/2014          *
      *    if H-AUTREDTEO                     =  zeros
      *    then
      *        move
      *            'NON pagabile: reddito Autonomo non presente.      '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  NDC1
      *        go  to  L351-EX
      *    end-if.
      *------------------------------------- Reddito Giorn. Teorico  *
           if H-AUTREDGTEO                    is  not  numeric
           then
               move
                   'reddito gior. teorico att. autonoma non valido.   '
      *            'valore di AUTREDGTEO/TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
200214*---------Teorico -----verifica correlazione redd. annuo/giorn.*
130415     if  (H-AUTREDTEO       =  zeros   and
                H-AUTREDGTEO  not =  zeros)
              or
080915         (H-AUTTIPOATT  not =  'V'     and
                H-AUTREDTEO   not =  zeros   and
                H-AUTREDGTEO      =  zeros)
              or
               (H-AUTTIPOATT      =  'V'     and
                H-AUTREDTEO       >  3000    and
180419          A8-AAAA           <  2017    and
080915          H-AUTREDGTEO      =  zeros)
180419        or
               (H-AUTTIPOATT      =  'V'     and
                H-AUTREDTEO       >  5000    and
                A8-AAAA           >  2016    and
180419          H-AUTREDGTEO      =  zeros)
           then
               move
                   'Errore: Reddito Aut.Annuo/Giorn. teo. non esatto. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
200614*------------------------------------- Reddito Annuo  Effettivo *
           if H-AUTREDEFF                    is  not  numeric
           then
               move
                   'reddito effettivo attività autonoma non valido.   '
      *            'valore di AUTREDTEO /TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
130415     if H-AUTREDEFF  <  zeroes
           then
               move
                   'reddito effettivo attività autonoma non valido.   '
      *            'valore di AUTREDTEO /TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
200614*------------------------------------- Reddito Giorn. Effettivo*
           if H-AUTREDGEFF                    is  not  numeric
           then
               move
                   'reddito gior. eff. att. autonoma non valido.      '
      *            'valore di AUTREDGEFF/TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
200614*---------Effettivo ---verifica correlazione redd. annuo/giorn.*
           if  (H-AUTREDEFF       =  zeros   and
130415          H-AUTREDGEFF  not =  zeros)
               or
080915         (H-AUTTIPOATT  not =  'V'     and
130415          H-AUTREDEFF   not =  zeros   and
                H-AUTREDGEFF      =  zeros)
               or
080915         (H-AUTTIPOATT      =  'V'     and
                H-AUTREDEFF       >  3000    and
180419          A8-AAAA           <  2017    and
                H-AUTREDGEFF      =  zeros)
               or
180419         (H-AUTTIPOATT      =  'V'     and
                H-AUTREDEFF       >  5000    and
                A8-AAAA           >  2016    and
180419          H-AUTREDGEFF      =  zeros)
           then
               move
                   'Errore: Reddito Aut.Annuo/Giorn. eff. non esatto. '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
200614     end-if.
130124*------------------------------------- Verifica Anno Successivo *
130124     perform  L353-ANNO-REDD-AUT   thru  L353-EX.
      *------------------------------------- Numero Giorn. Riduzione *
           if H-AUTNUMGRID                    is  not  numeric
           then
               move
                   'Giornate riduzione att. autonoma non valido.      '
      *            'valore di AUTNUMGRID/TDSAUTLA non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
      *---------------------------------flag Tipo Attività Autonoma  *
200115     if H-AUTTIPOATT  equal  spaces
           then
               move
                   'Tipo attività autonoma non presente.              '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
130415     if H-AUTTIPOATT  =  'A'   or
                            =  'B'   or
                            =  'C'   or
                            =  'D'   or
                            =  'L'   or
                            =  'P'   or
                            =  'S'   or
                            =  'T'   or
                            =  'V'
           then  continue
           else
               move
                   'Tipo attività autonoma non gestita.               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
130415     end-if.
200115*    move  H-AUTTIPOATT  to  W-AUTTIPOATT.
080915     if  W-AUTTIPOATT        =  'B'  or
                                   =  'T'  or
                                   =  'V'
           then  continue
           else  move  H-AUTTIPOATT  to  W-AUTTIPOATT
080915     end-if.
301118*---------------------------- Data inserimento reddito effettivo*
           if H-AUTDATARED                   is  not  numeric
           then
               move
                   'Data inserimento reddito effettivo non valida.    '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L351-EX
           end-if.
       L351-EX.
301118     Exit.
      *                                                              *
       L352-CARICOAUT.
      *------rivedere--------------- SCARTO AUTLAV PER ANTICIPAZIONE *
           if L-PROCEDURA                   =  'G21' OR
110517                                      =  'G96' OR
                                            =  'G98' OR
                                            =  'G99'
      *                             or      =  'Gnn'
           then
               if  H-PMEULPEAL not >  H-AUTDATADAL
               then
                   perform  AUTASPI-DB2-CLSCUR  thru
                            AUTASPI-DB2-CLSCUR-EX
                   move  111     to  NDC1
                   go  to  L352-EX
               end-if
           end-if.
151220*---------- Esclusione dati precedenti                         *
           move  zeros          to  W8-AAAAMMGG.
           move  H-AUTDATAAL    to  W8-AAAAMMGG.
           if  W8-AAAA           <  W-DECORRENZA(1:4)
           then  go  to  L352-EX
           else  continue
           end-if.
151220*---------- Esclusione dati successivi                         *
           move  zeros          to  W8-AAAAMMGG.
           move  H-AUTDATADAL   to  W8-AAAAMMGG.
           if  W8-AAAA           >  W-CALCOLO-AL(1:4)
           then  go  to  L352-EX
           else  continue
           end-if.
           if  IC-DCODTADEC      >  0
           then
               if  W8-AAAAMMGG   <  IC-DCODTADEC
               then  continue
               else  go  to  L352-EX
               end-if
151220     end-if.
      *-----------------------                                       *
161120     if  I-AUT  <    41
           then
               add   1    to  I-AUT
               move H-AUTPROGR       to  IC-AUTPROGR(I-AUT)
               move H-AUTDATADAL     to  IC-AUTDATADAL(I-AUT)
               move H-AUTDATAAL      to  IC-AUTDATAAL(I-AUT)
180523         move H-AUTREDTEO      to  W-AUTREDTEO(I-AUT)
180523         move H-AUTREDEFF      to  W-AUTREDEFF(I-AUT)
               move H-AUTREDGTEO     to  IC-AUTREDGTEO(I-AUT)
               move H-AUTREDGEFF     to  IC-AUTREDGEFF(I-AUT)
               move H-AUTNUMGRID     to  IC-AUTNUMGRID(I-AUT)
301118         if   H-AUTREDGEFF  >  zeros
               then
                   move H-AUTREDGEFF to  IC-AUTREDGTEO(I-AUT)
               end-if
               if   H-AUTDATARED  >  20180001
               then
                   move H-AUTREDGEFF to  IC-AUTREDGTEO(I-AUT)
301118         end-if
180523         move H-AUTTIPOATT     to  W-AUTTIPOATT2(I-AUT)
180523         move H-AUTDATARED     to  W-AUTDATARED(I-AUT)
180523         move H-AUTTIPOACQRED  to  W-AUTTIPOACQRED(I-AUT)
180523         move H-AUTDTLIMRED    to  W-AUTDTLIMRED(I-AUT)
      *
080915         perform  L3541-TAB-BAK     thru  L3541-EX
      *
030314         perform  L3542-TAB-T3      thru  L3542-EX
      *---rivedere--------------------->  ANTICIPAZIONE NASPI        *
               if L-PROCEDURA               =  'G21' OR
110517                                      =  'G96' OR
                                            =  'G98' OR
                                            =  'G99'
      *                                    or   =  'Gnn'
                  if  H-PMEULPEAL       <   IC-AUTDATAAL(I-AUT)
                  then
                      move H-PMEULPEAL  to  IC-AUTDATAAL(I-AUT)
                  end-if
               end-if
           else
               move
                   'Stabellamento per elementi IC-TAB-AUT             '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
           end-if.
       L352-EX.
           Exit.
      *                                                              *
270114 L353-ANNO-REDD-AUT.
130124*    if  W-RED-AUT-CORR     =  'S'                             *
      *    then                                                      *
      *        go  to  L353-EX                                       *
130124*    end-if.                                                   *
      *                                                              *
           move  zeros          to  W8-AAAAMMGG.
           move  H-AUTDATADAL   to  W8-AAAAMMGG.
      *
           if  IC-DCODTADEC(1:4) >  W8-AAAA
           then
170614         if  IC-DCODTADEC(5:4) =  0101
               then
                   add 1  to  W8-AAAA
170614         end-if
           end-if.
      *
160224     if  IC-DCODTADEC(1:4) =  W8-AAAA
           then
               move  'S'        to  W-RED-AUT-CORR
               go  to  L353-EX
           end-if.
      *
           if  W-DTRUPA(1:4) =  W8-AAAA
           then
               move  'S'        to  W-RED-AUT-CORR
               go  to  L353-EX
160224     end-if.
      *
130124     if  W8-ODIAA      >  2023
           then
               if  IC-DCODTADEC  >  zeros
               then
                   if  H-AUTDATADAL  >  IC-DCODTADEC
                   then
                       go  to  L353-EX
                   end-if
               end-if
               if  W8-AAAA             =  W4-ANNO-1
               then
                   if  H-AUTREDTEO   =  zero   and
                       H-AUTREDEFF   =  zero   and
                       W-RED-AUT-MENO1  not =  'M'
                   then
                       move  'Z'  to  W-RED-AUT-MENO1
                       move  'S'  to  W-RED-AUT-CORR
                   else
                       move  'M'  to  W-RED-AUT-MENO1
                       move  'N'  to  W-RED-AUT-CORR
                   end-if
                   go  to  L353-EX
               end-if
160224         if  W8-AAAA  =  W-DTRUPA(1:4)
               then
                   move  'S'  to  W-RED-AUT-CORR
                   go  to  L353-EX
               end-if
               if  W8-AAAA  =  W8-ODIAA
               then
                   move  'S'  to  W-RED-AUT-CORR
      *        go  to  L353-EX
160224     end-if.
       L353-EX.
270114     Exit.
      *                                                              *
080915 L3541-TAB-BAK.
           move  zeros           to  W8-AAAAMMGG.
           move  H-AUTDATADAL    to  W8-AAAAMMGG.
      *
           perform  varying  NDC2  from  1  by  1
161120                until  NDC2  >  40
               if  B-ANNO-RED(NDC2)         >  zeroes
               then
                   if  B-ANNO-RED(NDC2)     =  W8-AAAAMMGG(1:4)
                       and
                       B-AUTTIPOATT(NDC2)   =  H-AUTTIPOATT
                   then
                       move  'S'           to  W-AUTTIPOATT-DUP
                       add  H-AUTREDTEO    to  B-AUTREDTEO(NDC2)
                       add  H-AUTREDGTEO   to  B-AUTREDGTEO(NDC2)
                       add  H-AUTREDEFF    to  B-AUTREDEFF(NDC2)
                       add  H-AUTREDGEFF   to  B-AUTREDGEFF(NDC2)
                       add  H-AUTNUMGRID   to  B-AUTNUMGRID(NDC2)
                       move  99            to  NDC2
                   end-if
               else
                   move  W8-AAAAMMGG(1:4)  to  B-ANNO-RED(NDC2)
                   move  H-AUTDATADAL      to  B-AUTDATADAL(NDC2)
                   move  H-AUTDATAAL       to  B-AUTDATAAL(NDC2)
                   move  H-AUTREDTEO       to  B-AUTREDTEO(NDC2)
                   move  H-AUTREDEFF       to  B-AUTREDEFF(NDC2)
                   move  H-AUTREDGTEO      to  B-AUTREDGTEO(NDC2)
                   move  H-AUTREDGEFF      to  B-AUTREDGEFF(NDC2)
                   move  H-AUTNUMGRID      to  B-AUTNUMGRID(NDC2)
                   move  H-AUTTIPOATT      to  B-AUTTIPOATT(NDC2)
                   move  99                to  NDC2
               end-if
           end-perform.
       L3541-EX.
080915     Exit.
      *                                                              *
030314 L3542-TAB-T3.
           move  zeros           to  W8-AAAAMMGG.
           move  H-AUTDATADAL    to  W8-AAAAMMGG.
      *
           perform  varying  NDC3  from  1  by  1
161120                until  NDC3  >  40
               if  T3-ANNO-RED(NDC3)        >  zeroes
               then
                   if  T3-ANNO-RED(NDC3)    =  W8-AAAAMMGG(1:4)
                   then
                       add  H-AUTREDTEO    to  T3-REDD-TEO(NDC3)
                       add  H-AUTREDEFF    to  T3-REDD-EFF(NDC3)
050215                 if   H-AUTDATAAL    >   T3-DTAL-AUT(NDC3)
                       then
                           move  H-AUTDATAAL
                                           to  T3-DTAL-AUT(NDC3)
050215                 end-if
                       move  99            to  NDC3
                   end-if
               else
                   move  W8-AAAAMMGG(1:4)  to  T3-ANNO-RED(NDC3)
                   move  H-AUTDATADAL      to  T3-DTDA-AUT(NDC3)
050215             move  H-AUTDATAAL       to  T3-DTAL-AUT(NDC3)
                   move  H-AUTREDTEO       to  T3-REDD-TEO(NDC3)
                   move  H-AUTREDEFF       to  T3-REDD-EFF(NDC3)
                   move  H-AUTTIPOATT      to  T3-TIPO-ATT(NDC3)
                   move  99                to  NDC3
               end-if
           end-perform.
       L3542-EX.
030314     Exit.
      *                                                              *
080915 L3561-BAK-LIMITI-TIPO.
           perform  varying  NDC2  from  1  by  1
161120              until   (NDC2  >  40)
             if  B-ANNO-RED(NDC2)      >  zeroes
             then

180522*elena inizio
             initialize w-redd-aut w-redd-sub
             IF  B-ANNO-RED(NDC2) > 2014 AND < 2022
                 MOVE 4800.00  TO W-REDD-AUT
                 MOVE 8145.00  TO W-REDD-SUB
             END-IF
100124       IF  B-ANNO-RED(NDC2) > 2021 AND < 2024
                 MOVE 5500.00  TO W-REDD-AUT
                 MOVE 8173.91  TO W-REDD-SUB
             END-IF
180522*elena fine
100124       if  B-ANNO-RED(NDC2) > 2023
             then
                 move  5500.00  to  W-REDD-AUT
                 move  8500.00  to  W-REDD-SUB
100124       end-if

               if  B-AUTREDEFF(NDC2)  >  zeros
               then
180522*          if  (B-AUTREDEFF(NDC2)   >  4800.00    and
180522           if  (B-AUTREDEFF(NDC2)   >  W-REDD-AUT and
                     (B-AUTTIPOATT(NDC2)  =  'A'  or
                                          =  'C'  or
                                          =  'D'  or
                                          =  'L'  or
                                          =  'P'  or
                                          =  'S') )
                   or
180522*              (B-AUTREDEFF(NDC2)   >  8000.00    and
180522               (B-AUTREDEFF(NDC2)   >  W-REDD-SUB and
                     (B-AUTTIPOATT(NDC2)  =  'B'  or
                                          =  'T'  or
                                          =  'V') )
                 then  perform  L3581-CHK-DTADEC-AUTDATADAL
                                thru  L3581-EX
                 end-if
               else
180522*          if  (B-AUTREDTEO(NDC2)   >  4800.00    and
180522           if  (B-AUTREDTEO(NDC2)   >  W-REDD-AUT and
                     (B-AUTTIPOATT(NDC2)  =  'A'  or
                                          =  'C'  or
                                          =  'D'  or
                                          =  'L'  or
                                          =  'P'  or
                                          =  'S') )
                   or
180522*              (B-AUTREDTEO(NDC2)   >  8000.00    and
180522               (B-AUTREDTEO(NDC2)   >  W-REDD-SUB and
                     (B-AUTTIPOATT(NDC2)  =  'B'  or
                                          =  'T'  or
                                          =  'V') )
                 then  perform  L3581-CHK-DTADEC-AUTDATADAL
                                thru  L3581-EX
                 end-if
               end-if
             else
                 move  99  to  NDC2
             end-if
           end-perform.
       L3561-EX.
030314     Exit.
      *                                                              *
030314 L3562-T3-LIMITI-ANNO.
           perform  varying  NDC3  from  1  by  1
161120              until   (NDC3  >  40)
             if  T3-ANNO-RED(NDC3)      >  zeroes
             then

180522*elena inizio
             initialize w-redd-aut w-redd-sub
             IF  T3-ANNO-RED(NDC3) > 2014 AND < 2022
                 MOVE 4800.00  TO W-REDD-AUT
                 MOVE 8145.00  TO W-REDD-SUB
             END-IF
100124       IF  T3-ANNO-RED(NDC3) > 2021  AND  <  2024
                 MOVE 5500.00  TO W-REDD-AUT
                 MOVE 8173.91  TO W-REDD-SUB
             END-IF
180522*elena fine
100124       if  T3-ANNO-RED(NDC3)  >  2023
             then
                 move  5500.00  to  W-REDD-AUT
                 move  8500.00  to  W-REDD-SUB
100124       end-if

200614         if  T3-REDD-EFF(NDC3)  >  zeros
               then
180522*          if  (T3-REDD-EFF(NDC3)   >  4800.00    and
180522           if  (T3-REDD-EFF(NDC3)   >  W-REDD-AUT and
200115*               W-AUTTIPOATT        not  =  'T')
130415               (W-AUTTIPOATT        =  'A'  or
                                          =  'C'  or
                                          =  'D'  or
                                          =  'L'  or
                                          =  'P'  or
                                          =  'S') )
                   or
180522*              (T3-REDD-EFF(NDC3)   >  8000.00    and
180522               (T3-REDD-EFF(NDC3)   >  W-REDD-SUB and
200115*               W-AUTTIPOATT        not  =  'T')
130415               (W-AUTTIPOATT        =  'B'  or
                                          =  'T'  or
                                          =  'V') )
                 then  perform  L3582-CHK-DTADEC-AUTDATADAL
                                thru  L3582-EX
                 end-if
               else
180522*          if  (T3-REDD-TEO(NDC3)   >  4800.00    and
180522           if  (T3-REDD-TEO(NDC3)   >  W-REDD-AUT and
200115*               W-AUTTIPOATT        not  =  'T')
130415               (W-AUTTIPOATT        =  'A'  or
                                          =  'C'  or
                                          =  'D'  or
                                          =  'L'  or
                                          =  'P'  or
                                          =  'S') )
                   or
180522*              (T3-REDD-TEO(NDC3)   >  8000.00    and
180522               (T3-REDD-TEO(NDC3)   >  W-REDD-SUB and
200115*               W-AUTTIPOATT        =  'T')
130415               (W-AUTTIPOATT        =  'B'  or
                                          =  'T'  or
                                          =  'V') )
                 then  perform  L3582-CHK-DTADEC-AUTDATADAL
                                thru  L3582-EX
                 end-if
200614         end-if
             else
                 move  99  to  NDC3
             end-if
           end-perform.
       L3562-EX.
030314     Exit.
      *                                                              *
080915 L3581-CHK-DTADEC-AUTDATADAL.
           if  IC-DCODTADEC  =  zeros
           then
               move
              'NON pagabile: reddito Autonomo > limite annuo.    '
                         to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move   99     to  NDC2
               go  to  L3581-EX
           end-if.
      *
           if  IC-DCODTADEC  >  B-AUTDATADAL(NDC2)
               move
              'NON pagabile: redd. Aut. > limite (v. decadenza)  '
                         to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move   99     to  NDC2
               go  to  L3581-EX
           end-if.
       L3581-EX.
080915     Exit.
      *
200614 L3582-CHK-DTADEC-AUTDATADAL.
           if  IC-DCODTADEC  =  zeros
           then
               move
              'NON pagabile: reddito Autonomo > limite annuo.    '
                         to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move   99     to  NDC3
               go  to  L3582-EX
           end-if.
      *
           if  IC-DCODTADEC  >  T3-DTDA-AUT(NDC3)
               move
              'NON pagabile: redd. Aut. > limite (v. decadenza)  '
                         to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move   99     to  NDC3
               go  to  L3582-EX
           end-if.
       L3582-EX.
200614     Exit.
      *
      *----------------IMPLEMENTAZIONE SOSPESA                       *
080915*L3510-RIELABORA-AUT.
      *    initialize       IC-TAB-AUT.
      *    move  zeros  to  I-AUT.
      *    perform  varying  I-AUT  from  1  by  1
      *             until    (I-AUT >  5)
      *      if  B-AUTDATADAL(I-AUT)    >  zeroes
      *      then
      *        if  B-AUDATAAL(5:4)  =  1231
      *        then
      *            continue
      *        else
      *            move  1231  to  B-AUTDATAAL(I-AUT)
      *        end-if
      *    end-perform.
      *--------------------------- Calcolo gg tra inizio e fine      *
      *    move  zero       to  W8-AAAAMMGG
      *                         D6-GGMMAA.
      *    move  zero       to  R10-DATA-I
      *                         R10-DATA-F
      *                         R10-GIORNI
      *                         R10-GIORNI-INDS
      *                         R10-GIORNI-DANF
      *                         R10-RC.
      *
      *    move  B-AUTDATADAL     to  W8-AAAAMMGG.
      *    move  W8-AAAA          to  W6-AA
      *    move  W8-MM            to  W6-MM
      *    move  W8-GG            to  W6-GG
      *    move  D6-GGMMAA        to  R10-DATA-I.
      *    move  B-AUTDATAAL      to  W8-AAAAMMGG.
      *    move  W8-AAAA          to  W6-AA
      *    move  W8-MM            to  W6-MM
      *    move  W8-GG            to  W6-GG
      *    move  D6-GGMMAA        to  R10-DATA-F.
      *
      *    CALL  RDSUT10  USING
      *                WDFHEIBLK  WDFHCOMMAREA
      *                           PER-RDSUT10 .
      *    cancel  RDSUT10.
      *
      *    if  R10-RC   =  1
      *    then
      *        move  R10-GIORNI
      *    else
      *        move
      *            'Calcolo giorni attività compatibile non possibile.'
      *                      to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  L141-EX
      *    end-if.
      *L3510-EX.
080915*    Exit.
      *                                                              *
       L36-ORDSANMARINO.
      *     ORDSANMARINO   ADSORSAM   -  Tabella NON necessaria      *
      *------------------------------------- Importo giorn. teorico  *
           move zeroes                           to  IC-OSMIMPGSTE.
      *------------------------------------- Giornate indennizzabili *
           move zeroes                           to  IC-OSMGIOIND.
       L36-EX.
           EXIT.
      *                                                              *
       L37-RIMPATRIATI.
      *n
      *n   move H-DCOCHIDOM  to H-RFSCHIDOM .
      *n   PERFORM L37-DB2-SELECT THRU L37-DB2-SELECT-EX.
      *n   IF  SQLCODE = 0
      *n       NEXT SENTENCE
      *n   ELSE
      *n       move
      *n           'errore in lettura di ADSRIFRS.  Chiave invalida.  '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L37-EX
      *n   END-IF.
      *                                                              *
       L38-ASPRI.
      *---- Il pgm di calcolo ha bisogno del valore percentuale a *
      *---- zero per elaborare in misura intera la prestazione    *
           move  zeroes       to  IC-RIDPERC
200614                            W-ABB-NUMERAT
                                  W-ABB-DENOMIN
                                  W-ABBATTIMENTO
200614                            W-RIDPERC-ABB.
      *
      *    if  W8-ODIERNA  <  29999999
           if  W8-ODIERNA  <  20130101
           then  go  to  L38-EX
           end-if.
           move  H-DCOCHIDOM  to  H-RIDCHIDOM.
           perform  L38-DB2-SELECT  thru  L38-DB2-SELECT-EX.
           if  SQLCODE  =  100
           then  go  to  L38-EX
           end-if.
           if  SQLCODE  =  zeros
           then  continue
           else  move
                 'errore in lettura di TDSASPRI.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L38-EX
           end-if.
      *------------------------------------- Perc. sett. contr.ridot.*
           if H-RIDPERC                    is  not  numeric
           then
               move
                   'valore di RIDPERC   /TDSASPRI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L38-EX
           end-if.
280714     if H-RIDPERC                    <    0.00   or
              H-RIDPERC                    >  100.00
           then
               move
                   'Percentuale riduzione non valida - ASPRI.RIDPERC  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L38-EX
           end-if.
           move H-RIDPERC         to  IC-RIDPERC.
      *
280714     compute  W-ABB-DENOMIN  =
                           H-RIDNUSE     +
                           H-RIDNUSE14   +
                           H-RIDNUSE15   +
                           H-RIDNUSE16 .
           if W-ABB-DENOMIN                =  zeroes
           then  go  to  L38-EX
           end-if.
           if W-ABB-DENOMIN                >  52
           then
               move
                   'Totale sett. contribuzione  ridotta maggiore di 52'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L38-EX
           end-if.
200614     compute  W-ABB-NUMERAT  =
                   (80  *  H-RIDNUSE  )  +
                   (60  *  H-RIDNUSE14)  +
                   (40  *  H-RIDNUSE15)  +
                   (20  *  H-RIDNUSE16) .
           COMPUTE  W-ABBATTIMENTO  rounded  =
                    W-ABB-NUMERAT  /  W-ABB-DENOMIN .

           COMPUTE  W-RIDPERC-ABB  rounded  =
                  ( IC-RIDPERC  *  W-ABBATTIMENTO ) /  100 .
200614     move  W-RIDPERC-ABB    to  IC-RIDPERC .
       L38-EX.
           EXIT.
      *                                                              *
      *------------------------------------- Importo giorn. teorico  *
      *n   if H-RFSIMPGSTE                    is  not  numeric
      *n   then
      *n       move
      *n           'valore di RFSIMPGSTE/ADSRIFRS non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L37-EX
      *n   end-if.
      *n   if H-RFSIMPGSTE                    is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di RFSIMPGSTE/ADSRIFRS non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L37-EX
      *n   end-if.
           move  zeroes                         to  IC-RFSIMPGSTE.
      *------------------------------------- Giornate indennizzabili *
      *n   if H-RFSGIOIND                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di RFSGIOIND /ADSRIFRS non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L37-EX
      *n   end-if.
      *n   if H-RFSGIOIND                     is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di RFSGIOIND /ADSRIFRS non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L37-EX
      *n   end-if.
           move  zeroes                         to  IC-RFSGIOIND.
       L37-EX.
           EXIT.
      *                                                              *
       L41-ANTNASPI.
      *
           move H-DCOCHIDOM  to H-AASCHIDOM .
           PERFORM L41-DB2-SELECT THRU L41-DB2-SELECT-EX.
           IF  SQLCODE = 0
               NEXT SENTENCE
           ELSE
               move
                   'errore in lettura di TDSANTAS.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L41-EX
           END-IF.
           move  H-AASASPI                    to  IC-AASASPI.
           move  H-AASDTFINE                  to  IC-AASDTFINE.
           move  H-AASATTDAL                  to  IC-AASATTDAL.
      *----- Controllo TIPO domanda  Anticipazione                   *
191021     if  H-AASTIPO  =  'U'
           then  continue
           else  move
                 'Anticipazione non elaborata: AASTIPO non gestito. '
                              to  W-CHK-CAMPI
                 move  'S'    to  W-ERRORE
                 go  to  L41-EX
           end-if.
      *----- Controllo attività per  Anticipazione                   *
           if  H-AASATTIV  = 'A'
                       or  = 'C'
                       or  = 'D'
090224                 or  = 'L'
                       or  = 'P'
                       or  = 'S'
                       or  = 'Q'
           then  continue
           else
               if  W-NIK  =  'S'
               then  continue
               else  move
                 'Errore: attività da intraprendere non prevista.   '
                              to  W-CHK-CAMPI
                 move  'S'    to  W-ERRORE
                 go  to  L41-EX
               end-if
           end-if.
      *----- Controllo attività Q per detassazione Anticipazione     *
           if  H-AASATTIV  = 'Q'
           then  move  'Q'     to  IC-FLGANTICIP
           else  move  spaces  to  IC-FLGANTICIP
           end-if.
      *----- Controllo presenza Acconti: FCODPAGA1 no = ACC ma = SNI *
           if  IC-FLGANTICIP  =  'Q'
           then
               if  IC-RECTORERE-3  >  0
               then
                   move
                  'Anticipazione non pagabile: Acconto non previsto.'
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L41-EX
               end-if
191021     end-if.
211114*-- bloccare pagamento anticipazioni dal 25/11/2014            *
      *-- vedi mail Piccarreta del 20/11/2014                        *
      *    if  W8-ODIERNA  <  20141125
      *    then   continue
      *    else   move
      *          'Anticipazione non pagabile: ricognizione in corso.'
      *                        to  W-CHK-CAMPI
      *           move  'S'     to  W-ERRORE
      *           go  to  L41-EX
      *    end-if.
211114*-- bloccare pagamento anticipazioni dal 25/11/2014            *
200115     if  IC-DCODTPRDO  <  20140101    or
               IC-DCODTPRDO  >  20141231
           then   continue
           else   move
                 'Anticipazione non pagabile: ricognizione in corso.'
                               to  W-CHK-CAMPI
                  move  'S'     to  W-ERRORE
                  go  to  L41-EX
200115     end-if.
       L41-EX.
           EXIT.
      *                                                              *
       L42-DECANTNASPI.
      *
           move H-AASASPI    to H-PETCHIDOM .
           PERFORM L42-DB2-SELECT THRU L42-DB2-SELECT-EX.
           IF  SQLCODE = 0
               NEXT SENTENCE
           ELSE
               move
                   'errore in lettura di TDSPEERT.  Anticipo Naspi    '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L42-EX
           END-IF.
260716*-- bloccare pagamento prima della decorr NASPI A.Cicero       *
      *-- vedi mail Piccarreta del 26/07/2016                        *
           if  W8-ODIERNA  not < H-PETPEERTD
           then   continue
           else   move
                 'Anticipo pagabile dalla data di decorrenza  NASPI '
                                to  W-CHK-CAMPI
                  move  'S'     to  W-ERRORE
                  go  to  L42-EX
           end-if.
      *--
       L42-EX.
           EXIT.
      *                                                              *
       L40-REGIMECEE.
      *n
      *n   move H-DCOCHIDOM  to H-RICCHIDOM .
      *n   PERFORM L40-DB2-SELECT THRU L40-DB2-SELECT-EX.
      *n   IF  SQLCODE = 0
      *n       NEXT SENTENCE
      *n   ELSE
      *n       move
      *n           'errore in lettura di ADSREINC.  Chiave invalida.  '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   END-IF.
      *------------------------------------- Giorni no indennizzabili*
      *n   if H-RICGINOIN                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICGINOIN /ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICGINOIN.
      *------------------------------------- Inizio prest. da E303   *
      *n   if H-RICINIPRE                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICINIPRE /ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICINIPRE.
      *------------------------------------- Fine   prest. da E303   *
      *n   if H-RICFINPRE                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICFINPRE /ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICFINPRE.
      *------------------------------------- Periodo cambio valuta   *
      *n   if H-RICPECAVA                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICPECAVA /ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICPECAVA.
      *------------------------------------- Valuta estera           *
      *n   if H-RICCOVAES1                    is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICCOVAES1/ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICCOVAES1.
      *------------------------------------- Giorni teorici indenn.  *
      *n   if H-RICGIOIND                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICGIOIND /ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
      *n   if H-RICGIOIND                     is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di RICGIOIND /ADSREINC non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICGIOIND.
      *------------------------------------- Primo importo teorico   *
      *n
      *n   if H-RICPRIMGIE                    is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICPRIMGIE/ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
      *n   if H-RICPRIMGIE                    is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di RICPRIMGIE/ADSREINC non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICPRIMGIE.
      *------------------------------------- II°   importo teorico   *
      *n   if H-RICSEIMGIE                    is  not  numeric
      *n   then
      *n       move
      *n           'valore di RICSEIMGIE/ADSREINC non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L40-EX
      *n   end-if.
           move  zeroes                       to  IC-RICSEIMGIE.
       L40-EX.
           EXIT.
      *                                                              *
       L43-EDILI.
      *n   move H-DCOCHIDOM   to H-EDICHIDOM .
      *n
      *n   PERFORM L43-DB2-SELECT THRU L43-DB2-SELECT-EX.
      *n   IF  SQLCODE = 0
      *n       NEXT SENTENCE
      *n   ELSE
      *n       move
      *n           'errore in lettura di ADSEDILI.  Chiave invalida.  '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L43-EX
      *n
      *n   END-IF.
      *------------------------------------- Importo spett.teorico   *
      *n   IF H-EDIIMPGSTE                    is  not  numeric
      *n   then
      *n       move
      *n           'valore di EDIIMPGSTE/ADSEDILI non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L43-EX
      *n   end-if.
      *n   IF H-EDIIMPGSTE                    is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di EDIIMPGSTE/ADSEDILI non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L43-EX
      *n   end-if.
           move  zeroes                     to  IC-EDIIMPGSTE.
      *------------------------------------- Giorni teorici indenn.  *
      *n   IF H-EDIGIOIND                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di EDIGIOIND /ADSEDILI non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L43-EX
      *n   end-if.
      *n   IF H-EDIGIOIND                     is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di EDIGIOIND /ADSEDILI non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L43-EX
      *n   end-if.
           move  zeroes                     to  IC-EDIGIOIND.
       L43-EX.
           EXIT.
      *                                                              *
       L46-MARITTIMI.
      *n   move H-DCOCHIDOM  to H-MARCHIDOM .
      *n   PERFORM L46-DB2-SELECT THRU L46-DB2-SELECT-EX.
      *n   IF  SQLCODE = 0
      *n       NEXT SENTENCE
      *n   ELSE
      *n       move
      *n           'errore in lettura di ADSMARIT.  Chiave invalida.  '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L46-EX
      *n   END-IF.
      *------------------------------------- Importo spett.teorico   *
      *n   if H-MARIMPGSTE                    is  not  numeric
      *n   then
      *n       move
      *n           'valore di MARIMPGSTE/ADSMARIT non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L46-EX
      *n   end-if.
      *n   if H-MARIMPGSTE                    is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di MARIMPGSTE/ADSMARIT non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L46-EX
      *n   end-if.
           move  zeroes                       to  IC-MARIMPGSTE.
      *------------------------------------- Giorni teorici indenn.  *
      *n   if H-MARGIOIND                     is  not  numeric
      *n   then
      *n       move
      *n           'valore di MARGIOIND /ADSMARIT non numerico.       '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L46-EX
      *n   end-if.
      *n   if H-MARGIOIND                     is  not  >  zeroes
      *n   then
      *n       move
      *n           'valore di MARGIOIND /ADSMARIT non valido.         '
      *n                     to  W-CHK-CAMPI
      *n       move  'S'     to  W-ERRORE
      *n       go  to  L46-EX
      *n   end-if.
           move  zeroes                       to  IC-MARGIOIND.
       L46-EX.
           EXIT.
      *                                                              *
       L49-SOSPENSIONI.
      *---*Rivedere (prendo solo 50 record: quanti ne gestisce Longo)
281014*---* gestione di 400 sospensioni
           move H-DCOCHIDOM   to  H-SOSCHIDOM .
           move     'N'       to  WL-SOSPE.
271014*    move  all zero     to  L-TABELE-SOS.
      *
           move  zeros        to  I-SOS CNT-SOS.
      *
      *--------rivedere---------------->  ANTICIPAZIONE NASPI        *
190523*ex  if L-PROCEDURA    =  'G21'   or   =  'G99'
190523*    then  go  to  L49-ex
      *ex  end-if.
190523     if L-PROCEDURA    =  'G99'
190523     then  go  to  L49-ex
           end-if.
      *
           if L-PROCEDURA = 'G98'
           then
              MOVE WRK-DCODTADEC  TO H-SOSDTINSOS
           else
              MOVE 99999999       TO H-SOSDTINSOS
           end-if.
      *
           PERFORM  L49-DB2-DECL-CURS    THRU  L49-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                          until  I-SOS >  400
              perform  L49-DB2-FETCH    thru  L49-DB2-FETCH-EX
              if   SQLCODE  =  0
              then
      *    rivedere
                   if L-PROCEDURA = 'G98'             and
                      H-SOSDTFISOS > WRK-DCODTADEC
                   then
                      MOVE WRK-DCODTADEC  TO H-SOSDTFISOS
                   end-if
                   perform  L50-CHKFLD-SOSPE     thru  L50-EX
                   if  (W-ERRORE   =  'N')
                   then
                       perform  L51-CARICOSOS    thrU  L51-EX
                       move     'S'              to    WL-SOSPE
                   else
                       perform SOSPENSIONI-DB2-CLSCUR thru
                               SOSPENSIONI-DB2-CLSCUR-EX
                   end-if
              else
                   perform SOSPENSIONI-DB2-CLSCUR thru
                           SOSPENSIONI-DB2-CLSCUR-EX
                   move  444    to  I-SOS
              end-if
            end-perform.
      *
      *Se ci sono sospensioni Compatto
      *-------------- istruzioni commentar
      *    if  WL-SOSPE  = 'S'
      *        if  CNT-SOS > 49
      *        then
      *            PERFORM L491-COMPATTO THRU L491-EX
      *        else
      *            perform  L512-CARICOSOS    thru  L512-EX
      *                     varying  i-sos from  1  by  1
      *            until I-SOS > 50  or L-SOSDTINSOS(I-SOS) = 0
      *        end-if
      *    end-if.
      *
       L49-EX.
           EXIT.
      *
271014*L491-COMPATTO.
      *--------------- paragrafo commentato in data 27/10/2014
      *    MOVE  L-PROCEDURA       TO    LK-PROCEDURA .
      *    MOVE IC-DCODTADEC       TO    LK-DCODTADEC .
      *
      *    IF  IC-DCODTDECPP = 0   AND   IC-DCODTDECSP = 0
      *        MOVE 0              TO    LK-DCODTDECPP
      *    END-IF.
      *    IF  IC-DCODTDECPP > 0   AND   IC-DCODTDECSP = 0
      *        MOVE IC-DCODTDECPP  TO    LK-DCODTDECPP
      *    END-IF.
      *    IF  IC-DCODTDECPP = 0   AND   IC-DCODTDECSP > 0
      *        MOVE IC-DCODTDECPP  TO    LK-DCODTDECPP
      *    END-IF.
      *    IF  IC-DCODTDECPP > 0   AND   IC-DCODTDECSP > 0
      *        IF  IC-DCODTDECPP > IC-DCODTDECSP
      *            MOVE IC-DCODTDECSP  TO    LK-DCODTDECPP
      *        ELSE
      *            MOVE IC-DCODTDECPP  TO    LK-DCODTDECPP
      *        END-IF
      *    END-IF.
      *
      *    CALL RDSUT18 USING
      *                      WDFHEIBLK  WDFHCOMMAREA
      *                      PER-RDSUT18
      *                      R18-RC.
      *    if  R18-RC   =  1
      *    then
      *        perform  L512-CARICOSOS    thru  L512-EX
      *                  varying  i-sos from  1  by  1
      *           until I-SOS > 50  or L-SOSDTINSOS(I-SOS) = 0
      *    else
      *        move
      *           'valore di SOSDTINSOS/ADSSOSPE non valido. '
      *                        to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *    end-if.
      *L491-EX.
271014*    EXIT.
      *
       L50-CHKFLD-SOSPE.
      *------------------------------------- Data inizio sospensione *
           if H-SOSDTINSOS                    is  not  numeric
           then
               move
                   'valore di SOSDTINSOS/ADSSOSPE non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  444     to  I-SOS
               go  to  L50-EX
           end-if.
           if H-SOSDTINSOS                    >  zeros
           then
               continue
           else
               move
                   'data inizio sospensione non valida.               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  444     to  I-SOS
               go  to  L50-EX
           end-if.
      *------------------------------------- Data fine   sospensione *
           if H-SOSDTFISOS                    is  not  numeric
           then
               move
                   'valore di SOSDTFISOS/ADSSOSPE non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  444     to  I-SOS
               go  to  L50-EX
           end-if.
      *------------------------------------- Codice      sospensione *
           if H-SOSCODSOS                    =  spaces
           then
               move
                   'codice descrittivo sospensione non presente.      '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  444     to  I-SOS
               go  to  L50-EX
           end-if.
      *------------------------------------- Sospensioni sovrapposte *
271014*    if H-SOSDTINSOS not >  L-SOSDTFISOS(I-SOS) and I-SOS > 0
           if H-SOSDTINSOS not > IC-SOSDTFISOS(I-SOS) and I-SOS > 0
           then
               move
                   'presenza di sospensioni sovrapposte.              '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  444     to  I-SOS
               go  to  L50-EX
           end-if.
250917*-------- Eccezione da sospensione per indicatore NASPI 1°pagam*
           if  W8-ODIERNA  <  20170930
           then  go  to  L50-EX
           end-if.
           if  WL-PAGAMENTI  not  equal  'N'
           then  go  to  L50-EX
           end-if.
      *-------- W-N0CODICE9  è già impostato in L33- da H-NASFLGRIT  *
      *-------- W-N0IMPORTO9 è già impostato in L33- da H-NASDTACQD  *
           if  H-SOSCODSOS  =  '04'  or  '05'  or  '07'
           then
               if  IC-DCODTPRDO   >=  H-SOSDTINSOS   and
                   IC-DCODTPRDO   <=  H-SOSDTFISOS
               then
      *            move  'M'           to  W-N0CODICE9
                   move  'M'           to  W-NASFLGRIT
                   move  H-SOSDTFISOS  to  W-N0IMPORTO9
               end-if
               if  IC-DCODTDECPP  >=  H-SOSDTINSOS   and
                   IC-DCODTDECPP  <=  H-SOSDTFISOS
               then
      *            move  'M'           to  W-N0CODICE9
                   move  'M'           to  W-NASFLGRIT
                   move  H-SOSDTFISOS  to  W-N0IMPORTO9
               end-if
250917     end-if.
       L50-EX.
           EXIT.
      *
       L51-CARICOSOS.
      *
190523     if  L-PROCEDURA         =  'G21'
           then  if  H-SOSCODSOS   =  '59'
                 then  continue
                 else  go  to  L51-EX
                 end-if
190523     end-if.
      *
           if  L-PROCEDURA = 'G96' AND H-SOSCODSOS = '59'
               then  go  to  L51-EX
           end-if.
      *
281014*----Accordo x PDSNA02:   NON passare sospensioni che terminano
      *----prima della decorrenza prestazione,  iniziano dopo decadenza
      *----o iniziano dopo la data riferimento calcolo mensile
           if  H-SOSDTFISOS  >  zeros
           then
               if  H-SOSDTFISOS  <  W-DECORRENZA
               then  go  to  L51-EX
               else  continue
               end-if
           end-if.
      *?   if  H-SOSDTFISOS  =  0
      *?   then  move W-CALCOLO-AL  to  IC-SOSDTFISOS(I-SOS)
      *?   end-if.
           if  IC-DCODTADEC  >  zeros
           then
               if  H-SOSDTINSOS  <  IC-DCODTADEC
               then  continue
               else  go  to  L51-EX
               end-if
           end-if.
           if  H-SOSDTINSOS  <=  W-CALCOLO-AL
           then  continue
           else  go  to  L51-EX
281014     end-if.
      *
           add   1    to  CNT-SOS.
           if  I-SOS  <  400
           then
               add   1    to  I-SOS
      *        move H-SOSDTINSOS     to  L-SOSDTINSOS(I-SOS)
      *        move H-SOSDTFISOS     to  L-SOSDTFISOS(I-SOS)
      *        move H-SOSCODSOS      to  L-SOSCODSOS(I-SOS)
               move H-SOSDTINSOS     to  IC-SOSDTINSOS(I-SOS)
               move H-SOSDTFISOS     to  IC-SOSDTFISOS(I-SOS)
               move H-SOSCODSOS      to  IC-SOSCODSOS(I-SOS)
           else
               move
                   'Stabellamento per elementi ADSSOSPE               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  444     to  I-SOS
           end-if.
      *  GGA ---------- istruzioni commentate il 27/10/2014
271014*    if  H-SOSDTFISOS = 0
      *    then
      *       if  W-CALCOLO-AL  <  L-SOSDTINSOS(I-SOS)
      *       then
      *           move L-SOSDTINSOS(I-SOS) to  L-SOSDTFISOS(I-SOS)
      *       else
      *            move  W-CALCOLO-AL      to  L-SOSDTFISOS(I-SOS)
      *            move  L-SOSDTINSOS(I-SOS) TO  R-SOSDTIN
      *            if  IC-DCODTADEC  =  0   and
      *                SOS-ANNO-IN  NOT > (R-ANNO-AL - 2)
      *            then
      *                move L-SOSDTINSOS(I-SOS) to IC-DCODTADEC
      *            end-if
      *       end-if
      *    end-if.
271014*  GGA
      *    if  H-SOSDTFISOS = 0
      *        move W-CALCOLO-AL     to  L-SOSDTFISOS(I-SOS)
      *    end-if.
       L51-EX.
           EXIT.
      *-------------------- paragrafo commentato il 27/10/2014
      *L512-CARICOSOS.
      *    if  I-SOS  <  50
      *    then
      *        move L-SOSDTINSOS(I-SOS) to  IC-SOSDTINSOS(I-SOS)
      *        move L-SOSDTFISOS(I-SOS) to  IC-SOSDTFISOS(I-SOS)
      *        move L-SOSCODSOS(I-SOS)  to  IC-SOSCODSOS(I-SOS)
      *    else
      *        move
      *            'Stabellamento per elementi ADSSOSPE               '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  I-SOS
      *        perform SOSPENSIONI-DB2-CLSCUR thru
      *                SOSPENSIONI-DB2-CLSCUR-EX
      *    end-if.
      *L512-EX.
      *    EXIT.
      *
       L52-TEOEROGABI.
      *n   move  zeros    to  W-FINE-TEORICO
      *n                      W-TOGG-TEORICO.
      *----------------- Modifica: per la DS/Ord max.10 elementi!
           move H-DCOCHIDOM   to H-PETCHIDOM .
           move H-DCOCODFIS   to H-PETCODFIS .
           move  zeros  to  IO-PET.
           move  zeros  to  IS-PET.
      *
           perform  L52-DB2-DECL-CURS    thru  L52-DB2-DECL-CURS-EX.
           perform  varying  NDC3  from  1  by  1
                    until  (NDC3  >   99)
      *
             perform  L52-DB2-FETCH    thru  L52-DB2-FETCH-EX
             if   SQLCODE = 0
             then
                  MOVE 'S'    to  WL-TABPIENA
      *           move 'S'    to  WL-TEOEROGABI
                  perform  L53-CHKFLD-TEOEROGABI  thru  L53-EX
                  if  (W-ERRORE   =  'N')
                  then
                       perform  L54-CARICOPET    thru  L54-EX
                  else
                       perform TEOEROGABI-DB2-CLSCUR thru
                               TEOEROGABI-DB2-CLSCUR-EX
                  end-if
              else
                  perform TEOEROGABI-DB2-CLSCUR thru
                          TEOEROGABI-DB2-CLSCUR-EX
                  move  111    to  NDC3
             end-if
           end-perform.
      *
           if  WL-TABPIENA  =  'N'
           then
               move  'S'     to  W-ERRORE
           else
               move  'N'     to  WL-TABPIENA
           end-if.
080116*--NASPI: Eliminazione sospensioni se tutte successive al      *
      *      applicazione sospesa --  da testare e valutare          *
      *------- Teorico spettante (causano errore nel calcolo)        *
      *    if  IC-DCOCOTIDO  =  'U'    and
      *        CNT-SOS      >  zeros   and
      *        W-PETPEERTA  <  IC-SOSDTINSOS(1)
      *    then
      *        initialize  IC-TAB-SOSPE
080116*    end-if.
       L52-EX.
           EXIT.
      *
      *n
      *L525-DTNASCITA.
      *----- WIC-DTNASCITA    non disponibile al momento elaborazione*
      *n   move  zeros     to  W8-AAAAMMGG
      *n                       W-CALCOLI.
      *------------------------------------------------ Anno
      *n   move  IC-DCOCODFIS(7:2)       to  W8-AAAA.
      *n   if  W8-AAAA  >  36
      *n   then
      *n       add   1900  to  W8-AAAA
      *n   else
      *n       add   2000  to  W8-AAAA
      *n   end-if
   GGA*n   if  RNPYEAR-ANNO  >  W8-AAAA
      *n   if  W8-ODIAA      >  W8-AAAA
      *n   then
      *n       continue
      *n   else
      *n       subtract  100  from  W8-AAAA
      *n   end-if.
      *------------------------------------------------ Mese
      *n   evaluate  IC-DCOCODFIS(9:1)
      *n     when  'A'
      *n           move  '01'  to  W8-MM
      *n     when  'B'
      *n           move  '02'  to  W8-MM
      *n     when  'C'
      *n           move  '03'  to  W8-MM
      *n     when  'D'
      *n           move  '04'  to  W8-MM
      *n     when  'E'
      *n           move  '05'  to  W8-MM
      *n     when  'H'
      *n           move  '06'  to  W8-MM
      *n     when  'L'
      *n           move  '07'  to  W8-MM
      *n     when  'M'
      *n           move  '08'  to  W8-MM
      *n     when  'P'
      *n           move  '09'  to  W8-MM
      *n     when  'R'
      *n           move  '10'  to  W8-MM
      *n     when  'S'
      *n           move  '11'  to  W8-MM
      *n     when  'T'
      *n           move  '12'  to  W8-MM
      *n   end-evaluate.
      *------------------------------------------------ Giorno
      *n   move  IC-DCOCODFIS(10:2)  to  W8-GG.
      *n   if  W8-GG  >  40
      *n   then
      *n       subtract  40        from  W8-GG
      *n   end-if.
      *------------------------------------------- x Cinquantenni    *
      *n   compute  W-CALCOLI  =
      *n        IC-DCDDTCALA  -  W8-AAAAMMGG.
      *n   move  zeros    to  W8-AAAAMMGG.
      *L525-EX.
      *n   EXIT.
      *n
       L53-CHKFLD-TEOEROGABI.
      *------------------------------------- Data periodo teorico DAL*
           if H-PETPEERTD                     is  not  numeric
           then
               move
                   'valore di PETPEERTD /ADSPEERT non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
           if H-PETPEERTD                     =  zeros
           then
               move
                   'data inizio periodo teorico   non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
      *------------------------------------- Data periodo teorico  AL*
           if H-PETPEERTA                     is  not  numeric
           then
               move
                   'valore di PETPEERTA /ADSPEERT non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
           if H-PETPEERTA                     =  zeros
           then
               move
                   'data fine periodo teorico non presente.           '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
080116     if  H-PETPEERTA  >  W-PETPEERTA
           then
               move  H-PETPEERTA  to  W-PETPEERTA
080116     end-if.
131115*---- Per definire domande dove risultano giorni   teorici   *
      *---- inferiori a giorni   pagati - routine FPfinsiel        *
      *---- invocata automaticamente a variazione NASPI (v.L541-..)*
           move  'N'  to  W-SET-DTADEC.
           if  WL-PAGAMENTI  =  'S'       and
               W-ANFDIRETTI  =  'N'       and
               CNT-SOS       =  zeros     and
               IC-DCODTADEC  =  zeros     and
               IC-NASGIOIND  <  IC-PMEINDTOGG
           then
               move  'S'  to  W-SET-DTADEC
               perform  L531-SET-DTADEC  thru  L531-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L53-EX
               end-if
131115     end-if.
      *------------------------------------- Codice tipo prestazione *
           if H-PETCOTIPR                     is  not  numeric
           then
               move
                   'valore di PETCOTIPR /ADSPEERT non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
           if H-PETCOTIPR                     =  zeros
           then
               move
                   'codice tipo prestazione teorica non presente.     '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
      *------------------------------------- Giorni teorici erogabili*
           if H-PETNUGITE                     is  not  numeric
           then
               move
                   'valore di PETNUGITE /ADSPEERT non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
           if H-PETNUGITE                     >  zeros
           then  continue
           else
               move
                   'giorni teorici prestazione spettante non presenti.'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC3
               go  to  L53-EX
           end-if.
       L53-EX.
           EXIT.
      *                                                              *
131115 L531-SET-DTADEC.
      *------------ aggiungo 1 giorno  per impostare decadenza       *
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  H-PETPEERTA      to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA
           move  W8-MM            to  W6-MM
           move  W8-GG            to  W6-GG
           move  D6-GGMMAA        to  R10-DATA-I.
           move     1             to  R10-GIORNI.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-F  to  D6-GGMMAA
               move  W6-GG       to  W8-GG
               move  W6-MM       to  W8-MM
               move  W6-AA       to  W8-AAAA
               add   2000        to  W8-AAAA
               move  W8-AAAAMMGG  to  IC-DCODTADEC
           else
               move
                   'valore di IC-DCODTADEC non calcolato correttamente'
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
      *        go  to  L531-EX
           end-if.
131115 L531-EX.
           EXIT.
      *
301115 L533-SET-DTCODO.
      *------------ aggiungo 1 giorno  a decorrenza teorica presta-  *
      *------------ zione per impostare la completamento domanda     *
      *------------ a causa abend calcolo interessi legali se viene  *
      *------------ impostata la data di presentazione della domanda *
      *--------------------------- Calcolo PETPEERTD +  1  gg        *
           move  zero       to  W8-AAAAMMGG
                                D6-GGMMAA.
           move  zero       to  R10-DATA-I
                                R10-DATA-F
                                R10-GIORNI
                                R10-GIORNI-INDS
                                R10-GIORNI-DANF
                                R10-RC.
      *
           move  H-PETPEERTD      to  W8-AAAAMMGG.
           move  W8-AAAA          to  W6-AA.
           move  W8-MM            to  W6-MM.
           move  W8-GG            to  W6-GG.
           move  D6-GGMMAA        to  R10-DATA-I.
           move     1             to  R10-GIORNI.
      *
           CALL  RDSUT10  USING
                       WDFHEIBLK  WDFHCOMMAREA
                                  PER-RDSUT10 .
130218*    cancel  RDSUT10.
      *
           if  R10-RC   =  1
           then
               move  R10-DATA-F   to  D6-GGMMAA
               move  W6-GG        to  W8-GG
               move  W6-MM        to  W8-MM
               move  W6-AA        to  W8-AAAA
               add   2000         to  W8-AAAA
               move  W8-AAAAMMGG  to  IC-DCODTCODO
           else
               move
                   'valore di IC-DCODTCODO non calcolato correttamente'
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
      *        go  to  L533-EX
           end-if.
301115 L533-EX.
           EXIT.
      *
       L54-CARICOPET.
      *------------------------------------------------ Ordinaria
           if H-PETCOTIPR =  35   or   36
      *   rivedere anticipazione    or  =  37
           then
               if  IO-PET  <  100
               then
                   add   1    to  IO-PET
                   move H-PETPEERTD
                                         to  ICO-PETPEERTD(IO-PET)
                   move H-PETPEERTA
                                         to  ICO-PETPEERTA(IO-PET)
                   move H-PETNUGITE
                                         to  ICO-PETNUGITE(IO-PET)
301115             if  IO-PET      =  1
                   then
                       if  W-DATAPIU7  =  11111111
                       then
                           perform  L533-SET-DTCODO  thru  L533-EX
                       end-if
      *                if  W-DATAPIU7  =  99999999
      *                then
      *                    move
      *            'Errore calcolo: Data Completamento Domanda assente'
      *                                  to  W-CHK-CAMPI
      *                    move  'S'     to  W-ERRORE
      *                end-if
301115             end-if
               else
                   move
                   'Stabellamento per elementi ADSPEERT               '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   move  111     to  NDC3
                   perform TEOEROGABI-DB2-CLSCUR thru
                           TEOEROGABI-DB2-CLSCUR-EX
               end-if
           end-if.
      *------------------------------------------------ Speciale
      *n   if H-PETCOTIPR =  nn   or   nn
      *n   then
      *n       if  IS-PET  <  100
      *n       then
      *n           add   1    to  IS-PET
      *n           move H-PETPEERTD
      *n                                 to  ICS-PETPEERTD(IS-PET)
      *n           move H-PETPEERTA
      *n                                 to  ICS-PETPEERTA(IS-PET)
      *n           move H-PETNUGITE
      *n                                 to  ICS-PETNUGITE(IS-PET)
      *n       else
      *n           move
      *n           'Stabellamento per elementi ADSPEERT               '
      *n                         to  W-CHK-CAMPI
      *n           move  'S'     to  W-ERRORE
      *n           move  111     to  NDC3
      *n       end-if
      *n   end-if.
      *-------------------------------------------- per  L523       -*
      *n   if H-PETCOTIPR =  nn   or   nn
      *n   then
      *n       if H-PETPEERTA                     >  W-FINE-TEORICO
      *n       then
      *n           move H-PETPEERTA
      *n                            to  W-FINE-TEORICO
      *n       end-if
      *n       add H-PETNUGITE                  to  W-TOGG-TEORICO
      *n   end-if.
       L54-EX.
           EXIT.
      *
       L55-PENSIONI.
      *------------RIVEDERE: leggi con vista solo record
      *------------    dove PENCHIDOM  =  DCOCHIDOM
      *    move H-DCOCODFIS   to H-PENCODFIS .
           move H-DCOCHIDOM   to H-PENCHIDOM .
           move  zeros  to  I-PEN.
      *
           PERFORM  L55-DB2-DECL-CURS    THRU  L55-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                    until  (NDC1  >  99)
      *
             PERFORM  L55-DB2-FETCH    THRU  L55-DB2-FETCH-EX
             if  SQLCODE  =  0
             then
                  move  'S'           to  WL-TABPIENA
                  perform  L56-CHKFLD-PENSIONI    thru  L56-EX
                  if  (W-ERRORE   =  'N')
                  then
                       perform  L57-CARICOPEN    thru  L57-EX
                  else
                       perform  PENSIONI-DB2-CLSCUR thru
                                PENSIONI-DB2-CLSCUR-EX
                  end-if
              else
                  perform  PENSIONI-DB2-CLSCUR thru
                           PENSIONI-DB2-CLSCUR-EX
                  move  111    to  NDC1
             end-if
           end-perform.
      *-----------25/02/2013: no errore se record TDSPENSI non presente
      *    if WL-TABPIENA = 'N'
      *    then
      *        move  'S'     to  W-ERRORE
      *    else
               move  'N'     to  WL-TABPIENA.
      *    end-if.
       L55-EX.
           EXIT.
      *
       L56-CHKFLD-PENSIONI.
      *------------------------------------- Categoria pensione      *
           IF H-PENCATPEN                   is  not  numeric
           then
               move
                   'valore di PENCATPEN /ADSPENSI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC1
               go  to  L56-EX
           end-if.
      *------------------------------------- Progressivo pensione    *
           if H-PENPROPEN                   is  not  numeric
           then
               move
                   'valore di PENPROPEN /ADSPENSI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC1
               go  to  L56-EX
           end-if.
      *------------------------------------- Decorrenza  pensione    *
           if H-PENDTDEPE                   is  not  numeric
           then
               move
                   'valore di PENDTDEPE /ADSPENSI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC1
               go  to  L56-EX
           end-if.
      *------------------------------------- Importo     pensione    *
           if H-PENIMPPEE                   is  not  numeric
           then
               move
                   'valore di PENIMPPEE /ADSPENSI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111   to  NDC1
               go  to  L56-EX
           end-if.
       L56-EX.
           EXIT.
      *
       L57-CARICOPEN.
           if  I-PEN  <  5
           then
               add   1    to  I-PEN
               move H-PENCATPEN
                                     to  IC-PENCATPEN(I-PEN)
               move H-PENDTDEPE
                                     to  IC-PENDTDEPE(I-PEN)
               move H-PENIMPPEE
                                     to  IC-PENIMPPEE(I-PEN)
           else
               move
                   'Stabellamento per elementi ADSPENSI               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               perform  PENSIONI-DB2-CLSCUR thru
                        PENSIONI-DB2-CLSCUR-EX
           end-if.
       L57-EX.
           EXIT.
      *
      *------------------------- Verifica iban estero
280922 L59-IBANESTERO.
      *
           move  H-DCOCHIDOM  to  W-IBECHIDOM.
           perform  L59-DB2-SELECT  thru  L59-DB2-SELECT-EX.
           if  SQLCODE  =  +100
             move 'Pagamento bloccato per anomalia su iban estero.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L59-EX
           end-if.
           if  SQLCODE  =  zeros
           then  continue
           else  move
                 'errore in lettura di TDSIBES.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L59-EX
           end-if.
       L59-EX.
           EXIT.
      *------------------------- Verifica pag. Sussidi  incompatibili*
230620 L68-SUS-LD.
      *-------- Estensione  NASPI e DISCOLL -DL 34 del 2020          *
      *-------- Verifica pagamenti sussidi incompatibili, di cui:    *
      *--------   Emergenza Covid19  DL18 17/03/2020                 *
      *--------   art.27,28,29,30,38,44  di cui al DL 18/2020        *
      *--------   art.84 , 85 e 98 del  DL 34/2020                   *
      *-------- Esiste incompatibilità x pensione direttadalla decorr*
      *-------- e sospensione in caso di domanda APE e precoci       *
      *    Sussidi      - Cod. Prodotto  =  AG510 / AG520            *
      *    Bonus  LD    - Cod. Prodotto  =  DA001                    *
      *----------------------------------- lettura  ASTBC100         *
      *----------- sussidi
           move  zeros    to  CNT-C100
                              W-DCOFLASU.
           exec  SQL
               select  count(*)
               into    :CNT-C100
               from    ASTBC100
               where   AP_CODFIS        =  :W-COD-FISC
                  and  AP_CODSED        >  '0099'
                  and  (AP_COD_PRODOTTO =  'AG510'   or
                        AP_COD_PRODOTTO =  'AG511'   or
                        AP_COD_PRODOTTO =  'AG512'   or
                        AP_COD_PRODOTTO =  'AG513'   or
                        AP_COD_PRODOTTO =  'AG514'   or
                        AP_COD_PRODOTTO =  'AG515'   or
                        AP_COD_PRODOTTO =  'AG516'   or
                        AP_COD_PRODOTTO =  'AG517'   or
                        AP_COD_PRODOTTO =  'AG518'   or
                        AP_COD_PRODOTTO =  'AG519'   or
                        AP_COD_PRODOTTO =  'AG520'   or
                        AP_COD_PRODOTTO =  'AG521'   or
                        AP_COD_PRODOTTO =  'AG522'   or
                        AP_COD_PRODOTTO =  'AG524')
140921*------- i seguenti prodotti non sono incompatibili - Mongelli *
      *                                                              *
      *                 AP_COD_PRODOTTO =  'AG523'   or              *
      *                 AP_COD_PRODOTTO =  'AG525'   or              *
      *                 AP_COD_PRODOTTO =  'AG526'   or              *
      *                 AP_COD_PRODOTTO =  'AG527'   or              *
      *                 AP_COD_PRODOTTO =  'AG528'   or              *
      *                 AP_COD_PRODOTTO =  'AG529'   or              *
      *                 AP_COD_PRODOTTO =  'AG530'   or              *
      *                 AP_COD_PRODOTTO =  'AG531'   or              *
      *                 AP_COD_PRODOTTO =  'AG532'   or              *
      *                 AP_COD_PRODOTTO =  'AG533'   or              *
      *                 AP_COD_PRODOTTO =  'AG534'   or              *
      *                 AP_COD_PRODOTTO =  'AG535'   or              *
      *                 AP_COD_PRODOTTO =  'AG536'   or              *
      *                 AP_COD_PRODOTTO =  'AG537'   or              *
      *                 AP_COD_PRODOTTO =  'AG538'   or              *
      *                 AP_COD_PRODOTTO =  'AG539'   or              *
      *                 AP_COD_PRODOTTO =  'AG540'   or              *
      *                 AP_COD_PRODOTTO =  'AG541'   or              *
      *                 AP_COD_PRODOTTO =  'AG542'   or              *
140921*                 AP_COD_PRODOTTO =  'AG543')                  *
                  and  AP_DTELAB        >  '2020-04-01'
                  and  (AP_CODAPP       between
                               'AG601'  and  'AG849')
      *           and  AP_NUMPRA        like '2020%'
           end-exec.
      *
           if  SQLCODE  not  =  0   and   not  =  100
           then  move
                 'errore in lettura di ASTBC100.                    '
                               to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 go  to  L68-EX
           end-if.
           if  CNT-C100  >  zeroes
           then
               perform  L69-SUSS-NO  thru  L69-EX
               if  W-ERRORE  =  'S'
               then  go  to  L68-EX
               end-if
           end-if.
           if  CNT-C100  >  zeroes
           then  move
131020           'Pagati sussidi COVID-ripristinare periodi teorici.'
131020*          'Non pagabile: erogate  prestazioni incompatibili. '
                               to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 move   45     to  W-DCOFLASU
                 go  to  L68-EX
           end-if.
      *
      *----------- bonus LD
           exec  SQL
               select  count(*)
               into    :CNT-C100
               from    ASTBC100
               where   AP_CODFIS       =  :W-COD-FISC
                  and  AP_CODSED       >  '0099'
                  and  AP_COD_PRODOTTO =  'DA001'
                  and  AP_DTELAB       >  '2020-06-01'
                  and  (AP_CODAPP      between
                              'DA001'  and  'DA099')
                  and  AP_NUMPRA       like 'LDC19%'
           end-exec.
      *
           if  SQLCODE  not  =  0   and   not  =  100
           then  move
                 'errore in lettura di ASTBC100.                    '
                               to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 go  to  L68-EX
           end-if.
           if  CNT-C100  >  zeroes
           then  move
131020           'Pagati sussidi LD   -ripristinare periodi teorici.'
131020*          'Non pagabile: erogate  prestazioni incompatibili. '
                               to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 move   54     to  W-DCOFLASU
                 go  to  L68-EX
           end-if.
       L68-EX.
230620     EXIT.
      *----------------------- Verifica Sussidio decadenza=decorrenza*
131020 L69-SUSS-NO.
           move  zeros    to  CNT-C069.
           exec  SQL
               select  count(*)
               into    :CNT-C069
               from    TDSDATCO, TDSSUSST
               where   H_DCOCOSEGR      =  H_SSTCOSEDE
                  and  H_DCOCHIDOM      =  H_SSTCHIDOM
                  and  H_DCOCODFIS      =  :W-COD-FISC
                  and  H_DCOCOSEGR      >  '0099'
                  and  H_DCOCOTIDO      =  'E'
                  and  H_DCOANVEPR      =   2020
                  and  H_DCOCHIDOM      >  '8000000000000'
                  and  H_DCOULESSP      =  'D'
                  and  H_DCODTDECSP     =   H_SSTDADEC
                  and  H_DCOFLASU       <>  9
           end-exec.
      *
           if  SQLCODE  not  =  0   and   not  =  100
           then  move
                 'errore in lettura di TDSDATCO.                    '
                               to  W-CHK-CAMPI
                 move  'S'     to  W-ERRORE
                 go  to  L69-EX
           end-if.
           if  CNT-C069  >  zeroes
           then
               move  zeroes  to  CNT-C100
           end-if.
       L69-EX.
131020     EXIT.
      *
       E24-CALCOLO.
           move  99  to  OC-RETCODE.
      *
           if  W-XPDSNA02  =  'Y'
           then
               continue
           else
               go  to  E24-EX
           end-if.
      *------------------------------------------- Simulazione
           if  L-TIPOCALCOLO  =  'S'
           then
               move  'PDSNA13S'         to  IC-CHIAMANTE
               move  W-CALCOLO-AL-PIU1  to  IC-CALCOLOAL
           end-if.
      *------------------------------------------- Calcolo reale
           if  L-TIPOCALCOLO  =  'R'
           then
               move  'PDSNA13R'         to  IC-CHIAMANTE
      *
      *
161120         if (W-CODICEUNO  =   35
                            or  =   36)
021220            and  I-AUT    >  40
               then  go  to  E24-EX
161120         end-if
      *
      *        move  zeros              to  IC-CALCOLOAL
      *        move  W-CALCOLO-AL-REALE to  IC-CALCOLOAL
      *                    oppure DATA ODIERNA ?
           end-if.
      *----------------------------------- pgm test - calcolo       *
      *    if  LMATRICOLA  =   '24984000'
           if (W-CODICEUNO  =   35 or 36)
               if  W-NIK  =  'S'    and
101019             L-TIPOCALCOLO  =  'S'
               then
                   call  PDSNA42  USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  PER-CALCOLO L-CODICE-SEDE
      *-08-02-2019-cancel PDSNA42
               else
                   call  PDSNA02  USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  PER-CALCOLO L-CODICE-SEDE
      *-28-02-2019-cancel PDSNA02
               end-if
           end-if.
      *--------------------- rivedere
           if (W-CODICEUNO  =   37)
               call  PDSAU41  USING
                     WDFHEIBLK  WDFHCOMMAREA
                     COMMAREADS
                     PER-CALCOLO
               end-call
               cancel PDSAU41
           end-if.
      *
      *----------------------------------- x verifica date          *
           move  'NICOLA  '     to  IC-CHIAMANTE.
021220* SOLO PER DAL AL DIVERSI -andrebbe sempre eseguita!          *
021220*---- non mi è chiaro: commento la if                         *
      *    IF KNNO-DAL-IN-LK(1)   = KNNO-AL-IN-LK(1)    AND
      *       KUMERO-DAL-IN-LK(1) = KUMERO-AL-IN-LK(1)
      *    THEN
      *       CONTINUE
021220*    ELSE
              CALL  RDSNA12  USING
                                    WDFHEIBLK  WDFHCOMMAREA
                                    L-CODICE-SEDE
                                    L-CODICE-STOP
                                    L-NOME-SEDE
                                    L-NOME-STOP
                                    L-PROCEDURA
                                    PER-CALCOLO
                                    LAREA-D
                                    L-NUM-RIGA.
021220*    END-IF.

           if  W-NIK  =  'S'
           then
               move  'PDSRD02 -->'      to  S2A005
               move  OC-RETCODE         to  S2A007
               perform  S10-STAMPA     thru  S10-EX
           end-if.
      *--------------------------------- Definizione domande         *
      *            --- commentata il 16.1.2008 per verifiche varie   *
      *    if  W-ANFDIRETTI  =  'S'   or
      *        W-FRONTALIERI =  'S'
      *    then
      *        continue
      *    else
      *        perform  E29-DEFINIZIONE    thru  E29-EX
      *    end-if.
      *--------------------------------- Controlli pagamenti + / -   *
250717     if  OC-RETCODE  equal  zeroes
           then
220817         if  IC-PMESTAPAG  =  'C'
               then  continue
               else
250717             perform  E31-ANAGRAFICA   thru  E31-EX
                   if  W-ERRORE  =  'S'
                   then
                       move     94  to  OC-RETCODE
                       perform  S20-ELENCA       thru  S20-EX
                       go  to  E24-EX
                   end-if
               end-if
250717     end-if.
           if  OC-RETCODE  equal  zeroes
           then
               perform  E25-CONTROLLI  thru  E25-EX
           end-if.
           if  OC-RETCODE  equal  zeroes
           then
               if  OC-PMEIMULASE  >  2.00
               then
                   perform  E26-PAGABILI   thru  E26-EX
               else
                   perform  E27-DEFINITE   thru  E27-EX
               end-if
           end-if.
      *---------------------------------conta   Pagamenti > 4999 euro
270618     if  OC-RETCODE  equal  zeroes
           then
               IF    OC-PMEIMULASE > 4999
                     ADD   1   TO  CTR-ATT-PAGME
               END-IF
270618     end-if.
       E24-EX.
           EXIT.
      *
       E25-CONTROLLI.
      *--------------------------------> Controllo correlato in E25- *
271017*------------------- Verifica altri pagamenti stesso giorno    *
           if  W8-ODIERNA  =  IC-PMEDTELAB
           then
               if L-PROCEDURA               =  'G21'  OR
                                            =  'G96'  OR
                                            =  'G97'  OR
                                            =  'G98'  OR
                                            =  'G99'
               then
                   continue
               else
                   move  96  to  OC-RETCODE
                   string
                   'Avviso:   Prestazione non  pagabile oggi ma da'
                   ' Domani in poi.         ' delimited by size
                       into  OC-MESSAGGIO
               end-if
271017     end-if.
      *------------------- Verifica altre operazioni in corso        *
           move  IC-DCOCODFIS  to  LDCOCODFIS.
           move  W8-ODIERNA    to  LDATAODIERNA.
           move  spaces        to  LPAGAMENTO.
           move  L-CODICE-SEDE to  LSEDE-RDSPD13.
           move  IC-DCOCHIDOM  to  LDCOCHIDOM.
           CALL  RDSPD13  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 PER-RDSPD13 .
           cancel RDSPD13.
           if  LPAGAMENTO  =  'S'
           then
               if L-PROCEDURA               =  'G21'  OR
                                            =  'G96'  OR
                                            =  'G97'  OR
                                            =  'G98'  OR
                                            =  'G99'
               then
                   continue
               else
                   move  96  to  OC-RETCODE
                  string
271017             '**Avviso**  Prestazione in variazione;  non è '
                   'pagabile per 30 minuti. ' delimited by size
                        into OC-MESSAGGIO
      *           go  to  E25-EX
               end-if
           end-if.
      *
      *--------------------------------- Pagam. successivo coerente? *
           if  W-DATI-PAGME  =  'S'
           then
               if  OC-PMEINDTOTE  =  zeroes   and
                   OC-PMEINDUIME  =  zeroes   and
                   OC-PMEANFTOTE  =  zeroes   and
                   OC-PMEANFUIME  =  zeroes
               then
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR07 errato azzeramento   '
                                 to  OC-MESSAGGIO
                   go  to  E25-EX
               end-if
           end-if.
      *--------------------------------- Pagamento ANF/diretti       *
           if  W-ANFDIRETTI  =  'S'
           then
               if  OC-AADSTAPAG  =  'K'   or   'V'
               then
                   continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR06 esito non impostato  '
                                 to  OC-MESSAGGIO
                   go  to  E25-EX
               end-if
               go  to  E25-EX
           end-if.
      *n-------------------------------- Conguaglio frontalieri      *
      *n   if  W-FRONTALIERI =  'S'
      *n   then
      *n       go  to  E25-EX
      *n   end-if.
      *--------------------------------- Controllo esiti             *
      *n   if  OC-RETCODE  equal  zeroes
      *n   then
      *n       if  OC-DCOULESPP  =  'D'   or   'L'
      *n       then
      *n           continue
      *n       else
      *n           move  IC-DCOULESPP  to  OC-DCOULESPP
      *n       end-if
      *n       if  OC-DCOULESSP  =  'D'   or   'L'
      *n       then
      *n           continue
      *n       else
      *n           move  IC-DCOULESSP  to  OC-DCOULESSP
                   move  spaces        to  OC-DCOULESSP.
      *n       end-if
      *n   end-if.
      *-------------------------------------------- Esito possibile?
           if  OC-DCOULESPP   equal  spaces
      *n   and OC-DCOULESSP   equal  spaces
           then
               move  98  to  OC-RETCODE
               move  'Anomalia: KERR01 esito non impostato  '
                             to  OC-MESSAGGIO
               go  to  E25-EX
           end-if.
      *n
      *n   if  IC-DCOULESPP   equal  spaces
      *n   then
      *n       if  OC-DCOULESPP   equal  spaces
      *n       then
      *n           continue
      *n       else
      *n           move  98  to  OC-RETCODE
      *n           move  'Anomalia: KERR02 esito non compatibile'
      *n                     to  OC-MESSAGGIO
      *n           go  to  E25-EX
      *n       end-if
      *n   else
      *n       if  OC-DCOULESPP   equal  spaces
      *n       then
      *n           move  98  to  OC-RETCODE
      *n           move  'Anomalia: KERR03 esito non compatibile'
      *n                     to  OC-MESSAGGIO
      *n           go  to  E25-EX
      *n       end-if
      *n   end-if.
      *n
      *n   if  IC-DCOULESSP   equal  spaces
      *n   then
      *n       if  OC-DCOULESSP   equal  spaces
      *n       then
      *n           continue
      *n       else
      *n           move  98  to  OC-RETCODE
      *n           move  'Anomalia: KERR04 esito non compatibile'
      *n                     to  OC-MESSAGGIO
      *n           go  to  E25-EX
      *n       end-if
      *n   else
      *n       if  OC-DCOULESSP   equal  spaces
      *n       then
      *n           move  98  to  OC-RETCODE
      *n           move  'Anomalia: KERR05 esito non compatibile'
      *n                     to  OC-MESSAGGIO
      *n           go  to  E25-EX
      *n       end-if
      *n   end-if.
      *---------------- Controllo esiti contraddittori doppie prestaz*
      *n   if  OC-DCOULESPP  =  'L'   and
      *n       OC-DCOULESSP  =  'D'
      *n   then
      *n       move  98  to  OC-RETCODE
      *n       move  'Anomalia: KERR07 esito non compatibile'
      *n                 to  OC-MESSAGGIO
      *n       go  to  E25-EX
      *n   end-if.
      *n   if  OC-DCOULESPP  =  'D'   and
      *n       OC-DCOULESSP  =  'L'
      *n   then
      *n       move  98  to  OC-RETCODE
      *n       move  'Anomalia: KERR07 esito non compatibile'
      *n                 to  OC-MESSAGGIO
      *n       go  to  E25-EX
      *n   end-if.
      *---- i controlli che seguono  non  x le tipologie G98 e G99   *
290121     if  L-PROCEDURA                  =  'G98'  or
                                            =  'G99'
           then  go  to  E25-EX
290121     end-if.
      *----Deceduti: gestisco def.con indebito e pag. a terzi        *
270114     if  W-DATMORTE    >  zeroes
           then
               if  IC-DCODTADEC   >=   zeroes      and
                   OC-PMEULPEAL   <=   W-DATMORTE  and
                   OC-DCOULESPP   =    'D'         and
                   OC-PMEIMULASE  =    zeroes      and
                   OC-PMEINDUIME  <=   zeroes
               then  go  to  E25-EX
               end-if
               if  OC-PMEULPEAL   <=   W-DATMORTE  and
                   OC-DCOULESPP   =    'D'         and
                   OC-PMEIMULASE  =    zeroes      and
                   OC-PMEINDUIME  >    zeroes      and
      *            OC-PMEINDUIME  =    W-IMP-GPA10099
                   OC-PMEINDUIME  =    OC-RECIMUREE-1 + OC-RECIMUREE-3
               then  go  to  E25-EX
               end-if
160523*----Deceduti: gestione Riliquidazione Anticipazioni           *
      *    Non analizzata gestione dei pgm ponte                    *
      *    per celetità gestisco CF x  naspi ed anticipazione       *
      *        if  L-PROCEDURA    =  'G21'           and
      ***          IC-DCODTDECPP <=   W-DATMORTE     and
      *            OC-DCOULESPP   =   'D'            and
      ***          IC-NASGIOIND   =   OC-PMEINDTOGG  and
      ***          OC-PMEIMULASE  =   zeroes         and
      ***          OC-PMEINDUIME  >   zeroes         and
      ***          OC-PMEINDUIME  =   OC-RECIMUREE-1 + OC-RECIMUREE-3
               if    IC-DCOCODFIS   =  'RTNLSS74A04E897M'
070623           or  IC-DCOCODFIS   =  'FRAMRA66D07I301H'
               then  go  to  E25-EX
160523         end-if
      *
               move  96  to  OC-RETCODE
               move  'Non Gestibile *DECEDUTO* vedi msg 1654/2014'
                                 to  OC-MESSAGGIO
               go  to  E25-EX
270114     end-if.
      *
050916     if  W8-ODIERNA  <  20160905
           then
               if  W-ANF-DA062015  =  'N'   and
                   OC-PMEINDUIME  >=   zeroes
               then
                   move  BAK-PMEANFTOTE to  IC-PMEANFTOTE
                                            OC-PMEANFTOTE
                   move  BAK-PMEANFTOGG to  IC-PMEANFTOGG
                                            OC-PMEANFTOGG
               end-if
               if  W-ANF-DA062015  =  'N'       and
080916             IC-PMEANFTOTE  >    zeroes   and
                   OC-PMEINDUIME  <    zeroes
               then
                   move  95  to  OC-RETCODE
                   move  'Anomalia: ANF indebiti non calcolati  '
                                 to  OC-MESSAGGIO
                   go  to  E25-EX
               end-if
050916     end-if.
300919*------------- Blocco pag. con conguagli fiscali x cambio  CF  *
      *    if  W8-ODIGG       <  6
      *    then
      *        if  IC-PMESTAPAG   not  equal  "C"   and
      *            IC-DCOCODFIS   not  equal  IC-CODFISARCA
      *        then
      *            if  OC-PMECONFISE  >  zeroes
      *                OC-PMEADDREGE  >  zeroes   or
      *                OC-PMEADDCOME  >  zeroes   or
      *                OC-PME730UIME  >  zeroes
      *            then
101019**               move  'S'           to  WCF-COLLEGATO
      **               move  WL-PAGAMENTI  to  WCF-WL-PAG
      **               move  IC-DCOCODFIS  to  WCF-CODFIS
      **               move  IC-DCOCHIDOM  to  WCF-CHIDOM
101019**               move  'C'           to  WCF-STAPAG
      **
      *                move  98  to  OC-RETCODE
      *                move
      *                'Anomalia: Ass.Fiscale con CF variato. '
      **               'Anomalia: Cong.Fiscale con CF variato.'
      *                      to  OC-MESSAGGIO
      *                go  to  E25-EX
      *            end-if
      *        end-if
300919*    end-if.
221019*------------- Elimina conguagli da ass. fiscali x cambio  CF  *
           if  IC-PMESTAPAG   not  equal  "C"   and
               IC-DCOCODFIS   not  equal  IC-CODFISARCA
           then
               if  OC-PMECONFISE  not  equal  zeroes
               then  add  OC-PMECONFISE  to  OC-PMEIMULASE
                     move  zeroes        to  OC-PMECONFISE
                                             OC-FCONGAC
                                             OC-FCONGAP
               end-if
               if  OC-PMEADDREGE  not  equal  zeroes
               then  add  OC-PMEADDREGE  to  OC-PMEIMULASE
                     move  zeroes        to  OC-PMEADDREGE
                                             OC-FIMPREGAC
                                             OC-FIMPREGAP
               end-if
               if  OC-PMEADDCOME  not  equal  zeroes
               then  add  OC-PMEADDCOME  to  OC-PMEIMULASE
                     move  zeroes        to  OC-PMEADDCOME
                                             OC-FIMPCOMAC
                                             OC-FIMPCOMAP
               end-if
               if  OC-PME730UIME  not  equal  zeroes
               then  add  OC-PME730UIME  to  OC-PMEIMULASE
                     move  zeroes        to  OC-PME730UIME
                                             OC-IMPORTO7
                     move  spaces        to  OC-CODICE7
               end-if
221019     end-if.
       E25-EX.
           EXIT.
      *
       E26-PAGABILI.
200918*------------- blocco per pagamenti effettivi <  10 euro       *
200918*------------- per domande non in definizione                  *
070621*------------- per i soli pagamenti successivi al primo        *
070621     if  OC-PMEINDUIME  <  OC-PMEINDTOTE  and
               OC-PMEIMULASE  <  10.00   and
               OC-DCOULESPP   =  'L'     and
               L-TIPOCALCOLO  =  'R'
           then
               move  98  to  OC-RETCODE
               move
               'Importo da erogare con prossimo pagamento mensile'
                         to  OC-MESSAGGIO
               go  to  E26-EX
           end-if.
200918*--------------------------------------------Trattenute sindac.*
           if  IC-PMETOTRSIE  >  zeros
           then
               if  OC-PMETOTRSIE  >  zeros
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 tot. Trattenute Sind.'
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
      *--------------------------------------------Indennità totale  *
           if  IC-PMEINDTOTE  >  zeros
           then
               if  OC-PMEINDTOTE  >  zeros
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 totale Indennità     '
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
      *--------------------------------------------ANF       totale  *
           if  IC-PMEANFTOTE  >  zeros
           then
               if  OC-PMEANFTOTE  >  zeros
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 totale ANF           '
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
      *--------------------------------------------Sindacale ultima  *
           if  OC-PMEUITRSIE  >  zeros
           then
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMETOTRSIE  -  IC-PMETOTRSIE  -  OC-PMEUITRSIE )
               if  W-E-CALCOLI  <  0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 quadratura Tratt.Sind'
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
      *--------------------------------------------Indennità ultima  *
           if  OC-PMEINDUIME  >  zeros
           then
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMEINDTOTE  -  IC-PMEINDTOTE  -  OC-PMEINDUIME )
               if  W-E-CALCOLI  <  0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 quadratura indennità '
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
080916*------------------------------ Prestazione indebita           *
           if  OC-PMEINDUIME  <   zeroes
           then
               move  OC-PMEINDUIME  to  W-INDEB-IND
               multiply   -1        by  W-INDEB-IND
               move  W-INDEB-IND    to  OC-PINDINDEB
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMEINDTOTE  -  IC-PMEINDTOTE )
               if  W-E-CALCOLI   >  -0.0100   and
                   W-E-CALCOLI   <   0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 squadratura indebito '
                              to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
080916     end-if.
      *--------------------------------------------ANF       ultima  *
           if  OC-PMEANFUIME  >  zeros
           then
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMEANFTOTE  -  IC-PMEANFTOTE  -  OC-PMEANFUIME )
               if  W-E-CALCOLI  <  0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 quadratura ANF       '
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
080916*------------------------------ ANF         indebiti           *
           if  OC-PMEANFUIME  <   zeroes
           then
               move  OC-PMEANFUIME  to  W-INDEB-ANF
               multiply   -1        by  W-INDEB-ANF
               move  W-INDEB-ANF    to  OC-PANFINDEB
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMEANFTOTE  -  IC-PMEANFTOTE )
               if  W-E-CALCOLI   >  -0.0100   and
                   W-E-CALCOLI   <   0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 squadratura indebito '
                              to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
080916     end-if.
      *--------------------------------------------Inizio e Fine     *
           if  OC-PMEULPEDAL  equal  zeros
           then
               move  98  to  OC-RETCODE
               move  'Anomalia: KERR11 data inizio mancante '
                             to  OC-MESSAGGIO
               go  to  E26-EX
           end-if.
           if  OC-PMEULPEDAL  >  20150100
           then  continue
           else
               move  98  to  OC-RETCODE
               move  'Anomalia: KERR11 data inizio < 2015   '
                             to  OC-MESSAGGIO
               go  to  E26-EX
           end-if.
           if  OC-PMEULPEAL  equal  zeros
           then
               move  98  to  OC-RETCODE
               move  'Anomalia: KERR12 data fine   mancante '
                             to  OC-MESSAGGIO
               go  to  E26-EX
           end-if.
290719*------------------------------ PEI Detenuti luglio 2019       *
           if  W-DCDCSC      =  30103   and
               OC-PMEULPEAL  >  20190304
           then
               move  98  to  OC-RETCODE
               move  'Data fine pag. invalida; msg 909/2019 '
                           to  OC-MESSAGGIO
               go  to  E26-EX

290719     end-if.
      *------------------------------ data fine calcolo Reale        *
           if  L-TIPOCALCOLO  =  'R'      and
              (W-CODICEUNO  =   35 or 36)
           then
               if  OC-PMEULPEAL  >  W8-ODIERNA
               then
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR13 data fine   errata   '
                                 to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
301118*------------------------------ per errore periodo ANFdiretti  *
           if  L-TIPOCALCOLO  =  'R'             and
              (W-CODICEUNO    =   35 or 36)      and
              (OC-PMEIMULASE  =  OC-PMEANFUIME)  and
              (OC-PMEULPEAL   <  OC-PMEULPEDAL)
           then
               move  OC-PMEULPEAL  to  OC-PMEULPEDAL
           end-if.
301118*------------------------------ Anno corrente                  *
           if  OC-FACIMPONIBILE   >  zeroes   or
               OC-FACTREDICESIMA  >  zeroes
           then
               if  OC-FACDAL      >  zeroes   and
                   OC-FACAL       >  zeroes
               then
                   continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR21 periodo AC mancante  '
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
               if  OC-FACGGPREST  >  zeroes   and
                   OC-FACGGPREST  <  370
               then
                   continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR22 gg/prest. AC mancante'
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
      *------------------------------ Anno precedente                *
           if  OC-FAPIMPONIBILE   >  zeroes   or
               OC-FAPTREDICESIMA  >  zeroes
           then
               if  OC-FAPDAL      >  zeroes   and
                   OC-FAPAL       >  zeroes
               then
                   continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR31 periodo AP mancante  '
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
               if  OC-FAPGGPREST  >  zeroes
               then
                   continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR32 gg/prest. AP mancante'
                             to  OC-MESSAGGIO
                   go  to  E26-EX
               end-if
           end-if.
      *------------------------------ Giorni prestazione             *
           if  OC-PMEULPEGG   not  <
               (OC-FACGGPREST  +  OC-FAPGGPREST)
           then
               continue
           else
               move  98  to  OC-RETCODE
               move  'Anomalia: KERR41 ULPEGG <> GG(AC+AP)  '
                             to  OC-MESSAGGIO
               go  to  E26-EX
           end-if.
       E26-EX.
           EXIT.
      *
       E27-DEFINITE.
      *------------------------------ Prestazione indebita           *
           if  OC-PMEINDUIME  <   zeroes
           then
               move  OC-PMEINDUIME  to  W-INDEB-IND
               multiply   -1        by  W-INDEB-IND
290816         move  W-INDEB-IND    to  OC-PINDINDEB
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMEINDTOTE  -  IC-PMEINDTOTE )
               if  W-E-CALCOLI   >  -0.0100   and
                   W-E-CALCOLI   <   0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 squadratura indebito '
                              to  OC-MESSAGGIO
                   go  to  E27-EX
               end-if
           end-if.
      *------------------------------ ANF         indebiti           *
           if  OC-PMEANFUIME  <   zeroes
           then
               move  OC-PMEANFUIME  to  W-INDEB-ANF
               multiply   -1        by  W-INDEB-ANF
290816         move  W-INDEB-ANF    to  OC-PANFINDEB
               move  zeroes  to  W-E-CALCOLI
               compute  W-E-CALCOLI  =
                 ( OC-PMEANFTOTE  -  IC-PMEANFTOTE )
               if  W-E-CALCOLI   >  -0.0100   and
                   W-E-CALCOLI   <   0.0100
               then  continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia: KERR08 squadratura indebito '
                              to  OC-MESSAGGIO
                   go  to  E27-EX
               end-if
           end-if.
200416*------------------------------ Azzeramento importi            *
           if  OC-PMEIMULASE  >  0      and
               OC-PMEIMULASE  <  2.01
           then
               perform  E28-UPD-IMPO   thru  E28-EX
               if  OC-PMEIMULASE  =  zeros
               then  move
                     'Domanda elaborabile per definizione.  '
                              to  OC-MESSAGGIO
               else
                   move  98  to  OC-RETCODE
                   STRING
                     'Non vi sono somme erogabili per la prestazione.'
                     ' Verificare Recuperi / Acconti '
                   DELIMITED BY SIZE
                          into  OC-MESSAGGIO
                   go  to  E27-EX
               end-if
200416     end-if.
      *------------------------------ definizione prestazione        *
           if  OC-DCOULESPP      =  'D'  and
190224        (W-CODICEUNO  =   35  or  36  or  37)
           then
               move  spaces     to  OC-DCOULESSP
190224         go  to  E27-EX
      *        if  OC-DCOULESSP  =  spaces
      *n        or OC-DCOULESSP  =  'D'        or
      *n           OC-DCOULESSP  =  'R'
      *        then
      *            go  to  E27-EX
      *        end-if
           end-if.
      *n   if  OC-DCOULESSP  =  'D'
      *n   then
      *n       if  OC-DCOULESPP  =  spaces     or
      *n           OC-DCOULESPP  =  'D'        or
      *n           OC-DCOULESPP  =  'R'
      *n       then
      *n           go  to  E27-EX
      *n       end-if
      *n   end-if.
      *-------------------------------------------- Assegno=Recupero?
           move  98  to  OC-RETCODE.
      *    move  'Anomalia: KERR91 (non in definizione) '
      *                      to  OC-MESSAGGIO.
              STRING 'Non vi sono somme erogabili per la prestazione: '
               '(vedi recuperi / pagamenti) ' DELIMITED BY SIZE
                           INto  OC-MESSAGGIO.
       E27-EX.
           EXIT.
      *
       E28-UPD-IMPO.
280916     move  zeroes       to  W-E-CALCOLI.
           if  OC-PMEINDUIME   >  OC-RECIMUREE-1
           then
               compute  W-E-CALCOLI  =
                      OC-PMEINDUIME  -  OC-RECIMUREE-1
           end-if.
280916     if  OC-RECIMUREE-1  >  zeros   and
               W-E-CALCOLI     <  2.6100  and
               IC-PMEINDTOTE   =  zeros   and
               OC-RECIMUREE-2  =  zeros   and
               OC-RECIMUREE-3  =  zeros   and
      *---------- I seguenti dovrebbero essere a zero o Assegno = 10  *
               OC-PMECONFISE   =  zeros   and
               OC-PMEADDREGE   =  zeros   and
               OC-PMEADDCOME   =  zeros   and
               OC-PME730UIME   =  zeros
           then
      *------------------------ .. dati TDSPAGME                    *
               move  zeroes         to  OC-PMETOTRSIE
                                        OC-PMEUITRSIE
               move  OC-RECIMUREE-1 to  OC-PMEINDTOTE
                                        OC-PMEINDUIME
               move  OC-RECIMUREE-1 to  OC-PMEORDTOTE
                                        OC-PMEORDUIME
               move  IC-PMEANFTOTE  to  OC-PMEANFTOTE
               move  zeroes         to  OC-PMEANFUIME
                                        OC-PMEULANFG
               move  zeros          to  OC-PMEINLEPRE
                                        OC-PMEINLEANE
               move  zeroes         to  OC-PMEIMULASE
               move  zeros          to  OC-PMETOIRNCE
                                        OC-PMEULIRN1E
                                        OC-PMETOIRNPE
                                        OC-PMEULIRNSE
               move  zeroes         to  OC-PMECONFISE
                                        OC-PMEADDREGE
                                        OC-PMEADDCOME
                                        OC-PME730UIME
               move  zeroes         to  OC-PMEAUTTOTE
                                        OC-PMEAUTTOGG
                                        OC-PMEAUTUIME
                                        OC-PMEULAUTGG
      *------------------------------------- Sezione dati contabili  *
      *n   move  OC-UNTERZO     to  H-x0UNTERZO
      *n   move  OC-META        to  H-x0META
      *n   move  OC-META-O      to  H-x0METAO
      *n   move  OC-GAU3014     to  H-x0GAU3014
      *n   move  OC-GAT3014     to  H-x0GAT3014
      *n   move  OC-IMPORTO-ORD to  H-x0IMPORD
      *n   move  OC-IMPORTO-SPE to  H-x0IMPSPE
      *n   move  OC-IMPORTO-SPE2 to H-x0IMPSPE2
      *------------------------------------- Sezione dati fiscali    *
               move  zeroes     to  OC-FACDAL
                                    OC-FACAL
                                    OC-FACGGPREST
                                    OC-FACIMPONIBILE
                                    OC-FACTREDICESIMA
                                    OC-FACIMPLORDA
                                    OC-FACGGDETRAZ
                                    OC-FACIMPDETRAZ
      *          OC-FACIMPNETTA  vedi H-D0PMEULIRn1
               move  zeroes     to  OC-FAPDAL
                                    OC-FAPAL
                                    OC-FAPGGPREST
                                    OC-FAPIMPONIBILE
                                    OC-FAPTREDICESIMA
                                    OC-FAPALIQMEDIA
                                    OC-FAPIMPLORDA
                                    OC-FAPGGDETRAZ
                                    OC-FAPIMPDETRAZ
      *        OC-FAPIMPNETTA       vedi  H-D0pmeulirns
      *        OC-FADINIZIO         vedi  H-D0pmeulpeda
      *        OC-FADFINE           vedi  H-D0pmeulpeal
      *        OC-FADANFPAGATI      vedi  H-D0pmeanfuim + H-D0pmeinlean
      *        OC-FADRECSUANF       vedi  H-D0recimure2
      *        OC-FADRECSUIND       vedi  H-D0recimure1 + H-D0recimure3
      *        OC-FADTRATSIND       vedi  H-D0pmeuitrsi
      *        OC-FADNETTOPAG       vedi  H-D0pmeimulas
               move  zeroes     to  OC-FCONGAC
                                    OC-FCONGAP
                                    OC-FIMPREGAC
                                    OC-FIMPREGAP
                                    OC-FIMPPROAC
                                    OC-FIMPPROAP
                                    OC-FCODCOMUN
                                    OC-FIMPCOMAC
                                    OC-FIMPCOMAP
      *
               move  spaces     to  OC-FCODPAGA1
                                    OC-FCODPAGA2
                                    OC-FCODPAGA3
               move  zeroes     to  OC-FIMPPAGA1
                                    OC-FIMPPAGA2
                                    OC-FIMPPAGA3
               move  zeroes     to  OC-FACIMPDETRFAM
                                    OC-FACIMPDETRLAV
      *---------------------------------5.5.2005 Campi x contabilizz.*
               move  spaces     to  OC-CODICE1
                                    OC-CODICE2
                                    OC-CODICE3
                                    OC-CODICE4
                                    OC-CODICE5
                                    OC-CODICE6
                                    OC-CODICE7
                                    OC-CODICE8
                                    OC-CODICE9
               move  zeroes     to  OC-IMPORTO1
                                    OC-IMPORTO2
                                    OC-IMPORTO3
                                    OC-IMPORTO4
                                    OC-IMPORTO5
                                    OC-IMPORTO6
                                    OC-IMPORTO7
                                    OC-IMPORTO8
280916                              OC-IMPORTO9
           end-if.
      *---------------------------------------------
200416     if  OC-RECIMUREE-1  =  zeros   and
               OC-RECIMUREE-2  =  zeros   and
               OC-RECIMUREE-3  =  zeros   and
      *---------- I seguenti dovrebbero essere a zero o Assegno = 10  *
               OC-PMECONFISE   =  zeros   and
               OC-PMEADDREGE   =  zeros   and
               OC-PMEADDCOME   =  zeros   and
               OC-PME730UIME   =  zeros
           then  continue
           else
               go  to  E28-EX
           end-if.
      *------------------------ .. dati TDSPAGME                    *
           move  IC-PMETOTRSIE  to  OC-PMETOTRSIE .
           move  zeroes         to  OC-PMEUITRSIE .
           move  IC-PMEINDTOTE  to  OC-PMEINDTOTE .
      *    move  OC-PMEINDTOGG  to                .
170619     if    OC-PMEINDUIME  >   zeros
           then  move  zeroes   to  OC-PMEINDUIME
           end-if.
           move  IC-PMEORDTOTE  to  OC-PMEORDTOTE .
      *    move  OC-PMEORDTOGG  to                .
170619     if    OC-PMEORDUIME  >   zeros
           then  move  zeroes   to  OC-PMEORDUIME
           end-if.
      *    move  OC-PMEULPEGG   to                .
           move  IC-PMEANFTOTE  to  OC-PMEANFTOTE .
      *    move  OC-PMEANFTOGG  to                .
170619     if    OC-PMEANFUIME  >   zeros
           then  move  zeroes   to  OC-PMEANFUIME
           end-if.
           move  zeroes         to  OC-PMEULANFG  .
      *    move  OC-PANFINDEB   to                .
           move  IC-PMEINLEPRE  to  OC-PMEINLEPRE .
           move  IC-PMEINLEANE  to  OC-PMEINLEANE .
           move  zeroes         to  OC-PMEIMULASE .
      *    move  OC-PMEULPEDAL  to                .
      *    move  OC-PMEULPEAL   to                .
           move  IC-PMETOIRNCE  to  OC-PMETOIRNCE .
           move  zeroes         to  OC-PMEULIRN1E .
           move  IC-PMETOIRNPE  to  OC-PMETOIRNPE .
           move  zeroes         to  OC-PMEULIRNSE .
           move  IC-PMECONFISE  to  OC-PMECONFISE .
           move  IC-PMEADDREGE  to  OC-PMEADDREGE .
           move  IC-PMEADDCOME  to  OC-PMEADDCOME .
           move  IC-PME730UIME  to  OC-PME730UIME .
           move  IC-PMEAUTTOTE  to  OC-PMEAUTTOTE .
           move  IC-PMEAUTTOGG  to  OC-PMEAUTTOGG .
           move  zeroes         to  OC-PMEAUTUIME .
           move  zeroes         to  OC-PMEULAUTGG .
      *------------------------------------- Sezione dati contabili  *
      *n   move  OC-UNTERZO     to  H-x0UNTERZO .
      *n   move  OC-META        to  H-x0META    .
      *n   move  OC-META-O      to  H-x0METAO   .
      *n   move  OC-GAU3014     to  H-x0GAU3014 .
      *n   move  OC-GAT3014     to  H-x0GAT3014 .
      *n   move  OC-IMPORTO-ORD to  H-x0IMPORD  .
      *n   move  OC-IMPORTO-SPE to  H-x0IMPSPE  .
      *n   move  OC-IMPORTO-SPE2 to H-x0IMPSPE2 .
      *------------------------------------- Sezione dati fiscali    *
           move  zeroes         to  OC-FACDAL
                                    OC-FACAL
                                    OC-FACGGPREST
                                    OC-FACIMPONIBILE
                                    OC-FACTREDICESIMA
                                    OC-FACIMPLORDA
                                    OC-FACGGDETRAZ
                                    OC-FACIMPDETRAZ .
      *          OC-FACIMPNETTA  vedi H-D0PMEULIRn1
           move  zeroes         to  OC-FAPDAL
                                    OC-FAPAL
                                    OC-FAPGGPREST
                                    OC-FAPIMPONIBILE
                                    OC-FAPTREDICESIMA
                                    OC-FAPALIQMEDIA
                                    OC-FAPIMPLORDA
                                    OC-FAPGGDETRAZ
                                    OC-FAPIMPDETRAZ .
      *        OC-FAPIMPNETTA       vedi  H-D0pmeulirns
      *        OC-FADINIZIO         vedi  H-D0pmeulpeda
      *        OC-FADFINE           vedi  H-D0pmeulpeal
      *        OC-FADANFPAGATI      vedi  H-D0pmeanfuim + H-D0pmeinlean
      *        OC-FADRECSUANF       vedi  H-D0recimure2
      *        OC-FADRECSUIND       vedi  H-D0recimure1 + H-D0recimure3
      *        OC-FADTRATSIND       vedi  H-D0pmeuitrsi
      *        OC-FADNETTOPAG       vedi  H-D0pmeimulas
           move  zeroes         to  OC-FCONGAC
                                    OC-FCONGAP
                                    OC-FIMPREGAC
                                    OC-FIMPREGAP
                                    OC-FIMPPROAC
                                    OC-FIMPPROAP
                                    OC-FCODCOMUN
                                    OC-FIMPCOMAC
                                    OC-FIMPCOMAP .
      *
           move  spaces         to  OC-FCODPAGA1
                                    OC-FCODPAGA2
                                    OC-FCODPAGA3 .
           move  zeroes         to  OC-FIMPPAGA1
                                    OC-FIMPPAGA2
                                    OC-FIMPPAGA3 .
           move  zeroes         to  OC-FACIMPDETRFAM
                                    OC-FACIMPDETRLAV.
      *---------------------------------5.5.2005 Campi x contabilizz.*
           move  spaces         to  OC-CODICE1
                                    OC-CODICE2
                                    OC-CODICE3
                                    OC-CODICE4
                                    OC-CODICE5
                                    OC-CODICE6
                                    OC-CODICE7
                                    OC-CODICE8
                                    OC-CODICE9 .
           move  zeroes         to  OC-IMPORTO1
                                    OC-IMPORTO2
                                    OC-IMPORTO3
                                    OC-IMPORTO4
                                    OC-IMPORTO5
                                    OC-IMPORTO6
                                    OC-IMPORTO7
                                    OC-IMPORTO8
200416                              OC-IMPORTO9 .
       E28-EX.
           EXIT.
      *n
      *E29-DEFINIZIONE.
      *n   move  spaces         to  W-AGGPAGME.
      **
      **   valori di OC-RETCODE                                      *
      **     1: 'La domanda non è da calcolare.                    ' *
      **     2: 'Il calcolo ed il pagamento risultano già eseguiti.' *
      **     3: 'Uno dei periodi presenta anomalie da correggere.  ' *
      **     4: 'Non è presente l'importo giornaliero del pagamento' *
      **     5: 'La domanda è relativa ad un anno non gestito.     ' *
      **     6: 'Non permane lo stato di disoccupazione.           ' *
      **     7: 'Una o più date non risultano corrette.            ' *
      **     8: 'Il modello DS56 non risulta rientrato.            ' *
      **     9: 'Anomalia non gestibile nel calcolo dell'IRPEF.    ' *
      **    96:  presente domanda con data esito odierna             *
      **    98:  errore e messaggi impostati da PDSNA13              *
      **    97:  errore e messaggi impostati da PDSRD21              *
      **    96:  Non Gestibile *DECEDUTO* vedi msg 1654/2014         *
      **    95:  Anomalia: ANF indebiti non calcolati                *
      **    94:  Errore nella consultazione dari ARCA                *
      *n   if  OC-RETCODE  =  0   or   1   or   2   or   6
      *n   then
      *n       continue
      *n   else
      *n       go to  E29-EX
      *n   end-if.
      **
      *n   if  OC-DCOULESPP  =  'D'
      *n   then
      **       if  OC-DCOULESSP  =  spaces     or
      **           OC-DCOULESSP  =  'D'        or
      **           OC-DCOULESSP  =  'R'
      **       then
      **           if  OCO-PEEPEERED(1)  >  zeros
      **           then
      *n               go  to  E29-EX
      **           end-if
      **       end-if
      *n   end-if.
      *n   if  OC-DCOULESSP  =  'D'
      *n   then
      **       if  OC-DCOULESPP  =  spaces     or
      **           OC-DCOULESPP  =  'D'        or
      **           OC-DCOULESPP  =  'R'
      **       then
      **           if  OCS-PEEPEERED(1)  >  zeros
      **           then
      *n               go  to  E29-EX
      **           end-if
      **       end-if
      *n   end-if.
      **
      *n   call  PDSRD21  USING
      *n             WDFHEIBLK  WDFHCOMMAREA
      *n         PER-CALCOLO  L-CODICE-SEDE
      *n   end-call.
      *n   cancel PDSRD21.
      **
      *n   if  OC-RETCODE          =  77      and
      *n       OC-MESSAGGIO(1:10)  =  'NOADSPAGME'
      *n   then
      *n       move  'N'            to  W-AGGPAGME
      *n       move  zeroes         to  OC-RETCODE
      *n       move  spaces         to  OC-MESSAGGIO
      *n   end-if.
      *E29-EX.
      *n   EXIT.
      *n
      *
       E30-AGGIORNA.
      *-------------------------------------------- Contatori
           if  OC-PMEIMULASE  >  2.00
           then
               add   1              to  CTR-PAGATE
290816         go  to  E30-CTR
           end-if.
           if  OC-PMEINDUIME  <  zeros
290816     or  OC-PMEANFUIME  <  zeros
           then
               add 1                to  CTR-INDEBITE
290816         go  to  E30-CTR
           end-if.
           if  OC-PMEIMULASE  <  2.01   and
               OC-PMEIMULASE  >= 0
           then
               add   1              to  CTR-DEFINITE
           end-if.
290816 E30-CTR.
      *-------------------------------------------- Simulazione      *
           if  L-TIPOCALCOLO  =  'S'
           then
               add   1   to  CTR-SCR-APPO
               move  1   to  TDSREPORT-NUM-RPT
               perform  S30-STAMPA        thru  S30-EX
               go  to  E30-EX
           end-if.
040615*-------------------------------------------- Msg errore ?     *
           if  W-CHK-CAMPI    =  spaces
           then  continue
           else
150915*------------- causa errata impostazione PCALCOLATI.TDSRPG00   *
150915*        add   1   to  CTR-SCR-APPO
               move  5   to  TDSREPORT-NUM-RPT
               perform  S30-STAMPA        thru  S30-EX
               go  to  E30-EX
           end-if.
      *-------------------------------------------- Pagamento reale  *
           move  W-PROCEDURA      to  H-N0PROCEDURA.
           move  L-CODICE-STOP    to  H-N0DCOCENOPE.
           move  L-CODICE-SEDE    to  H-N0COSEDE.
           move  IC-DOMANDA       to  H-N0DOMANDA.
      *-------------------------------- Scrivo per lettura invalida  *
      *    move  'N'              to  WS-APPOGGIO.
           perform  E30-DB2-SELECT  thru  E30-DB2-SELECT-EX.
      *
           if  SQLCODE  not  =  zeros
                perform E33-DATI-APPOGGIO  thru  E33-EX
                perform E30-DB2-INSERT thru E30-DB2-INSERT-EX
                if  SQLCODE  =  zeros
                then
      *               add   1                  to  CTR-SCR-APPO
                      move  'S'                to  WS-APPOGGIO
                      move  'S'                to  FLG-COMMIT
      *---------------------Aggiornamento file Sospeso prime prove  *
      *---------------------sbloccato il 28/05/2015                 *
                      perform  E35-UPD-FILE    thru  E35-EX
                      move  'CALCOLATA '       to  S2A005
                      move  spaces             to  S2A006
                                                   S2A007
      *
                      if  OC-PMEIMULASE  >  zeros
                      then
                          continue
                      else
                          if  OC-PMEINDUIME  <  zeros
                          then
                              move  'INDEBITA  '   to  S2A006
                          end-if
                      end-if
                      perform  S05-STAMPA-2   thru  S05-EX
                      perform  S10-STAMPA     thru  S10-EX
                end-if
           else
                 move  'READ      '       to  S2A005
                 move  'TDSAPNA0  '       to  S2A006
                 move  FST-TDSAPNA0       to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
                 add   1                  to  CTR-LET-APPO
           end-if.
       E30-EX.
           EXIT.
      *
       E31-ANAGRAFICA.
           move  spaces           to  FLD-1
                                      FLD-2.
           initialize  C14-I-AREA
                       C14-O-AREA.
           move  'L'              to  I-SISTEMA.
           move  'L'              to  I-RICHIESTA.
           move  091              to  I-ARCHGE.
           move  'A'              to  I-PROGETTO.
           move  'F'              to  I-TIPO-KEY.
      *
           STRING H-DCOCODFIS  L-CODICE-SEDE
                  DELIMITED BY SIZE INTO  I-CODIND .
      *
           move  spaces           to  I-PASSWORD.
           move  L-CODICE-STOP    to  I-CODSTOP.
           move  LMATRICOLA       to  I-UTENTE.
      *
           CALL  RDSUT14  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 C14-I-AREA   C14-O-AREA .
           cancel RDSUT14.
      *
           if  O-RETURN-CODE    =  spaces
      *    or  AI-TIPO-RISPOSTA  not =  'U'
           then
               continue
           else
               if  W-NIK  =  'S'
               then
                   move  'Dati anagrafici non disponibili '
      *                                  to  AI-COGNOME
                                         to  IC-COMPATTO
                                             W-CHK-CAMPI
200423             move  IC-DCOCODFIS  to  IC-CODFISARCA
                   go  to  E31-EX
               else
                   move 'Dati anagrafici non disponibili '
                                         to  W-CHK-CAMPI
                                             out-messaggio
                   move  'S'    to  W-ERRORE
                   go  to  E31-EX
               end-if
           end-if.
      *
           if  O-CFVALID  =  'S'
           then
               move  O-CODICE-FISCALE  to  IC-CODFISARCA
           else
               move  "Codice fiscale  non validato.   "
                                       to  IC-COMPATTO
                                           W-CHK-CAMPI
                                           out-messaggio
               move  O-CODICE-FISCALE  to  IC-CODFISARCA
               move  "S"  to  W-ERRORE
               go  to  E31-EX
           end-if.
      *
230620     if  IC-DCOCODFIS  =  IC-CODFISARCA
           then  go  to  E31-SALTO1
230620     end-if.
131115*----------------------------- Verifica Blocco pagamento x CF  *
           move  IC-CODFISARCA         to  LK-CODFIS.
           move  'N'                   to  LK-RISP.
           call  RDSUT28  using
                 WDFHEIBLK  WDFHCOMMAREA
                 PER-RDSUT28.
280218*    cancel  RDSUT28.
           if  LK-RISP =  'S'
           then  move
               'Pagamenti bloccati x il Codice Fiscale: vedi SCUP '
                                       to  W-CHK-CAMPI
                                           out-messaggio
               move  'S'  to  W-ERRORE
               go  to  E31-EX
131115     end-if.
      *
230620*    if (IC-DCOFLASU     =  60)   and
131020     if (IC-DCOFLASU     =  60  or  62  or  70)
              and
              (W-CODICEUNO     =  35  or  36)
           then
               move  IC-CODFISARCA     to  W-COD-FISC
               perform  L68-SUS-LD     thru  L68-EX
               if  W-ERRORE  =  'S'
               then  go  to  E31-EX
               end-if
               if  CNT-C100  >  zeroes
               then  move
                 'Non pagabile: erogate  prestazioni incompatibili. '
                       to  out-messaggio
                   move  'S'  to  W-ERRORE
                   go  to  E31-EX
230620         end-if
131020     end-if.
      *        if  L-TIPOCALCOLO   =  'R'
      *        then
      *            if  CNT-C100  >  zeroes
      *            then  perform   E391-DB2-UPD-DATCO
      *                     thru   E391-DB2-UPD-DATCO-EX
      *            then
      *                move  W-DCOFLASU     to  IC-DCOFLASU
      *                move  IC-DCODTDECSP  to  IC-DCODTADEC
      *                move  zeroes         to  IC-DCODTDECSP
      *            end-if
      *------------- le seguenti 6 commentate il 131020              *
220720*            if  (IC-DCODTADEC  >   zeroes)   and
      *                (IC-DCODTADEC  <=  IC-DCODTDECSP)
      *            then
      *                move  W-DCOFLASU     to  IC-DCOFLASU
      *                move  zeroes         to  IC-DCODTDECSP
220720*            end-if
      *        else
      *            if  W-ERRORE  =  'S'
      *            then  go  to  E31-EX
      *            end-if
      *        end-if
230620*    end-if.
      *
230620 E31-SALTO1.
      *
      *    move  O-CODICE-FISCALE  to  IC-CODFISARCA.
           move  O-COGNOME         to  WIC-COGNOME
                                       FLD-1.
           move  spaces            to  FLD-1(27:6).
           move  O-NOME            to  WIC-NOME
                                       FLD-2.
      *------------------------------ Dati compattati per Video/Stampa
           move    32              to  NDC1.
           perform  until  NDC1           <  1   or
                           BT-1(NDC1) not = space
               compute  NDC1  =  NDC1  -  1
           end-perform.
           move  '/'             to  BT-1(NDC1  +  1)
           compute  NDC1  =  (NDC1)  +  2.
           move    1             to  NDC2.
           perform  until  NDC1  >  32
               move  BT-2(NDC2)  to  BT-1(NDC1)
               compute  NDC1  =  NDC1  +  1
               compute  NDC2  =  NDC2  +  1
           end-perform.
           move  FLD-1           to  IC-COMPATTO.
      *
           move  O-COGNACQU      to  WIC-ACQUISITO.
           move  O-DATNASCI      to  WIC-DTNASCITA.
051213*-------------------Verifica data decesso                      *
           move  zeros           to  W-8CIFRE.
           move  O-DATMORTE      to  R-8STRINGA.
           if  W-8CIFRE   is  numeric
           then
               if  W-8CIFRE  >  zeros
               then  move  "Presente data decesso in ARCA   "
270114*                                    to  IC-COMPATTO
031115*                                    to  W-CHK-CAMPI
                                           to  out-messaggio
      *            move  O-DATMORTE        to  IC-xxxxxxARCA
181213*            move  "S"  to  W-ERRORE
181213             move  W-8CIFRE          to  W-DATMORTE
               end-if
250717*    else
      *        if  W-NIK  =  'S'
      *        then  move  'Data morte non decifrabile      '
      *                        to  IC-COMPATTO   W-CHK-CAMPI
250717*        end-if
051213     end-if.
270321*------------------------------ Verifica titolarità            *
020421*--- verifica sospesa: troppi casi dovuti a iban UBI modificati*
160421*--- verifica riattivata: iban verrà ritenuto valido v-mail RP *
           if  IC-DCOCOOBAN  =  spaces
280922       AND  H-DCOIBAN  not = 'EEEE'
           then  continue
           else
               perform  E312-TITOLARITA  thru  E312-EX
               if  W-ERRORE  =  'S'
               then  go  to  E31-EX
               end-if
270321     end-if.
      *
       E31-EX.
           EXIT.
      *
250717 E311-NO-ARCA.
           move  'NO CALL/ARCA                    '
                                   to  IC-COMPATTO.
           move  IC-DCOCODFIS      to  IC-CODFISARCA.
      *------------------------------------- Data nascita
           move  zeros                to  W8-AAAAMMGG
                                          WIC-DTNASCITA.
      *------------------------------------- Anno
           move  IC-DCOCODFIS(7:2)    to  W8-AAAA.
           if  W8-AAAA  >  35
           then
               add   1900  to  W8-AAAA
           else
               add   2000  to  W8-AAAA
           end-if.
           if  W8-ODIAA      >  W8-AAAA
           then
               continue
           else
               subtract  100  from  W8-AAAA
           end-if.
      *------------------------------------- Mese
           evaluate  IC-DCOCODFIS(9:1)
             when  'A'  move  '01'  to  W8-MM
             when  'B'  move  '02'  to  W8-MM
             when  'C'  move  '03'  to  W8-MM
             when  'D'  move  '04'  to  W8-MM
             when  'E'  move  '05'  to  W8-MM
             when  'H'  move  '06'  to  W8-MM
             when  'L'  move  '07'  to  W8-MM
             when  'M'  move  '08'  to  W8-MM
             when  'P'  move  '09'  to  W8-MM
             when  'R'  move  '10'  to  W8-MM
             when  'S'  move  '11'  to  W8-MM
             when  'T'  move  '12'  to  W8-MM
           end-evaluate.
      *------------------------------------- Giorno                  *
           move  IC-DCOCODFIS(10:2) to W8-GG.
           if  W8-GG  >  40
           then
               subtract  40        from  W8-GG
           end-if.
      *
           move  W8-AAAAMMGG     to  WIC-DTNASCITA.
           move  spaces          to  WIC-ACQUISITO.
      *-------------------         data decesso                      *
           move  zeros           to  W-8CIFRE.
           move  W-8CIFRE        to  W-DATMORTE.
       E311-EX.
250717     EXIT.
      *
270321*------------------------------ Verifica titolarità            *
       E312-TITOLARITA.
      *------------------------- solo x pagamento G19/G20/G21        *
           if  L-PROCEDURA  =  'G19'
                        or  =  'G20'
                        or  =  'G21'
           then  continue
           else  go  to  E312-EX
           end-if.
      *-------------------------   no x definite senza pagamento     *
           if  OC-DCOULESPP   =  'D'      and
               OC-PMEIMULASE  <   2.01
           then
                 go  to  E312-EX
           end-if.
      *
      *****                           LCFIB-IBAN = pic x(40)         *
           initialize  LCFIB-INPUT
                       LCFIB-OUTPUT.
      *****move  W-COORDINATE    to  LCFIB-IBAN.
280922     IF H-DCOIBAN  = 'EEEE'
280922       move W-IBEIBAEST    to  LCFIB-IBAN
280922     ELSE
             move  IC-DCOCOIBAN  to  LCFIB-IBAN
280922     END-IF.
           move  IC-CODFISARCA   to  LCFIB-CF.
      ***** AG020 x DISCOLL  &  AG021 x Antic.NASPI

110521     if  W-NIK  =  'S'
           then  display  LCFIB-INPUT
           end-if.

           call  PNBTCFIB
                   using  PNLKCFIB
           end-call.
      **%%solo per test elena
      **%% move 'OK'  to LCFIB-STATO
      **%% move 'S'   to LCFIB-F-CERT
      **%%

      *    cancel  PNBTCFIB.
      *
110521     if  W-NIK  =  'S'
           then  display  LCFIB-OUTPUT
           end-if.

           if  LCFIB-STATO   =  'OK'
           then
110521         if  LCFIB-F-CERT  =  'S'
220922*        or  LCFIB-F-CERT  =  'E'
               then  continue
               else  move
                  'Titolarità CF-IBAN non verificata: vedi SCUP.     '
                                       to  W-CHK-CAMPI
                                           out-messaggio
                   move  'S'  to  W-ERRORE
                   go  to  E312-EX
               end-if
           else
110521         move  LCFIB-DESCR   to  W-CHK-CAMPI
                                       out-messaggio
               move  'S'  to  W-ERRORE
               go  to  E312-EX
           end-if.
       E312-EX.
270321     EXIT.
      *
       E33-DATI-APPOGGIO.
           initialize  DCLTDSAPNA0.
      *
           move  W-PROCEDURA    to  H-N0PROCEDURA .
           move  L-CODICE-STOP  to  H-N0DCOCENOPE .
           move  IC-DOMANDA     to  H-N0DOMANDA .
      *------------------------ ..dati da PDSNA02 a TDSAPNA0        *
           move  W8-ODIERNA     to  H-N0DATAELABO .
           move  W-PROGRESSIVO  to  H-N0PROGRESSI .
           move  L-CODICE-SEDE  to  H-N0COSEDE.
           move  'N'            to  H-N0RECPAGATO .
           move  IC-COMPATTO    to  H-N0COMPATTO .
           move  WIC-ACQUISITO  to  H-N0ACQUISITO .
           move  IC-CODFISARCA  to  H-N0CFISCALE .
      *------------------------ .. dati comuni                      *
           move  IC-DCOCODFIS   to  H-N0DCOCODFIS .
           move  IC-DCOCOTIDO   to  H-N0DCOCOTIDO .
           move  IC-DCOCHIDOM   to  H-N0DCOCHIDOM .
           move  IC-DCOPENS     to  H-N0DCOPENS   .
           move  IC-DCOANFRIC   to  H-N0DCOANFRIC .
           move  OC-DCOULESPP   to  H-N0DCOULESPP .
           if  OC-DCOULESPP  =  'L'   or   'D'
           then
               move  W8-ODIERNA to  H-N0DCODTULPP
           end-if.
           move  IC-DCODTDECPP  to  H-N0DCODTDEPP .
           move  IC-DCOCODPAT   to  H-N0DCOCODPAT .
      *-31/01/2013 SOSTITUITO OBAN Con IBAN                         *
270321*-----prima di memorizzare IC-DCOCOIBAN occorre variare pgm   *
270321*-----nei quali viene usato/stampato il valore IBAN           *
270321*    move  IC-DCOCOIBAN   to  H-N0DCOCOIBAN .
280922     IF H-DCOIBAN  = 'EEEE'
280922       move  W-IBEIBAEST    to  H-N0DCOCOIBAN
280922     ELSE
             move  IC-DCOCOOBAN   to  H-N0DCOCOIBAN
280922     END-IF.
           move  IC-DCODTCODO   to  H-N0DCODTCODO .
           move  IC-DCOINT      to  H-N0DCOINT  .
131115     if  W-SET-DTADEC  =  'S'
           then
               move  zeros          to  H-N0DCODTADEC
           else
               move  IC-DCODTADEC   to  H-N0DCODTADEC
131115     end-if.
      *------------------------ .. dati DISCOLL                     *
090817*    if (W-CODICEUNO  =   36)
      *    then
           move  IC-DICGIOIND   to  H-N0DICGIOIND.
           move  IC-DICIMPGIO   to  H-N0DICIMPGIO.
           move  IC-DICCOUTIL   to  H-N0DICCOUTIL.
      *    end-if.
060721*------------- memorizzo ultimo importo 'decalage' NASPI
      *------------- nel campo della DISCOLL
           if (W-CODICEUNO  =   35)
           then
               if  OC-PMEUONNCOE  >  zeroes
               then
                   move  zeroes  to  W-DIFFERENZA
                   compute  W-DIFFERENZA  =
                         OC-PMEUONNCOE   -  IC-PMEUONNCOE
                   move  W-DIFFERENZA   to  H-N0DICIMPGIO
               end-if
060721     end-if.
140921*------------- memorizzo giornate lavoro ultimi 12 mesi       *
      *------------- nel campo della DISCOLL
           if (W-CODICEUNO  =   35)
           then
      *        if  W-NASGGLAV12  <  30
               if  H-DCODTPRDO   >  20210001
               then
                   move  W-NASGGLAV12  to  H-N0DICGIOIND
               end-if
140921     end-if.
      *------------------------ .. dati per statistica NASPI        *
      *    if (W-CODICEUNO  =   35)
      *    then
      *    move  IC-            to  H-N0DICGIOIND
      *    move  IC-            to  H-N0DICIMPGIO
      *    move  IC-            to  H-N0DICCOUTIL
090817*    end-if.
      *------------------------ .. dati NASPI                       *
           move  IC-NASGIOIND   to  H-N0NASGIOIND .
           move  IC-NASIMPGIOTE to  H-N0NASIMPGIOTE.
           move  IC-NASGIOCOUT  to  H-N0NASGIOCOUT.
      *------------------------ .. dati sindacato                   *
           move  IC-DSICODSIN   to  H-N0DSICODSIN .
           move  IC-DSICATSIN   to  H-N0DSICATSIN .
      *------------------------ .. dati recuperi                    *
           move  IC-RECTOREEE-1 to  H-N0RECTOREE1 .
           move  OC-RECTORERE-1 to  H-N0RECTORER1
           move  OC-RECIMUREE-1 to  H-N0RECIMURE1 .
           move  IC-RECIMPRAE-1 to  H-N0RECIMPRA1 .
      *
           move  IC-RECTOREEE-2 to  H-N0RECTOREE2 .
           move  OC-RECTORERE-2 to  H-N0RECTORER2
           move  OC-RECIMUREE-2 to  H-N0RECIMURE2 .
           move  IC-RECIMPRAE-2 to  H-N0RECIMPRA2 .
      *
           move  IC-RECTOREEE-3 to  H-N0RECTOREE3 .
           move  OC-RECTORERE-3 to  H-N0RECTORER3
           move  OC-RECIMUREE-3 to  H-N0RECIMURE3 .
      *------------------------ .. dati comuni DS                   *
           move  IC-DCDCOUFCO   to  H-N0DCDCOUFCO .
           move  IC-DCDDTCALA   to  H-N0DCDDTCALA .
           move  IC-DCDQUAPRE   to  H-N0DCDQUAPRE .
011221     if  IC-FLGANTICIP  =  'Q'
           then
               move  'Q'        to  H-N0DCDQUAPRE
011221     end-if.
      *------------------------ .. dati ultimo pagamento            *
           if  OC-PMEDTRICA  =   zeros
           then
               move  OC-PMEULPEAL   to  H-N0PMEDTRICA
           else
               move  OC-PMEDTRICA   to  H-N0PMEDTRICA
           end-if.
           move  OC-PMETOTRSIE  to  H-N0PMETOTRSI .
           move  OC-PMEUITRSIE  to  H-N0PMEUITRSI .
           move  OC-PMEINDTOTE  to  H-N0PMEINDTOT .
           move  OC-PMEINDTOGG  to  H-N0PMEINDTOG .
           move  OC-PMEINDUIME  to  H-N0PMEINDUIM .
           move  OC-PINDINDEB   to  H-N0PINDINDEB .
           move  OC-PMEULPEGG   to  H-N0PMEULPEGG .
300119*------ ripristino dati indennità indebita su domande elab.
      *------ per pagamento ANFdiretti
           if  W-ANFDIRETTI   =  'S'     and
               OC-PMEINDUIME  =  zeros   and
               IC-PMEINDUIME  <  zeros
           then
               move  IC-PMEINDUIME  to  H-N0PMEINDUIM
               move  IC-PMEINDUIME  to  W-INDEB-IND
               multiply   -1        by  W-INDEB-IND
               move  W-INDEB-IND    to  H-N0PINDINDEB
300119     end-if.
           move  OC-PMEANFTOTE  to  H-N0PMEANFTOT .
           move  OC-PMEANFTOGG  to  H-N0PMEANFTOG .
           move  OC-PMEANFUIME  to  H-N0PMEANFUIM .
           if  OC-PMEULANFG   =  zeroes
           then
               if  OC-PMEANFUIME  >  zeroes
               then
                   compute  W-CALCOLI  rounded  =
                        OC-PMEULPEGG  /  30  *  26
                   move  W-CALCOLI  to  H-N0PMEANFUGG
               end-if
           else
               move  OC-PMEULANFG   to  H-N0PMEANFUGG
           end-if.
           move  OC-PANFINDEB   to  H-N0PANFINDEB .
           move  OC-PMEINLEPRE  to  H-N0PMEINLEPR .
           move  OC-PMEINLEANE  to  H-N0PMEINLEAN .
           move  OC-PMEIMULASE  to  H-N0PMEIMULAS .
           move  OC-PMEULPEDAL  to  H-N0PMEULPEDA .
           move  OC-PMEULPEAL   to  H-N0PMEULPEAL .
           move  OC-PMETOIRNCE  to  H-N0PMETOIRNC .
           move  OC-PMEULIRN1E  to  H-N0PMEULIRN1 .
           move  OC-PMETOIRNPE  to  H-N0PMETOIRNP .
           move  OC-PMEULIRNSE  to  H-N0PMEULIRNS .
           move  OC-PMECONFISE  to  H-N0PMECONFIS .
           move  OC-PMEADDREGE  to  H-N0PMEADDREG .
           move  OC-PMEADDCOME  to  H-N0PMEADDCOM .
           move  OC-PME730UIME  to  H-N0PMER730UIM.
           move  OC-PMEAUTTOTE  to  H-N0PMEAUTTOTE.
           move  OC-PMEAUTTOGG  to  H-N0PMEAUTTOGG.
           move  OC-PMEAUTUIME  to  H-N0PMEAUTUIME.
           move  OC-PMEULAUTGG  to  H-N0PMEULAUTGG.
      *------------------------------------- Sezione dati contabili  *
      *n
      *n   move  OC-UNTERZO     to  H-x0UNTERZO .
      *n   move  OC-META        to  H-x0META    .
      *n   move  OC-META-O      to  H-x0METAO   .
      *n   move  OC-GAU3014     to  H-x0GAU3014 .
      *n   move  OC-GAT3014     to  H-x0GAT3014 .
      *n   move  OC-IMPORTO-ORD to  H-x0IMPORD  .
      *n   move  OC-IMPORTO-SPE to  H-x0IMPSPE  .
      *n   move  OC-IMPORTO-SPE2 to H-x0IMPSPE2 .
      *------------------------------------- Sezione ANF diretti    *
           move  IC-AADRECUP    to  H-N0AADRECUP  .
           move  OC-AADIMPSPE   to  H-N0AADIMPSPE .
           move  OC-AADSTAPAG   to  H-N0AADSTAPAG .
      *------------------------------------- Sezione dati fiscali    *
           move  OC-FACDAL      to  H-N0FACDAL  .
           move  OC-FACAL       to  H-N0FACAL   .
           move  OC-FACGGPREST  to  H-N0FACGGPRES .
           move  OC-FACIMPONIBILE
                                to  H-N0FACIMPONI .
           move  OC-FACTREDICESIMA
                                to  H-N0FACTREDIC .
           move  OC-FACIMPLORDA to  H-N0FACIMPLOR .
           move  OC-FACGGDETRAZ to  H-N0FACGGDETR .
020119*  per elab.  W8-ODIERNA  >  20181231
           if  OC-FACGGDETRAZ    >  OC-FACGGPREST
           then  move
                 OC-FACGGPREST  to  H-N0FACGGDETR
020119     end-if.
           move  OC-FACIMPDETRAZ
                                to  H-N0FACIMPDET .
      *    move  OC-FACIMPNETTA      vedi H-D0pmeulirn1
      *
           move  OC-FAPDAL      to  H-N0FAPDAL  .
           move  OC-FAPAL       to  H-N0FAPAL   .
           move  OC-FAPGGPREST  to  H-N0FAPGGPRES .
           move  OC-FAPIMPONIBILE
                                to  H-N0FAPIMPONI .
           move  OC-FAPTREDICESIMA
                                to  H-N0FAPTREDIC .
           move  OC-FAPALIQMEDIA
                                to  H-N0FAPALIQME .
           move  OC-FAPIMPLORDA to  H-N0FAPIMPLOR .
           move  OC-FAPGGDETRAZ to  H-N0FAPGGDETR .
020119*  per elab.  W8-ODIERNA  >  20181231
           if  OC-FAPGGDETRAZ    >  OC-FAPGGPREST
           then  move
                 OC-FAPGGPREST  to  H-N0FAPGGDETR
020119     end-if.
           move  OC-FAPIMPDETRAZ
                                to  H-N0FAPIMPDET .
      *        OC-FAPIMPNETTA       vedi  H-D0pmeulirns
      *        OC-FADINIZIO         vedi  H-D0pmeulpeda
      *        OC-FADFINE           vedi  H-D0pmeulpeal
      *        OC-FADANFPAGATI      vedi  H-D0pmeanfuim + H-D0pmeinlean
      *        OC-FADRECSUANF       vedi  H-D0recimure2
      *        OC-FADRECSUIND       vedi  H-D0recimure1 + H-D0recimure3
      *        OC-FADTRATSIND       vedi  H-D0pmeuitrsi
      *        OC-FADNETTOPAG       vedi  H-D0pmeimulas
           move  OC-FCONGAC     to  H-N0FCONGAC .
           move  OC-FCONGAP     to  H-N0FCONGAP .
           move  OC-FIMPREGAC   to  H-N0FIMPREGAC .
           move  OC-FIMPREGAP   to  H-N0FIMPREGAP .
           move  OC-FIMPPROAC   to  H-N0FIMPPROAC .
           move  OC-FIMPPROAP   to  H-N0FIMPPROAP .
           move  OC-FCODCOMUN   to  H-N0FCODCOMUN .
           move  OC-FIMPCOMAC   to  H-N0FIMPCOMAC .
           move  OC-FIMPCOMAP   to  H-N0FIMPCOMAP .
      *
           move  OC-FCODPAGA1   to  H-N0FCODPAGA1 .
           move  OC-FIMPPAGA1   to  H-N0FIMPPAGA1 .
           move  OC-FCODPAGA2   to  H-N0FCODPAGA2 .
           move  OC-FIMPPAGA2   to  H-N0FIMPPAGA2 .
           move  OC-FCODPAGA3   to  H-N0FCODPAGA3 .
           move  OC-FIMPPAGA3   to  H-N0FIMPPAGA3 .
      *
           move  OC-FACIMPDETRFAM
                                to  H-N0FACDETFAM .
           move  OC-FACIMPDETRLAV
                                to  H-N0FACDETLAV .
      *---------------------------------5.5.2005 Campi x contabilizz.*
           move  OC-CODICE1     to  H-N0CODICE1 .
           move  OC-IMPORTO1    to  H-N0IMPORTO1 .
           move  OC-CODICE2     to  H-N0CODICE2 .
           move  OC-IMPORTO2    to  H-N0IMPORTO2 .
           move  OC-CODICE3     to  H-N0CODICE3 .
           move  OC-IMPORTO3    to  H-N0IMPORTO3 .
           move  OC-CODICE4     to  H-N0CODICE4 .
           move  OC-IMPORTO4    to  H-N0IMPORTO4 .
           move  OC-CODICE5     to  H-N0CODICE5 .
           move  OC-IMPORTO5    to  H-N0IMPORTO5 .
           move  OC-CODICE6     to  H-N0CODICE6 .
           move  OC-IMPORTO6    to  H-N0IMPORTO6 .
           move  OC-CODICE7     to  H-N0CODICE7 .
           move  OC-IMPORTO7    to  H-N0IMPORTO7 .
           move  OC-CODICE8     to  H-N0CODICE8 .
           move  OC-IMPORTO8    to  H-N0IMPORTO8 .
           move  OC-CODICE9     to  H-N0CODICE9 .
           move  OC-IMPORTO9    to  H-N0IMPORTO9 .
      *
300421*    if  W8-ODIERNA  <  20170831
      *    then  go  to  E33-EX
300421*    end-if.
280817*------x NASPI----x Maldera------- x statistica NASPI 1° pag. *
           if  WL-PAGAMENTI   =  'N'
           then
               perform  E331-CONTA-BLKPA   thru  E331-BLKPA-EX
280817*    end-if.
300421*--- x statistica: flag x naspi con < 30 gg - 01/01 23/03 2021 *
               if  W-FLGTDSBLKPA  =  'Y'
               then  continue
               else
                   if  W-NASGGLAV12   <   30
                   then
                       if  H-DCODTPRDO   >  20210001   and
                           H-DCODTPRDO   <  20210324
                       then
                           move  'Y'    to  W-FLGTDSBLKPA
                       end-if
                   end-if
               end-if
300421     end-if.
           move  W-N0CODICE9    to  H-N0CODICE9.
280817     move  W-N0IMPORTO9   to  H-N0IMPORTO9.
       E33-EX.
           EXIT.
      *
280817 E331-CONTA-BLKPA.
           move 'E331-CONTA-BLKPA' to  WABNDB-LABEL.
           move  0                 to  WRK-CONTA-BLKPA.
      *
           EXEC SQL
           SELECT
                COUNT(*)
           INTO
                :WRK-CONTA-BLKPA
              FROM   TDSBLKPA
              WHERE
                     H_BLKCODFIS    =  :IC-DCOCODFIS
                     or
                     H_BLKCODFIS    =  :IC-CODFISARCA
           END-EXEC.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSBLKPA=' DCLTDSBLKPA
               move 'TDSBLKPA'    to  WABNDB-TABL
               move 'SELECT '     to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
           if  WRK-CONTA-BLKPA  >  0
           then  move  'Y'     to  W-FLGTDSBLKPA
           else  move  'N'     to  W-FLGTDSBLKPA
           end-if.
      *
       E331-BLKPA-EX.
280817     EXIT.
      *
       E35-UPD-FILE.
      *-------------------------------------- Riscrivo DATICOMUNI
           if  WL-DATICOMUNI  =  'S'
           then
      *n       if  W-FRONTALIERI  =  'S'
      *n       then
      *n           perform  E391-UPD-DATICOMUNI-F  thru  E391-EX
      *n       end-if
               if  W-ANFDIRETTI   =  'S'
               then
                   perform  E392-UPD-DATICOMUNI-A  thru  E392-EX
               else
                   perform  E40-UPD-DATICOMUNI     thru  E40-EX
               end-if
           else
               go  to  E35-EX
           end-if.
      *---------------------------RIVEDERE    ???
      *    if  W-FINE-ELABORA     =  'S'   or
      *        W-FINE-INTERVALLO  =  'S'
      *    then
      *        go  to  E35-EX
      *    end-if.
      *-------------------------------------- Riscrivo RECUPERI
           if  WL-RECUPERI  =  'S'
           then
               perform  E43-UPD-RECUPERI       thru  E43-EX
           end-if.
      *
      *-------------------------------------- Scrivo   EFFEROGATI
      *n   if  (OC-DCOULESPP   =  'D'    and
      *n       (OC-DCOULESSP   =  spaces  or
      *n           =  'R'  or  =  'D'))        or
      *n       (OC-DCOULESSP   =  'D'    and
      *n       (OC-DCOULESPP   =  spaces  or
      *n           =  'R'  or  =  'D'))
      **-no per anticipazione/discoll -                              *
           if (W-CODICEUNO  =   35)
           then
090519*        if  OC-DCOULESPP   =  'D'
090519*        then
                   if  W-ANFDIRETTI  =  'S'
      *            or  W-FRONTALIERI =  'S'
                   then
                       continue
                   else
                       perform  E45-DLT-EFFEROGATI     thru  E45-EX
                       perform  E46-WRT-EFFEROGATI     thru  E46-EX
                   end-if
090519*        end-if
           end-if.
      *-----------DISCOLL cessazioni 2022 --- Scrivo   EFFEROGATI
280122     if (W-CODICEUNO  =   36)
           then
               if  IC-DCDDTCALA  >  20211231
               then
                   perform  E45-DLT-EFFEROGATI     thru  E45-EX
                   perform  E46-WRT-EFFEROGATI     thru  E46-EX
               end-if
280122     end-if.
      **-si per anticipazione  per calcolo gg da detrarre, no figur. *
           if (W-CODICEUNO  =   37)
           then
               if  OC-DCOULESPP   =  'D'
               then
                   if  OC-PMEULPEGG  >  zeros
                   then
                       perform  E45-DLT-EFFEROGATI     thru  E45-EX
                          move  IC-DCODTDECPP   to  OCO-PEEPEERED(1)
                          move  IC-AASDTFINE    to  OCO-PEEPEEREA(1)
                          move  OC-PMEULPEGG    to  OCO-PEENUGIEE(1)
                       perform  E46-WRT-EFFEROGATI     thru  E46-EX
                   end-if
               end-if
           end-if.
      *-------------------------------------- Riscrivo SITUAZIONE
           if  WL-SITUAZIODO  =  'S'
           then
               if  W-ANFDIRETTI  =  'S'  or
                   W-FRONTALIERI =  'S'
               then
                   perform E35-DB2-SIT-UPD thru E35-DB2-SIT-UPD-EX
               else
                   perform  E47-UPD-SITUAZIODO     thru  E47-EX
               end-if
           end-if.
      *-------------------------------------- Riscrivo TEOEROGABI    *
      *No  if  WL-TEOEROGABI  =  'S'
      *No  then
      *No      perform  E48-UPD-TEOEROGABI     thru  E48-EX
      *No  end-if.
      *-------------------------------------- Aggiorno PAGAMENTI
           if  W-AGGPAGME     =  'N'
           then
               continue
           else
               if  WL-PAGAMENTI   =  'S'
               then
                   perform  E51-UPD-PAGAMENTI      thru  E51-EX
               else
                   perform  E52-WRT-PAGAMENTI      thru  E52-EX
               end-if
           end-if.
           move  spaces         to  W-AGGPAGME.
      *-------------------------------------- Riscrivo ANF diretti   *
      *I-no per anticipazione/discoll -                              *
           if (W-CODICEUNO  =   35 )
           then
               if  WL-ANFDIR      =  'S'
               then
                   perform  E53-UPD-ANFDIR         thru  E53-EX
               end-if
           end-if.
      *
      *-------------------------------------- Riscrivo AUT.LAvoratori*
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35 or 36)
           then
               if  WL-AUTLASPI    =  'S'
               then
                   perform  E55-UPD-AUTLASPI       thru  E55-EX
               end-if
           end-if.
      *-------------------------------------- Scrivo storico ANF     *
      *I-no per anticipazione7discoll -                              *
           if (W-CODICEUNO  =   35 )
           then
               if  IC-ANFDTDEVA(1)  >  zeros
               then
                   perform  E65-WRT-STOANF         thru  E65-EX
               end-if
           end-if.
      *-------------------------------------- Scrivo storico SOS     *
      *I-no per anticipazione   -------                              *
           if (W-CODICEUNO  =   35 or 36)
           then
               if  IC-SOSDTINSOS(1)  >  zeros
               then
                   perform  E66-WRT-STOSOS         thru  E66-EX
               end-if
           end-if.
180523*-------------------------------------- Scrivo storico AUTLA   *
           if (W-CODICEUNO  =   35 or 36)
           then
               if  IC-AUTPROGR(1)  >  zeros
               then
                   perform  E67-WRT-STOAUTLA       thru  E67-EX
               end-if
           end-if.
      *-------------------------------------- incremento ctr calcolat*
           if  FLG-COMMIT  =  'S'
           then
               add  1   to  CTR-SCR-APPO
           end-if.
       E35-EX.
           EXIT.
      *n
      *E391-UPD-DATICOMUNI-F.
      *n   if  W-DCOULESPP  =  'L'
      *n   then
      *n       move  'D'  to H-DCOULESPP
      *n   end-if.
      *n
      *n   move  zeroes        to H-DCOFLASU    .
      *n   move  OC-DCOPESTDI  to H-DCOPESTDI   .
      *n   move  'N'           to H-DCOTRDOCE   .
      *n   move  'N'           to H-DCOTRDODO   .
      *n   PERFORM E391-DB2-COM-UPD THRU E391-DB2-COM-UPD-EX.
      *E391-EX.
      *n   EXIT.
      *n
       E392-UPD-DATICOMUNI-A.
           if  W-DCOULESPP  =  'L'
           then
               move  'D'  to H-DCOULESPP
           end-if.
      *n   if  W-DCOULESSP  =  'L'
      *n   then
      *n       move  'D'  to H-DCOULESSP
      *n   end-if.
      *
           move  W8-ODIERNA    to H-DCODTULPP   .
           move  OC-AADSTAPAG  to H-DCOANFRIC   .
           move  OC-DCOPESTDI  to H-DCOPESTDI   .
           move  'N'           to H-DCOTRDOCE   .
           move  'N'           to H-DCOTRDODO   .
           perform E392-DB2-COM-UPD thru E392-DB2-COM-UPD-EX .
       E392-EX.
           EXIT.
      *
       E40-UPD-DATICOMUNI.
240519*    move  OC-DCOINT     to H-DCOINT      .
           if  OC-DCOULESPP  =  'D'   or   'L'
           then
               move  OC-DCOULESPP  to H-DCOULESPP
               move  W8-ODIERNA    to H-DCODTULPP
           end-if.
           if  OC-DCOULESSP  =  'D'   or   'L'
           then
               move  OC-DCOULESSP  to H-DCOULESSP
               move  W8-ODIERNA    to H-DCODTULSP
           end-if.
           move  UPD-ANFRIC    to H-DCOANFRIC   .
           move  'N'           to H-DCOTRDOCE   .
           move  OC-DCOPESTDI  to H-DCOPESTDI   .
261113*----Blocco ad ogni pagamento domanda lavoratore sospeso:       *
      *---- dopo arrivo rendiconto la sede inserisce sosp e sblocca   *
           if  W-LAVSOSPESO  =  "S"
           then
               move  "N"       to  H-DCOPESTDI
261113     end-if.
           move  'N'           to H-DCOTRDODO   .
      *         la seguente move, prevista per gestione variazione   *
      *-------- è modificata per la gestione covid19                 *
240519*    move  zeros         to H-DCOFLASU    . *
230620*    if  IC-DCOFLASU  =  19   or
240620*        IC-DCOFLASU  =  20   or
      *        IC-DCOFLASU  =  45   or
      *        IC-DCOFLASU  =  54
      *    then
131020         move  IC-DCODTDECSP  to  H-DCODTDECSP.
               move  IC-DCODTADEC   to  H-DCODTADEC.
131020         move  IC-DCOFLASU    to  H-DCOFLASU.
230620*    end-if.
           PERFORM E40-DB2-COM-UPD THRU E40-DB2-COM-UPD-EX.
       E40-EX.
           EXIT.
      *
       E43-UPD-RECUPERI.
           if  OC-RECIMUREE-1  =  zeroes   and
               OC-RECIMUREE-2  =  zeroes   and
               OC-RECIMUREE-3  =  zeroes
           then
               go  to  E43-EX
           end-if.
      *
           move  IC-DCOCHIDOM  to H-RECCHIDOM .
           move  zeros         to H-RECPROREC .
      *
           perform  E43-DB2-DECL-CURS    thru  E43-DB2-DECL-CURS-EX.
      *
           move   zeros  to  NDC2.
           perform  varying  NDC1  from  1  by  1
                    until  NDC1  >  99
      *
            perform  E43-DB2-FETCH    thru  E43-DB2-FETCH-EX
            if   SQLCODE =    0
            then
                 move 'S'            to  WL-TABPIENA
                 if  H-RECCHIDOM is  equal IC-DCOCHIDOM
                 then
                     perform E44-UPD-IMPORTI    thru E44-EX
                     if  OC-RECIMUREE-1  =  zeroes   and
                         OC-RECIMUREE-2  =  zeroes   and
                         OC-RECIMUREE-3  =  zeroes
                     then
                       perform
                          REC43-DB2-CLSCUR thru REC43-DB2-CLSCUR-EX
                       move  111    to  NDC1
                     end-if
                 else
                     perform REC43-DB2-CLSCUR thru REC43-DB2-CLSCUR-EX
                     move  111    to  NDC1
                 end-if
            else
                 perform REC43-DB2-CLSCUR thru REC43-DB2-CLSCUR-EX
                 move  111    to  NDC1
            end-if
           end-perform.
      *------------------------------------- per i recuperi migrati  *
           if  OC-RECIMUREE-1  <  0.0100
           then
               move  zeroes   to  OC-RECIMUREE-1
           end-if.
           if  OC-RECIMUREE-2  <  0.0100
           then
               move  zeroes   to  OC-RECIMUREE-2
           end-if.
           if  OC-RECIMUREE-3  <  0.0100
           then
               move  zeroes   to  OC-RECIMUREE-3
           end-if.
      *------------------------------------- a regime                *
           if  OC-RECIMUREE-1  =  zeroes   and
               OC-RECIMUREE-2  =  zeroes   and
               OC-RECIMUREE-3  =  zeroes
           then
               continue
           else
               move  'N'                to  FLG-COMMIT
               move  'KO-UPDATE '       to  S2A005
               move  'ADSRECUP  '       to  S2A006
               move  FST-ADSRECUP       to  S2A007
               perform  S10-STAMPA     thru  S10-EX
           end-if.
      *
           if  WL-TABPIENA  =  'N'
               move  'N'                to  FLG-COMMIT
               move  'KO-START  '       to  S2A005
               move  'ADSRECUP  '       to  S2A006
               move  FST-ADSRECUP       to  S2A007
               perform  S10-STAMPA     thru  S10-EX
           else
               move 'N'                 to  WL-TABPIENA
           end-if.
      *
       E43-EX.
           EXIT.
      *
       E44-UPD-IMPORTI.
           if H-RECTORERE                  =  zeroes
           then
               go  to  E44-EX
           end-if.
      *----------------------------------------- Recuperi Indennità  *
           if  OC-RECIMUREE-1  >  zeroes
           then
               if  (H-RECCAUREC                =  '1')   and
                   (H-RECTIPREC                =  'R')
               then
                   if H-RECTORERE                 =  OC-RECIMUREE-1
                   then
                       move  W8-ODIERNA     to H-RECDTESRE
                       move  OC-RECIMUREE-1 to H-RECIMUREE
                       move  zeroes         to H-RECTORERE
                       move  zeroes         to  OC-RECIMUREE-1
                   end-if
                   if H-RECTORERE                 >  OC-RECIMUREE-1
                   then
                       move  W8-ODIERNA     to H-RECDTESRE
                       move  OC-RECIMUREE-1 to H-RECIMUREE
                       subtract  OC-RECIMUREE-1 from H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-1
                   end-if
                   if H-RECTORERE                 <  OC-RECIMUREE-1
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move H-RECTORERE  to H-RECIMUREE
                       subtract H-RECTORERE from  OC-RECIMUREE-1
                       move  zeroes      to H-RECTORERE
                   end-if
               end-if
           end-if.
      *----------------------------------------- Recuperi/acconti ANF*
           if  OC-RECIMUREE-2  >  zeroes
           then
               if H-RECCAUREC  =  '2'
               then
                   if H-RECTORERE  =  OC-RECIMUREE-2
                   then
                       move  W8-ODIERNA     to H-RECDTESRE
                       move  OC-RECIMUREE-2 to H-RECIMUREE
                       move  zeroes         to H-RECTORERE
                       move  zeroes         to OC-RECIMUREE-2
                   end-if
                   if H-RECTORERE  >  OC-RECIMUREE-2
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-2
                                         to H-RECIMUREE
                       subtract  OC-RECIMUREE-2
                                       from H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-2
                   end-if
                   if H-RECTORERE  <  OC-RECIMUREE-2
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move H-RECTORERE
                                         to H-RECIMUREE
                       subtract H-RECTORERE
                                       from  OC-RECIMUREE-2
                       move  zeroes      to H-RECTORERE
                   end-if
               end-if
           end-if.
      *-----------------------------------------Acconto indennità   *
           if  OC-RECIMUREE-3  >  zeroes
           then
      *        if H-RECTIPREC                 =  'A'
               if  (H-RECCAUREC   =  "1")   and
                   (H-RECTIPREC   =  "A")
               then
                   if H-RECTORERE                 =  OC-RECIMUREE-3
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-3
                                         to H-RECIMUREE
                       move  zeroes      to H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-3
                   end-if
                   if H-RECTORERE  >  OC-RECIMUREE-3
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-3
                                         to H-RECIMUREE
                       subtract  OC-RECIMUREE-3
                                       from H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-3
                   end-if
                   if H-RECTORERE  <  OC-RECIMUREE-3
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move H-RECTORERE
                                         to H-RECIMUREE
                       subtract H-RECTORERE
                                       from  OC-RECIMUREE-3
                       move  zeroes      to H-RECTORERE
                   end-if
               end-if
           end-if.
      *------------------------------------- scrivo  storico REC   --*
           if H-RECIMUREE   >  zeros  and
              H-RECDTESRE   =  W8-ODIERNA
           then
               perform  E441-WRT-STOREC  thru  E441-EX
           end-if.
      *--------------------------------------------- Aggiornamento
           perform E44-DB2-REC-UPD thru E44-DB2-REC-UPD-EX.
       E44-EX.
           EXIT.
      *
       E441-WRT-STOREC.
           move  'N'  to  LC-RETCODE.
      *
           call  PDSPD07 using
                                   WDFHEIBLK  WDFHCOMMAREA
                                   L-CODICE-SEDE
                                   W-PROCEDURA
                                   L-CODICE-STOP
                                   W8-ODIERNA
                                   IC-DOMANDA
                                   W-PROGRESSIVO
                                   IC-DCOCODFIS
                                   IC-DCOCHIDOM
                                   H-RECPROREC
                                   H-RECTOREEE
                                   H-RECTORERE
                                   H-RECCOREAL
                                   H-RECCORENU
                                   H-RECCAUREC
                                   H-RECTIPREC
                                   H-RECIMUREE
                                   LC-RETCODE
           end-call.
           cancel  PDSPD07 .
       E441-EX.
           EXIT.
      *
       E45-DLT-EFFEROGATI.
           move    IC-DCOCHIDOM     to  H-PEECHIDOM .
           perform E45-DB2-DELETE  thru E45-DB2-DELETE-EX.
       E45-EX.
           EXIT.
      *
       E46-WRT-EFFEROGATI.
      *--------------------------------- Prima prestazione           *
           perform  varying  N1  from  1  by  1
             until  (OCO-PEEPEERED(N1)  =  zeros
271014                 or   N1  >  450)
             initialize   DCLTDSPEERE
             move  IC-DCOCODFIS       to H-PEECODFIS
             move  IC-DCOCHIDOM       to H-PEECHIDOM
             move  OCO-PEEPEERED(N1)  to H-PEEPEERED
             move  IC-STDCOTIPRU      to H-PEECOTIPR
230620       if  (IC-DCODTDECSP  >  zeroes)   and
                 (OCO-PEEPEERED(N1)  not  <  IC-DCODTDECSP)
             then  move  46           to  H-PEECOTIPR
230620       end-if
             move  OCO-PEEPEEREA(N1)  to H-PEEPEEREA
             move  OCO-PEENUGIEE(N1)  to H-PEENUGIEE
             perform E46-DB2-EFFE-INS thru E46-DB2-EFFE-INS-EX
           end-perform.
      *--------------------------------- Seconda prestazione         *
      *n
      *n   perform  varying  N1  from  1  by  1
      *n     until  (OCS-PEEPEERED(N1)  =  zeros
      *n        or   N1  >  50)
      *n     move  IC-DCOCODFIS       to H-PEECODFIS
      *n     move  IC-DCOCHIDOM       to H-PEECHIDOM
      *n     move  OCS-PEEPEERED(N1)  to H-PEEPEERED
      *n     move  IC-STDCOTIPRD      to H-PEECOTIPR
      *n     move  OCS-PEEPEEREA(N1)  to H-PEEPEEREA
      *n     move  OCS-PEENUGIEE(N1)  to H-PEENUGIEE
      *n     PERFORM E46-DB2-EFFE-INS THRU E46-DB2-EFFE-INS-EX
      *n   end-perform.
       E46-EX.
           EXIT.
      *
       E47-UPD-SITUAZIODO.
           if  OC-DCOULESPP  =  'D'   or   'L'
           then
               move  W8-ODIERNA     to H-STDDTMOPRU
               move  OC-DCOULESPP   to H-STDESITPRU
           end-if.
      *n   if  OC-DCOULESSP  =  'D'   or   'L'
      *n   then
      *n       move  W8-ODIERNA     to H-STDDTMOPRD
      *n       move  OC-DCOULESSP   to H-STDESITPRD
      *n   end-if.
           perform E47-DB2-SIT-UPD thru E47-DB2-SIT-UPD-EX.
       E47-EX.
           EXIT.
      *
      *E48-UPD-TEOEROGABI.
      *-------------- Nella Disoccupazione ordinaria i periodi teorici
      *-------------- erogabili disposti non vanno mai modificati!
      *    move  OC-IDMDTPRTE   to H-PETPEERTA  .
      *    move  OC-PETNUGITE   to H-PETNUGITE  .
      *    rewrite  R-TEOEROGABI
      *      invalid  key
      *          move  'N'                to  FLG-COMMIT
      *          move  'REWRITE   '       to  S2A005
      *          move  'LFPEERT1  '       to  S2A006
      *          move  FST-LFPEERT1       to  S2A007
      *          perform  S10-STAMPA     thru  S10-EX
      *      not  invalid  key
      *          continue
      *    end-rewrite.
      *E48-EX.
      *    EXIT.
      *
       E50-PREPARO-PAGAMENTI.
           move  IC-DCOCODFIS   to  H-PMECODFIS   .
           move  W8-ODIERNA     to  H-PMEDTELAB   .
           move  IC-DCOCHIDOM   to  H-PMECHIDOM   .
           move  OC-PMETOTRSIE  to  H-PMETOTRSIE  .
           move  OC-PMEUITRSIE  to  H-PMEUITRSIE  .
060721*    move  OC-PMEUONNCOE  to  H-PMEUONNCOE  .
           if (W-CODICEUNO  =   35)
           then
               if  OC-PMEUONNCOE  >  IC-PMEUONNCOE
               then
                   move  OC-PMEUONNCOE  to  H-PMEUONNCOE
               else
                   move  IC-PMEUONNCOE  to  H-PMEUONNCOE
               end-if
           else
               move  zeroes         to  H-PMEUONNCOE
060721     end-if.
220817     if  IC-CODFISARCA  =  IC-DCOCODFIS
           then  continue
           else  move  'C'      to  H-PMESTAPAG
220817     end-if.
           move  OC-PMEDTRICA   to  H-PMEDTRICA   .
           move  OC-PMEINDTOTE  to  H-PMEINDTOTE  .
           move  OC-PMEINDUIME  to  H-PMEINDUIME  .
           move  OC-PMEANFTOTE  to  H-PMEANFTOTE  .
           move  OC-PMEANFUIME  to  H-PMEANFUIME  .
           move  OC-PMEINDTOGG  to  H-PMEINDTOGG  .
           move  OC-PMEANFTOGG  to  H-PMEANFTOGG  .
           move  OC-PMEDS56     to  H-PMEDS56     .
           move  OC-PMEORDTOTE  to  H-PMEORDTOTE  .
           move  OC-PMEORDTOTL  to  H-PMEORDTOTL  .
           move  OC-PMEORDUIME  to  H-PMEORDUIME  .
300119     if  W-ANFDIRETTI   =  'S'     and
               OC-PMEINDUIME  =  zeros   and
               IC-PMEINDUIME  <  zeros
           then
               move  IC-PMEINDUIME  to  H-PMEINDUIME
               move  IC-PMEORDUIME  to  H-PMEORDUIME
300119     end-if.
           move  OC-PMEORDUIML  to  H-PMEORDUIML  .
           move  OC-PMEORDTOGG  to  H-PMEORDTOGG  .
           move  OC-PMESPETOTE  to  H-PMESPETOTE  .
           move  OC-PMESPEUIME  to  H-PMESPEUIME  .
           move  OC-PMESPETOGG  to  H-PMESPETOGG  .
           move  OC-PMEIMINNAE  to  H-PMEIMINNAE  .
           move  OC-PMEIMIANFE  to  H-PMEIMIANFE  .
           if  OC-PMEIMULASE  >  zeros
           then
               move  OC-PMEIMULASE  to  H-PMEIMULASE
           else
               move  zeros          to  H-PMEIMULASE
           end-if.
           move  OC-PMEULPEDAL  to  H-PMEULPEDAL  .
           move  OC-PMEULPEAL   to  H-PMEULPEAL   .
           move  OC-PMEULPEGG   to  H-PMEULPEGG   .
           move  OC-PMECONFISE  to  H-PMECONFISE  .
           move  OC-PMEADDCOME  to  H-PMEADDCOME  .
           move  OC-PMEADDREGE  to  H-PMEADDREGE  .
           move  OC-PMEULIRNSE  to  H-PMEULIRNSE  .
           move  OC-PMEULIRN1E  to  H-PMEULIRN1E  .
           move  OC-PMETOIRNPE  to  H-PMETOIRNPE  .
           move  OC-PMETOIRNCE  to  H-PMETOIRNCE  .
           move  OC-PMEINLEPRE  to  H-PMEINLEPRE  .
           move  OC-PMEINLEANE  to  H-PMEINLEANE  .
           move  0              to  H-PMEANFTOTL .
           move  OC-PME730UIME  to  H-PMER730UIM .
           move  OC-PMEAUTTOTE  to  H-PMEAUTTOTE .
           move  OC-PMEAUTTOGG  to  H-PMEAUTTOGG .
           move  OC-PMEAUTUIME  to  H-PMEAUTUIME .
           move  OC-PMEULAUTGG  to  H-PMEULAUTGG .
       E50-EX.
           EXIT.
      *
       E51-UPD-PAGAMENTI.
           perform  E50-PREPARO-PAGAMENTI  thru  E50-EX.
           perform E51-DB2-PAG-UPD thru E51-DB2-PAG-UPD-EX.
       E51-EX.
           EXIT.
      *
       E52-WRT-PAGAMENTI.
           initialize  DCLTDSPAGME.
      *
           move  IC-DCOCHIDOM   to  H-PMECHIDOM .
           perform  E50-PREPARO-PAGAMENTI  thru  E50-EX.
           PERFORM E52-DB2-PAGA-INS THRU E52-DB2-PAGA-INS-EX.
       E52-EX.
           EXIT.
      *
       E53-UPD-ANFDIR.
           move  OC-AADIMPSPE   to  H-AADIMPSPE .
           move  OC-AADSTAPAG   to  H-AADSTAPAG .
           move  W8-ODIERNA     to  H-AADDATASTA .
           perform E53-DB2-ANF-UPD thru E53-DB2-ANF-UPD-EX.
       E53-EX.
           EXIT.
      *
       E55-UPD-AUTLASPI.
      *--------------------------------- Aggiorna numero gg riduzione*
           perform  varying  N1  from  1  by  1
151220*      until  (OC-AUTNUMGRID(N1)  =  zeros  or          )
             until          N1  >  40
             if  OC-AUTPROGR(N1)     >  zeroes  and
                 OC-AUTNUMGRID(N1)   >  zeroes
             then
                 initialize   DCLTDSAUTLA
                 move  IC-DCOCHIDOM       to  H-AUTCHIDOM
151220**ex   variata in quanto da PDSNA02 oc-autprogr  =  0
151220*      move  N1                 to  H-AUTPROGR
                 move  OC-AUTPROGR(N1)    to  H-AUTPROGR
                 move  OC-AUTNUMGRID(N1)  to  H-AUTNUMGRID
                 perform E55-DB2-AUT-UPD thru E55-DB2-AUT-UPD-EX
151220       end-if
           end-perform.
      *
      *    move  IC-DCOCHIDOM  to  H-AUTCHIDOM .
      *    move  zeros         to  H-AUTPROGR  .
      *
      *    perform  E55-DB2-DECL-CURS    thru  E55-DB2-DECL-CURS-EX.
      *
      *    move   zeros  to  NDC2.
      *    perform  varying  NDC1  from  1  by  1
      *             until  NDC1  >  99
      *
      *     perform  E55-DB2-FETCH    thru  E55-DB2-FETCH-EX
      *     if   SQLCODE =    0
      *     then
      *          move 'S'         to  WL-TABPIENA
      *          if  H-AUTCHIDOM  is  equal  IC-DCOCHIDOM
      *              H-AUTPROGR   =
      *          then
      *              perform E56-UPD-NUMGRID    thru E56-EX
      *          else
      *              perform  AUT55-DB2-CLSCUR  thru
      *                       AUT55-DB2-CLSCUR-EX
      *              move  111    to  NDC1
      *          end-if
      *     else
      *         perform  AUT55-DB2-CLSCUR  thru
      *                  AUT55-DB2-CLSCUR-EX
      *         move  111    to  NDC1
      *     end-if
      *    end-perform.
      *
      *    if  WL-TABPIENA  =  'N'
      *        move  'N'                to  FLG-COMMIT
      *        move  'KO-START  '       to  S2A005
      *        move  'TDSAUTLA  '       to  S2A006
      *        move  FST-TDSAUTLA       to  S2A007
      *        perform  S10-STAMPA     thru  S10-EX
      *    else
      *        move 'N'                 to  WL-TABPIENA
      *    end-if.
      *
       E55-EX.
           EXIT.
      *
      *E56-UPD-NUMGRID.
      *    move  OC-AUTPROGR    to  H-AUTPROGR  .
      *    move  OC-AUTNUMGRID  to  H-AUTNUMGRID.
      *--------------------------------------------- Aggiornamento
      *    perform E56-DB2-AUT-UPD thru E56-DB2-AUT-UPD-EX.
       E56-EX.
           EXIT.
      *
       E65-WRT-STOANF.
           move  'N'  to  LC-RETCODE.
      *
           CALL  PDSPD05  USING
                     WDFHEIBLK  WDFHCOMMAREA
                                   L-CODICE-SEDE
                                   W-PROCEDURA
                                   L-CODICE-STOP
                                   W8-ODIERNA
                                   IC-DOMANDA
                                   W-PROGRESSIVO
                                   IC-DCOCODFIS
                                   IC-DCOCHIDOM
      *I------------------------------- new dal 23/07/2013           *
      *                            IC-TAB-ANF
                                   LC-TAB-ANF
      *F------------------------------- new dal 23/07/2013           *
                                   LC-RETCODE
           end-call.
           cancel  PDSPD05 .
       E65-EX.
           EXIT.
      *
       E66-WRT-STOSOS.
           move  'N'  to  LC-RETCODE.
      *
271014*    CALL  PDSPD06  USING
           CALL  PDSPD08  USING
                     WDFHEIBLK  WDFHCOMMAREA
                                   L-CODICE-SEDE
                                   W-PROCEDURA
                                   L-CODICE-STOP
                                   W8-ODIERNA
                                   IC-DOMANDA
                                   W-PROGRESSIVO
                                   IC-DCOCODFIS
                                   IC-DCOCHIDOM
                                   IC-TAB-SOSPE
                                   LC-RETCODE
           end-call.
           cancel  PDSPD08 .
       E66-EX.
           EXIT.
      *
180523*inizio storicizzazione tdsautla in tdssaut0
       E67-WRT-STOAUTLA.

           perform  varying  I-AUT from 1 by  1
                      until  I-AUT > 40
             if  IC-AUTPROGR(I-AUT) =  zeros
             then
                 move  41   to  I-AUT
             else
               move  L-CODICE-SEDE      to  H-XACOSEDE
               move  W-PROCEDURA        to  H-XAPROCEDURA
               move  L-CODICE-STOP      to  H-XADCOCENOPE
               move  W8-ODIERNA         to  H-XADATAELABO
               move  IC-DOMANDA         to  H-XADOMANDA
               move  W-PROGRESSIVO      to  H-XAPROGRESSI
               move  IC-DCOCODFIS       to  H-XADCOCODFIS
               move  IC-DCOCHIDOM       to  H-XADCOCHIDOM

               move  IC-AUTPROGR(I-AUT)     TO H-XAUTPROGR
               move  IC-AUTDATADAL(I-AUT)   TO H-XAUTDATADAL
               move  IC-AUTDATAAL(I-AUT)    TO H-XAUTDATAAL
               move  W-AUTREDTEO(I-AUT)     TO H-XAUTREDTEO
               move  W-AUTREDEFF(I-AUT)     TO H-XAUTREDEFF
               move  IC-AUTREDGTEO(I-AUT)   TO H-XAUTREDGTEO
               move  IC-AUTREDGEFF(I-AUT)   TO H-XAUTREDGEFF
               move  IC-AUTNUMGRID(I-AUT)   TO H-XAUTNUMGRID
               move  W-AUTTIPOATT2(I-AUT)   TO H-XAUTTIPOATT
               move  W-AUTDATARED(I-AUT)    TO H-XAUTDATARED
               move  W-AUTTIPOACQRED(I-AUT) TO H-XAUTTIPOACQRED
               move  W-AUTDTLIMRED(I-AUT)   TO H-XAUTDTLIMRED

      *        DISPLAY 'H-XACOSEDE     : ' H-XACOSEDE
      *        DISPLAY 'H-XAPROCEDURA  : '  H-XAPROCEDURA
      *        DISPLAY 'H-XADCOCENOPE  : '  H-XADCOCENOPE
      *        DISPLAY 'H-XADATAELABO  : '  H-XADATAELABO
      *        DISPLAY 'H-XADOMANDA    : '  H-XADOMANDA
      *        DISPLAY 'H-XAPROGRESSI  : '  H-XAPROGRESSI
      *        DISPLAY 'H-XADCOCODFIS  : '  H-XADCOCODFIS
      *        DISPLAY 'H-XADCOCHIDOM  : '  H-XADCOCHIDOM
      *        DISPLAY 'H-XAUTPROGR    : '  H-XAUTPROGR
      *        DISPLAY 'H-XAUTDATADAL  : '  H-XAUTDATADAL
      *        DISPLAY 'H-XAUTDATAAL   : '  H-XAUTDATAAL
      *        DISPLAY 'H-XAUTREDTEO   : '  H-XAUTREDTEO
      *        DISPLAY 'H-XAUTREDEFF   : '  H-XAUTREDEFF
      *        DISPLAY 'H-XAUTREDGTEO  : '  H-XAUTREDGTEO
      *        DISPLAY 'H-XAUTREDGEFF  : '  H-XAUTREDGEFF
      *        DISPLAY 'H-XAUTNUMGRID  : '  H-XAUTNUMGRID
      *        DISPLAY 'H-XAUTTIPOATT  : '  H-XAUTTIPOATT
      *        DISPLAY 'H-XAUTDATARED  : '  H-XAUTDATARED
      *        DISPLAY 'H-XAUTTIPOACQRED : ' H-XAUTTIPOACQRED
      *        DISPLAY 'H-XAUTDTLIMRED : '  H-XAUTDTLIMRED

               EXEC SQL
                       INSERT  INTO TDSSAUT0
                       VALUES  ( :DCLTDSSAUT0)
               END-EXEC

               IF    SQLCODE NOT = ZERO
                       DISPLAY 'DCLTDSSAUT0=' DCLTDSSAUT0
                       MOVE 'TDSSAUT0' TO WABNDB-TABL
                       MOVE 'INSERT  ' TO WABNDB-FUNC
                       PERFORM ERRORE-SQL
               END-IF
             end-if
           end-perform.

       E67-EX.
           EXIT.
180523*fine
      *
       E60-SINCRONIZZO.
      *----------------------------------- Lista controllo
           if  L-TIPOCALCOLO  =  'S'
           then
               EXEC CICS
                    SYNCPOINT
               END-EXEC
               if  W-FINE-ELABORA  =  'S' and TIPO-ELABO-IN < '3'
               then
               if  CTR-PAGATE   >  zeros or
                   CTR-INDEBITE >  zeros or
300315             CTR-DEFINITE >  zeros
               then
      *            SYNCPOINT  ROLLBACK
                   perform  S40-IMPOSTAZIONI  thru  S40-EX
      *            MOVE S5A000       TO R5A000
                   MOVE S5N001       TO R5N001
      *            MOVE S5A002       TO R5A002
      *            MOVE S5A003       TO R5A003
                   MOVE S5N004       TO R5N004
                   MOVE S5N005       TO R5N005
                   MOVE S5N007       TO R5N007
                   MOVE S5N006       TO R5N006
                   MOVE S5N008       TO R5N008
                   MOVE S5N009       TO R5N009
                   MOVE S5N011       TO R5N011
                   MOVE S5N012       TO R5N012
      *            perform  S40-IMPOSTAZIONI  thru  S40-EX
                   MOVE R-STAMPAS    TO TDSREPORT-RIGA-REPORT
                   MOVE  0           TO TDSREPORT-NUM-RIGA
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
      *
               else
                   MOVE 'NESSUNA DOMANDA DA PAGARE' TO  OUT-MESSAGGIO
                   move  '96'           to  OUT-STATUS
               end-if
               end-if
               go  to  E60-EX
           end-if.
230620*----sospeso--------------- solo x memorizzare l'Incompatibilità*
      *    if  FLG-COMMIT   =  'X'
      *    then  EXEC CICS
      *               SYNCPOINT
      *          END-EXEC
      *          move  'N'  to  FLG-COMMIT
      *          go  to  E60-EX
230620*    end-if.
      *----------------------------------- Fine Calcolo reale
           if  W-FINE-ELABORA     =  'S'
           then
               if  CTR-PAGATE    >  zeros   or
300315             CTR-DEFINITE  >  zeros   or
300315             CTR-INDEBITE  >  zeros
               then
      ********* ELABORAZIONE TERMINATA *****
                   perform  S40-IMPOSTAZIONI  thru  S40-EX
                   MOVE R-STAMPAS    TO TDSREPORT-RIGA-REPORT
                   MOVE  0           TO TDSREPORT-NUM-RIGA
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
               else
                   perform  S40-IMPOSTAZIONI  thru  S40-EX
                   DISPLAY 'ROLLBACK PDSNA13'
                EXEC CICS
                   SYNCPOINT  ROLLBACK
                END-EXEC
      ********* ELABORAZIONE TERMINATA *****
      *            MOVE 'NESSUNA DOMANDA DA PAGARE' TO  OUT-MESSAGGIO
300315             MOVE 'NESSUNA DOMANDA ELABORATA' TO  OUT-MESSAGGIO
                   move  '96'           to  OUT-STATUS
                   go  to  E60-EX
               end-if
           end-if.
      *----------------------------------- Impostazione Riepilogo
           if ((CTR-PAGATE    >  zeros)   or
300315         (CTR-DEFINITE  >  zeros)   or
300315         (CTR-INDEBITE  >  zeros))  and
               (FLG-COMMIT  =  'S')
           then
               if  WS-RIEPILOGO  =  'N'
               then
                   perform  E62-SCRIVO         thru  E62-EX
               else
                   perform  E64-RISCRIVO       thru  E64-EX
               end-if
           end-if.
      *-------------------------------------- Sincronia intermedia
           if  WS-APPOGGIO  =  'S'
           then  continue
           else
220720*          perform E60-POP      thru  E60-POP-EX
                 go  to  E60-EX
           end-if.

           if  CTR-PAGATE    >  zeros   or
300315         CTR-DEFINITE  >  zeros   or
300315         CTR-INDEBITE  >  zeros
           then
               if  FLG-COMMIT  =  'S'
               then
                   EXEC CICS
                        SYNCPOINT
                   END-EXEC
                   move  'N'    to  FLG-COMMIT
               else
300720             EXEC CICS
                        SYNCPOINT  ROLLBACK
300720             END-EXEC
      *
      * tolto rollback perchè non chiudeva le domande con pagamento
      * a 0
      *
   gga*       EXEC CICS
      *            SYNCPOINT  ROLLBACK
   gga*       END-EXEC
      *            subtract  1           from  CTR-SCR-APPO
                   move  WIC-DOMANDA       to  W-DOMANDA-DAL
                   add   1                 to  W-DOMANDA-DAL
                   perform  B20-PERSTART  thru  B20-EX
               end-if
           end-if.
       E60-EX.
           EXIT.
220720*------------------ Commentata gestione pop 730 x mofifica GF *
      *E60-POP.
      *
      *----- GESTIONE ANNULLAMENTO RECUPERO IN CASO DI ABEND.
      *
      *    IF OC-CODICE7  = '730'
      *       initialize  area-input-in
      *       MOVE ZEROES           TO REC-IMPORTO-MASSIMO-IN
      *       MOVE SPACES           TO REC-NUMERO-PRATICA-IN
      *       MOVE ZEROES           TO REC-PROGRESSIVO-PRATICA-IN
      *       MOVE SPACES           TO REC-CHIAVE-RESTART-IN
      *       MOVE SPACES           TO REC-UTENZA
      *       MOVE ZEROES           TO REC-DATA-IN
      *       move W8-ODIERNA       to REC-DATA-IN
      *       MOVE REC-DATA-IN(5:2) to REC-RATA-IN
      *       MOVE REC-DATA-IN(1:4) to REC-ANNO-IN
      *       move L-CODICE-SEDE    to REC-SEDE-IN
      *       move L-CODICE-STOP    to REC-SEDE-IN(5:2)
      *       MOVE '035'            TO TIPO-RICHIESTA-IN-5
      *
      *       if IC-STDCOTIPRU = 35
      *       then
      *          move  "G19"        to  REC-PROCEDURA-CHIAMANTE-IN
      *       end-if
      *       if IC-STDCOTIPRU = 36
      *       then
      *          move  "G20"        to  REC-PROCEDURA-CHIAMANTE-IN
      *       end-if
      *       MOVE IC-CODFISARCA    TO REC-CODICE-FISCALE-IN
      *       MOVE OC-IMPORTO7      TO REC-IMPORTO-TRATTATO-IN
      *       MOVE  '999999'        TO RETCODE-00
      *
      *       EXEC CICS LINK PROGRAM('POPWMAIN')
      *                      COMMAREA(AREA-POPSIN)
      *       END-EXEC
      *
      *       IF RETCODE-00 not = '000000'
      *          display  'POP RETCODE =' RETCODE-00 '-' H-DCOCHIDOM
      *                    '--' area-input-in(1:100)
      *       ELSE
      *          display  'POP ANNULLATO RECUPERO =' H-DCOCHIDOM
      *                    '--' area-input-in(1:100)
      *       END-IF
      *    END-IF.
      *E60-POP-EX.
220720*    EXIT.

      *
      *
       E62-SCRIVO.
           initialize  DCLTDSRPG00.
      *----------------------------------- Impostazione key          *
           move  W8-ODIERNA     to  H-PDATAELABO.
           move  W-PROGRESSIVO  to  H-PPROGRESSI.
           move  W-PROCEDURA    to  H-PPROCEDURA.
           move  L-CODICE-STOP  to  H-PSTRUTTURA.
           move  L-CODICE-SEDE  to  H-PCOSEDE.
      *----------------------------------- Errore per lettura valida *
           PERFORM E62-DB2-SELECT THRU E62-DB2-SELECT-EX.
      *
           IF  SQLCODE = 0
                 move   7      to  NDT2
                 move  zeros   to  CTR-PAGATE
                 move  'S'     to  W-FINE-INTERVALLO
                 go  to  E62-EX
           end-IF.
      *----------------------------------- Impostazione dati         *
           move  'N'           to  H-PBACKUP.
           move  W8-ODIERNA    to  W8-AAAAMMGG.
           if  W8-MM     >  1
           then
               subtract     1   from  W8-MM
           else
               move  12           to  W8-MM
               subtract     1   from  W8-AAAA
           end-if.
           if  W8-MM     =  04   or  =  06   or  =  09   or  =  11
           then
               move  30           to  W8-GG
           else
               if  W8-MM     =  02
               then
                   move  28           to  W8-GG
               else
                   move  31           to  W8-GG
               end-if
           end-if.
           move  W8-AAAAMMGG      to  H-PCALCOLOAL.
           move  CTR-SCR-APPO     to  H-PCALCOLATI.
           move  zeroes           to  H-PRECPAGATI.
           move  'N'              to  H-PFINEPAGAM.
300315     if  CTR-PAGATE  >  zeroes
           then
               move  'N'          to  H-PZEROPAGAM
           else
               if  CTR-DEFINITE  >  zeroes   or
                   CTR-INDEBITE  >  zeroes
               then
                   move  'S'     to  H-PZEROPAGAM
               end-if
300315     end-if.
           move  zeroes           to  H-PIMPCONTAB
                                      H-PIMPTELEMA.
           move  spaces           to  H-PCODTELEMA.
           move  zeroes           to  H-PDATAEMISS.
           move  W-PAGARE         to  H-PCHEDOMAND.
           move  X1-CHEPRESTA     to  H-PCHEPRESTA.
      *    move  T2-INTERVALLI    to  H-PCHENUMERA.
           move  PERIODI-IN-LK    to  H-PCHENUMERA.
      *
           PERFORM E62-DB2-INSERT THRU E62-DB2-INSERT-EX.
      *
           IF  SQLCODE NOT = 0
                 move  'WRITE     '   to  S2A005
                 move  'ADSRPG00  '   to  S2A006
                 move  FST-ADSRPG00   to  S2A007
                 perform  S10-STAMPA  thru  S10-EX
                 move   7             to  NDT2
                 move  zeros          to  CTR-PAGATE
                 move  'S'            to  W-FINE-INTERVALLO
                 go  to  E62-EX
           ELSE
                 move  'S'            to  WS-RIEPILOGO
                 continue
           end-IF.
       E62-EX.
           EXIT.
      *
       E64-RISCRIVO.
           move  CTR-SCR-APPO    to  H-PCALCOLATI.
      *
300315     if  CTR-PAGATE  >  zeroes
           then
               move  'N'          to  H-PZEROPAGAM
           else
               if  CTR-DEFINITE  >  zeroes   or
                   CTR-INDEBITE  >  zeroes
               then
                   move  'S'     to  H-PZEROPAGAM
               end-if
300315     end-if.
      *
           PERFORM E64-DB2-UPDATE THRU E64-DB2-UPDATE-EX.
      *
           IF  SQLCODE NOT = 0
                 move  'REWRITE   '       to  S2A005
                 move  'ADSRPG00  '       to  S2A006
                 move  FST-ADSRPG00       to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
                 perform  T13-TESTO13    thru  T13-EX
                 perform  W10-MSGERRORE  thru  W10-EX
                 move   7                 to  NDT2
                 move  zeros              to  CTR-PAGATE
                 move  'S'                to  W-FINE-INTERVALLO
                 go  to  E64-EX
           end-IF.
       E64-EX.
           EXIT.
      *
       F00-FINALI.
           if  W-FLAGYNCORSO  =  'S'
           then
               perform F20-FINYNCORSO   thru  F20-EX
           end-if.
      *
           if  (K-RETURN-CODE   not  =  'KO')  and
               (K-ESITO-LOCK-UNLOCK  =  'OK')  and
               (K-IS-LOCKED          =  'N' )
           then
               perform F30-FINELOCK     thru  F30-EX
           end-if.
      *
           if TIPO-ELABO-IN  = 3 and
              OUT-STATUS = '96'
      *        and W-NIK = 'S'
           then
      *       move '00'          to  OUT-STATUS
              if OUT-MESSAGGIO  NOT = SPACES
                  move   OUT-MESSAGGIO TO DSPFM134-O
              else
                  move    OC-MESSAGGIO TO DSPFM134-O
              end-if
              move  SPACES          to  OUT-MESSAGGIO
                  STRING WK-RPT-KEY   DSPFM134-O
                         DELIMITED BY SIZE INTO  OUT-MESSAGGIO
           end-if.
      *
           if out-status = '00' and l-tipocalcolo = 'R'
           then
              STRING
                 WK-RPT-KEY
                 CTR-LET-DATCO
                 CTR-ELA-DATCO
                 CTR-SCR-DATCO
                 CTR-LET-DATAN
                 CTR-ELA-DATAN
                 CTR-SCR-DATAN
                 CTR-IMPREVISTI
                 CTR-PAGATE
                 CTR-DEFINITE
                 CTR-INDEBITE
                 CTR-ATT-PAGME
              DELIMITED BY SIZE INTO OUT-MESSAGGIO
              STRING
                 CTR-LET-DATCO
                 CTR-ELA-DATCO
                 CTR-SCR-DATCO
                 CTR-LET-DATAN
                 CTR-ELA-DATAN
                 CTR-SCR-DATAN
                 CTR-IMPREVISTI
                 CTR-PAGATE
                 CTR-DEFINITE
                 CTR-INDEBITE
                 CTR-ATT-PAGME
              DELIMITED BY SIZE INTO TDSREPORT-RIGA-REPORT
              MOVE  0           TO TDSREPORT-NUM-RIGA
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
      *
           end-if.
      *    Goback.
       F00-EX.
           EXIT.

       F20-FINYNCORSO.
      *------------------------------------ Memorizzo fine esecuzione
           move  L-CODICE-SEDE    to  C-CODICE-SEDE.
           move  L-CODICE-STOP    to  C-CODICE-STOP.
           move  L-NOME-SEDE      to  C-NOME-SEDE.
           move  L-NOME-STOP      to  C-NOME-STOP.
           move  W-PROCEDURA      to  C-PROCEDURA.
           move  'F'              to  C-RICHIESTA.
           move  W-PROGRESSIVO    to  C-PROGRESSIVO.
           move  zeros            to  C-CONGUAGLIO.
           move  spaces           to  C-DIRIGENTE
                                      C-ELABINCORSO
                                      C-RETCODE.
      *
           CALL  PDSPD16  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 AREALINK-1  AREALINK-2.
           cancel PDSPD16.
      *-------------------------------------- Elaborazione possibile?
           if  C-RETCODE      =  'C'   and
               C-ELABINCORSO  =  'K'
           then
               continue
           else
               move  'E'  to  L-RETCODE
      *        move  'S'  to  W-ERRORE
               perform  T90-TESTO90    thru  T90-EX
               perform  W10-MSGERRORE  thru  W10-EX
           end-if.
       F20-EX.
           EXIT.
      *
       F30-FINELOCK.
      *------------------------------------ Memorizzo UNLOCK         *
      *    move  '61441000'        to  K-MATRICOLA.
           move   LMATRICOLA       to  K-MATRICOLA.
           string  L-CODICE-STOP       delimited by size
                   L-PROCEDURA         delimited by size
                   W8-ODIERNA          delimited by size
                                 into  K-NDOMUS.
           move  'B '              to  K-TIPO-DOMANDA.
           move  'U '              to  K-TIPO-RICHIESTA.
           move  L-CODICE-STOP     to  K-CENTRO-OPERATIVO.
           move  'P'               to  K-TIPO-OPERAZIONE.
           move  'S'               to  K-AUTO-COMMIT.
           move  spaces            to  K-RETURN-CODE
                                       K-RETURN-MESSAGE
                                       K-IS-LOCKED
                                       K-ESITO-LOCK-UNLOCK
                                       K-LOCK-UNLOCK-MESSAGE.
           move L-CODICE-SEDE      TO  K-CODICESEDE.
      *
           EXEC CICS LINK PROGRAM(PDSLOCK)
                          COMMAREA(L-AREA-LOCK)
                          LENGTH(27000)
           END-EXEC.

      *
           if  (K-RETURN-CODE   not  =  'KO')  and
               (K-ESITO-LOCK-UNLOCK  =  'OK')
           then
               continue
           else
               if  K-RETURN-CODE     =  'KO'
               then
                   move  K-RETURN-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO  OUT-STATUS
               end-if
               if  K-ESITO-LOCK-UNLOCK  =  'KO'
               then
                   move  K-LOCK-UNLOCK-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO  OUT-STATUS
               end-if
               move  'S'  to  W-ERRORE
      *        go  to  F30-EX
           end-if.
       F30-EX.
           EXIT.
      *
       I00-INIZIALI.
           MOVE 'PDSNA13 '     TO WABNDB-PGM.
           move  1936.27       to  W-EURO.
           move  ' 102 / 04 '  to  W-VALTOZAC.
      *    initialize    PER-CALCOLO      ex
           if L-PROCEDURA                   =  'G97' or
                                            =  'G96'
              move  KATA-ELABO-IN            to  WRK-DCODTADEC
              if  DATA-ELABO-MM   =  04   or  =  06   or
                                  =  09   or  =  11
              then
                   move  30           to  DATA-ELABO-GG
              else
                   if  DATA-ELABO-MM  = 02
                   then
                       divide  4  into  DATA-ELABO-AA
                          giving  RISULT  remainder RESTO
                       if  BISESTILE
                       then
                           move  29        to  DATA-ELABO-GG
                       else
                           move  28        to  DATA-ELABO-GG
                       end-if
                   else
                       move  31           to  DATA-ELABO-GG
                   end-if
              end-if
           end-if.
           move  '00'          to  OUT-STATUS.
271014*    move  all zero      to  PER-RDSUT18.
           initialize    IC-AREA
                         OC-AREA
                         W-ANAGRAFICI.
      *
           move  'N'     to  L-RETCODE.
           move  'N'     to  W-FINE-ELABORA.
           move  'N'     to  W-ERRORE.
      *---------------------------------------- Controllo prestaz.  *
           if  L-PROCEDURA    =  'G19'
                        or    =  'G20'
                        or    =  'G21'
                        or    =  'G96'
                        or    =  'G97'
                        or    =  'G98'
                        or    =  'G99'
           then  move  'G19'  to  W-PROCEDURA
           else
               move  'S'  to  W-ERRORE
               perform  T11-TESTO11    thru  T11-EX
               perform  W10-MSGERRORE  thru  W10-EX
               go  to  I00-EX
           end-if.
      *---------------------------------------- Controllo           *
      *    if  L-CODICE-SEDE  =  9090   and
      *        L-CODICE-STOP  =  90     and
      *        L-NOME-SEDE    =  'VALTOZAC'
      *    then
      *        move  W-VALTOZAC  to  L-NOME-STOP
      *        move  'S'         to  W-ERRORE
      *        go  to  I00-EX
      *    end-if.
      *
      * PREPARA TABELLA PER LA STAMPA
      *
           PERFORM IMPOSTA-RPT THRU EX-IMPOSTA-RPT.
      *
           MOVE  L-CODICE-SEDE    TO
                                     H-AADCOSEDE
                                     H-DCOCOSEGR
                                     H-DCDCOSEDE
                                     H-DANCOSEDE
                                     H-DSICOSEDE
      *n                             H-EDICOSEDE
      *n                             H-MARCOSEDE
                                     H-ANFCOSEDE
      *n                             H-OSMCOSEDE
                                     H-PMECOSEDE
                                     H-PEECOSEDE
                                     H-PENCOSEDE
                                     H-RECCOSEDE
      *n                             H-RICCOSEDE
      *n                             H-RFSCOSEDE
                                     H-STDCOSEDE
                                     H-SOSCOSEDE
                                     H-PETCOSEDE
                                     H-NASCOSEDE
                                     H-DICCOSEDE
                                     H-AUTCOSEDE.
      *
              MOVE 0 TO   S5N005
                          S5N006
                          S5N007
                          S5N008
                          S5N009
                          S5N012
                          S5N001
                          S5N004
                          S5N011.
      *-------------------------------------------- Verifica date    *
           perform I10-DATA-ORA      thru  I10-EX.
      *------------- da agosto a dicembre da ore 1.00 a 1.15 circa *
      *------------- caricamento conguagli da assistenza fiscale   *
270921     if  W8-ODIGG  =  01
           then
               if  W8-ODIMM  >  07
               then
                   if  W-HH-MM  <  0131
                   then
                       if  L-TIPOCALCOLO  =  'R'
                       then
                           move  'S'  to  W-ERRORE
                           perform  T15-TESTO15    thru  T15-EX
                           perform  W10-MSGERRORE  thru  W10-EX
                           go  to  I00-EX
                       end-if
                   end-if
               end-if
270921     end-if.
      *
           perform I13-CALCOLO-AL    thru  I13-EX.
      *----------------------------------------- Controllo accesso
           perform I07-ACCESSO        thru  I07-EX.
      *-------------------------------------------Calcolo in corso ?
           perform I30-CHK-PAGAMENTO   thru  I30-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  I00-EX
           end-if.
      *-------------------------------------------Controllo TDSSOSPE *
           if  L-TIPOCALCOLO  =  'R'
           then
               perform I09-CONTA-SOSPE     thru  I09-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  I00-EX
               end-if
           end-if.
      *---------------------------------------- Ripartenza e selezioni
           perform I32-SELEZIONI   thru  I32-EX.
      *-------------------------------------- Memorizzo elaborazione
           perform  I60-BLOCCO     thru  I60-EX.
           if  W-ERRORE  =  'S'
           then
                   go  to  I00-EX
           end-if.
       I00-EX.
           EXIT.
      *
       I07-ACCESSO.
           move  'N'  to  W-NIK.
      *
           if  LMATRICOLA  =  'E0014249'
           then
               move  '5'  to  LLIVAUTO
               move  50014249  to  LMATRICOLA
           end-if.
      *
           if  LLIVAUTO    =  '5'
           then
               move  LMATRICOLA    to  Z-MATRICOLA
               move  'N'           to  Z-RETCODE
               CALL  PDSPD13  USING
                     WDFHEIBLK  WDFHCOMMAREA
                     PER-PDSPD13
               cancel PDSPD13
               if  Z-RETCODE  =  'S'
               then
                   move  'S'  to  W-NIK
                   go  to  I07-EX
               end-if
           end-if.
       I07-EX.
           EXIT.
      *
       I10-DATA-ORA.
               MOVE FUNCTION CURRENT-DATE(1:8) TO
                    W8-ODIERNA.
      *
      *        MOVE  '20091001'    TO  W8-ODIERNA .
               move  W8-ODIAA      to  W6-ODIAA .
               move  W8-ODIMM      to  W6-ODIMM .
               move  W8-ODIGG      to  W6-ODIGG .
               compute  W4-ANNO-1  =  W8-ODIAA  -  1.
      *
       I10-EX.
           EXIT.
      *
       I13-CALCOLO-AL.
      *---------------------------------------- Data fine calcolo
           move  zeros         to  W8-AAAAMMGG
                                   W-CALCOLO-AL
                                   W-CALCOLO-AL-REALE.
           move  W8-ODIERNA    to  W8-AAAAMMGG.
      *---------------------------------------- Se gg > 15 allora    *
           if  W8-GG     >  15
           then
               move  15           to  W8-GG
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
                                      W-CALCOLO-AL-REALE
               go  to  I13-EX
           end-if.
      *---------------------------------------- altrmenti fine mese  *
           if  W8-MM     >  1
           then
               subtract     1   from  W8-MM
           else
               move  12           to  W8-MM
               subtract     1   from  W8-AAAA
           end-if.
           if  W8-MM     =  04   or  =  06   or  =  09   or  =  11
           then
               move  30           to  W8-GG
           else
               if  W8-MM     =  02
               then
      *            if  RNPYEAR-BISESTILE  =  'SI'
      *            then
      *                move  29       to  W8-GG
      *            else
      *                move  28       to  W8-GG
      *            end-if
                   divide  4  into  W8-AAAA
                       giving  RISULT  remainder RESTO
                   if  BISESTILE
                   then
                       move  29        to  W8-GG
                   else
                       move  28        to  W8-GG
                   end-if
               else
                   move  31           to  W8-GG
               end-if
           end-if.
           move  W8-AAAAMMGG  to  W-CALCOLO-AL
                                  W-CALCOLO-AL-REALE.
       I13-EX.
           EXIT.
      *
      *
       I30-CHK-PAGAMENTO.
      *--------------------------------------- Calcolo simulato?
           if  L-TIPOCALCOLO  =  'S'
           then
               go  to I30-EX
           ELSE
              MOVE  5                   TO TDSREPORT-NUM-RPT
              MOVE '00'                 TO OUT-STATUS
           end-if.
      *--------------------------------------- Controllo per stuttura
           move  L-CODICE-SEDE  to  C-CODICE-SEDE.
           move  L-CODICE-STOP  to  C-CODICE-STOP.
           move  L-NOME-SEDE    to  C-NOME-SEDE.
           move  L-NOME-STOP    to  C-NOME-STOP.
           move  W-PROCEDURA    to  C-PROCEDURA.
           move  'I'            to  C-RICHIESTA.
           move  zeros          to  C-PROGRESSIVO
                                    C-CONGUAGLIO.
           move  spaces         to  C-DIRIGENTE
                                    C-ELABINCORSO
                                    C-RETCODE.
      *
           CALL  PDSPD16  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 AREALINK-1  AREALINK-2.
           cancel PDSPD16.
      *-------------------------------------- Elaborazione non valida
           if  C-RETCODE  =  'E'
           then
               move  '96'              to  OUT-STATUS
               move  'S'  to  W-ERRORE
               perform  T70-TESTO70    thru  T70-EX
               perform  W10-MSGERRORE  thru  W10-EX
               go  to  I30-EX
           end-if.
      *-------------------------------------- Struttura disattiva?
           if  C-RETCODE  =  'D'
           then
               move  '96'              to  OUT-STATUS
               move  'S'  to  W-ERRORE
               perform  T71-TESTO71    thru  T71-EX
               perform  W10-MSGERRORE  thru  W10-EX
           end-if.
      *-------------------------------------- Elaborazione corretta
           if  C-RETCODE  =  'C'
           then
               if  C-ELABINCORSO  =  'K'
               then
                   continue
               else
                   move  '96'              to  OUT-STATUS
                   move  'S'  to  W-ERRORE
                   perform  T10-TESTO10    thru  T10-EX
                   perform  W10-MSGERRORE  thru  W10-EX
                   go  to  I30-EX
               end-if
           end-if.
      *--------------------------------------- Controllo su TDSRPG00
           move  W-PROCEDURA    to  H-PPROCEDURA.
           move  L-CODICE-STOP  to  H-PSTRUTTURA.
           move  L-CODICE-SEDE  to  H-PCOSEDE.
           move  'N'            to  H-PBACKUP   .
      *
           PERFORM I30-DB2-SELECT THRU I30-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               move  'N'        to  W-PAGAMINCORSO
           ELSE
               move  'S'        to  W-PAGAMINCORSO
           end-IF.
       I30-EX.
           EXIT.
      *
       I32-SELEZIONI.
      *
      *    MOVE PERIODI-IN-LK  TO W-PERIODI.
           move ANNO-DAL-IN-LK(1)  to  ANNO-DAL-IN1.
           move ANNO-AL-IN-LK(1)   to  ANNO-AL-IN1.
           move NUMERO-DAL-IN-LK(1) to NUMERO-DAL-IN1.
           move NUMERO-AL-IN-LK(1)  to NUMERO-AL-IN1.
      *
           move ANNO-DAL-IN-LK(2)  to  ANNO-DAL-IN2.
           move ANNO-AL-IN-LK(2)   to  ANNO-AL-IN2.
           move NUMERO-DAL-IN-LK(2) to NUMERO-DAL-IN2.
           move NUMERO-AL-IN-LK(2)  to NUMERO-AL-IN2.
           move ANNO-DAL-IN-LK(3)  to  ANNO-DAL-IN3.
           move ANNO-AL-IN-LK(3)   to  ANNO-AL-IN3.
           move NUMERO-DAL-IN-LK(3) to NUMERO-DAL-IN3.
           move NUMERO-AL-IN-LK(3)  to NUMERO-AL-IN3.
           move ANNO-DAL-IN-LK(4)  to  ANNO-DAL-IN4.
           move ANNO-AL-IN-LK(4)   to  ANNO-AL-IN4.
           move NUMERO-DAL-IN-LK(4) to NUMERO-DAL-IN4.
           move NUMERO-AL-IN-LK(4)  to NUMERO-AL-IN4.
           move ANNO-DAL-IN-LK(5)  to  ANNO-DAL-IN5.
           move ANNO-AL-IN-LK(5)   to  ANNO-AL-IN5.
           move NUMERO-DAL-IN-LK(5) to NUMERO-DAL-IN5.
           move NUMERO-AL-IN-LK(5)  to NUMERO-AL-IN5.
           move ANNO-DAL-IN-LK(6)  to  ANNO-DAL-IN6.
           move ANNO-AL-IN-LK(6)   to  ANNO-AL-IN6.
           move NUMERO-DAL-IN-LK(6) to NUMERO-DAL-IN6.
           move NUMERO-AL-IN-LK(6)  to NUMERO-AL-IN6.
      *
           MOVE WK-CURS                 TO  C-IND.
           move  zeros                  to  W-DOMANDA-DAL
                                            W-DOMANDA-AL
           move  ANNO-DAL-IN-LK(1)      to  W-DAL-ANNO.
           move  NUMERO-DAL-IN-LK(1)    to  W-DAL-NUMERO.
           move  ANNO-AL-IN-LK(C-IND)   to  W-AL-ANNO.
           move  NUMERO-AL-IN-LK(C-IND) to  W-AL-NUMERO .
      *
      *I---------29/05/2013 - Consento elab. di una sola prestazione  *
           initialize  X1-CHEPRESTA.
      *    perform  varying  IND1  from  1  by  1
      *         until  IND1  >  8
      *         MOVE T1-PRESTAZIONE(ind1)  TO  X1-PRESTAZIONE(ind1)
                MOVE T1-PRESTAZIONE(1)     TO  X1-PRESTAZIONE(1)
      *    END-PERFORM.
      *F--------------------------------------------------------------*
      *---------------------------------------- Selezione 2
           if  TIPO-ELABO-IN   =  2
      *       MOVE '00'                 TO OUT-STATUS
              PERFORM I39-SELF-CURS     thru I39-EX-SELF-CURS
           ELSE
              MOVE '1'   TO WK-CURS
           END-IF.
      *-------------------tipo pagamento PrimeLiq/Tutti/Successiv
           move PAGA-ELABO-IN   to  W-PAGARE.
      *---------------------------------------- Data fine calcolo
           if  L-TIPOCALCOLO  =  'S'
           then
      *        move DATA-ELABO-GG   TO  R-GIORNO-AL
      *        move DATA-ELABO-MM   TO  R-MESE-AL
      *        move DATA-ELABO-AA   TO  R-ANNO-AL
               perform  I38-DSPFM-M8         thru  I38-EX
           end-if.
      *---------------------------------------- Selezione 3
           if  TIPO-ELABO-IN   =  3
      *        and  L-TIPOCALCOLO  =  'S'
           then
              perform I39-DSPF-M9       thru I39-EX
           end-if.
      *
       I32-EX.
           EXIT.
      *
       I38-DSPFM-M8.
      *--------------------------------------- Giorno
           if  DATA-ELABO-GG            =  zeros
                                    or  >  31
           then
               go  to  I38-EX
           end-if.
      *
           if  DATA-ELABO-MM            =  4
                                    or  =  6
                                    or  =  9
                                    or  =  11
           then
               if  DATA-ELABO-GG            >  30
               then
                   go  to  I38-EX
               end-if
           end-if.
      *---------------------------------------Speciale febbraio !
           if  DATA-ELABO-MM            =  2
           then
      *------------------------------------------- anno bisestile ?
               divide  4  into  DATA-ELABO-AA
                   giving  RISULT  remainder RESTO
               if  BISESTILE
               then
                   move  29        to  GG-FEBBRAIO
               else
                   move  28        to  GG-FEBBRAIO
               end-if
               if  DATA-ELABO-GG            >  GG-FEBBRAIO
               then
                   go  to  I38-EX
               end-if
           end-if.
      *--------------------------------------- Mese
           if  DATA-ELABO-MM            =  zeros
                                    or  >  12
           then
               go  to  I38-EX
           end-if.
      *--------------------------------------- Anno
           if  (DATA-ELABO-AA            <  (W8-ODIAA - 1))  or
150916         (DATA-ELABO-AA            >  (W8-ODIAA + 2))
           then
      *---------- rivedere
               if L-PROCEDURA                   =  'G21' OR
                                                =  'G98' OR
                                                =  'G97' OR
                                                =  'G96' OR
                                                =  'G99'
               then
                  continue
               else
                  go  to  I38-EX
               end-if
           end-if.
      *--------------------------------------- Fine mese o metàmese  *
           if  (DATA-ELABO-GG             =  15)
               or
               (DATA-ELABO-MM             =  2    and
                (DATA-ELABO-GG            =  28   and
                 GG-FEBBRAIO  =  28))
               or
               (DATA-ELABO-MM             =  2    and
                (DATA-ELABO-GG            =  29   and
                 GG-FEBBRAIO  =  29))
               or
               (DATA-ELABO-GG             =  30   and
                (DATA-ELABO-MM            =   4   or
                 DATA-ELABO-MM            =   6   or
                 DATA-ELABO-MM            =   9   or
                 DATA-ELABO-MM            =  11))
               or
               (DATA-ELABO-GG             =  31   and
                (DATA-ELABO-MM            =   1   or
                 DATA-ELABO-MM            =   3   or
                 DATA-ELABO-MM            =   5   or
                 DATA-ELABO-MM            =   7   or
                 DATA-ELABO-MM            =   8   or
                 DATA-ELABO-MM            =  10   or
                 DATA-ELABO-MM            =  12))
           then
               continue
           else
               go  to  I38-EX
           end-if.
      *------------------------------------- Imposto data fine calcolo
           move  DATA-ELABO-GG          to  R-GIORNO-AL.
           move  DATA-ELABO-MM          to  R-MESE-AL.
           move  DATA-ELABO-AA          to  R-ANNO-AL.
      *------------------------------------- e data + 1 gg  x PDSNA02
           move  zeros         to  W8-AAAAMMGG.
           move  W-CALCOLO-AL  to  W8-AAAAMMGG.
           if  W8-GG  =  15
           then
               add   1     to  W8-GG
           else
               if  W8-MM  =  12
               then
                   add   1     to  W8-AAAA
                   move  1     to  W8-MM
                                   W8-GG
               else
                   add   1     to  W8-MM
                   move  1     to  W8-GG
               end-if
           end-if.
      *--- rivedere
           if L-PROCEDURA                   =  'G21' OR
                                            =  'G96' OR
                                            =  'G97' OR
                                            =  'G98' OR
                                            =  'G99'
           then
               move  W8-AAAAMMGG   to  W-CALCOLO-AL-PIU1
               go to I38-EX
           end-if.
           if  W8-AAAAMMGG  >  W8-ODIERNA
           then
               move  W8-AAAAMMGG   to  W-CALCOLO-AL-PIU1
           else
               move  W8-ODIERNA    to  W-CALCOLO-AL-PIU1
           end-if.
      *-------------- per simulazione con data pregressa
030215     if  W-NIK  =  'S'
           then
               move  W8-AAAAMMGG   to  W-CALCOLO-AL-PIU1
           end-if.
       I38-EX.
           EXIT.
      *
       I39-SELF-CURS.
      *
           IF ANNO-DAL-IN6 > 0
              MOVE '6'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
      *
           IF ANNO-DAL-IN5 > 0
              MOVE '5'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN4 > 0
              MOVE '4'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN3 > 0
              MOVE '3'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN2 > 0
              MOVE '2'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN1 > 0
              MOVE '1'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
       I39-EX-SELF-CURS.
           EXIT.
      *
       I39-DSPF-M9.
      *
           perform  E15-INIZIALIZZO  thru  E15-EX.
      *
      *--------------------------------------- Lettura domanda
           move  zeros                    to  WB-DOMANDA.
           move  ANNO-DAL-IN1             to  WB-ANNO.
           move  NUMERO-DAL-IN1           to  WB-NUMERO .
      *----
      *  inserire  possibilità calcolo simulato con CODICE-DOMUS
      *
           initialize  DCLTDSDATCO.
           move  WB-ANNO        to H-DCOANVEPR   .
           move  WB-NUMERO      to H-DCONDVEPR   .
           move  L-CODICE-SEDE  to H-DCOCOSEGR   .
           PERFORM I39-DB2-SELECT THRU I39-DB2-SELECT-EX.
      *
           if  SQLCODE  = 0
           then
               move  'S'     to  WL-DATICOMUNI
           else
               move  'N'     to  WL-DATICOMUNI
               MOVE '96'     to  OUT-STATUS
               STRING 'Domanda non presente in Archivio ' WB-DOMANDA
               DELIMITED BY SIZE      INTO OUT-MESSAGGIO
               go  to  I39-EX
           end-if.
      *
      *
      *---------------------------------- Impostazione esito   ------*
      *------rivedere------------------>  ANTICIPAZIONE NASPI        *
           if L-PROCEDURA                   =  'G21' or
                                            =  'G98' OR
                                            =  'G99'
GAL         if H-DCOCOTIDO              not  =  'T'
              move 'L'                       to  H-DCOULESPP
              move 'S'                       to  H-DCOPESTDI
              move  H-DCODTADEC              to  WRK-DCODTADEC
              move 0                         to  H-DCODTADEC
GAL         end-if
           end-if.
           if L-PROCEDURA                   =  'G97' or
                                            =  'G96'
              move 'L'                       to  H-DCOULESPP
              move 'S'                       to  H-DCOPESTDI
              move 0                         to  H-DCODTADEC
              move W8-ODIERNA                to  H-DCODTCODO
              move WRK-DCODTADEC             to  H-DCODTADEC
           end-if.
           move  H-DCOULESPP   to  W-DCOULESPP.
           move  H-DCOULESSP   to  W-DCOULESSP.
      *---------------------------------- Gestione per ANF/diretti   *
      *    move  'N'      to  W-ANFDIRETTI.
           if H-DCOANFRIC  =  'K'   and
              H-DCOCOTIDO  =  'U '
           then
               perform  E221-ELABORA221    thru  E221-EX
           end-if.
      *---------------------------------- Conguaglio Frontalieri     *
      *    move  'N'      to  W-FRONTALIERI.
      *n   if H-DCOCOTIDO  = '2 '                   and
      *n      H-DCOFLASU   =  1
      *n   then
      *n       perform  E231-ELABORA231  thru  E231-EX
      *n   end-if.
      *------------------------------------------ Esito prestazione
           if  W-DCOULESPP  =  'L'
      *n   or  W-DCOULESSP  =  'L'
           then
               continue
           else
               move '96'    to OUT-STATUS
               move 'Stato domanda non compatibile '
                   to  out-messaggio
               move 'S'     to W-ERRORE
               go  to  I39-EX
           end-if.
      *------------------------------------------ Tipo prestazione
           if H-DCOCOTIDO                   =  'Q '
                                        or  =  'U '
                                        or  =  'T '
           then
               continue
           else
               move '96'    to  OUT-STATUS
               move 'Prestazione non gestita '
                            to  out-messaggio
               move 'S'     to  W-ERRORE
               go  to  I39-EX
           end-if.
      *------------------------------------------ Ordinaria
           if H-DCOCOTIDO                   =  'Q '
      *                                 or  =  'U '
      *   rivedere                      or  =  'T '
               if  W-DCOULESPP  =  'L'
               then
                   if H-DCODTULPP  >                  20150131
                   then
                       continue
                   else
                       move '96'    to  OUT-STATUS
                       move 'Domanda non gestita '
                                    to  out-messaggio
                       move 'S'     to  W-ERRORE
                       go  to  I39-EX
                   end-if
               else
                   move '96'    to  OUT-STATUS
                   move 'Stato domanda non compatibile '
                                to  out-messaggio
                   move 'S'     to  W-ERRORE
                   go  to  I39-EX
               end-if
           end-if.
      *n
      *------------------------------------------ Speciale
      *n   if H-DCOCOTIDO                   =  '3 '
      *n                                or  =  '8 '
      *n       if  W-DCOULESSP  =  'L'
      *n       then
      *n           if H-DCODTULSP  >                  19990630
      *n           then
      *n               continue
      *n           else
      *n               move '96'    to OUT-STATUS
      *n               move 'Stato domanda non compatibile '
      *n                        to  out-messaggio
      *n               move 'S'     to W-ERRORE
      *n               go  to  I39-EX
      *n           end-if
      *n       else
      *n           go  to  I39-EX
      *n       end-if
      *n   end-if.
      *------------------------------------------ Doppio trattamento
      *n   if H-DCOCOTIDO                   =  '0 '
      *n                                or  =  '5 '
      *n                                or  =  '9 '
      *n       if  W-DCOULESPP  =  'L'   or
      *n           W-DCOULESSP  =  'L'
      *n       then
      *n           if H-DCODTULPP  >                  19990630   or
      *n              H-DCODTULSP  >                  19990630
      *n           then
      *n               continue
      *n           else
      *n               move '96'    to OUT-STATUS
      *n               move 'Domanda non gestita '
      *n                        to  out-messaggio
      *n               move 'S'     to W-ERRORE
      *n               go  to  I39-EX
      *n           end-if
      *n       else
      *n               move '96'    to OUT-STATUS
      *n               move 'Stato domanda non compatibile '
      *n                        to  out-messaggio
      *n               move 'S'     to W-ERRORE
      *n           go  to  I39-EX
      *n       end-if
      *n   end-if.
      *----------------------------------------Lettura DATICOMUNI
      *    initialize  DCLTDSDATCO.
      *    move  WB-ANNO        to H-DCOANVEPR   .
      *    move  WB-NUMERO      to H-DCONDVEPR   .
      *
      *    PERFORM I39-DB2-SELECT THRU I39-DB2-SELECT-EX.
      *
      *    IF  SQLCODE  = 0
      *         move  'S'     to  WL-DATICOMUNI
      *    ELSE
      *         move  'N'     to  WL-DATICOMUNI
      *         go  to  I39-EX
      *    END-IF.
      *---------------------------------- Gestione per ANF/diretti   *
      *    move  'N'      to  W-ANFDIRETTI.
           if H-DCOANFRIC  =  'K'   and
              H-DCOCOTIDO  =  'U'
           then
               perform  E22-ELABORA22    thru  E22-EX
           end-if.
      *---------------------------------- Conguaglio Frontalieri     *
      *    move  'N'      to  W-FRONTALIERI.
      *n   if H-DCOCOTIDO                   = '2 '   and
      *n      H-DCOFLASU                    =  1
      *n   then
      *n       perform  E23-ELABORA23    thru  E23-EX
      *n   end-if.
      *------------------------------------------ Leggo archivi      *
           move  'N'    to  W-ERRORE.
           perform  L10-LETTURA     thru  L10-EX.
           if  W-ERRORE  =  'S'
           then
               perform  M43-READ-ERROR  thru  M43-EX
               go  to  I39-EX
           end-if.
      *------------------------------------------                    *
           move  99  to  OC-RETCODE
      *    initialize   AREA1.
      *------------------------------------------ Calcolo ordinaria  *
      *----------- con PER-CALCOLO                                   *
               move  'PDSNA13S'         to  IC-CHIAMANTE.
               move  DATA-ELABO-IN      to  IC-CALCOLOAL.
      *ggnew   move  W8-ODIERNA         to  IC-CALCOLOAL.
               move  L-CODICE-STOP      to  IC-STRUTTURA.
      *--------------------------------------- Verifica Blocco pagamento
           move  H-DCOCODFIS                  to  LK-CODFIS.
           move  'N'                          to  LK-RISP.
           CALL  RDSUT28  USING
                 WDFHEIBLK  WDFHCOMMAREA
                 PER-RDSUT28.
280218*    cancel  RDSUT28.
           if  LK-RISP =  'S'
           then
               move '96'    to OUT-STATUS
               move
               'Pagamenti bloccati x il Codice Fiscale: vedi SCUP '
                        to  out-messaggio
               move 'S'     to W-ERRORE
               go  to  I39-EX
           end-if.
      *------------------------------------------ Anagrafica         *
           move  'N'    to  W-ERRORE.
           perform  E31-ANAGRAFICA   thru  E31-EX.
           if  W-ERRORE  =  'S'
           then
               move '96'    to OUT-STATUS
300321**
      **       move 'Dati anagrafici non disponibili '
      **                to  out-messaggio
230620**       if  LK-RISP =  'S'
      **       then
      **           move 'Pagamenti Bloccati per il Codice Fiscale'
      **               to  out-messaggio
      **       end-if
      **       if  CNT-C100  >  zeroes
      **       then  move
      **         'Non pagabile: erogate  prestazioni incompatibili. '
      **               to  out-messaggio
230620**       end-if
300321**
               go  to  I39-EX
           end-if.
      *
      *  SE PRIMA LIQUIDAZIONE
      *
           move  W-CALCOLO-AL-PIU1  to  IC-CALCOLOAL.
      *    move  20141231           to  IC-CALCOLOAL. --prova
      *    IF IC-CALCOLOAL  = 15 AND
      *    IF IC-PMEINDTOTE = 0
      *       MOVE 0 TO IC-CALCOLOAL
      *    END-IF.
      *
      *--------rivedere---------------->  ANTICIPAZIONE NASPI        *
           if L-PROCEDURA                   =  'G98' OR
                                            =  'G99'
              if IC-PMEINDUIME < 0
                 COMPUTE IC-PMEINDTOTE = IC-PMEINDTOTE + IC-PMEINDUIME
                 move IC-PMEINDTOTE  to  IC-PMEORDTOTE
                 move 0              to  IC-PMEINDUIME
              end-if
           end-if.
           if  W-XPDSNA02  =  'Y'
           then
               if (W-CODICEUNO  =   35 or 36)
               then
                   if  W-NIK  =  'S'    and
                       L-TIPOCALCOLO  =  'S'
                   then
                       call  PDSNA42  USING
                                      WDFHEIBLK  WDFHCOMMAREA
                                      PER-CALCOLO L-CODICE-SEDE
                       cancel PDSNA42
                   else
                       call  PDSNA02  USING
                                      WDFHEIBLK  WDFHCOMMAREA
                                      PER-CALCOLO L-CODICE-SEDE
                       cancel PDSNA02
                   end-if
               end-if
      *            anticipazione NASPI
               if (W-CODICEUNO  =   37)
               then
                   call  PDSAU41  USING
                         WDFHEIBLK  WDFHCOMMAREA
                         COMMAREADS
                         PER-CALCOLO
                   end-call
                   cancel PDSAU41
               end-if
      *
               if  OC-RETCODE  >  0
               then
                       move '96'         to    OUT-STATUS
               end-if
               if  W-NIK  =  'S'
               then
                   perform  I41-PERSVA   thru  I41-EX
               end-if
           else
               move  98   to  OC-RETCODE
               move  'Anomalia Calcolo/Pagamento/Definizione'
                          to  OC-MESSAGGIO
           end-if.
      *--------------------------------- Controlli pagamenti + / -   *
           if  OC-RETCODE  equal  zeroes
           then
               perform  E25-CONTROLLI  thru  E25-EX
           end-if.
           if  (OC-RETCODE  equal  zeroes)  or
               (OC-RETCODE  =  96)
           then
               if  OC-PMEIMULASE  >  2.00
               then
                   perform  E26-PAGABILI   thru  E26-EX
               else
                   perform  E27-DEFINITE   thru  E27-EX
               end-if
           end-if.
      *--------------------------------------------------------------*
           if  (OC-RETCODE  equal  zeroes)  or
               (OC-RETCODE  =  96)
           then
      *-------------------------------------------- Verifica         *
               perform  J10-QUADRATURA   thru  J10-EX
      *-------------------------------------------- Visualizzo       *
               move  'E'                  to  W-VALUTA
               perform  M39-DSPF-M13B    thru  M39-EX
           else
               perform  M41-ERR-CALCOLO  thru  M41-EX
           end-if.
      *-------------------------------------------- Visualizzo chk   *
121020     if  W-NIK  =  'S'
           then
               if  W-ERRORE     =  'N'   and
                   W-CHK-CAMPI  =  spaces
               then
                   if  W-ERR-PROROGA  =  'S'
                   then
                       move  W-CHK-PROROGA  to  OUT-MESSAGGIO
                   end-if
               end-if
131020     end-if.
       I39-EX.
           EXIT.
      *                                                              *
       I41-PERSVA.
050916     if  W8-ODIERNA  <  20160905
           then
               if  W-ANF-DA062015  =  'N'   and
                   OC-PMEINDUIME  >=   zeroes
               then
                   move  BAK-PMEANFTOTE to  IC-PMEANFTOTE
                                            OC-PMEANFTOTE
                   move  BAK-PMEANFTOGG to  IC-PMEANFTOGG
                                            OC-PMEANFTOGG
               end-if
050916     end-if.
      *----------------------------------- x RDSNA12  12/11/2012    *
           CALL  RDSNA12  USING
                                    WDFHEIBLK  WDFHCOMMAREA
                                    L-CODICE-SEDE
                                    L-CODICE-STOP
                                    L-NOME-SEDE
                                    L-NOME-STOP
                                    L-PROCEDURA
                                    PER-CALCOLO
                                    LAREA-D
                                    L-NUM-RIGA
           end-call.
           cancel RDSNA12.
      *----------------------------------- x RDSNA13   6/4/2006     *
           CALL  RDSNA13  USING
                                    WDFHEIBLK  WDFHCOMMAREA
                                    L-CODICE-SEDE
                                    L-CODICE-STOP
                                    L-NOME-SEDE
                                    L-NOME-STOP
                                    L-PROCEDURA
                                    PER-CALCOLO
                                    LAREA-D
           end-call.
           cancel  RDSNA13 .
       I41-EX.
           EXIT.
      *                                                              *
       I60-BLOCCO.
           if  L-TIPOCALCOLO  =  'S'
           then
               go  to  I60-EX
           end-if.
      *------------BLOCCO-------------->  ANTICIPAZIONE NASPI        *
      *    if T1-PRESTAZIONE(1)             =  'T '
      *       if L-TIPOCALCOLO              =  'R'
      *          if LMATRICOLA
      *                        = '79137000' or
      *                        = '28946000' or
      *                        = '26272000' or
      *                        = '01884000' or
      *                        = '78520000' or
      *                        = '56259000'
      *    then
      *        continue
      *    else
      *        move  '96'              to  OUT-STATUS
      *        perform  T16-TESTO16    thru  T16-EX
      *        perform  W10-MSGERRORE  thru  W10-EX
      *        move  'S'  to  W-ERRORE
      *        go  to  I60-EX
      *    end-if.
      *------------------------------------ Verifica situazione      *
           perform I30-CHK-PAGAMENTO   thru  I30-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  I60-EX
           end-if.
           if  W-PAGAMINCORSO  =  'N'   and
               C-ELABINCORSO   =  'K'
           then
               continue
           else
               move  '96'              to  OUT-STATUS
               perform  T12-TESTO12    thru  T12-EX
               perform  W10-MSGERRORE  thru  W10-EX
               move  'S'  to  W-ERRORE
               go  to  I60-EX
           end-if.
      *
      *-------------------------------------- Attivazione LOCK       *
           perform  I62-INIZIOLOCK  thru  I62-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  I60-EX
           end-if.
      *------------------------------------ Memorizzo esecuzione     *
           move  'N'            to  W-FLAGYNCORSO.
           move  L-CODICE-SEDE  to  C-CODICE-SEDE.
           move  L-CODICE-STOP  to  C-CODICE-STOP.
           move  L-NOME-SEDE    to  C-NOME-SEDE.
           move  L-NOME-STOP    to  C-NOME-STOP.
           move  W-PROCEDURA    to  C-PROCEDURA.
           move  'C'            to  C-RICHIESTA.
           move  zeros          to  C-PROGRESSIVO
                                    C-CONGUAGLIO.
           move  spaces         to  C-DIRIGENTE
                                    C-ELABINCORSO
                                    C-RETCODE.
      *                                                              *
           CALL  PDSPD16  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 AREALINK-1  AREALINK-2.
           cancel PDSPD16.
      *-------------------------------------- Verifica esito         *
           if  C-RETCODE      =  'C'   and
               C-ELABINCORSO  =  'Y'
           then
               move  'S'               to  W-FLAGYNCORSO
               move  C-DIRIGENTE       to  W-NOMEDIR
               move  C-PROGRESSIVO     to  W-PROGRESSIVO
               move  C-CONGUAGLIO      to  W-CONGUAGLIO
           else
               move  '96'              to  OUT-STATUS
               perform  T12-TESTO12    thru  T12-EX
               perform  W10-MSGERRORE  thru  W10-EX
               move  'S'  to  W-ERRORE
      *        go  to  I60-EX                                        *
           end-if.
       I60-EX.
           EXIT.
      *
       I62-INIZIOLOCK.
      *------------------------------------ Memorizzo LOCK           *
      *    move  '61441000'        to  K-MATRICOLA.
           move  LMATRICOLA        to  K-MATRICOLA.
           string  L-CODICE-STOP       delimited by size
                   L-PROCEDURA         delimited by size
                   W8-ODIERNA          delimited by size
                                 into  K-NDOMUS.
           move  'B '              to  K-TIPO-DOMANDA.
           move  'L '              to  K-TIPO-RICHIESTA.
           move  L-CODICE-STOP     to  K-CENTRO-OPERATIVO.
           move  'P'               to  K-TIPO-OPERAZIONE.
           move  'N'               to  K-AUTO-COMMIT.
           move  spaces            to  K-RETURN-CODE
                                       K-RETURN-MESSAGE
                                       K-IS-LOCKED
                                       K-ESITO-LOCK-UNLOCK
                                       K-LOCK-UNLOCK-MESSAGE.
           move L-CODICE-SEDE      TO  K-CODICESEDE.
      *    call  PDSLOCK USING
      *                 WDFHEIBLK
      *                 WDFHEIBLK  WDFHCOMMAREA
      *                 L-AREA-LOCK
      *    end-call.
      *    cancel  PDSLOCK .
           EXEC CICS LINK PROGRAM(PDSLOCK)
                          COMMAREA(L-AREA-LOCK)
                          LENGTH(27000)
           END-EXEC.
           if  (K-RETURN-CODE   not  =  'KO')  and
               (K-ESITO-LOCK-UNLOCK  =  'OK')  and
               (K-IS-LOCKED          =  'N' )
           then
               continue
           else
               if  K-RETURN-CODE     =  'KO'
               then
                   move  K-RETURN-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO OUT-STATUS
               end-if
               if  K-ESITO-LOCK-UNLOCK  =  'KO'
               then
                   move  K-LOCK-UNLOCK-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO OUT-STATUS
               end-if
               move  'S'  to  W-ERRORE
      *        go  to  I62-EX
           end-if.
       I62-EX.
           EXIT.
      *
      *
       J10-QUADRATURA.
      *---------------------------------------- Solo se pagata       *
      *    if  (OC-PMEINDUIME  >  zeroes    or
      *         OC-PMEANFUIME  >  zeroes)  and
      *         OC-PMEIMULASE  >  zeroes
           if   OC-PMEIMULASE  >  zeroes
           then
               perform  J12-QUADRAFISCO    thru  J12-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  J10-EX
               end-if
           else
               go  to  J10-EX
           end-if.
      *----------------------------------------- Quadratura contabile*
      *n---------------------------------------- Solo per IND/ANF > 0*
      *n   if  (OC-PMEINDUIME  >  zeroes    or
      *n        OC-PMEANFUIME  >  zeroes)
      *n   then  continue
      *n   else  go  to  J10-EX
      *n   end-if.
      *
           move  zeros             to  W-DIFFERENZA.
           compute  W-DIFFERENZA    =  OC-PMEINDUIME
                                    +  OC-PMEANFUIME
                                    +  OC-PMEINLEPRE
                                    +  OC-PMEINLEANE
                                    -  OC-PMEUITRSIE
                                    -  OC-PMECONFISE
                                    -  OC-PMEADDCOME
                                    -  OC-PMEADDREGE
                                    -  OC-PMEULIRN1E
                                    -  OC-PMEULIRNSE
                                    -  OC-PMEIMULASE
                                    -  OC-RECIMUREE-1
                                    -  OC-RECIMUREE-2
                                    -  OC-RECIMUREE-3
                                    +  W-INDEB-IND
                                    +  W-INDEB-ANF.
           if  OC-CODICE7  =  '730'
           then
               subtract  OC-IMPORTO7
                                 from  W-DIFFERENZA
           end-if.
141013     if  W-ANFDIRETTI  =  'S'
           then
               subtract  IC-AADRECUP
                                 from  W-DIFFERENZA
141013     end-if.
           move  W-DIFFERENZA      to  W-SQUADRATURA.
           if  W-DIFFERENZA  =  zeros
           then
               continue
           else
               move  'S'  to  W-ERRORE
               go  to  J10-EX
           end-if.
      *
      *    if  OC-PMEUITRSIE  =  OC-FADTRATSIND
      *    then
      *        continue
      *    else
      *        move  'Valore di OC-PMEUITRSIE  non = OC-FADTRATSIND   '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *--------------- rivedere con piero
      *    if  (OC-PMEINDUIME     +  OC-PMEINLEPRE)  equal
      *        (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE  +
      *         OC-FACTREDICESIMA +  OC-FAPTREDICESIMA +
      *         OC-RECIMUREE-1    +  OC-RECIMUREE-3)
      *    then
      *        continue
      *    else
      *        move  'OC-PME(INDUIME+INLEPRE) not= OC(FAC+FAPIMPONIBIL'
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *----------------------------------
      *    if  (OC-PMEANFUIME     +  OC-PMEINLEANE)  equal
      *        OC-FADANFPAGATI
      *    then
      *        continue
      *    else
      *        move  'OC-PME(ANFUIME+INLEANE) not= OC-FADANFPAGATI    '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  OC-PMEIMULASE  =  OC-FADNETTOPAG
      *    then
      *        continue
      *    else
      *        move  'Valore di OC-PMEIMULASE not= OC-FADNETTOPAG     '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  OC-PMECONFISE  =
      *        (OC-FCONGAC  +  OC-FCONGAP)
      *    then
      *        continue
      *    else
      *        move  'OC-PMECONFISE not= OC-(FCONGAC+FCONGAP)        '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  OC-PMEADDCOME  =  OC-FIMPCOMAP
      *    then
      *        continue
      *    else
      *        move  'OC-PMEADDCOME not= OC-FIMPCOMAP                '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  OC-PMEADDREGE  =  OC-FIMPREGAP
      *    then
      *        continue
      *    else
      *        move  'OC-PMEADDREGEnot= OC-FIMPREGAP                 '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  OC-PMEULIRNSE  =  OC-FAPIMPNETTA
      *    then
      *        continue
      *    else
      *        move  'OC-PMEULIRNSE not= OC-FAPIMPNETTA              '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  OC-PMEULIRN1E  =  OC-FACIMPNETTA
      *    then
      *        continue
      *    else
      *        move  'OC-PMEULIRN1E not= OC-FACIMPNETTA              '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  (OC-RECIMUREE-1  +  OC-RECIMUREE-3)  equal
      *         OC-FADRECSUIND
      *    then
      *        continue
      *    else
      *        move  'OC-(RECIMUREE1+/RECIMUREE2) not= OC-FADRECSUIND'
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if   OC-RECIMUREE-2  equal
      *         OC-FADRECSUANF
      *    then
      *        continue
      *    else
      *        move  'OC-RECIMUREE-2 not= OC-FADRECSUANF             '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
       J10-EX.
           EXIT.
      *
       J12-QUADRAFISCO.
011221*---------- verifica detassazione Anticipazione  * quote coop.*
           if  IC-FLGANTICIP  =  'Q'
           then
               if  OC-FIMPPAGA1  >  0   and
                   OC-FCODPAGA1  =  'SNI'
               then
                   continue
               else
                   move  'S'  to  W-ERRORE
                   move
                  'Errore dati fiscali, invia mail a PagamentiDSweb'
                                        to  W-CHK-CAMPI
                   go  to  J12-EX
               end-if
011221     end-if.
      *------------------- Gli ANF sono al lordo recuperi !!!!!     *
      * quindi: (OC-PMEINLEANE     +  OC-PMEANFUIME)       -
      *         (OC-RECIMUREE-2)                           -
           move  zeros             to  W-DIF-FISCALE.
      *    if  OC-FCODPAGA1  =  '730'  or
           if  OC-FCODPAGA1  =  'ACC'
           then
               compute  W-DIF-FISCALE   =
               ((OC-FACIMPONIBILE  +  OC-FACTREDICESIMA
                                   -  OC-PMEULIRN1E)       +
                (OC-FAPIMPONIBILE  +  OC-FAPTREDICESIMA
                                   -  OC-PMEULIRNSE)       +
                (OC-PMEINLEANE     +  OC-PMEANFUIME)       +
080916                                W-INDEB-ANF          -
141013          (OC-RECIMUREE-2    +  IC-AADRECUP)         -
                (OC-PMEUITRSIE)                            -
                (OC-FCONGAC        +  OC-FCONGAP)          -
                (OC-FIMPREGAC      +  OC-FIMPREGAP)        -
                (OC-FIMPCOMAC      +  OC-FIMPCOMAP)        -
                 OC-FIMPPAGA1                              -
                 OC-IMPORTO7
               )                                           -
                 OC-PMEIMULASE
           end-if.
      *
           if  OC-FCODPAGA1  =  '   '  or
               OC-FCODPAGA1  =  'SNI'
           then
               compute  W-DIF-FISCALE   =
               ((OC-FACIMPONIBILE  +  OC-FACTREDICESIMA
                                   -  OC-PMEULIRN1E)       +
                (OC-FAPIMPONIBILE  +  OC-FAPTREDICESIMA
                                   -  OC-PMEULIRNSE)       +
                (OC-PMEINLEANE     +  OC-PMEANFUIME)       +
080916                                W-INDEB-ANF          -
                (OC-RECIMUREE-2    +  IC-AADRECUP)         -
                (OC-PMEUITRSIE)                            -
                (OC-FCONGAC        +  OC-FCONGAP)          -
                (OC-FIMPREGAC      +  OC-FIMPREGAP)        -
                (OC-FIMPCOMAC      +  OC-FIMPCOMAP)        +
                 OC-FIMPPAGA1                              -
                 OC-IMPORTO7
               )                                           -
                 OC-PMEIMULASE
           end-if.
      *
           if  W-DIF-FISCALE  =  zeros
           then
               continue
           else
               move  'S'  to  W-ERRORE
               move
                 'Errore quadratura fiscale: segnala a  HELP-DSORD'
                                        to  W-CHK-CAMPI
      *        go  to  J12-EX
           end-if.
       J12-EX.
           EXIT.
      *
       J20-MUOVIEURO.
      *----------------------------------------- Ultimo importo ind.
           move  OC-PMEINDUIME       to  MBN013 .
      *----------------------------------------- Totale indennita'
           move  OC-PMEINDTOTE       to  MBN014 .
      *----------------------------------------- Totale gg. indenn.
           move  OC-PMEINDTOGG       to  MBN015 .
      *----------------------------------------- Ultimo importo ANF
           move  OC-PMEANFUIME       to  MBN016 .
      *----------------------------------------- Totale ANF
           move  OC-PMEANFTOTE       to  MBN017 .
      *----------------------------------------- Totale gg. ANF
           move  OC-PMEANFTOGG       to  MBN018 .
      *----------------------------------------- Ultima tratt. IRPEF AC
           move  OC-PMEULIRN1E       to  MBN019 .
      *----------------------------------------- Totale tratt. IRPEF AC
           move  OC-PMETOIRNCE       to  MBN020 .
      *----------------------------------------- Ultima tratt. IRPEF AP
           move  OC-PMEULIRNSE       to  MBN029 .
      *----------------------------------------- Totale tratt. IRPEF AP
           move  OC-PMETOIRNPE       to  MBN030 .
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-PMECONFISE  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031
      *        move  'Rimborso   Irpef 2004'
      *                             to  MBA031
               move  OC-PMECONFISE  to  MBN032
           end-if.
           if  OC-PMECONFISE  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031
      *        move  'Conguaglio Irpef 2004'
      *                             to  MBA031
               move  OC-PMECONFISE  to  MBN032
           end-if.
           move  OC-PMECONFISE      to  MBN032 .
      *----------------------------------------- Conguaglio Irpef AC
           if  OC-CODICE7  =  '730'
           then
               move  'Conguaglio da 730    '
                                    to  MBA031
               move  OC-IMPORTO7    to  MBN032
           end-if.
      *----------------------------------------- Addizionale Regionale
           move  OC-PMEADDREGE      to  MBN033 .
      *----------------------------------------- Addizionale Comunale
           move  OC-PMEADDCOME      to  MBN034 .
      *----------------------------------------- Ultima tratt. sindac.
           move  OC-PMEUITRSIE       to  MBN021 .
      *----------------------------------------- Totale tratt. sindac.
           move  OC-PMETOTRSIE       to  MBN022 .
      *----------------------------------------- Acconto
           move  OC-RECIMUREE-3      to  MBN023 .
      *----------------------------------------- Ultimo  recupero ind.
           add   OC-RECIMUREE-1      to  MBN024 .
      *----------------------------------------- Ultimo  recupero ANF
           add   OC-RECIMUREE-2      to  MBN024 .
141013     if  W-ANFDIRETTI  =  'S'
           then
               add   IC-AADRECUP     to  MBN024
141013     end-if.
      *----------------------------------------- Interessi indennità
           move  zeros               to  MBN025 .
           add   OC-PMEINLEPRE       to  MBN025 .
      *----------------------------------------- Interessi ANF
           add   OC-PMEINLEANE       to  MBN025 .
      *---------------------------------conta   Pagamenti > 4999 euro
           IF    OC-PMEIMULASE > 4999
                 ADD   1   TO  CTR-ATT-PAGME
           END-IF.
      *----------------------------------------- Assegno
           move  OC-PMEIMULASE       to  MBN026 .
      *---------------------------------Settimana Natalizia
           move  OC-PMEIMINNAE       to  MBN301 .
           move  OC-PMEIMIANFE       to  MBN302 .
      *----------------------------------------- Squadratura
           if  W-NIK  =  'S'
           then
               if  W-DIFFERENZA     =  zeros
               then
                   move  spaces     to  MBA041
               else
                   string  'Att. squadra di euro '
                                        delimited   by  size
                      R-SQUADRATURA     delimited   by  size
                                  into  MBA041
                   go  to  J20-EX
               end-if
               if  W-CHK-CAMPI       =  spaces
               then
                   move  spaces     to  MBA041
               else
                   string  'ATT: '
                                        delimited   by  size
                      W-CHK-CAMPI       delimited   by  size
                                  into  MBA041
               end-if
           end-if.
       J20-EX.
           EXIT.
      *
       J30-MUOVILIRE.
      *----------------------------------------- Ultimo importo ind.
           compute  W-CALCOLI   rounded  =
                                    OC-PMEINDUIME    *  W-EURO
           move  W-CALCOLI          to  MBN013 .
      *----------------------------------------- Totale indennita'
           compute  W-CALCOLI   rounded  =
                                    OC-PMEINDTOTE    *  W-EURO
           move  W-CALCOLI          to  MBN014 .
      *----------------------------------------- Totale gg. indenn.
           move  OC-PMEINDTOGG       to  MBN015 .
      *----------------------------------------- Ultimo importo ANF
           compute  W-CALCOLI   rounded  =
                                    OC-PMEANFUIME    *  W-EURO
           move  W-CALCOLI          to  MBN016 .
      *----------------------------------------- Totale ANF
           compute  W-CALCOLI   rounded  =
                                    OC-PMEANFTOTE    *  W-EURO
           move  W-CALCOLI          to  MBN017 .
      *----------------------------------------- Totale gg. ANF
           move  OC-PMEANFTOGG       to  MBN018 .
      *----------------------------------------- Ultima tratt. IRPEF AC
           compute  W-CALCOLI   rounded  =
                                    OC-PMEULIRN1E    *  W-EURO
           move  W-CALCOLI          to  MBN019 .
      *----------------------------------------- Totale tratt. IRPEF AC
           compute  W-CALCOLI   rounded  =
                                    OC-PMETOIRNCE    *  W-EURO
           move  W-CALCOLI          to  MBN020 .
      *----------------------------------------- Ultima tratt. IRPEF AP
           compute  W-CALCOLI   rounded  =
                                    OC-PMEULIRNSE    *  W-EURO
           move  W-CALCOLI          to  MBN029 .
      *----------------------------------------- Totale tratt. IRPEF AP
           compute  W-CALCOLI   rounded  =
                                    OC-PMETOIRNPE    *  W-EURO
           move  W-CALCOLI          to  MBN030 .
      *----------------------------------------- Conguaglio Irpef AC
      *    if  OC-PMECON????   <  zeroes
      *    then
      *        move  'Rimborso D.L.268/2000'
      *                             to  MBA031
      *    end-if.
      *    if  OC- CONGAC ???  >  zeroes
      *    then
      *        move  'Conguaglio Irpef A.C.'
      *                             to  MBA031
      *    end-if.
      *    compute  W-CALCOLI   rounded  =
      *                             OC- CONGAC ???  *  W-EURO
      *    move  W-CALCOLI          to  MBN032 .
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-PMECONFISE  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031
      *        move  'Rimborso   Irpef 2004'
      *                             to  MBA031
               compute  W-CALCOLI   rounded  =
                                    OC-PMECONFISE    *  W-EURO
               move  W-CALCOLI      to  MBN032
           end-if.
           if  OC-PMECONFISE  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031
      *        move  'Conguaglio Irpef 2004'
      *                             to  MBA031
               compute  W-CALCOLI   rounded  =
                                    OC-PMECONFISE    *  W-EURO
               move  W-CALCOLI      to  MBN032
           end-if.
      *----------------------------------------- Conguaglio 730      *
           if  OC-CODICE7  =  '730'
           then
               move  'Conguaglio da 730    '
                                    to  MBA031
               compute  W-CALCOLI   rounded  =
                                    OC-IMPORTO7      *  W-EURO
               move  W-CALCOLI      to  MBN032
           end-if.
      *----------------------------------------- Addizionale Regionale
           compute  W-CALCOLI   rounded  =
                                    OC-PMEADDREGE   *  W-EURO
           move  W-CALCOLI          to  MBN033 .
      *----------------------------------------- Addizionale Comunale
           compute  W-CALCOLI   rounded  =
                                    OC-PMEADDCOME   *  W-EURO
           move  W-CALCOLI          to  MBN034 .
      *----------------------------------------- Ultima tratt. sindac.
           compute  W-CALCOLI   rounded  =
                                    OC-PMEUITRSIE    *  W-EURO
           move  W-CALCOLI          to  MBN021 .
      *----------------------------------------- Totale tratt. sindac.
           compute  W-CALCOLI   rounded  =
                                    OC-PMETOTRSIE    *  W-EURO
           move  W-CALCOLI          to  MBN022 .
      *----------------------------------------- Acconto
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-3  *  W-EURO
           move  W-CALCOLI          to  MBN023 .
      *----------------------------------------- Ultimo  recupero ind.
           move  zeros              to  MBN024 .
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-1  *  W-EURO
           add   W-CALCOLI          to  MBN024 .
      *----------------------------------------- Ultimo  recupero ANF
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-2  *  W-EURO
           add   W-CALCOLI          to  MBN024 .
      *----------------------------------------- Interessi indennità
           move  zeros              to  MBN025 .
           compute  W-CALCOLI   rounded  =
                                    OC-PMEINLEPRE    *  W-EURO
           add   W-CALCOLI          to  MBN025 .
      *----------------------------------------- interessi ANF
           compute  W-CALCOLI   rounded  =
                                    OC-PMEINLEANE    *  W-EURO
           add   W-CALCOLI          to  MBN025 .
      *----------------------------------------- Assegno
           compute  W-CALCOLI   rounded  =
                                    OC-PMEIMULASE    *  W-EURO
           move  W-CALCOLI          to  MBN026 .
      *----------------------------------------- Squadratura
           if  W-NIK  =  'S'
           then
               if  W-DIFFERENZA     =  zeros
               then
                   move  spaces     to  MBA041
               else
                   move  'Attenzione: squadratura!         '
                                to  MBA041
                   go  to  J20-EX
               end-if
               if  W-CHK-CAMPI       =  spaces
               then
                   move  spaces     to  MBA041
               else
                   move  'Attenzione: dati calcolo dubbi!  '
                                to  MBA041
               end-if
           end-if.
       J30-EX.
           EXIT.
      *
      *
       M39-DSPF-M13B.
           if  W-NIK  =  'S'
           then
               move  '-N.A.S.P.I'   to  MBA099
           else
               move  spaces         to  MBA099
           end-if.
      *----------------------------------------- Anno e numero       *
           move  WB-DOMANDA               to  MBN002 .
      *----------------------------------------- Codice domus        *
           move  IC-DCOCHIDOM       to  MBA051 .
      *----------------------------------------- Cognome e nome      *
           move  IC-COMPATTO        to  MBA004 .
      *----------------------------------------- Data di nascita     *
           move  WIC-DTNASCITA      to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN005 .
      *----------------------------------------- Codice fiscale      *
      *    move  IC-DCOCODFIS       to  MBA052 .
           move  IC-CODFISARCA      to  MBA052 .
      *----------------------------------------- Indirizzo
           move  WIC-DANIND         to  MBA006 .
           if  W-NIK  =  'S'    and
               L-TIPOCALCOLO  =  'S'
           then
               move  '***  TEST PDSNA42  ***'  to  MBA006
           end-if.
      *----------------------------------------- C.A.P.
           move  WIC-DANCAP         to  MBN007 .
      *----------------------------------------- Comune e provincia res
           move  WIC-DANCOCORE      to  MBA008 .
           move  WIC-DANSIPRRE      to  MBA009 .
      *----------------------------------------- Coordinate bancarie
           if  IC-DCOCOOBAN  =  spaces
280922       AND H-DCOIBAN not = 'EEEE'
           then
               move  'Pagamento con ASSEGNO            '
                                    to  MBA010
           else
280922       IF H-DCOIBAN  = 'EEEE'
280922         string  'Accredito '  delimited  by  size
280922            W-IBEIBAEST        delimited  by  size
280922                        into      MBA010
280922       ELSE
               string  'Accredito '  delimited  by  size
                  IC-DCOCOOBAN       delimited  by  size
                              into      MBA010
280922       END-IF
           end-if.
      *--------------------------------- Progressivo elaborazione??
      *    move  zeros              to  MBN011 .
      *----------------------------------------- Data riferim. calcolo
           move  OC-PMEDTRICA       to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012 .
      *----------------------------------------- Importi
           if  W-VALUTA  =  'E'
           then
               perform  J20-MUOVIEURO      thru  J20-EX
           end-if.
           if  W-VALUTA  =  'L'
           then
               perform  J30-MUOVILIRE      thru  J30-EX
           end-if.
      *-----------VO-DSPFM13B------------------- Visualizzo
      *    move VO-DSPFM13B         to  OUT-DATI.
           move  OC-MESSAGGIO       to  OUT-MESSAGGIO.
           move 0                   to RBN090   .
      *GG  move MBN090              to RBN090   .
           move MBA099              to RBA099   .
           move MBN002              to RBN002   .
           move SPACES              to RBA003   .
      *GG  move MBA003              to RBA003   .
           move MBA051              to RBA051   .
           move MBA004              to RBA004   .
           move MBN005              to RBN005   .
           move MBA052              to RBA052   .
           move MBA006              to RBA006   .
           move MBN007              to RBN007   .
           move MBA008              to RBA008   .
           move MBA009              to RBA009   .
           move MBA010              to RBA010   .
           move MBN012              to RBN012   .
           move MBN013              to RBN013   .
           move MBN014              to RBN014   .
           move MBN015              to RBN015   .
           move MBN016              to RBN016   .
           move MBN017              to RBN017   .
           move MBN018              to RBN018   .
           move MBN019              to RBN019   .
           move MBN020              to RBN020   .
           move MBN029              to RBN029   .
           move MBN030              to RBN030   .
           move MBA031              to RBA031   .
           move MBN032              to RBN032   .
           move SPACES              to RBA042   .
      *GG  move MBA042              to RBA042   .
           move MBN033              to RBN033   .
      *gg  move 0                   to RBN033   .
           move MBN034              to RBN034   .
      *gg  move 0                   to RBN034   .
           move MBN021              to RBN021   .
           move MBN022              to RBN022   .
           move MBN023              to RBN023   .
           move MBN024              to RBN024   .
           move MBN025              to RBN025   .
           move MBN026              to RBN026   .
           move MBA041              to RBA041   .
           move MBN301              to RBN301   .
           move MBN302              to RBN302   .
      *
           MOVE  RIGA-13B-1  TO TDSREPORT-RIGA-REPORT.
           MOVE  2           TO TDSREPORT-NUM-RPT.
           MOVE  1           TO TDSREPORT-NUM-RIGA.
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
           MOVE  RIGA-13B-2  TO TDSREPORT-RIGA-REPORT.
           MOVE  2           TO TDSREPORT-NUM-RPT.
           MOVE  2           TO TDSREPORT-NUM-RIGA.
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
           MOVE  RIGA-13B-3  TO TDSREPORT-RIGA-REPORT.
           MOVE  2           TO TDSREPORT-NUM-RPT.
           MOVE  3           TO TDSREPORT-NUM-RIGA.
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
           if  OC-RETCODE  NOT = ZERO
           then
               move  '96'           to  OUT-STATUS
               move  OC-MESSAGGIO   to  OUT-MESSAGGIO
           else
      *    STRING '******** ELABORAZIONE TERMINATA *****'
               move  SPACES         to  OUT-MESSAGGIO
      *---rivedere--------------------->  ANTICIPAZIONE NASPI        *
               if L-PROCEDURA                   =  'G21' OR
                                                =  'G96' OR
                                                =  'G97' OR
                                                =  'G98'
                  if IC-PMEINDUIME              < 0
                     compute WRK-PMEINDUIME =
                              OC-PMEINDUIME - IC-PMEINDUIME
                  else
                     MOVE     OC-PMEINDUIME       TO WRK-PMEINDUIME
                  end-if
                  STRING WRK-PMEINDUIME OC-PMEULPEGG OC-PMEULPEAL
                         WRK-DCODTADEC
                         DELIMITED BY SIZE INTO  OUT-MESSAGGIO
               else
                  STRING WK-RPT-KEY   W-CHK-CAMPI
                         DELIMITED BY SIZE INTO  OUT-MESSAGGIO
               end-if
           end-if.
      *
      *i   if  OUT-STATUS = 96 and W-NIK = 'S'
      *    then
      *        move  SPACES         to  OUT-MESSAGGIO
      *        STRING WK-RPT-KEY   OC-MESSAGGIO
      *               DELIMITED BY SIZE INTO  OUT-MESSAGGIO
      *f   end-if.
      *
       M39-EX.
           EXIT.
      *
      *
       M41-ERR-CALCOLO.
           perform  T41-TESTO41    thru  T41-EX.
      *
      *    evaluate  OC-RETCODE
      *      when  1  move
      *         'La domanda non è da calcolare.                    '
      *                   to  M4A013
      *      when  2  move
      *         'Il calcolo ed il pagamento risultano già eseguiti.'
      *                   to  M4A013
      *      when  3  move
      *         'Uno dei periodi presenta anomalie da correggere.  '
      *                   to  M4A013
      *      when  4  move
      *         'Non è presente l'importo giornaliero del pagamento'
      *                   to  M4A013
      *      when  5  move
      *         'La domanda è relativa ad un anno non gestito.     '
      *                   to  M4A013
      *      when  6  move
      *         'Non permane lo stato di disoccupazione.           '
      *                   to  M4A013
      *      when  7  move
      *         'Una o più date non risultano corrette.            '
      *                   to  M4A013
      *      when  8  move
      *         'Il modello DS56 non risulta rientrato.            '
      *                   to  M4A013
      *      when  9  move
      *         'Anomalia non gestibile nel calcolo dell'IRPEF.    '
      *                   to  M4A013
      *      when  other  move
      *         'Errore imprevisto: contattare S.R.Puglia.         '
      *                   to  M4A013
      *    end-evaluate.
      *
           if  (OC-RETCODE  =  0)  or
               (OC-RETCODE  =  96)
           then
               continue
           else
               move  OC-MESSAGGIO  to  M4A013
           end-if.
      *
           if  W-XPDSNA02  =  'Y'
           then
               continue
           else
               evaluate  W-XPDSNA02
                 when  'A'  move
                 'Errore nella tabella dei dati comuni              '
                          to  M4A013
                 when  'D'  move
                 'Errore nella tabella dei dati comuni              '
                          to  M4A013
                 when  'E'  move
                 'Errore nella tabella degli esiti.                 '
                          to  M4A013
                 when  'P'  move
                 'Errore sul record relativo ai pagamenti.          '
                          to  M4A013
                 when  'R'  move
                 'I record relativi ai recuperi non sono gestibili. '
                          to  M4A013
                 when  '?'  move
                 'Il calcolo ed il pagamento risultano ????         '
                          to  M4A013
                 when  other  move
                 'Errore imprevisto: contattare S.R.Puglia.         '
                          to  M4A013
               end-evaluate
           end-if.
      *
           move  'S'   to  W-SCRIVO.
           perform  W10-MSGERRORE  thru  W10-EX.
       M41-EX.
           EXIT.
      *
       M43-READ-ERROR.
           perform  T41-TESTO41    thru  T41-EX.
           move  '96'               to  OUT-STATUS.
      *------------------------------------- non usato in simulazione*
      *    if  FST-ADSRPG00  not equal  '00'
      *    then
      *        move
      *        'Errore nella lettura del file Riepilogo Pagamenti.'
      *                      to  M4A013
      *    end-if.
      *------------------------------------- non usato in simulazione*
      *    if  FST-LDSRPG01  not equal  '00'
      *    then
      *        move
      *        'Errore nella lettura del file logico su Riepilogo.'
      *                      to  M4A013
      *    end-if.
      *
           if  FST-LFDATCO2  not equal    0
           then
               move
               'Errore nella lettura del file dei Dati Comuni     '
                             to  M4A013
           end-if.
      *n
      *n   if  FST-ADSORSAM  not equal    0
      *n   then
      *n       move
      *n       'Errore nella lettura del file dei Dati Ordinaria  '
      *n                     to  M4A013
      *n   end-if.
      *n
      *n   if  FST-ADSRIFRS  not equal    0
      *n   then
      *n       move
      *n       'Errore nella lettura del file Rimpatr./Front./Stag'
      *n                     to  M4A013
      *n   end-if.
      *
           if  FST-ADSRECUP  not equal    0
           then
               move
               'Errore nella lettura del file dei Recuperi.       '
                             to  M4A013
           end-if.
      *
           if  FST-LFPEERE1  not equal    0
           then
               move
               'Errore nella lettura del file Periodi Erogati     '
                             to  M4A013
           end-if.
      *
           if  FST-ADSSITDO  not equal    0
           then
               move
               'Errore nella lettura del file Situazione Domanda  '
                             to  M4A013
           end-if.
      *
           if  FST-ADSPAGME  not equal    0
           then
               move
               'Errore nella lettura del file Pagamenti.          '
                             to  M4A013
           end-if.
      *------------------------------------- non usato in simulazione*
      *    if  FST-ADSAPRD0  not equal    0
      *    then
      *        move
      *        'Errore nella lettura del file Transito Pagamenti. '
      *                      to  M4A013
      *    end-if.
      *
           if  FST-ADSDATAN  not equal    0
           then
               move
               'Errore nella lettura del file Dati Anagrafici     '
                             to  M4A013
           end-if.
      *
           if  FST-LFDELSI1  not equal    0
           then
               move
               'Errore nella lettura del file Deleghe sindacali   '
                             to  M4A013
           end-if.
      *
           if  FST-LFMODAN1  not equal    0
           then
               move
               'Errore nella lettura del file modelli A.N.F.      '
                             to  M4A013
           end-if.
      *
           if  FST-ADSDACOD  not equal    0
           then
               move
               'Errore nella lettura del file Dati Comuni DS      '
                             to  M4A013
           end-if.
      *
           if  FST-TDSNASPI  not equal    0
           then
               move
               'Errore nella lettura del file NASPI.              '
                             to  M4A013
           end-if.
      *
           if  FST-TDSDICOL  not equal    0
           then
               move
               'Errore nella lettura del file  DISCOLL            '
                             to  M4A013
           end-if.
      *
           if  FST-TDSASPRI  not equal    0
           then
               move
               'Errore nella lettura del file ASPRI               '
                             to  M4A013
           end-if.
      *
           if  FST-TDSAUTLA  not equal    0
           then
               move
               'Errore nella lettura del file A.S P.I AUTONOMI    '
                             to  M4A013
           end-if.
      *
           if  FST-LFSOSPE1  not equal    0
           then
               move
               'Errore nella lettura del file Sospensioni         '
                             to  M4A013
           end-if.
      *
           if  FST-LFPEERT1  not equal    0
           then
               move
               'Errore nella lettura del file Periodi Erogabili   '
                             to  M4A013
           end-if.
      *
           if  FST-ADSPENSI  not equal    0
           then
               move
               'Errore nella lettura del file delle Pensioni.     '
                             to  M4A013
           end-if.
      *n
      *n   if  FST-ADSREINC  not equal    0
      *n   then
      *n       move
      *n       'Errore nella lettura del file Regimr Intern./CEE  '
      *n                     to  M4A013
      *n   end-if.
      *n
      *n   if  FST-ADSEDILI  not equal    0
      *n   then
      *n       move
      *n       'Errore nella lettura del file degli Edili         '
      *n                     to  M4A013
      *n   end-if.
      *n
      *n   if  FST-ADSMARIT  not equal    0
      *n   then
      *n       move
      *n       'Errore nella lettura del file dei Marittimi       '
      *n                     to  M4A013
      *n   end-if.
      *n
           if  W-CHK-CAMPI  =  spaces
           then
               continue
           else
               move  W-CHK-CAMPI  to  M4A013
           end-if.
      *
           move  'S'   to  W-SCRIVO.
           perform  W10-MSGERRORE  thru  W10-EX.
       M43-EX.
           EXIT.
      *
       S05-STAMPA-2.
      *------------------------------- Importo assegno
      *    move OC-PMEIMULASE   to  CP-S3ASSEGNO.     ?????
      *------------------------------- Ultimo calcolo: DAL
           move  zeros          to  W8-AAAAMMGG.
           move  OC-PMEULPEDAL  to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S2D008.
      *------------------------------- Ultimo calcolo: AL
           move  zeros          to  W8-AAAAMMGG.
           move  OC-PMEULPEAL   to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S2D009.
      *------------------------------- Ultimo calcolo: num.GG
      *    move  OC-PMEULPEGG     to  CP-S3ULTGG.     ?????
       S05-EX.
           EXIT.
      *
       S10-STAMPA.
      *----------------------------------------- Domanda
           move  WIC-ANNO           to  S2N001
           move  WIC-NUMERO         to  S2N002
      *----------------------------------------- Cognome/nome
           move  IC-COMPATTO        to  S2A003
      *----------------------------------------- Data di nascita
           move  WIC-DTNASCITA      to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  S2D004.
      *
      *    move  'operazione '      to  S2A005
      *    move  'archivio   '      to  S2A006
      *    move  'file-status'      to  S2A007
           MOVE    W-STAMPAD TO TDSREPORT-RIGA-REPORT.
           if  L-TIPOCALCOLO  =  'S'
           then
               MOVE  1   TO  TDSREPORT-NUM-RPT
           else
               MOVE  5   to  TDSREPORT-NUM-RPT
           end-if.
           add   1           TO TDSREPORT-NUM-RIGA.
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
       S10-EX.
           EXIT.
      *
       S20-ELENCA.
      *-------------------------------- Escludo per lista controllo
           if  L-TIPOCALCOLO  =  'S'
           then
               if  W-NIK  =  'S'
               then
                   continue
               else
                   go  to  S20-EX
               end-if
           end-if.
           move  'CALCOLO    '      to  S2A005
      *-   move  CM1-RETCODE        to  S2A007
           move  OC-RETCODE         to  S2A007
           move  OC-MESSAGGIO       to  S2A006
           if  (OC-RETCODE  =  98)  or
               (OC-RETCODE  =  96)
           then
               if (W-CODICEUNO  =   35 or 36)
               then
                   move  'DA PDSNA13'  to  S2A006
               end-if
           end-if.
      *
           if  O-RETURN-CODE  not  =  spaces
           then
               move  'ANAGRAFICA'        to  S2A006
               move  'KO RICERCA '       to  S2A005
               move  O-RETURN-CODE       to  S2A007
           end-if.
      *
           if  W-CHK-CAMPI  =  spaces
           then
               continue
           else
               move  W-CHK-CAMPI(11:10)  to  S2A005
               move  W-CHK-CAMPI(22:10)  to  S2A006
               move  'KO'                to  S2A007
           end-if.
      *
           perform  S10-STAMPA     thru  S10-EX.
       S20-EX.
           EXIT.
      *
       S30-STAMPA.
      *---------------------------------------- Lista di controllo
           move  zeros      to  S4N005
                                S4N006
                                S4N007
                                S4N008
                                S4N001
                                S4N002
                                S4N005
                                S4N006
                                S4N007
                                S4N008
                                S4N009
                                S4D011
                                S4D012
                                S4N021
                                S4N022
                                S4N023
                                S4N025
                                S4N026
                                S4N009.
      *---------------------------------------- Domanda
           move  WIC-ANNO            to  S4N001
           move  WIC-NUMERO          to  S4N002.
      *---------------------------------------- Nominativo           *
131115     if  V-OK-IBAN  =  'OK'
           then
               move  IC-COMPATTO           to  S4A003
           else
               move  IC-COMPATTO           to  W10-COMPATTO
               move  '/COOR.BANCA ERRATE'  to  W-ERR-COOBAN
               move  W-COMPATTO            to  S4A003
           end-if.
      *---------------------------------------- Indennità ultima
      *    if  OC-PMEINDUIME  =  zeros
      *    then
      *        continue
      *    else
               if  OC-PMEINDUIME  >  zeros
               then
                   move  OC-PMEINDUIME   to  S4N005
                   add   OC-PMEINDUIME   to  S5N005
               else
                   move  OC-PMEINDUIME   to  S4N005
                   add  OC-PMEINDUIME    to  S5N012
               end-if.
      *    end-if.
      *---------------------------------------- ANF       ultima
      *    if  OC-PMEANFUIME    =  zeros
      *    then
      *        continue
      *    else
               move  OC-PMEANFUIME    to  S4N006
               add   OC-PMEANFUIME    to  S5N006.
      *    end-if.
      *---------------------------------------- IRPEF     ultima
      *    if  OC-PMEULIRN1E  =  zeros   and
      *        OC-PMEULIRNSE  =  zeros
      *    then
      *        continue
      *    else
               move  OC-PMEULIRN1E  to  S4N007
                add  OC-PMEULIRNSE  to  S4N007
                add  OC-PMEULIRN1E  to  S5N007
                add  OC-PMEULIRNSE  to  S5N007.
      *    end-if.
      *-------------------------------------------- Conguaglio AC
      *    if  W8-ODIERNA  >  20021231   and
      *        W8-ODIERNA  <  20030301
      *    then
      *        if  L-S3CONGAC  =  zeros
      *        then
      *            continue
      *        else
      *            add  L-S3CONGAC  to  S4N007
      *            add  L-S3CONGAC  to  S5N007
      *        end-if
      *    end-if.
      *-------------------------------------------- Conguaglio AP
      *    if  W8-ODIERNA  >  20041231   and
      *        W8-ODIERNA  <  20050301
           if  W8-ODIMM    =  01   or   02
           then
      *        if  OC-PMECONFISE  =  zeros
      *        then
      *            continue
      *        else
                   add  OC-PMECONFISE  to  S4N007
                   add  OC-PMECONFISE  to  S5N007
      *        end-if
           end-if.
      *-------------------------------------------- Conguaglio 730   *
      *    if  W8-ODIMM    =  08   or   09   or   10   or   11
      *    then
               if  OC-CODICE7    =  '730'
               then
                   add  OC-IMPORTO7    to  S4N007
                   add  OC-IMPORTO7    to  S5N007
           end-if.
      *-------------------------------------------- Addizionali
      *    if  OC-PMEADDREGE    =  zeros
      *    then
      *        continue
      *    else
               add   OC-PMEADDREGE   to  S4N007
               add   OC-PMEADDREGE   to  S5N007.
      *    end-if.
      *    if  OC-PMEADDCOME    =  zeros
      *    then
      *        continue
      *    else
               add   OC-PMEADDCOME   to  S4N007
               add   OC-PMEADDCOME   to  S5N007.
      *    end-if.
      *-------------------------------------------- Trattenute
           move  zeros              to  S4N008.
      *
      *    if  OC-PMEUITRSIE  =  zeros
      *    then
      *        continue
      *    else
               add  OC-PMEUITRSIE   to  S4N008
                                        S5N008.
      *    end-if.
      *    if  OC-RECIMUREE-1  =  zeros
      *    then
      *        continue
      *    else
               add  OC-RECIMUREE-1  to  S4N008
                                        S5N008.
      *    end-if.
      *    if  OC-RECIMUREE-2  =  zeros
      *    then
      *        continue
      *    else
              add  OC-RECIMUREE-2   to  S4N008
                                        S5N008.
      *    end-if.
      *    if  OC-RECIMUREE-3  =  zeros
      *    then
      *        continue
      *    else
              add  OC-RECIMUREE-3   to  S4N008
                                        S5N008.
      *    end-if.
      *-------------------------------------------- Importo assegno
      *    move  OC-PMEIMULASE        to  S4N009
      *            vedi  prima della write
      *-------------------------------------------- Totali pagate/indeb
      *    move  CTR-PAGATE    to  S5N004
      *                            S6N071.
      *    move  CTR-INDEBITE  to  S5N011
      *                            S6N072.
      *            vedi  prima della write
      *-------------------------------------------- Decadenza
           if  IC-DCODTADEC  =  zeros
           then
               move  spaces          to  S4A010
           else
               move  'S'             to  S4A010
           end-if.
      *-------------------------------------------- Data Dal
           move  zeros          to  W8-AAAAMMGG.
           move  OC-PMEULPEDAL  to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S4D011.
      *-------------------------------------------- Data Al
           move  zeros          to  W8-AAAAMMGG.
           move  OC-PMEULPEAL   to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S4D012.
      *------------------------------------------ Inverto date x indeb.
           if  OC-PMEULPEDAL  <=  OC-PMEULPEAL
           then
               continue
           else
               move  S4D011          to  S4D012
               move  D8-GGMMAAAA     to  S4D011
           end-if.
      *------------------------------------------ 2° rigo dettaglio
      *ex  move  OC-IMPORTO-ORD  to  S4N021.
      *ex  move  OC-IMPORTO-SPE  to  S4N022.
           evaluate  W-CODICEUNO
             when    '35'  move  IC-NASIMPGIOTE to  S4N021
             when    '36'  move  IC-DICIMPGIO   to  S4N021
      *      when    '27'  move  IC-..........  to  S4N021
           end-evaluate.
      *    evaluate  W-CODICEDUE
      *      when    '22'  move  IC-RICPRIMGIE  to  S4N021
      *      when    '23'  move  IC-EDIIMPGSTE  to  S4N021
      *      when    '24'  move  IC-EDIIMPGSTE  to  S4N021
      *    end-evaluate.
           move  OC-PMEULPEGG    to  S4N023.
      *------------------------------- Interessi indennità
      *    if  OC-PMEINLEPRE  >  zeros
      *    then
               move  OC-PMEINLEPRE   to  S4N025
               add   OC-PMEINLEPRE   to  S5N005.
      *    else
      *        move  zeros           to  S4N025
      *    end-if.
      *------------------------------- Interessi ANF
      *    if  OC-PMEINLEANE  >  zeros
      *    then
               move  OC-PMEINLEANE   to  S4N026
               add   OC-PMEINLEANE   to  S5N006.
      *    else
      *        move  zeros           to  S4N026
      *    end-if.
      *------------------------------------------ Indebiti ???
           if  OC-PMEULPEDAL  <=  OC-PMEULPEAL
           then
               continue
           else
               move  zeros           to  S4D011
           end-if.
      *------------------------------------------ Assegno
           compute  S4N009  =
                   (S4N005  +  S4N006  -  S4N007  -  S4N008  +
                    S4N025  +  S4N026)
           if  S4N009  >  zeros
           then
               add  S4N009          to  S5N009
      *        add  1               to  CTR-PAGATE       (v.E30)
           else
               move  zeros          to  S4N009
      *        add  1               to  CTR-INDEBITE     (v.E30)
           end-if.
      *-------------------------------------------- Totali pagate/indeb
           move  CTR-PAGATE    to  S5N004.
           move  CTR-INDEBITE  to  S5N011.
      *-------------------------------------- Riga generica calcolo
           MOVE S4N001       TO R4ANNDOM         .
           MOVE S4N002       TO R4NUMDOM         .
           MOVE S4A003       TO R4NOMECOGNOME    .
           MOVE S4N005       TO R4PMEINDUIME     .
           MOVE S4N006       TO R4PMEANFUIME     .
           MOVE S4N007       TO R4PMEULIRN1E     .
           MOVE S4N008       TO R4PMEUITRSIE     .
           MOVE S4N009       TO R4PMEAIMULASE    .
           MOVE S4A010       TO R4DCODTADEC      .
           MOVE S4D011       TO R4PMEULPEDAL     .
           MOVE S4D012       TO R4PMEULPEAL      .
           MOVE S4N021       TO R4OSMIMPGSTE     .
           MOVE S4N023       TO R4PMEULPEGG      .
           MOVE S4N025       TO R4PMEINLEPRE     .
           MOVE S4N026       TO R4PMEINLEANE     .
           MOVE R-STAMPAE    TO TDSREPORT-RIGA-REPORT.
           add   1           TO TDSREPORT-NUM-RIGA.
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
       S30-EX.
           EXIT.
      *
       S40-IMPOSTAZIONI.
           if  L-TIPOCALCOLO  =  'R'
           then
               move  W-CALCOLO-AL-REALE   to  W8-AAAAMMGG
           else
               move  W-CALCOLO-AL         to  W8-AAAAMMGG
           end-if.
           move  W8-AAAA          to  D8-AAAA.
           move  W8-MM            to  D8-MM.
           move  W8-GG            to  D8-GG.
      *-------------------------------------- Stampa
           MOVE TDSREPORT-MATRICOLA TO WK-RPT-MATRICOLA.
           MOVE TDSREPORT-SEDE      TO WK-RPT-SEDE.
           MOVE TDSREPORT-CEOP      TO WK-RPT-CEOP.
           MOVE TDSREPORT-DTA-PRE   TO WK-RPT-DTA-PRE.
           MOVE TDSREPORT-ORA-PRE   TO WK-RPT-ORA-PRE.
      *
      *     STRING '******** ELABORAZIONE TERMINATA *****'
      *    MOVE WK-RPT-KEY   TO  OUT-MESSAGGIO.
              STRING
                 WK-RPT-KEY
                 CTR-LET-DATCO
                 CTR-ELA-DATCO
                 CTR-SCR-DATCO
                 CTR-LET-DATAN
                 CTR-ELA-DATAN
                 CTR-SCR-DATAN
                 CTR-IMPREVISTI
                 CTR-PAGATE
                 CTR-DEFINITE
                 CTR-INDEBITE
                 CTR-ATT-PAGME
              DELIMITED BY SIZE INTO OUT-MESSAGGIO .
      *
       S40-EX.
           EXIT.
      *-----------------------------------------------Testi msg
      *Txx-TESTOxx.
      *    move spaces  to  M4A011
      *                     M4A012
      *                     M4A013
      *                     M4A014.
      *    move 'ATTENZIONE:  errore generico nella determinazione '
      *         to  M4A011.
      *    move 'dell'importo xxx xxxxxxxxx: verificare anni, tipo '
      *         to  M4A012.
      *    move 'e componenti xxxxxx e se necessita tel.06-59053346'
      *         to  M4A013.
      *    move 'o al n.080-5724591.                   Si termina. '
      *         to  M4A014.
      *Txx-EX.
      *    EXIT.
       T04-TESTO04.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore generico nella consultazione  '
                to  M4A011.
           move 'dei valori di sistema;                            '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A013.
       T04-EX.
           EXIT.
       T10-TESTO10.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione:  risulta  in corso  altra elaborazione'
                to  M4A011.
           move 'relativa al pagamento della prestazione: riprovare'
                to  M4A012.
           move 'a elaborazione completata.                        '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T10-EX.
           EXIT.
       T11-TESTO11.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione:  risulta  richiesta la elaborazione di'
                to  M4A011.
           move 'una prestazione non gestita.                      '
                to  M4A012.
           move 'Avvisare i referenti di procedura.                '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T11-EX.
           EXIT.
       T12-TESTO12.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione: sono in atto altre elaborazioni  '
                to  M4A011.
           move 'sullo stesso archivio, incompatibili con la fase  '
                to  M4A012.
           move 'richiesta.                                        '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T12-EX.
           EXIT.
       T13-TESTO13.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  non  risulta  disponibile il record  '
                to  M4A011.
           move 'di riepilogo della struttura, indispensabile alla '
                to  M4A012.
           move 'corretta  gestione  dell applicazione.            '
                to  M4A013.
           move '                        Il programma termina.     '
                to  M4A014.
       T13-EX.
           EXIT.
       T14-TESTO14.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione: risulta gia''in uso l''archivio di'
                to  M4A011.
           move 'appoggio  per il  pagamento  della assicurazione  '
                to  M4A012.
           move 'sociale per l''impiego.                           '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T14-EX.
           EXIT.
       T15-TESTO15.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione: il giorno 1 del mese le elaborazioni di'
                to  M4A011.
           move 'pagamento sono possibile dalle ore 01:30:00       '
                to  M4A012.
           move '      Il programma termina                        '
                to  M4A013.
           move '                                                  '
                to  M4A014.
       T15-EX.
           EXIT.
       T16-TESTO16.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione:  Pagamento Anticipazione NASPI   '
                to  M4A011.
           move '          sara'' disponibile nei prossimi giorni. '
                to  M4A012.
           move 'il programma termina   .                          '
                to  M4A013.
           move '                                                  '
                to  M4A014.
       T16-EX.
           EXIT.
       T18-TESTO18.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione: e''stata  richiesta l elaborazione da '
                to  M4A011.
           move 'un numero di domanda che risulta maggiore dell'' ul-'
                to  M4A012.
           move 'tima presente nell archivio.                      '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T18-EX.
           EXIT.
       T19-TESTO19.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  non  risulta corretta la versione dei'
                to  M4A011.
           move 'programmi  della Gestione  Fiscale, indispensabili'
                to  M4A012.
           move 'per il funzionamento dell applicazione.           '
                to  M4A013.
           move '                        Il programma termina.     '
                to  M4A014.
       T19-EX.
           EXIT.
       T40-TESTO40.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore generico nella consultazione  '
                to  M4A011.
           move 'del file tabelle di sede (archivio PNADS0030);    '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A013.
       T40-EX.
           EXIT.
       T41-TESTO41.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE: non e''possibile effettuare il'
                to  M4A011.
           move ' calcolo della domanda per il seguente motivo:'
                to  M4A012.
           move 'Il programma termina.       '
                to  M4A014.
       T41-EX.
           EXIT.
       T50-TESTO50.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE: non essendo presente  nelle domande il'
                to  M4A011.
           move 'codice della struttura,e'' necessario indicare gli'
                to  M4A012.
           move 'intervalli esatti di domande di propria competenza'
                to  M4A013.
           move 'per evitare di elaborare quelle di altre strutture'
                to  M4A014.
       T50-EX.
           EXIT.
       T70-TESTO70.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  Si e'' verificato un errore non gestito'
                to  M4A011.
           move 'nella consultazione dei  dati della struttura e   '
                to  M4A012.
           move 'quindi non e'' possibile continuare l''elaborazione.'
                to  M4A013.
      *    move '                                                  '
      *         to  M4A014.
       T70-EX.
           EXIT.
       T71-TESTO71.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  La  struttura  operativa  in uso  non'
                to  M4A011.
           move 'risulta  abilitata  alla  presenta  procedura  di '
                to  M4A012.
           move 'pagamento delle prestazioni: le relative funzioni '
                to  M4A013.
           move 'vengono inibite.                                  '
                to  M4A014.
       T71-EX.
           EXIT.
       T90-TESTO90.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore, non gestibile, nella fase di '
                to  M4A011.
           move 'chiusura dell elaborazione; e'' opportuno chiudere '
                to  M4A012.
           move 'l''applicazione e uscire con il SIGNOFF  prima di  '
                to  M4A013.
           move 'avviare altre elaborazioni.                       '
                to  M4A014.
       T90-EX.
           EXIT.
      *---------------------------- Le 3 seguenti sono da togliere
      *    perform  T91-TESTO91    thru  T91-EX.
      *    perform  W10-MSGERRORE  thru  W10-EX.
      *        go  to  I39-EX.
       T91-TESTO91.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  la presente funzione e''di prossima   '
                to  M4A011.
           move 'implementazione.   Attualmente NON disponibile.   '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A013.
       T91-EX.
           EXIT.
      *
       T97-TESTO97.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore, non gestibile, nella fase di '
                to  M4A011.
           move 'richiamo del programma PDSRD42 di MAZZOTTI Antonio'
                to  M4A012.
           move 'Bisogna uscire dalla sessione con il SIGNOFF e .. '
                to  M4A013.
           move 'sperare che non vi siano conseguenze!             '
                to  M4A014.
       T97-EX.
           EXIT.
      *
       W10-MSGERRORE.
      *------------------------------ Imposto su mappa anno e numero
      *
           if  OUT-STATUS = '96' OR OUT-STATUS = '99'
           then
               move  spaces        to  OUT-MESSAGGIO
               STRING WK-RPT-KEY VO-DSPFM134
               DELIMITED BY SIZE INTO  OUT-MESSAGGIO
           end-if.
      *
           if  OC-RETCODE  not  equal  zeros
           then
               move  VO-DSPFM134   to  OUT-MESSAGGIO
      *        move  OC-MESSAGGIO  to  OUT-MESSAGGIO
           end-if.
      *------------------------------------------------- Lettura
       W10-EX.
           EXIT.
      *
      *********************************************************************
      *                                                                   *
      *           SQL DB2                                                 *
      *********************************************************************
      *
      ******************************************************************
      *       CLOSE DEI CURSORI
      ******************************************************************

      *
       DATICOMUNI-DB2-CLSCUR.
      *
           MOVE 'DATICOMUNI-DB2-CLSCUR'   TO WABNDB-LABEL.
           IF WK-CURS = '1'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO1
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO1
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '2'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO2
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO2
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '3'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO3
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO3
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '4'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO4
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO4
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '5'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO5
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO5
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '6'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO6
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO6
                 END-EXEC
              END-IF
           END-IF.
      *
      *    move  SQLCODE               to  FST-LFDATCO2.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'DATICOMUNI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       DATICOMUNI-DB2-CLSCUR-EX.
            exit.
      *
       RECUPERI-DB2-CLSCUR.
      *
           MOVE 'RECUPERI-DB2-CLSCUR'   TO WABNDB-LABEL.
      *
           EXEC SQL
                CLOSE CURRECUP
           END-EXEC.
      *    move  SQLCODE               to  FST-ADSRECUP.
           IF SQLCODE NOT = ZERO
               MOVE 'RECUPERI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       RECUPERI-DB2-CLSCUR-EX.
           EXIT.
      *
       REC43-DB2-CLSCUR.
      *
           move 'REC43-DB2-CLSCUR'   to WABNDB-LABEL.
      *
           EXEC SQL
                CLOSE CURREC43
           END-EXEC.
      *    move  SQLCODE          to  FST-ADSRECUP.
           if SQLCODE  =  ZERO
           then  continue
           else
               move 'RECUPERI'    to  WABNDB-TABL
               move 'CLOSE'       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       REC43-DB2-CLSCUR-EX.
            exit.
      *
       EFFER-DB2-CLSCUR.
      *

           EXEC SQL
                 CLOSE CUREFFER
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-LFPEERE1.

           IF SQLCODE NOT = ZERO
               MOVE 'EFFEROGATI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *

       EFFER-DB2-CLSCUR-EX.
           exit.
      *
       PENSIONI-DB2-CLSCUR.
      *
           MOVE 'PENSIONI-DB2-CLSCUR'   TO WABNDB-LABEL.
           EXEC SQL
                 CLOSE CURPENS
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-ADSPENSI.
           IF SQLCODE NOT = ZERO
               MOVE 'TDSPENSI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       PENSIONI-DB2-CLSCUR-EX.
           exit.
      *
       DATIANF-DB2-CLSCUR.

      *
           EXEC SQL
                 CLOSE CURANF
           END-EXEC.
      *
      *    move  SQLCODE          to  FST-LFMODAN1.

           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'DATIANF '    to  WABNDB-TABL
               move 'CLOSE'       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *

       DATIANF-DB2-CLSCUR-EX.
           exit.
      *
       TEOEROGABI-DB2-CLSCUR.
      *
           EXEC SQL
                 CLOSE CURGABI
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-LFPEERT1.

           IF SQLCODE NOT = ZERO
               MOVE 'LFPEERT1'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *

       TEOEROGABI-DB2-CLSCUR-EX.
           exit.
      *
       ANFDIR-DB2-CLSCUR.
      *
           EXEC SQL
                 CLOSE CURFDIR
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-ADSANFDI.
           IF SQLCODE NOT = ZERO
               MOVE 'TDSANFDI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       ANFDIR-DB2-CLSCUR-EX.
           exit.
      *
       DELEGHE-DB2-CLSCUR.
      *
           move  SQLCODE          to  FST-LFDELSI1.
           EXEC SQL
                 CLOSE CURDELEG
           END-EXEC.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSDELSI'    to  WABNDB-TABL
               move 'CLOSE'       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       DELEGHE-DB2-CLSCUR-EX.
           exit.
      *
       SOSPENSIONI-DB2-CLSCUR.
      *
           EXEC SQL
                 CLOSE CURSOSP
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-LFSOSPE1.
           IF SQLCODE NOT = ZERO
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       SOSPENSIONI-DB2-CLSCUR-EX.
           exit.
      *
       AUTASPI-DB2-CLSCUR.
      *
           EXEC SQL
                 CLOSE CURAUTASPI
           END-EXEC.
      *
      *    move  SQLCODE           to  FST-TDSAUTLA.
           if  SQLCODE  =  ZERO
           then  continue
           else
               move  'TDSAUTLA'    to  WABNDB-TABL
               move  'CLOSE'       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       AUTASPI-DB2-CLSCUR-EX.
           exit.
      *
      *AUT55-DB2-CLSCUR.
      *
      *    EXEC SQL
      *          CLOSE CURAUT55
      *    END-EXEC.
      *
      *    move  SQLCODE           to  FST-TDSAUTLA.
      *    if  SQLCODE  =  ZERO
      *    then  continue
      *    else
      *        move  'TDSAUTLA'    to  WABNDB-TABL
      *        move  'CLOSE'       to  WABNDB-FUNC
      *        perform  ERRORE-SQL
      *    end-if.
      *
      *AUT55-DB2-CLSCUR-EX.
      *    exit.
      *
      ******************************************************************
      *       DECLARE/OPEN DEI CURSORI
      ******************************************************************

      *
       B20-DB2-DECL-CURS.
      *--------------------------------  File dati comuni (LFDATCO2) *
           MOVE 'B20-DB2-DECL-CURS'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-DCOCOSEGR.
      *
           IF WK-CURS = '1'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO1
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO1
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '2'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO2
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO2
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '3'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO3
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO3
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '4'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO4
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO4
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '5'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO5
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO5
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '6'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO6
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO6
                 END-EXEC
              END-IF
           END-IF.
      *
           IF SQLCODE NOT = ZERO
               move  'N'          to   WL-DATICOMUNI
               MOVE 'TDSDATCO'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
           move  SQLCODE               to  FST-LFDATCO2.
       B20-DB2-DECL-CURS-EX.
           EXIT.
      *
       L16-DB2-DECL-CURS.
      *
           move 'L16-DB2-DECL-CURS'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE       to  H-RECCOSEDE.
      *
           EXEC SQL
                OPEN CURRECUP
           END-EXEC.
           move  SQLCODE             to  FST-ADSRECUP.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSRECUP'       to  WABNDB-TABL
               move 'OPEN '          to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L16-DB2-DECL-CURS-EX.
           EXIT.
      *
       L25-DB2-DECL-CURS.
      *
           move 'L25-DB2-DECL-CURS'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE       to  H-DSICOSEDE.
      *
           EXEC SQL
                 OPEN CURDELEG
           END-EXEC.
           move  SQLCODE             to  FST-LFDELSI1.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSDELSI'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       L25-DB2-DECL-CURS-EX.
           EXIT.
      *
       L28-DB2-DECL-CURS.
           move 'L28-DB2-DECL-CURS'  to  WABNDB-LABEL.
      *
           move  L-CODICE-SEDE       to  H-ANFCOSEDE.
      *
           EXEC SQL
                 OPEN CURANF
           END-EXEC.
           move  SQLCODE             to  FST-LFMODAN1.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSANFDI'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       L28-DB2-DECL-CURS-EX.
           EXIT.
      *
       L281-DB2-DECL-CURS.
      *
           MOVE 'L281-DB2-DECL-CURS'  TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE        TO  H-AADCOSEDE.
      *
           EXEC SQL
                 OPEN CURFDIR
           END-EXEC.
           move  SQLCODE              to  FST-ADSANFDI.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSANFDI'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
      *
       L281-DB2-DECL-CURS-EX.
           EXIT.
      *
       L35-DB2-DECL-CURS.
           move 'L35-DB2-DECL-CURS'  to  WABNDB-LABEL.
      *
           move  L-CODICE-SEDE       to  H-AUTCOSEDE.
      *
           EXEC SQL
                 OPEN CURAUTASPI
           END-EXEC.
           move  SQLCODE             to  FST-TDSAUTLA.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSAUTLA'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       L35-DB2-DECL-CURS-EX.
           EXIT.
      *
       L49-DB2-DECL-CURS.
      *
           MOVE 'L49-DB2-DECL-CURSUR'  TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE         TO  H-SOSCOSEDE.
      *
           EXEC SQL
                 OPEN CURSOSP
           END-EXEC.
           move  SQLCODE          to  FST-LFSOSPE1.
      *
           if SQLCODE  =  ZERO
           then  continue
           else
               MOVE 'TDSSOSPE'    to  WABNDB-TABL
               MOVE 'OPEN '       to  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.
      *
       L49-DB2-DECL-CURS-EX.
           EXIT.
      *
       L52-DB2-DECL-CURS.
      *
           MOVE 'L52-DB2-DECL-CURSUR'  TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE         TO  H-PETCOSEDE.
      *
           EXEC SQL
                 OPEN CURGABI
           END-EXEC.
           move  SQLCODE               to  FST-LFPEERT1.

      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               MOVE 'TDSPEERT'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.
      *
       L52-DB2-DECL-CURS-EX.
           EXIT.
      *
       L55-DB2-DECL-CURS.
      *
           MOVE 'L55-DB2-DECL-CURSUR'  to  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE         to  H-PENCOSEDE.
      *
           EXEC SQL
                 OPEN CURPENS
           END-EXEC.
           move  SQLCODE          to  FST-ADSPENSI.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSPENSI'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L55-DB2-DECL-CURS-EX.
           EXIT.
      *
       E43-DB2-DECL-CURS.
      *
           move 'E43-DB2-DECL-CURS'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE       to  H-RECCOSEDE.
      *
           EXEC SQL
                 OPEN CURREC43
           END-EXEC.
           move  SQLCODE          to  FST-ADSRECUP.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               move 'TDSRECUP'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E43-DB2-DECL-CURS-EX.
           EXIT.
      *
       E45-DB2-DECL-CURS.
      *-----------------------------  perform non richiamata         *
           move 'E45-DB2-DECL-CURS'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE       to  H-PEECOSEDE.
      *
           EXEC SQL
                 OPEN CUREFFER
           END-EXEC.
           move  SQLCODE          to  FST-LFPEERE1.
      *
           if  SQLCODE  =  ZERO
           then  continue
               move 'TDSPEERE'    to  WABNDB-TABL
               move 'OPEN '       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E45-DB2-DECL-CURS-EX.
           EXIT.
      *
      *E55-DB2-DECL-CURS.
      *
      *    move 'E55-DB2-DECL-CURS'  to  WABNDB-LABEL.
      *    move  L-CODICE-SEDE       to  H-AUTCOSEDE.
      *
      *    EXEC SQL
      *          OPEN CURAUT55
      *    END-EXEC.
      *    move  SQLCODE          to  FST-TDSAUTLA.
      *
      *    if  SQLCODE  =  ZERO
      *    then  continue
      *    else
      *        move 'TDSAUTLA'    to  WABNDB-TABL
      *        move 'OPEN '       to  WABNDB-FUNC
      *        perform ERRORE-SQL
      *    end-if.
      *
      *E55-DB2-DECL-CURS-EX.
      *    EXIT.
      ******************************************************************

      *      FETCH
      ******************************************************************

      *
      *--------------------------------  File dati comuni (LFDATCO2) *

       B20-DB2-FETCH.
           MOVE 'B20-DB2-FETCH '  TO WABNDB-LABEL.
      *
           IF WK-CURS = '1'
              IF KLIVAUTO = '5'
                EXEC SQL
                 FETCH CURSSCO1
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
                END-EXEC
              ELSE
                EXEC SQL
                 FETCH CURSDCO1
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '2'
              IF KLIVAUTO = '5'
                 EXEC SQL
                 FETCH CURSSCO2
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
                END-EXEC
              ELSE
                EXEC SQL
                 FETCH CURSDCO2
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '3'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO3
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO3
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '4'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO4
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO4
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '5'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO5
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO5
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '6'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO6
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO6
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           move  SQLCODE               to  FST-LFDATCO2.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSDATCO=' DCLTDSDATCO
               MOVE 'TDSDATCO'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *        DISPLAY 'DCO=' h-DCOANVEPR "/" h-dcondvepr.
      *
       B20-DB2-FETCH-EX.
           EXIT.
      *
       L16-DB2-FETCH.
           EXEC SQL
                 FETCH CURRECUP
                  into
                        :H-RECCHIDOM,
                        :H-RECPROREC,
                        :H-RECTOREEE,
                        :H-RECTORERE,
                        :H-RECCOREAL,
                        :H-RECCORENU,
                        :H-RECIMPRAE,
                        :H-RECCAUREC,
                        :H-RECTIPREC,
                        :H-RECCHDDVI,
                        :H-RECIMUREE,
                        :H-RECDTESRE,
                        :H-RECNUMRAT,
                        :H-RECCODBIL,
                        :H-RECIIRPEF,
                        :H-RECCOSEDE
           END-EXEC.
           move  SQLCODE           to  FST-ADSRECUP.

      *
           if  SQLCODE  =  ZERO  or
               SQLCODE  =   100
           then  continue
           else
               display 'DCLTDSRECUP='  DCLTDSRECUP
               move  'TDSRECUP'    to  WABNDB-TABL
               move  'FETCH'       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L16-DB2-FETCH-EX.
           EXIT.
      *
       L25-DB2-FETCH.
      *
           EXEC SQL
                 FETCH CURDELEG
                  INTO
                 :H-DSICHIDOM,
                 :H-DSIDTINIS,
                 :H-DSIDTFIIS,
                 :H-DSICODSIN,
                 :H-DSICATSIN,
                 :H-DSICOSEDE
          END-EXEC.
           move  SQLCODE          to  FST-LFDELSI1.

      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSDELSI=' DCLTDSDELSI
               move 'TDSDELSI'    to  WABNDB-TABL
               move 'FETCH'       to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *

       L25-DB2-FETCH-EX.
           EXIT.
      *
       L28-DB2-FETCH.
      *
           move 'L28-DB2-FETCH'  to  WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CURANF
                  INTO
                     :H-ANFCOSEDE,
                     :H-ANFCODFIS,
                     :H-ANFDTDEVA,
                     :H-ANFCHIDOM,
                     :H-ANFCONUFA,
                     :H-ANFNUMFIG,
                     :H-ANFNUMGEN,
                     :H-ANFPREINV,
                     :H-ANFTIPINV,
                     :H-ANFFIGMIN,
                     :H-ANFTIPNUC,
                     :H-ANFREDFAE,
                     :H-ANFANRIRE,
                     :H-ANFTABELLA,
                     :H-ANFIMPMENS,
                     :H-ANFIMPGIOR
          END-EXEC.
           move  SQLCODE          to  FST-LFMODAN1.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSANFDI=' DCLTDSANFDI
               move 'TDSANFDI'    to  WABNDB-TABL
               move 'FETCH'       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L28-DB2-FETCH-EX.
           EXIT.
      *
       L281-DB2-FETCH.
      *
           move 'L281-DB2-FETCH'  to WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CURFDIR
                  INTO
                    :H-AADCHIDOM,
                    :H-AADPROANF,
                    :H-AADCOSEDE,
                    :H-AADDAL,
                    :H-AADAL,
                    :H-AADRECUP,
                    :H-AADIMPSPE,
                    :H-AADPREDOM,
                    :H-AADSTAPAG,
                    :H-AADDATASTA,
                    :H-AADMODARR
          END-EXEC.
           move  SQLCODE          to  FST-ADSANFDI.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               DISPLAY 'DCLTDSANFDI=' DCLTDSANFDI
               MOVE 'TDSANFDI'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.
      *
       L281-DB2-FETCH-EX.
           EXIT.
      *
       L35-DB2-FETCH.
      *
           move 'L35-DB2-FETCH'  to  WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CURAUTASPI
                  INTO
                     :H-AUTCOSEDE,
                     :H-AUTCHIDOM,
                     :H-AUTPROGR,
                     :H-AUTDATADAL,
                     :H-AUTDATAAL,
                     :H-AUTREDTEO,
                     :H-AUTREDEFF,
                     :H-AUTREDGTEO,
                     :H-AUTREDGEFF,
                     :H-AUTNUMGRID,
                     :H-AUTTIPOATT,
                     :H-AUTDATARED,
                     :H-AUTTIPOACQRED,
180523               :H-AUTDTLIMRED
          END-EXEC.
           move  SQLCODE          to  FST-TDSAUTLA.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSAUTLA=' DCLTDSAUTLA
               move 'TDSAUTLA'    to  WABNDB-TABL
               move 'FETCH'       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L35-DB2-FETCH-EX.
           EXIT.
      *
       L49-DB2-FETCH.
      *
           EXEC SQL
                 FETCH CURSOSP
                  INTO
                 :H-SOSCOSEDE,
                 :H-SOSCODFIS,
                 :H-SOSDTINSOS,
                 :H-SOSCHIDOM,
                 :H-SOSDTFISOS,
                 :H-SOSCODSOS,
                 :H-SOSDTCOM
           END-EXEC.
           move  SQLCODE           to  FST-LFSOSPE1.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               DISPLAY 'DCLTDSSOSPE=' DCLTDSSOSPE
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.

      *
       L49-DB2-FETCH-EX.
           EXIT.
      *
       L52-DB2-FETCH.
           EXEC SQL
                 FETCH CURGABI
                  INTO
                     :H-PETCODFIS,
                     :H-PETCOSEDE,
                     :H-PETCHIDOM,
                     :H-PETPEERTD,
                     :H-PETCOTIPR,
                     :H-PETPEERTA,
                     :H-PETNUGITE
          END-EXEC.
           move  SQLCODE          to  FST-LFPEERT1.
      *
           IF  SQLCODE  = ZERO    or
               SQLCODE  = 100
           then  continue
           else
               DISPLAY 'DCLTDSPEERT=' DCLTDSPEERT
               MOVE 'TDSPEERT'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.
      *
       L52-DB2-FETCH-EX.
           EXIT.
      *
       L55-DB2-FETCH.
      *
           move 'L55-DB2-FETCH'  to  WABNDB-LABEL.
           EXEC SQL
                 FETCH CURPENS
                  INTO
                     :H-PENCOSEDE,
                     :H-PENCODFIS,
                     :H-PENCATPEN,
                     :H-PENPROPEN,
                     :H-PENCHIDOM,
                     :H-PENDTDEPE,
                     :H-PENIMPPEE
           END-EXEC.
           move  SQLCODE           to  FST-ADSPENSI.

      *
           if  SQLCODE  =  ZERO    or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSPENSI=' DCLTDSPENSI
               move  'TDSPENSI'    to  WABNDB-TABL
               move  'FETCH'       to  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.
      *

       L55-DB2-FETCH-EX.
           EXIT.
      *
       E43-DB2-FETCH.
      *
           move 'E43-DB2-FETCH'  TO WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CURREC43
                  INTO
                :H-RECCHIDOM,
                :H-RECPROREC,
                :H-RECTOREEE,
                :H-RECTORERE,
                :H-RECCOREAL,
                :H-RECCORENU,
                :H-RECIMPRAE,
                :H-RECCAUREC,
                :H-RECTIPREC,
                :H-RECCHDDVI,
                :H-RECIMUREE,
                :H-RECDTESRE,
                :H-RECNUMRAT,
                :H-RECCODBIL,
                :H-RECIIRPEF,
                :H-RECCOSEDE
           END-EXEC.
           move  SQLCODE          to  FST-ADSRECUP.
      *
           if  SQLCODE  =  ZERO    or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSRECUP=' DCLTDSRECUP
               move 'TDSRECUP'    to  WABNDB-TABL
               move 'FETCH'       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E43-DB2-FETCH-EX.
           EXIT.
      *
       E45-DB2-FETCH.
      *-----------------------------  perform non richiamata         *
           move  'E45-DB2-FETCH'  to WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CUREFFER
                  INTO
                     :H-PEECODFIS,
                     :H-PEEPEERED,
                     :H-PEECOTIPR,
                     :H-PEEPEEREA,
                     :H-PEENUGIEE
           END-EXEC.
           move  SQLCODE          to  FST-LFPEERE1.
      *
           if  SQLCODE  =  ZERO    or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSPEERE=' DCLTDSPEERE
               move 'TDSPEERE'    to  WABNDB-TABL
               move 'FETCH'       to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E45-DB2-FETCH-EX.
           EXIT.
      *
      *E55-DB2-FETCH.
      *
      *    move 'E55-DB2-FETCH'  to  WABNDB-LABEL.
      *
      *    EXEC SQL
      *          FETCH CURAUT55
      *           INTO
      *              :H-AUTCOSEDE,
      *              :H-AUTCHIDOM,
      *              :H-AUTPROGR,
      *              :H-AUTDATADAL,
      *              :H-AUTDATAAL,
      *              :H-AUTREDTEO,
      *              :H-AUTREDEFF,
      *              :H-AUTREDGTEO,
      *              :H-AUTREDGEFF,
      *              :H-AUTNUMGRID,
      *              :H-AUTTIPOATT
      *    END-EXEC.
      *    move  SQLCODE          to  FST-TDSAUTLA.
      *
      *    if  SQLCODE  =  ZERO   or
      *        SQLCODE  =  100
      *    then  continue
      *    else
      *        display 'DCLTDSAUTLA=' DCLTDSAUTLA
      *        move 'TDSAUTLA'    to  WABNDB-TABL
      *        move 'FETCH'       to  WABNDB-FUNC
      *        perform ERRORE-SQL
      *    end-if.
      *
      *E55-DB2-FETCH-EX.
      *    EXIT.
      *
      ******************************************************************
      *      UPDATE
      ******************************************************************
       E35-DB2-SIT-UPD.
      *
           move  L-CODICE-SEDE      to  H-STDCOSEDE.
           move 'E35-DB2-SIT-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE    TDSSITDO
            SET
                H_STDCOTIPRU     = :H-STDCOTIPRU,
                H_STDCOTIPRD     = :H-STDCOTIPRD,
                H_STDDTMOPRU     = :H-STDDTMOPRU,
                H_STDDTMOPRD     = :H-STDDTMOPRD,
                H_STDESITPRU     = :H-STDESITPRU,
                H_STDESITPRD     = :H-STDESITPRD
             WHERE
                     H_STDCHIDOM      =  :H-STDCHIDOM
                AND  H_STDCOSEDE      =  :H-STDCOSEDE
           END-EXEC.
      *
           move  SQLCODE          to  FST-ADSSITDO.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               DISPLAY 'DCLTDSSITDO=' DCLTDSSITDO
               move 'TDSSITDO'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E35-DB2-SIT-UPD-EX.
           EXIT.
      *n
      *E391-DB2-COM-UPD.
      *n
      *n   MOVE  L-CODICE-SEDE      TO  H-DCOCOSEGR.
      *n   MOVE 'E391-DB2-COM-UPD'  TO  WABNDB-LABEL.
      *n
      *n   EXEC SQL
      *n   UPDATE    TDSDATCO
      *n    SET
      *n            H_DCOULESPP     = :H-DCOULESPP,
      *n            H_DCOTRDOCE     = :H-DCOTRDOCE,
      *n            H_DCOPESTDI     = :H-DCOPESTDI,
      *n            H_DCOTRDODO     = :H-DCOTRDODO,
      *n            H_DCOFLASU     = :H-DCOFLASU
      *n
      *n      WHERE
      *n             H_DCOCHIDOM      =  :H-DCOCHIDOM
      *n        AND  H_DCOCOSEGR      =  :H-DCOCOSEGR
      *n    END-EXEC.
      *n
      *n    move  SQLCODE               to  FST-LFDATCO2.
      *n
      *n    IF SQLCODE NOT = ZERO
      *n       DISPLAY 'DCLTDSDATCO=' DCLTDSDATCO
      *n       MOVE 'TDSDATCO'    TO  WABNDB-TABL
      *n       MOVE 'UPDATE'      TO  WABNDB-FUNC
      *n       PERFORM ERRORE-SQL
      *n    END-IF.
      *n
      *E391-DB2-COM-UPD-EX.
      *n   EXIT.
      *n
      *--------------------sospeso
230620*E391-DB2-UPD-DATCO.
      *    move  L-CODICE-SEDE    to    H-DCOCOSEGR.
      *    move  IC-DCOCHIDOM     to    H-DCOCHIDOM.
      *    move  W-DCOFLASU       to    H-DCOFLASU.
      *    move  'N'              to    H-DCOTRDOCE.
      *
      *    exec sql
      *    update    TDSDATCO
      *     set
      *             H_DCOFLASU      =  :H-DCOFLASU,
      *             H_DCOTRDOCE     =  :H-DCOTRDOCE
      *       where
      *              H_DCOCOSEGR      =  :H-DCOCOSEGR
      *         and  H_DCOCHIDOM      =  :H-DCOCHIDOM
      *    end-exec.
      *
      *    move  SQLCODE               to  FST-LFDATCO2.
      *
      *    if  SQLCODE     = 0
      *          move  'X'                to  FLG-COMMIT
      *    else
      *          move  'N'                to  FLG-COMMIT
      *          move  'S'                to  W-ERRORE
      *          move  'UPDATE    '       to  S2A005
      *          move  'LFDATCO2  '       to  S2A006
      *          move  SQLCODE            to  S2A007
      *          perform  S10-STAMPA     thru  S10-EX
      *    end-if.
      *
      *E391-DB2-UPD-DATCO-EX.
230620*    EXIT.
      *
       E392-DB2-COM-UPD.
      *
           move  L-CODICE-SEDE      to  H-DCOCOSEGR.
           move 'E392-DB2-COM-UPD'  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE   TDSDATCO
            SET
                    H_DCOANFRIC     = :H-DCOANFRIC,
                    H_DCOULESPP     = :H-DCOULESPP,
                    H_DCODTULPP     = :H-DCODTULPP,
                    H_DCOTRDOCE     = :H-DCOTRDOCE,
                    H_DCOPESTDI     = :H-DCOPESTDI,
                    H_DCOTRDODO     = :H-DCOTRDODO
              WHERE
                     H_DCOCHIDOM      =  :H-DCOCHIDOM
                AND  H_DCOCOSEGR      =  :H-DCOCOSEGR
           END-EXEC.
      *
           move  SQLCODE          to  FST-LFDATCO2.

           if  SQLCODE  =  ZERO
           then  continue
           else
               display 'DCLTDSDATCO=' DCLTDSDATCO
               move 'TDSDATCO'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *    IF  SQLCODE NOT = 0
      *          move  'N'                to  FLG-COMMIT
      *          move  'REWRITE   '       to  S2A005
      *          move  'LFDATCO2  '       to  S2A006
      *          move  SQLCODE            to  S2A007
      *          perform  S10-STAMPA     thru  S10-EX
      *    END-IF.
      *
       E392-DB2-COM-UPD-EX.
           EXIT.

      *
      *
       E40-DB2-COM-UPD.
      *
           move  L-CODICE-SEDE      to  H-DCOCOSEGR.
           move 'E40-DB2-COM-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE  TDSDATCO
            SET
                    H_DCOANFRIC     = :H-DCOANFRIC,
                    H_DCOULESPP     = :H-DCOULESPP,
                    H_DCODTULPP     = :H-DCODTULPP,
                    H_DCOULESSP     = :H-DCOULESSP,
                    H_DCODTULSP     = :H-DCODTULSP,
                    H_DCOTRDOCE     = :H-DCOTRDOCE,
240519*             H_DCOINT        = :H-DCOINT,
                    H_DCOPESTDI     = :H-DCOPESTDI,
                    H_DCOTRDODO     = :H-DCOTRDODO,
240519              H_DCOFLASU      = :H-DCOFLASU
              WHERE
                     H_DCOCHIDOM      =  :H-DCOCHIDOM
                AND  H_DCOCOSEGR      =  :H-DCOCOSEGR
           END-EXEC.
      *
           move  SQLCODE          to  FST-LFDATCO2.

           if  SQLCODE  =  ZERO
           then  continue
           else
               display 'DCLTDSDATCO=' DCLTDSDATCO
               move 'TDSDATCO'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E40-DB2-COM-UPD-EX.
           EXIT.

      *
       E44-DB2-REC-UPD.
      *
           move  L-CODICE-SEDE      to  H-RECCOSEDE.
           move 'E44-DB2-REC-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE  TDSRECUP
            SET
                H_RECTORERE     = :H-RECTORERE,
                H_RECIMUREE     = :H-RECIMUREE,
                H_RECDTESRE     = :H-RECDTESRE
             WHERE
                     H_RECCHIDOM      =  :H-RECCHIDOM
                AND  H_RECPROREC      =  :H-RECPROREC
                AND  H_RECCOSEDE      =  :H-RECCOSEDE
           END-EXEC.
      *
           move  SQLCODE          to  FST-ADSRECUP.

           if  SQLCODE   =  ZERO
           then  continue
           else
               display 'DCLTDSRECUP=' DCLTDSRECUP
               move 'TDSRECUP'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E44-DB2-REC-UPD-EX.
           EXIT.

      *
       E47-DB2-SIT-UPD.
      *
           move  L-CODICE-SEDE      to  H-STDCOSEDE.
           move 'E47-DB2-SIT-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE   TDSSITDO
            SET
                H_STDDTMOPRU     = :H-STDDTMOPRU,
                H_STDDTMOPRD     = :H-STDDTMOPRD,
                H_STDESITPRU     = :H-STDESITPRU,
                H_STDESITPRD     = :H-STDESITPRD
             WHERE
                     H_STDCHIDOM      =  :H-STDCHIDOM
                AND  H_STDCOSEDE      =  :H-STDCOSEDE
           END-EXEC.
      *
           move  SQLCODE          to  FST-ADSSITDO.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               display 'DCLTDSSITDO=' DCLTDSSITDO
               move 'TDSSITDO'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E47-DB2-SIT-UPD-EX.
           EXIT.
      *
       E51-DB2-PAG-UPD.
      *
           move  L-CODICE-SEDE      to  H-PMECOSEDE.
           move 'E51-DB2-PAG-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE   TDSPAGME
            SET
                H_PMECODFIS      = :H-PMECODFIS,
                H_PMEDTELAB      = :H-PMEDTELAB,
                H_PMETOTRSIE     = :H-PMETOTRSIE,
                H_PMEUITRSIE     = :H-PMEUITRSIE,
                H_PMEUONNCOE     = :H-PMEUONNCOE,
                H_PMESTAPAG      = :H-PMESTAPAG,
                H_PMEDTRICA      = :H-PMEDTRICA,
                H_PMEINDTOTE     = :H-PMEINDTOTE,
                H_PMEINDUIME     = :H-PMEINDUIME,
                H_PMEANFTOTE     = :H-PMEANFTOTE,
                H_PMEANFUIME     = :H-PMEANFUIME,
                H_PMEINDTOGG     = :H-PMEINDTOGG,
                H_PMEANFTOGG     = :H-PMEANFTOGG,
                H_PMEDS56        = :H-PMEDS56,
                H_PMEORDTOTE     = :H-PMEORDTOTE,
                H_PMEORDUIME     = :H-PMEORDUIME,
                H_PMEORDTOGG     = :H-PMEORDTOGG,
                H_PMESPETOTE     = :H-PMESPETOTE,
                H_PMESPEUIME     = :H-PMESPEUIME,
                H_PMESPETOGG     = :H-PMESPETOGG,
                H_PMEIMINNAE     = :H-PMEIMINNAE,
                H_PMEIMIANFE     = :H-PMEIMIANFE,
                H_PMEIMULASE     = :H-PMEIMULASE,
                H_PMEULPEDAL     = :H-PMEULPEDAL,
                H_PMEULPEAL      = :H-PMEULPEAL,
                H_PMEULPEGG      = :H-PMEULPEGG,
                H_PMECONFISE     = :H-PMECONFISE,
                H_PMEADDCOME     = :H-PMEADDCOME,
                H_PMEADDREGE     = :H-PMEADDREGE,
                H_PMEULIRNSE     = :H-PMEULIRNSE,
                H_PMEULIRN1E     = :H-PMEULIRN1E,
                H_PMETOIRNPE     = :H-PMETOIRNPE,
                H_PMETOIRNCE     = :H-PMETOIRNCE,
                H_PMEINLEPRE     = :H-PMEINLEPRE,
                H_PMEINLEANE     = :H-PMEINLEANE,
                H_PMEORDTOTL     = :H-PMEORDTOTL,
                H_PMEORDUIML     = :H-PMEORDUIML,
                H_PMEANFTOTL     = :H-PMEANFTOTL,
                H_PMER730UIM     = :H-PMER730UIM,
                H_PMEAUTTOTE     = :H-PMEAUTTOTE,
                H_PMEAUTTOGG     = :H-PMEAUTTOGG,
                H_PMEAUTUIME     = :H-PMEAUTUIME,
                H_PMEULAUTGG     = :H-PMEULAUTGG
             WHERE
                     H_PMECHIDOM      =  :H-PMECHIDOM
                AND  H_PMECOSEDE      =  :H-PMECOSEDE
           END-EXEC.
      *
           move  SQLCODE          to  FST-ADSPAGME.

           if  SQLCODE  =  ZERO
           then  continue
           else
               display 'DCLTDSPAGME=' DCLTDSPAGME
               move 'TDSPAGME'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
      *    IF  SQLCODE NOT = 0
      *          move  'N'                to  FLG-COMMIT
      *          move  'REWRITE   '       to  S2A005
      *          move  'ADSPAGME  '       to  S2A006
      *          move  SQLCODE            to  S2A007
      *          perform  S10-STAMPA     thru  S10-EX
      *    END-IF.
      *
       E51-DB2-PAG-UPD-EX.
           EXIT.

      *
       E53-DB2-ANF-UPD.
      *
           move  L-CODICE-SEDE      to  H-AADCOSEDE.
           move 'E53-DB2-ANF-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE TDSANFDI
           SET
               H_AADIMPSPE         = :H-AADIMPSPE,
               H_AADSTAPAG         = :H-AADSTAPAG,
               H_AADDATASTA        = :H-AADDATASTA
            WHERE
                    H_AADCHIDOM      =  :H-AADCHIDOM
               AND  H_AADPROANF      =  :H-AADPROANF
               AND  H_AADCOSEDE      =  :H-AADCOSEDE
           END-EXEC.
      *
           move  SQLCODE          to  FST-ADSANFDI.
      *
           if  SQLCODE  =  ZERO
           then  continue
           else
               display 'DCLTDSANFDI ' DCLTDSANFDI
               move 'TDSANFDI'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.

      *    IF  SQLCODE NOT = 0
      *          move  'N'                to  FLG-COMMIT
      *          move  'REWRITE   '       to  S2A005
      *          move  'TDSANFDI  '       to  S2A006
      *          move  SQLCODE            to  S2A007
      *          perform  S10-STAMPA     thru  S10-EX
      *    END-IF.
      *
       E53-DB2-ANF-UPD-EX.
           EXIT.
      *
       E55-DB2-AUT-UPD.
      *
           move  L-CODICE-SEDE      to  H-AUTCOSEDE.
           move 'E55-DB2-AUT-UPD '  to  WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE  TDSAUTLA
              SET
                     H_AUTNUMGRID    =  :H-AUTNUMGRID
              WHERE
                     H_AUTCHIDOM     =  :H-AUTCHIDOM
                AND  H_AUTPROGR      =  :H-AUTPROGR
                AND  H_AUTCOSEDE     =  :H-AUTCOSEDE
           END-EXEC.
      *
           move  SQLCODE          to  FST-TDSAUTLA.

           if  SQLCODE   =  ZERO
           then  continue
           else
               display 'DCLTDSAUTLA=' DCLTDSAUTLA
               move 'TDSAUTLA'    to  WABNDB-TABL
               move 'UPDATE'      to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       E55-DB2-AUT-UPD-EX.
           EXIT.
      *
       E64-DB2-UPDATE.
      *
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           UPDATE TDSRPG00
           SET
               H_PCALCOLATI        =  :H-PCALCOLATI,
300315         H_PZEROPAGAM        =  :H-PZEROPAGAM
            WHERE
                     H_PCOSEDE        =  :H-PCOSEDE
                AND  H_PDATAELABO     =  :H-PDATAELABO
                AND  H_PPROCEDURA     =  :H-PPROCEDURA
                AND  H_PPROGRESSI     =  :H-PPROGRESSI
                AND  H_PSTRUTTURA     =  :H-PSTRUTTURA
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSRPG00.
      *
       E64-DB2-UPDATE-EX.
           EXIT.
      *
      ******************************************************************

      *      SELECT
      ******************************************************************

      *
       L13-DB2-SELECT.
      *
           MOVE 'L13-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PMECOSEDE.
      *
           EXEC SQL
           SELECT
                H_PMECODFIS,
                H_PMEDTELAB,
                H_PMETOTRSIE,
                H_PMEUITRSIE,
                H_PMEUONNCOE,
                H_PMESTAPAG,
                H_PMEDTRICA,
                H_PMEINDTOTE,
                H_PMEINDUIME,
                H_PMEANFTOTE,
                H_PMEANFUIME,
                H_PMEINDTOGG,
                H_PMEANFTOGG,
                H_PMEDS56,
                H_PMEORDTOTE,
                H_PMEORDUIME,
                H_PMEORDTOGG,
                H_PMESPETOTE,
                H_PMESPEUIME,
                H_PMESPETOGG,
                H_PMEIMINNAE,
                H_PMEIMIANFE,
                H_PMEIMULASE,
                H_PMEULPEDAL,
                H_PMEULPEAL,
                H_PMEULPEGG,
                H_PMECONFISE,
                H_PMEADDCOME,
                H_PMEADDREGE,
                H_PMEULIRNSE,
                H_PMEULIRN1E,
                H_PMETOIRNPE,
                H_PMETOIRNCE,
                H_PMEINLEPRE,
                H_PMEINLEANE,
                H_PMEORDTOTL,
                H_PMEORDUIML,
                H_PMER730UIM,
                H_PMEAUTTOTE,
                H_PMEAUTTOGG,
                H_PMEAUTUIME,
                H_PMEULAUTGG
           INTO
                :H-PMECODFIS,
                :H-PMEDTELAB,
                :H-PMETOTRSIE,
                :H-PMEUITRSIE,
                :H-PMEUONNCOE,
                :H-PMESTAPAG,
                :H-PMEDTRICA,
                :H-PMEINDTOTE,
                :H-PMEINDUIME,
                :H-PMEANFTOTE,
                :H-PMEANFUIME,
                :H-PMEINDTOGG,
                :H-PMEANFTOGG,
                :H-PMEDS56,
                :H-PMEORDTOTE,
                :H-PMEORDUIME,
                :H-PMEORDTOGG,
                :H-PMESPETOTE,
                :H-PMESPEUIME,
                :H-PMESPETOGG,
                :H-PMEIMINNAE,
                :H-PMEIMIANFE,
                :H-PMEIMULASE,
                :H-PMEULPEDAL,
                :H-PMEULPEAL,
                :H-PMEULPEGG,
                :H-PMECONFISE,
                :H-PMEADDCOME,
                :H-PMEADDREGE,
                :H-PMEULIRNSE,
                :H-PMEULIRN1E,
                :H-PMETOIRNPE,
                :H-PMETOIRNCE,
                :H-PMEINLEPRE,
                :H-PMEINLEANE,
                :H-PMEORDTOTL,
                :H-PMEORDUIML,
                :H-PMER730UIM,
                :H-PMEAUTTOTE,
                :H-PMEAUTTOGG,
                :H-PMEAUTUIME,
                :H-PMEULAUTGG
              FROM TDSPAGME
              WHERE
                     H_PMECHIDOM      =  :H-PMECHIDOM
                AND  H_PMECOSEDE      =  :H-PMECOSEDE
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSPAGME.

           if  SQLCODE = 0
           then
               move  'S'    to  WL-PAGAMENTI
           else
               if  SQLCODE = 100
               then  continue
               else
                   display 'DCLTDSPAGME=' DCLTDSPAGME
                   move 'TDSPAGME'    to  WABNDB-TABL
                   move 'FETCH'       to  WABNDB-FUNC
                   perform ERRORE-SQL
               end-if
           end-if.
      *
       L13-DB2-SELECT-EX.
           EXIT.
      *
       L19-DB2-SELECT.
      *
           move 'L19-DB2-SELECT'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE    to  H-STDCOSEDE.
      *
           EXEC SQL
           select
                H_STDCOTIPRU,
                H_STDCOTIPRD,
                H_STDDTMOPRU,
                H_STDDTMOPRD,
                H_STDESITPRU,
                H_STDESITPRD
           into
                  :H-STDCOTIPRU,
                  :H-STDCOTIPRD,
                  :H-STDDTMOPRU,
                  :H-STDDTMOPRD,
                  :H-STDESITPRU,
                  :H-STDESITPRD
              from   TDSSITDO
              where
                     H_STDCHIDOM  =  :H-STDCHIDOM
                and  H_STDCOSEDE  =  :H-STDCOSEDE
           END-EXEC.
           move  SQLCODE          to  FST-ADSSITDO.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSSITDO=' DCLTDSSITDO
               move 'TDSSITDO'    to  WABNDB-TABL
               move 'SELECT '     to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       L19-DB2-SELECT-EX.
           EXIT.
      *
       L22-DB2-SELECT.
      *
           move 'L22-DB2-SELECT'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE    to  H-DANCOSEDE.
      *
           EXEC SQL
           select
              H_DANCODFIS,
              H_DANCHANVP,
              H_DANCCORE ,
              H_DANCOCORE,
              H_DANSIPRRE,
              H_DANIND ,
              H_DANCAP ,
              H_DANPRETEL,
              H_DANNUMTEL,
              H_DANDTINAS,
              H_DANTRSOCE,
              H_DANTRARCE,
              H_DANCOERMI,
              H_DANDTULAG
           into
              :H-DANCODFIS,
              :H-DANCHANVP,
              :H-DANCCORE ,
              :H-DANCOCORE,
              :H-DANSIPRRE,
              :H-DANIND ,
              :H-DANCAP ,
              :H-DANPRETEL,
              :H-DANNUMTEL,
              :H-DANDTINAS,
              :H-DANTRSOCE,
              :H-DANTRARCE,
              :H-DANCOERMI,
              :H-DANDTULAG
              from  TDSDATAN
              where
                     H_DANCODFIS      =  :H-DANCODFIS
                and  H_DANCOSEDE      =  :H-DANCOSEDE
           END-EXEC.
           move  SQLCODE          to  FST-ADSDATAN.
      *
           if  SQLCODE  =  ZERO  or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSDATAN=' DCLTDSDATAN
               move 'TDSDATAN'    to  WABNDB-TABL
               move 'SELECT '     to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       L22-DB2-SELECT-EX.
           EXIT.
      *
       L31-DB2-SELECT.
      *
           MOVE 'L31-DB2-SELECT'  TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO  H-DCDCOSEDE.
      *
           EXEC SQL
           SELECT
                  H_DCDCHIDOM,
                  H_DCDCOUFCO,
                  H_DCDDTIUCO,
                  H_DCDDTCALA,
                  H_DCDCOMOCE,
                  H_DCDGIMAPR,
                  H_DCDQUAPRE,
                  H_DCDNUCESE,
                  H_DCDNUCOSE,
                  H_DCDPEMDA ,
                  H_DCDPEMAL ,
                  H_DCDPESDA ,
                  H_DCDPESAL ,
                  H_DCDDTFIVSG,
                  H_DCDMAAZPR ,
                  H_DCDCSC ,
                  H_DCDCA ,
                  H_DCDRIEDS56,
                  H_DCDCOERMI ,
                  H_DCDCOSEDE
                 INTO
                  :H-DCDCHIDOM,
                  :H-DCDCOUFCO,
                  :H-DCDDTIUCO,
                  :H-DCDDTCALA,
                  :H-DCDCOMOCE,
                  :H-DCDGIMAPR,
                  :H-DCDQUAPRE,
                  :H-DCDNUCESE,
                  :H-DCDNUCOSE,
                  :H-DCDPEMDA ,
                  :H-DCDPEMAL ,
                  :H-DCDPESDA ,
                  :H-DCDPESAL ,
                  :H-DCDDTFIVSG,
                  :H-DCDMAAZPR ,
                  :H-DCDCSC ,
                  :H-DCDCA ,
                  :H-DCDRIEDS56,
                  :H-DCDCOERMI ,
                  :H-DCDCOSEDE
                 FROM TDSDACOD
                 WHERE
                          H_DCDCHIDOM      =  :H-DCDCHIDOM
                     AND  H_DCDCOSEDE      =  :H-DCDCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-ADSDACOD.
      *
           if  SQLCODE  =  zeros   or
               SQLCODE  =  100
           then  continue
           else
               DISPLAY 'DCLTDSDACOD=' DCLTDSDACOD
               MOVE 'TDSDACOD'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           end-if.

      *
       L31-DB2-SELECT-EX.
           EXIT.
      *
       L33-DB2-SELECT.
      *
           move 'L33-DB2-SELECT'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE    TO  H-NASCOSEDE.
      *
           EXEC SQL
           select
                  H_NASCOSEDE,
                  H_NASCHIDOM,
                  H_NASNSELA4,
                  H_NASTREU4A,
                  H_NASIMPREMM,
                  H_NASGGLAV12,
                  H_NASIMPGIOTE,
                  H_NASGIOCOUT,
                  H_NASGIOIND,
                  H_NASDTACQD,
                  H_NASFLGRIT
              into
                 :H-NASCOSEDE,
                 :H-NASCHIDOM,
                 :H-NASNSELA4,
                 :H-NASTREU4A,
                 :H-NASIMPREMM,
                 :H-NASGGLAV12,
                 :H-NASIMPGIOTE,
                 :H-NASGIOCOUT,
                 :H-NASGIOIND,
                 :H-NASDTACQD,
                 :H-NASFLGRIT
               from    TDSNASPI
                 where
                          H_NASCHIDOM      =  :H-NASCHIDOM
                     and  H_NASCOSEDE      =  :H-NASCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-TDSNASPI.
      *
           if  SQLCODE  =  zeros   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSNASPI=' DCLTDSNASPI
               move 'TDSNASPI'    TO  WABNDB-TABL
               move 'SELECT '     TO  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L33-DB2-SELECT-EX.
           EXIT.
      *
       L34-DB2-SELECT.
      *
           move 'L34-DB2-SELECT'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE    TO  H-DICCOSEDE.
      *
           EXEC SQL
           select
                  H_DICCOSEDE,
                  H_DICCHIDOM,
                  H_DICNMENUP,
                  H_DICGIOIND,
                  H_DICMESECO,
                  H_DICTOREUP,
                  H_DICREMEME,
                  H_DICIMPGIO,
                  H_DICCOUTIL
              into
                 :H-DICCOSEDE,
                 :H-DICCHIDOM,
                 :H-DICNMENUP,
                 :H-DICGIOIND,
                 :H-DICMESECO,
                 :H-DICTOREUP,
                 :H-DICREMEME,
                 :H-DICIMPGIO,
                 :H-DICCOUTIL
               from    TDSDICOL
                 where
                          H_DICCHIDOM      =  :H-DICCHIDOM
                     and  H_DICCOSEDE      =  :H-DICCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-TDSDICOL.
      *
           if  SQLCODE  =  zeros   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSDICOL=' DCLTDSDICOL
               move 'TDSDICOL'    TO  WABNDB-TABL
               move 'SELECT '     TO  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L34-DB2-SELECT-EX.
           EXIT.
      *n
      *L37-DB2-SELECT.
      *n
      *n   MOVE 'L37-DB2-SELECT'  TO WABNDB-LABEL.
      *n   MOVE  L-CODICE-SEDE    TO    H-RFSCOSEDE.
      *n
      *n   EXEC SQL
      *n   SELECT
      *n        H_RFSNUGILA,
      *n        H_RFSTRVE,
      *n        H_RFSDTARIM,
      *n        H_RFSIMPGSTE,
      *n        H_RFSGIOIND
      *n   INTO
      *n        :H-RFSNUGILA,
      *n        :H-RFSTRVE,
      *n        :H-RFSDTARIM,
      *n        :H-RFSIMPGSTE,
      *n        :H-RFSGIOIND
      *n      FROM TDSRIFRS
      *n      WHERE
      *n             H_RFSCHIDOM      =  :H-RFSCHIDOM
      *n        AND  H_RFSCOSEDE      =  :H-RFSCOSEDE
      *n   END-EXEC.
      *n   move  SQLCODE               to  FST-ADSRIFRS.
      *n
      *n   IF SQLCODE NOT = ZERO AND NOT = 100
      *n       DISPLAY 'DCLTDSRIFRS=' DCLTDSRIFRS
      *n       MOVE 'TDSRIFRS'    TO  WABNDB-TABL
      *n       MOVE 'SELECT '     TO  WABNDB-FUNC
      *n       PERFORM ERRORE-SQL
      *n   END-IF.
      *n
      *L37-DB2-SELECT-EX.
      *n   EXIT.
      *
       L38-DB2-SELECT.
      *
           move 'L38-DB2-SELECT'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE    TO  H-RIDCOSEDE.
      *
           EXEC SQL
           select
                  H_RIDCOSEDE,
                  H_RIDCHIDOM,
                  H_RIDPERC,
                  H_RIDNUSE,
                  H_RIDTIPOATT,
                  H_RIDNUSE14,
                  H_RIDNUSE15,
                  H_RIDNUSE16
              into
                 :H-RIDCOSEDE,
                 :H-RIDCHIDOM,
                 :H-RIDPERC,
                 :H-RIDNUSE,
                 :H-RIDTIPOATT,
                 :H-RIDNUSE14,
                 :H-RIDNUSE15,
                 :H-RIDNUSE16
               from    TDSASPRI
                 where
                          H_RIDCHIDOM      =  :H-RIDCHIDOM
                     and  H_RIDCOSEDE      =  :H-RIDCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-TDSASPRI
      *
           if  SQLCODE  =  zeros   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSASPRI=' DCLTDSASPRI
               move 'TDSASPRI'    TO  WABNDB-TABL
               move 'SELECT '     TO  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       L38-DB2-SELECT-EX.
           EXIT.
      *
       I39-DB2-SELECT.
      *
           move  'I39-DB2-SELECT' to  WABNDB-LABEL.
           move  L-CODICE-SEDE    to  H-DCOCOSEGR.
      *
           EXEC SQL
              SELECT
                    H_DCOCODFIS,
                    H_DCOCHIDOM,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN
           INTO
                    :H-DCOCODFIS,
                    :H-DCOCHIDOM,
                    :H-DCOCENOPE,
                    :H-DCOCOTIDO,
                    :H-DCOPENS,
                    :H-DCOANFRIC,
                    :H-DCOANVEPR,
                    :H-DCONDVEPR,
                    :H-DCOULESPP,
                    :H-DCODTULPP,
                    :H-DCOULESSP,
                    :H-DCODTULSP,
                    :H-DCODTPRDO,
                    :H-DCODTDECPP,
                    :H-DCODTDECSP,
                    :H-DCOCODPAT,
                    :H-DCOZONPAT,
                    :H-DCOMODARR,
                    :H-DCOCOOBAN,
                    :H-DCOCOREIM,
                    :H-DCOTRDOCE,
                    :H-DCODTCODO,
                    :H-DCODTVIR,
                    :H-DCOINT,
                    :H-DCORECNUO,
                    :H-DCODTADEC,
                    :H-DCOPESTDI,
                    :H-DCOTRDODO,
                    :H-DCOCOERMI,
                    :H-DCODORICO,
                    :H-DCOFLASU,
                    :H-DCONUPRO,
                    :H-DCOIBAN
              FROM TDSDATCO
              WHERE
                     H_DCOANVEPR      =  :H-DCOANVEPR
                AND  H_DCONDVEPR      =  :H-DCONDVEPR
                AND  H_DCOCOSEGR      =  :H-DCOCOSEGR
                AND  H_DCOCOTIDO IN
      *g        ('U', 'Q')
                ('U', 'Q', 'T')
           END-EXEC.
           move  SQLCODE          to  FST-LFDATCO2.
      *
           if  SQLCODE  =  ZERO    or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSDACOD=' DCLTDSDACOD
               move 'TDSDATCO'    to  WABNDB-TABL
               move 'SELECT '     to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       I39-DB2-SELECT-EX.
           EXIT.
      *
       L41-DB2-SELECT.
      *
           MOVE 'L41-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO H-AASCOSED .
      *
           EXEC SQL
           SELECT
                H_AASASPI  ,
                H_AASTIPO  ,
                H_AASATTIV ,
                H_AASDTFINE
           INTO
                :H-AASASPI  ,
191021          :H-AASTIPO  ,
191021          :H-AASATTIV ,
                :H-AASDTFINE
              FROM TDSANTAS
              WHERE
                     H_AASCHIDOM      =  :H-AASCHIDOM
                AND  H_AASCOSED       =  :H-AASCOSED
           END-EXEC.
           move  SQLCODE               to  FST-ADSANTAS.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSANTAS=' DCLTDSANTAS
               MOVE 'TDSANTAS'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L41-DB2-SELECT-EX.
           EXIT.
      *
       L42-DB2-SELECT.
      *
           MOVE 'L42-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO H-PETCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PETPEERTD
           INTO
               :H-PETPEERTD
           FROM TDSPEERT
           WHERE
                     H_PETCHIDOM      =  :H-PETCHIDOM
           END-EXEC.
           move  SQLCODE               to  FST-LFPEERT1
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSPEERT=' DCLTDSPEERT
               MOVE 'TDSPEERT'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L42-DB2-SELECT-EX.
           EXIT.
      *n
      *L40-DB2-SELECT.
      *n
      *n   MOVE 'L40-DB2-SELECT'  TO WABNDB-LABEL.
      *n   MOVE  L-CODICE-SEDE    TO    H-RICCOSEDE.
      *n
      *n   EXEC SQL
      *n   SELECT
      *n        H_RICDTARIM,
      *n        H_RICGIDAIN,
      *n        H_RICGINOIN,
      *n        H_RICINIPRE,
      *n        H_RICFINPRE,
      *n        H_RICPECAVA,
      *n        H_RICDTIUCE,
      *n        H_RICCOVAES1,
      *n        H_RICINVAES1,
      *n        H_RICDEVAES1,
      *n        H_RICINVAES2,
      *n        H_RICDEVAES2,
      *n        H_RICPRIMGIE,
      *n        H_RICGIOIND,
      *n        H_RICSEIMGIE
      *n   INTO
      *n        :H-RICDTARIM,
      *n        :H-RICGIDAIN,
      *n        :H-RICGINOIN,
      *n        :H-RICINIPRE,
      *n        :H-RICFINPRE,
      *n        :H-RICPECAVA,
      *n        :H-RICDTIUCE,
      *n        :H-RICCOVAES1,
      *n        :H-RICINVAES1,
      *n        :H-RICDEVAES1,
      *n        :H-RICINVAES2,
      *n        :H-RICDEVAES2,
      *n        :H-RICPRIMGIE,
      *n        :H-RICGIOIND,
      *n        :H-RICSEIMGIE
      *n      FROM TDSREINC
      *n      WHERE
      *n             H_RICCHIDOM      =  :H-RICCHIDOM
      *n        AND  H_RICCOSEDE      =  :H-RICCOSEDE
      *n   END-EXEC.
      *n   move  SQLCODE               to  FST-ADSREINC.
      *n
      *n   IF SQLCODE NOT = ZERO AND NOT = 100
      *n       DISPLAY 'DCLTDSREINC=' DCLTDSREINC
      *n       MOVE 'TDSREINC'    TO  WABNDB-TABL
      *n       MOVE 'SELECT '     TO  WABNDB-FUNC
      *n       PERFORM ERRORE-SQL
      *n   END-IF.
      *n
      *L40-DB2-SELECT-EX.
      *n   EXIT.
      *n
      *L43-DB2-SELECT.
      *n
      *n   MOVE 'L43-DB2-SELECT'  TO WABNDB-LABEL.
      *n   MOVE  L-CODICE-SEDE    TO    H-EDICOSEDE.
      *n
      *n   EXEC SQL
      *n   SELECT
      *n        H_EDITIPCON,
      *n        H_EDIOREFCO,
      *n        H_EDIORTECO,
      *n        H_EDIRESE1E,
      *n        H_EDIRESE2E,
      *n        H_EDIRESE3E,
      *n        H_EDIRESE4E,
      *n        H_EDIORSE1,
      *n        H_EDIORSE2,
      *n        H_EDIORSE3,
      *n        H_EDIORSE4,
      *n        H_EDIISLICIG,
      *n        H_EDIDTASOS,
      *n        H_EDIIMPGSTE,
      *n        H_EDIGIOIND
      *n   INTO
      *n        :H-EDITIPCON,
      *n        :H-EDIOREFCO,
      *n        :H-EDIORTECO,
      *n        :H-EDIRESE1E,
      *n        :H-EDIRESE2E,
      *n        :H-EDIRESE3E,
      *n        :H-EDIRESE4E,
      *n        :H-EDIORSE1,
      *n        :H-EDIORSE2,
      *n        :H-EDIORSE3,
      *n        :H-EDIORSE4,
      *n        :H-EDIISLICIG,
      *n        :H-EDIDTASOS,
      *n        :H-EDIIMPGSTE,
      *n        :H-EDIGIOIND
      *n      FROM TDSEDILI
      *n      WHERE
      *n             H_EDICHIDOM      =  :H-EDICHIDOM
      *n        AND  H_EDICOSEDE      =  :H-EDICOSEDE
      *n   END-EXEC.
      *n   move  SQLCODE               to  FST-ADSEDILI.
      *n
      *n
      *n   IF SQLCODE NOT = ZERO AND NOT = 100
      *n       DISPLAY 'DCLTDSEDILI=' DCLTDSEDILI
      *n       MOVE 'TDSEDILI'    TO  WABNDB-TABL
      *n       MOVE 'SELECT '     TO  WABNDB-FUNC
      *n       PERFORM ERRORE-SQL
      *n   END-IF.
      *n
      *L43-DB2-SELECT-EX.
      *n   EXIT.
      *n
      *n
      *L46-DB2-SELECT.
      *n
      *n   MOVE 'L46-DB2-SELECT'  TO WABNDB-LABEL.
      *n   MOVE  L-CODICE-SEDE    TO    H-MARCOSEDE.
      *n
      *n   EXEC SQL
      *n   SELECT
      *n        H_MARNUGILA,
      *n        H_MARTRTE,
      *n        H_MARDTDIDI,
      *n        H_MARIMPGSTE,
      *n        H_MARGIOIND
      *n   INTO
      *n        :H-MARNUGILA,
      *n        :H-MARTRTE,
      *n        :H-MARDTDIDI,
      *n        :H-MARIMPGSTE,
      *n        :H-MARGIOIND
      *n      FROM TDSMARIT
      *n      WHERE
      *n             H_MARCHIDOM      =  :H-MARCHIDOM
      *n        AND  H_MARCOSEDE      =  :H-MARCOSEDE
      *n   END-EXEC.
      *n   move  SQLCODE               to  FST-ADSMARIT.
      *n
      *n   IF SQLCODE NOT = ZERO AND NOT = 100
      *n       DISPLAY 'DCLTDSMARIT=' DCLTDSMARIT
      *n       MOVE 'TDSMARIT'    TO  WABNDB-TABL
      *n       MOVE 'SELECT '     TO  WABNDB-FUNC
      *n       PERFORM ERRORE-SQL
      *n   END-IF.
      *n
      *L46-DB2-SELECT-EX.
      *n   EXIT.
      *n
       E62-DB2-SELECT.
      *
           MOVE 'E62-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PBACKUP,
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PBACKUP   ,
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PCOSEDE        =  :H-PCOSEDE
                AND  H_PDATAELABO     =  :H-PDATAELABO
                AND  H_PPROCEDURA     =  :H-PPROCEDURA
                AND  H_PPROGRESSI     =  :H-PPROGRESSI
                AND  H_PSTRUTTURA     =  :H-PSTRUTTURA
           END-EXEC.
           move  SQLCODE               to  FST-ADSRPG00.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E62-DB2-SELECT-EX.
           EXIT.
      *
       E30-DB2-SELECT.
      *
           MOVE 'E30-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-N0COSEDE.
      *
           EXEC SQL
           SELECT
               H_N0PROCEDURA,
               H_N0DCOCENOPE,
               H_N0DATAELABO,
               H_N0DOMANDA,
               H_N0PROGRESSI,
               H_N0COSEDE,
               H_N0RECPAGATO,
               H_N0COMPATTO,
               H_N0ACQUISITO,
               H_N0CFISCALE,
               H_N0DCOCODFIS,
               H_N0DCOCOTIDO,
               H_N0DCOCHIDOM,
               H_N0DCOPENS,
               H_N0DCOANFRIC,
               H_N0DCOULESPP,
               H_N0DCODTULPP,
               H_N0DCODTDEPP,
               H_N0DCOCODPAT,
               H_N0DCOCOIBAN,
               H_N0DCODTCODO,
               H_N0DCOINT,
               H_N0DCODTADEC,
               H_N0DICGIOIND,
               H_N0DICIMPGIO,
               H_N0DICCOUTIL,
               H_N0NASIMPGIOTE,
               H_N0NASGIOCOUT,
               H_N0NASGIOIND,
               H_N0DSICODSIN,
               H_N0DSICATSIN,
               H_N0RECTOREE1,
               H_N0RECTORER1,
               H_N0RECIMURE1,
               H_N0RECIMPRA1,
               H_N0RECTOREE2,
               H_N0RECTORER2,
               H_N0RECIMURE2,
               H_N0RECIMPRA2,
               H_N0RECTOREE3,
               H_N0RECTORER3,
               H_N0RECIMURE3,
               H_N0DCDCOUFCO,
               H_N0DCDDTCALA,
               H_N0DCDQUAPRE,
               H_N0PMEDTRICA,
               H_N0PMETOTRSI,
               H_N0PMEUITRSI,
               H_N0PMEINDTOT,
               H_N0PMEINDTOG,
               H_N0PMEINDUIM,
               H_N0PMEULPEGG,
               H_N0PINDINDEB,
               H_N0PMEANFTOT,
               H_N0PMEANFTOG,
               H_N0PMEANFUIM,
               H_N0PMEANFUGG,
               H_N0PANFINDEB,
               H_N0PMEINLEPR,
               H_N0PMEINLEAN,
               H_N0PMEIMULAS,
               H_N0PMEULPEDA,
               H_N0PMEULPEAL,
               H_N0PMETOIRNC,
               H_N0PMEULIRN1,
               H_N0PMETOIRNP,
               H_N0PMEULIRNS,
               H_N0PMECONFIS,
               H_N0PMEADDREG,
               H_N0PMEADDCOM,
               H_N0PMER730UIM,
               H_N0IMPORD,
               H_N0PMEAUTTOTE,
               H_N0PMEAUTTOGG,
               H_N0PMEAUTUIME,
               H_N0PMEULAUTGG,
               H_N0AADRECUP,
               H_N0AADIMPSPE,
               H_N0AADSTAPAG,
               H_N0FACDAL,
               H_N0FACAL,
               H_N0FACGGPRES,
               H_N0FACIMPONI,
               H_N0FACTREDIC,
               H_N0FACIMPLOR,
               H_N0FACGGDETR,
               H_N0FACIMPDET,
               H_N0FAPDAL,
               H_N0FAPAL,
               H_N0FAPGGPRES,
               H_N0FAPIMPONI,
               H_N0FAPTREDIC,
               H_N0FAPALIQME,
               H_N0FAPIMPLOR,
               H_N0FAPGGDETR,
               H_N0FAPIMPDET,
               H_N0FCONGAC,
               H_N0FCONGAP,
               H_N0FIMPREGAC,
               H_N0FIMPREGAP,
               H_N0FIMPPROAC,
               H_N0FIMPPROAP,
               H_N0FCODCOMUN,
               H_N0FIMPCOMAC,
               H_N0FIMPCOMAP,
               H_N0FCODPAGA1,
               H_N0FIMPPAGA1,
               H_N0FCODPAGA2,
               H_N0FIMPPAGA2,
               H_N0FCODPAGA3,
               H_N0FIMPPAGA3,
               H_N0FACDETFAM,
               H_N0FACDETLAV,
               H_N0CODICE1,
               H_N0IMPORTO1,
               H_N0CODICE2,
               H_N0IMPORTO2,
               H_N0CODICE3,
               H_N0IMPORTO3,
               H_N0CODICE4,
               H_N0IMPORTO4,
               H_N0CODICE5,
               H_N0IMPORTO5,
               H_N0CODICE6,
               H_N0IMPORTO6,
               H_N0CODICE7,
               H_N0IMPORTO7,
               H_N0CODICE8,
               H_N0IMPORTO8,
               H_N0CODICE9,
               H_N0IMPORTO9
            INTO
              :H-N0PROCEDURA,
              :H-N0DCOCENOPE,
              :H-N0DATAELABO,
              :H-N0DOMANDA,
              :H-N0PROGRESSI,
              :H-N0COSEDE,
              :H-N0RECPAGATO,
              :H-N0COMPATTO,
              :H-N0ACQUISITO,
              :H-N0CFISCALE,
              :H-N0DCOCODFIS,
              :H-N0DCOCOTIDO,
              :H-N0DCOCHIDOM,
              :H-N0DCOPENS,
              :H-N0DCOANFRIC,
              :H-N0DCOULESPP,
              :H-N0DCODTULPP,
              :H-N0DCODTDEPP,
              :H-N0DCOCODPAT,
              :H-N0DCOCOIBAN,
              :H-N0DCODTCODO,
              :H-N0DCOINT,
              :H-N0DCODTADEC,
              :H-N0DICGIOIND,
              :H-N0DICIMPGIO,
              :H-N0DICCOUTIL,
              :H-N0NASGIOIND,
              :H-N0NASIMPGIOTE,
              :H-N0NASGIOCOUT,
              :H-N0DSICODSIN,
              :H-N0DSICATSIN,
              :H-N0RECTOREE1,
              :H-N0RECTORER1,
              :H-N0RECIMURE1,
              :H-N0RECIMPRA1,
              :H-N0RECTOREE2,
              :H-N0RECTORER2,
              :H-N0RECIMURE2,
              :H-N0RECIMPRA2,
              :H-N0RECTOREE3,
              :H-N0RECTORER3,
              :H-N0RECIMURE3,
              :H-N0DCDCOUFCO,
              :H-N0DCDDTCALA,
              :H-N0DCDQUAPRE,
              :H-N0PMEDTRICA,
              :H-N0PMETOTRSI,
              :H-N0PMEUITRSI,
              :H-N0PMEINDTOT,
              :H-N0PMEINDTOG,
              :H-N0PMEINDUIM,
              :H-N0PMEULPEGG,
              :H-N0PINDINDEB,
              :H-N0PMEANFTOT,
              :H-N0PMEANFTOG,
              :H-N0PMEANFUIM,
              :H-N0PMEANFUGG,
              :H-N0PANFINDEB,
              :H-N0PMEINLEPR,
              :H-N0PMEINLEAN,
              :H-N0PMEIMULAS,
              :H-N0PMEULPEDA,
              :H-N0PMEULPEAL,
              :H-N0PMETOIRNC,
              :H-N0PMEULIRN1,
              :H-N0PMETOIRNP,
              :H-N0PMEULIRNS,
              :H-N0PMECONFIS,
              :H-N0PMEADDREG,
              :H-N0PMEADDCOM,
              :H-N0PMER730UIM,
              :H-N0IMPORD,
              :H-N0PMEAUTTOTE,
              :H-N0PMEAUTTOGG,
              :H-N0PMEAUTUIME,
              :H-N0PMEULAUTGG,
              :H-N0AADRECUP,
              :H-N0AADIMPSPE,
              :H-N0AADSTAPAG,
              :H-N0FACDAL,
              :H-N0FACAL,
              :H-N0FACGGPRES,
              :H-N0FACIMPONI,
              :H-N0FACTREDIC,
              :H-N0FACIMPLOR,
              :H-N0FACGGDETR,
              :H-N0FACIMPDET,
              :H-N0FAPDAL,
              :H-N0FAPAL,
              :H-N0FAPGGPRES,
              :H-N0FAPIMPONI,
              :H-N0FAPTREDIC,
              :H-N0FAPALIQME,
              :H-N0FAPIMPLOR,
              :H-N0FAPGGDETR,
              :H-N0FAPIMPDET,
              :H-N0FCONGAC,
              :H-N0FCONGAP,
              :H-N0FIMPREGAC,
              :H-N0FIMPREGAP,
              :H-N0FIMPPROAC,
              :H-N0FIMPPROAP,
              :H-N0FCODCOMUN,
              :H-N0FIMPCOMAC,
              :H-N0FIMPCOMAP,
              :H-N0FCODPAGA1,
              :H-N0FIMPPAGA1,
              :H-N0FCODPAGA2,
              :H-N0FIMPPAGA2,
              :H-N0FCODPAGA3,
              :H-N0FIMPPAGA3,
              :H-N0FACDETFAM,
              :H-N0FACDETLAV,
              :H-N0CODICE1,
              :H-N0IMPORTO1,
              :H-N0CODICE2,
              :H-N0IMPORTO2,
              :H-N0CODICE3,
              :H-N0IMPORTO3,
              :H-N0CODICE4,
              :H-N0IMPORTO4,
              :H-N0CODICE5,
              :H-N0IMPORTO5,
              :H-N0CODICE6,
              :H-N0IMPORTO6,
              :H-N0CODICE7,
              :H-N0IMPORTO7,
              :H-N0CODICE8,
              :H-N0IMPORTO8,
              :H-N0CODICE9,
              :H-N0IMPORTO9
              FROM TDSAPNA0
              WHERE
                     H_N0COSEDE       =  :H-N0COSEDE
                AND  H_N0PROCEDURA    =  :H-N0PROCEDURA
                AND  H_N0DCOCENOPE    =  :H-N0DCOCENOPE
                AND  H_N0DOMANDA      =  :H-N0DOMANDA
           END-EXEC.
           move  SQLCODE              to  FST-TDSAPNA0.
      *
           if  SQLCODE  =  zeros   or
               SQLCODE  =  100
           then  continue
           else
               display  'DCLTDSAPNA0=' DCLTDSAPNA0
               move  'TDSAPNA0'    to  WABNDB-TABL
               move  'SELECT '     to  WABNDB-FUNC
               perform  ERRORE-SQL
           end-if.
      *
       E30-DB2-SELECT-EX.
           EXIT.
      *
       I30-DB2-SELECT.
      *
           MOVE 'I30-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PPROCEDURA   =  :H-PPROCEDURA
                AND  H_PSTRUTTURA   =  :H-PSTRUTTURA
                AND  H_PCOSEDE      =  :H-PCOSEDE
                AND  H_PBACKUP      =  :H-PBACKUP
           END-EXEC.
           move  SQLCODE               to  FST-ADSRPG00.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I30-DB2-SELECT-EX.
           EXIT.
280922 L59-DB2-SELECT.
      *
           MOVE 'L59-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO W-IBECOSEDE.
      *
           EXEC SQL
           SELECT
                A.H_IBEIBAEST
           INTO
                :W-IBEIBAEST
              FROM TDSIBES A
              WHERE
                     A.H_IBECHIDOM      =  :W-IBECHIDOM
                AND  A.H_IBECOSEDE      =  :W-IBECOSEDE
060323          AND  A.H_IBEFLAGCANC    =  ' '
                AND  A.H_IBEPROGR       = (SELECT MAX(B.H_IBEPROGR)
                                             FROM TDSIBES B
                                     WHERE B.H_IBECHIDOM = A.H_IBECHIDOM
                                       AND B.H_IBECOSEDE = A.H_IBECOSEDE
060323                                 AND B.H_IBEFLAGCANC    =  ' '
                                          )
           END-EXEC.

       L59-DB2-SELECT-EX.
           EXIT.
      *
      *
       I09-CONTA-SOSPE.
      *
           move 'I09-CONTA-SOSPE' to  WABNDB-LABEL.
           move  L-CODICE-SEDE    to  H-SOSCOSEDE.
           move  0                to  WRK-CONTA-SOS.
      *
           EXEC SQL
           SELECT
                COUNT(*)
           INTO
                :WRK-CONTA-SOS
              FROM TDSSOSPE
              WHERE
                     H_SOSCOSEDE    =  :H-SOSCOSEDE
           END-EXEC.
           move  SQLCODE          to  FST-LFSOSPE1.
      *
           if  SQLCODE  =  ZERO   or
               SQLCODE  =  100
           then  continue
           else
               display 'DCLTDSSOSPE=' DCLTDSSOSPE
               move 'TDSSOSPE'    to  WABNDB-TABL
               move 'SELECT '     to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
           if   SQLCODE = 100  or  WRK-CONTA-SOS = 0
           then
               move  'S'          to  W-ERRORE
               display 'SEDE SENZA SOSPENSIONI >>' H-SOSCOSEDE
                       ' SQLCODE='  FST-LFSOSPE1
                       ' NUMERO ='  WRK-CONTA-SOS
               display 'DCLTDSSOSPE=' DCLTDSSOSPE
               move 'TDSSOSPE'    to  WABNDB-TABL
               move 'SELECT '     to  WABNDB-FUNC
               perform ERRORE-SQL
           end-if.
      *
       I09-EX.
           EXIT.
      ******************************************************************
      *       DELETE
      ******************************************************************
      *
       E45-DB2-DELETE.
      *
           move  L-CODICE-SEDE    to    H-PEECOSEDE.
      *
            EXEC SQL
            DELETE  FROM TDSPEERE
               WHERE
                H_PEECHIDOM =  :H-PEECHIDOM
            AND H_PEECOSEDE =  :H-PEECOSEDE
           END-EXEC .
           move  SQLCODE              to  FST-LFPEERE1.

           if  SQLCODE  =  0    or
               SQLCODE  =  100
           then  continue
           else
               move  'N'              to  FLG-COMMIT
               move  'DELETE    '     to  S2A005
               move  'LFPEERE1  '     to  S2A006
               move  SQLCODE          to  S2A007
               perform  S10-STAMPA   thru  S10-EX
               move  111  to  NDC3
           end-if.
      *
       E45-DB2-DELETE-EX.
           exit.
      *
220218*------------------------------- Cancellazione TDSLOCK
       F00-DELETE-TDSLOCK0.
      *
           string  '000'         delimited  by  size
                   LMATRICOLA    delimited  by  size
                   H-DCOCENOPE   delimited  by  size
           into  H-LCKCHIDOM.
           move  'F00-DELETE-TDSLOCK0'  to  WABNDB-LABEL.
      *
           EXEC SQL
                   DELETE FROM  TDSLOCK0
                   WHERE
                      H_LCKCOSEDE = :H-DCOCOSEGR   AND
                      H_LCKCODOPE = :H-DCOCENOPE   AND
                      H_LCKPREST  = 'U'            AND
                      H_LCKCHIDOM = :H-LCKCHIDOM   AND
                      H_LCKTIPR   = 'T'             AND
                      H_LCKMATR   = :LMATRICOLA
           END-EXEC.
      *
      *    IF    SQLCODE NOT = ZERO
      *            DISPLAY 'DCLTDSLOCK0=' DCLTDSLOCK0
      *            MOVE 'TDSLOCK0' TO WABNDB-TABL
      *            MOVE 'DELETE  ' TO WABNDB-FUNC
      *            PERFORM ERRORE-SQL
      *    END-IF.
      *

      *
       F00-EX-DELETE-TDSLOCK0.
220218     exit.
      *
      ******************************************************************
      *       INSERT
      ******************************************************************
      *
      * INSERIMENTO RIGA DI STAMPA
      *
       S30-INSERT-REPORT.
200120* rivedere
GGA   *    if L-PROCEDURA                   =  'G96' OR
GGA   *----                                 =  'G97' OR
      *                                     =  'G21' OR
      *                                     =  'G98'
      *       GO TO S30-EX-INSERT-REPORT
200120*    END-IF.
      *
           MOVE  'S30-INSERT-REPORT     '  TO  WABNDB-LABEL.
      *
           EXEC SQL
                   INSERT  INTO TDSREPOR
                   VALUES  (:DCLTDSREPOR)
           END-EXEC.
      *
200120*    IF    SQLCODE NOT = ZERO
      *            DISPLAY 'DCLTDSREPOR=' DCLTDSREPOR
      *            MOVE 'TDSREPOR' TO WABNDB-TABL
      *            MOVE 'INSERT  ' TO WABNDB-FUNC
      *            PERFORM ERRORE-SQL
      *    END-IF.
           if  SQLCODE  equal  zeros
           then  continue
           else
               if L-PROCEDURA           =  'G21'  or
                                        =  'G96'  or
                                        =  'G97'  or
                                        =  'G98'
               then  continue
               else
                   display  'DCLTDSREPOR='  DCLTDSREPOR
                   move  'TDSREPOR'  to  WABNDB-TABL
                   move  'INSERT  '  to  WABNDB-FUNC
                   perform  ERRORE-SQL
               end-if
200120     end-if.
      *
       S30-EX-INSERT-REPORT.
      *
           EXIT.
      *
       E30-DB2-INSERT.
      *
           move  'E30-DB2-INSERT '  to  WABNDB-LABEL.
           move  L-CODICE-SEDE      to  H-N0COSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSAPNA0
                   VALUES  ( :DCLTDSAPNA0)
           END-EXEC.
      *
           if    SQLCODE  =  ZERO
           then  continue
           else
                 display 'DCLTDSAPNA0=' DCLTDSAPNA0
                 move  'TDSAPNA0'  to  WABNDB-TABL
                 move  'INSERT  '  to  WABNDB-FUNC
                 perform  ERRORE-SQL
           end-if.
           move  SQLCODE               to  FST-TDSAPNA0.
      *
       E30-DB2-INSERT-EX.
              EXIT.
      *
       E46-DB2-EFFE-INS.
      *
      *    move  'E46-DB2-EFF-INS'  to  WABNDB-LABEL.
           move  L-CODICE-SEDE    to    H-PEECOSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSPEERE
                   VALUES  ( :DCLTDSPEERE)
           END-EXEC.
      *
           move  SQLCODE          to  FST-LFPEERE1.

           if  SQLCODE   =  ZERO
           then  continue
           else
               move  'N'                to  FLG-COMMIT
               move  'WRITE     '       to  S2A005
               move  'LFPEERE1  '       to  S2A006
               move  SQLCODE            to  S2A007
               perform  S10-STAMPA     thru  S10-EX
           end-if.
      *
       E46-DB2-EFFE-INS-EX.
              EXIT.
      *
       E52-DB2-PAGA-INS.
      *
      *    move  'E52-DB2-PAGA-INS' to  WABNDB-LABEL.
           move  L-CODICE-SEDE      to  H-PMECOSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSPAGME
                   VALUES  ( :DCLTDSPAGME)
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSPAGME.
      *
           IF    SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'WRITE     '       to  S2A005
                 move  'TDSPAGME  '       to  S2A006
                 move  SQLCODE            to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
           END-IF.
      *
       E52-DB2-PAGA-INS-EX.
           EXIT.
      *
       E62-DB2-INSERT.
      *
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSRPG00
                   VALUES  ( :DCLTDSRPG00)
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSRPG00.
      *
       E62-DB2-INSERT-EX.
           EXIT.
      *
       IMPOSTA-RPT.
      *
           MOVE  'IMPOSTA-RPT'  TO  WABNDB-LABEL.
      *
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-TIMESTAMP-DATA-ORA.
           MOVE WK-GG      TO  WW-DB2-GG.
           MOVE WK-MM      TO  WW-DB2-MM.
           MOVE WK-AA      TO  WW-DB2-AA.
           MOVE WK-H       TO  WW-DB2-HH
270921                         W-T-HH.
           MOVE WK-M       TO  WW-DB2-T-MM
270921                         W-T-MM.
           MOVE WK-S       TO  WW-DB2-SS.
           MOVE WK-DB2-DATA   TO TDSREPORT-DTA-PRE.
           MOVE WK-DB2-TIME   TO TDSREPORT-ORA-PRE.
           MOVE 0             TO TDSREPORT-NUM-RIGA.
           MOVE SPACES        TO TDSREPORT-RIGA-REPORT.
           MOVE L-CODICE-SEDE TO TDSREPORT-SEDE.
           MOVE L-CODICE-STOP TO TDSREPORT-CEOP.
           MOVE L-PROCEDURA   TO TDSREPORT-PROCEDURA.
           MOVE KMATRICOLA    TO TDSREPORT-MATRICOLA.
      *
           MOVE TDSREPORT-SEDE      TO WK-RPT-SEDE.
           MOVE TDSREPORT-CEOP      TO WK-RPT-CEOP.
           MOVE TDSREPORT-MATRICOLA TO WK-RPT-MATRICOLA.
           MOVE TDSREPORT-DTA-PRE   TO WK-RPT-DTA-PRE.
           MOVE TDSREPORT-ORA-PRE   TO WK-RPT-ORA-PRE.
      *
       EX-IMPOSTA-RPT.
           EXIT.
      *
      *----------------------------------------- COPY PER GESTIONE
      *
           EXEC SQL INCLUDE CDSABNDB END-EXEC.
      *