      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PDSIO05.
       AUTHOR.      MASI-MONGELLI.
      *--------------------------------------------------------------*
      *  Ad ogni variazione aggiorna WK_VERSION  <--------           *
      *---------------------------------------------------------------
      *$ OPTION      *SRCDBG                                         *
      * 1° rilascio:  x/02/2005 -   Autore: MASI, MONGELLI           *
      *              -                                               *
      *--------------------------------------------------------------*
      * Allineato pgm as400 vers. del 23.02.2011                     *
      *                                                              *
      *  Data  15.04.2026
      *      Autore: Elena
      *            inserita gestione TIRA - INSERIMENTO-REINSERIMENTO
      *            ABRUZZO 2026, 23/02/2026 - 31/12/2028
      *            inserita gestione PIAC - INVECCHIAMENTO ATTIVO CAN-
      *            TIERI ABRUZZO 2026, 23/02/2026 - 31/12/2028
      *
      *  -     24.10.2025
      *      Autore: Elena
      *            inserita gestione TGOP - Tirocinio politiche attive
      *            Piemonte, 16/07/2025 - 31/12/2026.
      *
      *  -     30.07.2025
      *      Autore: Elena
      *            inserita gestione TGOS - Tirocinio politiche attive
      *            Sicilia, 02/07/2025 - 31/12/2026.
      *            Completata il 03/09/2025.
      *
      *  -     14.03.2025
      *      Autore: Elena
      *            inserita gestione TYGP - Tirocinio PON Puglia, 2023
      *
      *  -     13.03.2025
      *      Autore: Elena
      *            inserita gestione TGOV - Tirocinio politiche attive
      *            Veneto, 2021-2027.
      *            Corretti il 22/05/2025 a seguito comunicazione da
      *            D.C. Bilanci.
      *
      *  -     30.01.2025
      *      Autore: Elena
      *            per FTCG e FTCD va gestita l'eventuale presenza di
      *            interessi legali presenti nella colonna
      *            TDSSPIO0.H_O0SXIMANFT.
      *            (messa in linea 18/03/2025)
      *
      *  -     28.01.2025
      *      Autore: Elena
      *            inserita gestione APA6 - AZIONE POLITICA ATTIVA VAL
      *            D AOSTA OVER58, Periodo: Gen-Dic 2024.
      *
      *  -     16.01.2025
      *      Autore: Elena
      *            Fatte correzioni per la gestione dei sindacati.
      *            - ampliata l'area a 400 occurs.
      *            - tutti i sindacati vanno gestiti come il codice 10,
      *              cioè assumendo che ogni categoria abbia una sua
      *              convenzione ed utilizzi un conto specifico (invece
      *              in precedenza tutti i codici tranne il 10 pagavano
      *              su un unico conto perchè afferivano ad un'unica
      *              convenzione).
      *                                                              *
      *  -     16.01.2025
      *      Autore: Elena
      *            Corretti i conti per APA3 a seguito verifiche ammini-
      *            strative. I conti degli altri APA* sono corretti.
      *
      *  -     30.10.2024
      *      Autore: Elena
      *            Modificati i conti per TGOC Tiroc. PAR GOL Calabria
      *            secondo le indicazioni amministrative.
      *
      *  -     24.06.2024
      *      Autore: Elena
      *            inserita gestione TGOC - Tirocinio PAR GOL Calabria
      *            gennaio 2024 - dicembre 2025.
      *
      *  -     21.06.2024
      *      Autore: Elena
      *            inserita gestione TISM - Sussidio Lavori ad Utilità
      *            Diffusa - LUD - Regione Molise,  gennaio-dicembre
      *            2024.
      *  -     06.05.2024
      *      Autore: Elena
      *            inserita gestione TISC - Sussidio Tirocini Inclusione
      *            Sociale Calabria, per il periodo gennaio-dicembre
      *            2024.
      *
      *  -     10.04.2024
      *      Autore: Elena
      *            inserita gestione FTCI - Fondo Trasporto aereo Cig ad
      *            Integrazione per i lavoratori di Alitalia Sai e
      *            Alitalia Cityliner, per il periodo gennaio-ottobre
      *           2024.
      *                                                              *
      *  -     27.03.2024
      *      Autore: Elena
      *            inserita gestione FSAD - Fondo ServiziAmbientali
      *            Aspi/Naspi integrazione di durata  (come FTAD),
      *            18 mesi.
      *
      *  -     26.03.2024
      *      Autore: Elena
      *            inserita gestione FSAI - Fondo ServiziAmbientali
      *            Aspi/Naspi integrazione di importo (come FTAI).
      *
      * -      variazione   Data:      28/11/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita gestione sussidi:                    *
      *              DLI2 DOTE LAVORO INCLUS. ATTIVA CALABRIA        *
      *                                                              *
      * ------ variazione   Data:      25/10/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita gestione sussidi:                    *
      *                    POR3 Borse ricerca POR Marche 2021-2027   *
      *                    POR4 Borse lavoro POR Marche 2021-2027    *
      *                    POR5 Borse tematiche POR Marche 2021-2027 *
      *                    POR6 Tirocini extra-curriculari POR Marche*
      *                    2021-2027                                 *
      *                                                              *
      * ------ variazione   Data: 09/05/2023                         *
      *       Autore: Nicola                                         *
      *       Motivo: display vari                                   *
      * ------ variazione   Data: 14/03/2023                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito il sussidio APA5.                     *
      * -----  variazione   Data: 14/02/2023                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito il sussidio TGOL (convenzione RER-INPS)
      * -----  variazione   Data: 13/01/2023                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito bonus 1, E159, E160, E162, E157.      *
      * -----  variazione   Data: 24/11/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito il sussidio APA4.                     *
      * -----  variazione   Data: 23/11/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito bonus 1, E107.                        *
      * -----  variazione   Data: 08/07/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito bonus 1, E109, E110, E112.            *
      * -----  variazione   Data: 10/05/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito il sussidio POR2.                     *
      *       Convenzione Reg. Marche Politiche attive - POR - Borse *
      *       lavoro, valido dal 01/01/22 al 30/06/23                *
      * -----  variazione   Data: 13/04/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito bonus 0, E092.                        *
      * -----  variazione   Data: 11/04/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: inserito il sussidio APA3.                     *
      * -----  variazione   Data: 03/02/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: per il nuovo conto FTCG Alitalia si decide di  *
      *               prelevare le informazioni da tdssusst e non più*
      *               dal tabellone.                                 *
      * -----  variazione   Data: 27/01/2022                         *
      *       Autore: Elena                                          *
      *       Motivo: gestito nuovo conto per FTCG Alitalia. Inserita*
      *               lettura tabellone per verificare se sono doman-*
      *               de da inviare sul nuovo conto.                 *
      * -----  variazione   Data: 14/11/2020                         *
      *       Autore: Nicola                                         *
      *       Motivo: perform a10-aggiorna x  h-pzeropagam           *
      * -----  variazione   Data: 11/11/2020                         *
      *       Autore: Massimo                                        *
      *       Motivo: ampliata tab-sx da 60 a 160                    *
      * -----  variazione   Data: 17/07/2020                         *
      *       Autore: Massimo                                        *
      *       Motivo: eliminata chiamata POPWMAIN per conguaglio 730 *
      *               gestione conguaglio 730 anche in DARE          *
      * -----  variazione   Data: 11/07/2017                         *
      *       Autore: Massimo                                        *
      *       Motivo: inserita gestione ACCONTO in codpaga1-imppaga1 *
      *               spostato conguaglio 730 in codice2-importo2    *
      *
      * -----  variazione   Data: 25/01/2017                         *
      *       Autore: Massimo                                        *
      *          Motivo  : correttivo per FTMD h_sstrecrin contiene  *
      *                    contribuzione correlata                   *
      *                                                              *
      * -----  variazione   Data: 19/09/2016                         *
      *       Autore: Massimo                                        *
      *          Motivo  : correttivo per nuovi sindacati            *
      *                    da 10 03 in poi                           *
      *       variazioni identificate da SSS --> SSS-F               *
      *                                                              *
      * -----  variazione   Data: 20/05/2014                         *
      *       Autore: Massimo                                        *
      *          Motivo  : Errore importi negativi (solo per SX)     *
      *                                                              *
      * -----  variazione   Data: 27/06/2012                         *
      *       Autore: Giuseppe                                       *
      *          Motivo  : Modificata copy POPCSIN                   *
      *                                                              *
      * -----  variazione   Data: 25/02/2010                         *
      *       Autore: Nicola                                         *
      *                                                              *
      * -----  variazione   Data: 25/02/2010                         *
      *       Autore: Nicola                                         *
      *          Motivo  : modifica A10 ed I13                       *
      *     -- variazione   Data: 11/02/2010                         *
      *       Autore: Nicola                                         *
      *          Motivo  : MESSAGGIO CENTRALIZZAZIONE                *
      *     -- variazione   Data: 09/12/2009                         *
      *       Autore: Nicola                                         *
      *          Motivo  : settaggio W-ERRORE                        *
      *        variazione   Data: 04/09/2009                         *
      *       Autore: Massimo                                        *
      *          Motivo  : gestione recuperi per BCFC centralizzato  *
      *          ** cerca stringa 'gestione recuperi'                *
      *--------------------------------------------------------------*
      *                                                              *
      *                     Data: 01/09/2009                         *
      *       Autore: Massimo                                        *
      *          Motivo  : BCFC centralizzato                        *
      *--------------------------------------------------------------*
      *       Autore: Nicola                                         *
      *                     Data: 06/11/2009                         *
      *          Motivo  : RDSTART                                   *
      *                     Data: 28/08/2009                         *
      *          Motivo  : Pagamenti centralizzati                   *
      *                    ...................................       *
      *--------------------------------------------------------------*
      *                     Data: 21/07/2008                         *
      *       Autore: Massimo                                        *
      *        Motivo:- conti per assegno emergenziale               *
      *    17/09/2010                                                *
      *                     Data: 21/07/2008                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x controllo versioni web            *
      *               - Gestione elaborazione senza pagamenti        *
      *    15/01/2008                                                *
      * Autore           : Nicola                                    *
      * Motivo           : Modifica importo minimo > 1.99            *
      *    15/01/2008                                                *
      * Autore           : Massimo                                   *
      * Motivo           : Rimborso spese € 500 progetto ISOLA       *
      *--------------------------------------------------------------*
      *    28/11/2007                                                *
      * Autore           : Massimo                                   *
      * Motivo           : Aggiornamento area di passaggio           *
      *                    LK-POPCF73, LK-POPCF74                    *
      *                    per Gestione Centro operativo             *
      *--------------------------------------------------------------*
      *                    data    12/03/2007                        *
      *        Autore: massimo ..                                    *
      *        Motivo: conti per fondo trasp. aereo                  *
      *              : gestione mappa informa                        *
      *     -- variazione   Data:  6/03/2006                         *
      *        Autore: nicola  ..                                    *
      *        Motivo: gestione   ristampe                           *
      *              : gestione mappa informa                        *
      *     -- variazione   Data: 27/09/2005                         *
      *        Autore: nicola  ..                                    *
      *        Motivo: gestione   stampe / 730 in hcf                *
      *     -- variazione   Data: 12/07/2005                         *
      *        Autore: nicola  ..                                    *
      *        Motivo: gestione ristampe ....                        *
      *--------------------------------------------------------------*
      * Funzione :  Elabora biglietto contabile Interv.Occupazione   *
      *                                                              *
      * PGM Chiamante : -------->  PDSIO01                           *
      * PGM chiamati:                                                *
      *             RDSERR0    per mappa errori                      *
      *             RDSDLY1    per ritardo                           *
      *             RDSUSR1    per identificazione utente            *
      *                                                              *
      * Dati ricevuti :  LAREA1                                      *
      * Dati passati  :  LAREA1                                      *
      *                                                              *
      * ARCHIVI        :  Input/output                               *
      *                    LDSAPIO1  (Logico su ANALITICO pagamenti) *
      *                                                              *
      *--------------------------------------------------------------*
      *   NOME PGM:   PDSIO05                                        *
      *    Programma Disoccupazione Interv.Occupaz.n.05              *
      *--------------------------------------------------------------*
      * Display file :      MDSPD03                                  *
      *--------------------------------------------------------------*
      * Printer file :      SDSIO05                                  *
      *                                                              *
      *   Nome ARCHIVI:                                              *
      *                                                              *
      *      LDSAPIO1  - Logico su archivio disoccupazione           *
      *                  Analitico Pagamenti Interventi Occupazione  *
      *      LDSRPG01  - Logico 1 su archivio disoccupazione         *
      *                  Riepilogo Pagamenti                         *
      *      LDSRPG02  - Logico 2 su archivio disoccupazione         *
      *                  Riepilogo Pagamenti                         *
      *      ADSASUR1  - Archivio corrispondenza Regione/Provincia   *
      *                  .......................                     *
      *      ADSASUR2  - Archivio richieste anticipazione            *
      *                  dal Fondo Occupazione                       *
      *      ADSSX00   - Archivio categorie sussidio straordinario   *
      *                  .....................                       *
      *                                                              *
      *--------------------------------------------------------------*
      *                                                              *
      * Descrizione funzionale : Emissione biglietto contabile       *
      *            per lotti   di pagamento                          *
      *                                                              *
      *--------------------------------------------------------------*
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   IBM-AS400.
       OBJECT-COMPUTER.   IBM-AS400.
       SPECIAL-NAMES.
              DECIMAL-POINT IS COMMA.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *
       I-O-CONTROL.
      *----------------------------------------------Nomi interni
      *-----------------------------------------------------------*
       DATA DIVISION.
       FILE SECTION.
      *
       WORKING-STORAGE SECTION.
      *------------------------------
      *-SWITCH RECUPERI GPA 52/099
      * 1 SI
      * 0 NO
      *
       01  SW-RECUPERI                   PIC 9  VALUE 0.
      *------------------------------
       01  WK-CONTO.
           05 WK-CONTO-ALF               PIC X(003).
           05 FILLER                     PIC X(001).
           05 WK-CONTO-NUM1              PIC X(002).
           05 WK-BARRA                   PIC X(001).
           05 WK-CONTO-NUM2              PIC X(003).
      *
       01  WK-TOT-AVERE                  PIC 9(12)V9(02) VALUE 0.
       01  WK-TOT-DARE                   PIC 9(12)V9(02) VALUE 0.
      *
       01  WK-CONTO-KEY.
           05 WK-CONTO1-KEY              PIC X(003).
           05 WK-CONTO2-KEY              PIC X(002).
           05 WK-CONTO3-KEY              PIC X(003).
      *
      *------------------------------
       01  TAB-ERRORI.
           05 ELE-RIGA-ERRORI OCCURS 300 PIC X(200).
      *------------------------------
       01  WK-PDATAELABO    PIC 9(8).
      *
      * AREA APPOGGIO PER STAMPE
      *
       01  WK-RIGA-STAMPA.
           05  WK-DESCR-CONTO     PIC X(60).
           05  WK-CONTO-DARE      PIC X(10).
           05  WK-IMPOR-DARE      PIC ZZZ.ZZZ.ZZZ.ZZZ,ZZ.
           05  WK-CONTO-AVERE     PIC X(10).
           05  WK-IMPOR-AVERE     PIC ZZZ.ZZZ.ZZZ.ZZZ,ZZ.
      *
      *
      *
       01  WK-RPT-KEY.
           05  WK-RPT-SEDE        PIC 9(04).
           05  WK-RPT-CEOP        PIC 9(02).
           05  WK-RPT-MATRICOLA   PIC 9(08).
           05  WK-RPT-DTA-PRE     PIC X(10).
           05  WK-RPT-ORA-PRE     PIC X(08).
      *
      *
      * PER CHIAMATA CICS
      *
       01  WDFHCOMMAREA                PIC X(1).
       01  WDFHEIBLK                   PIC X(85).
      *
      * COMODO PER CHIAMATA CALL
      *
       01  RDSPD05                    PIC X(08) VALUE 'RDSPD05 '.
       01  RDSPD06                    PIC X(08) VALUE 'RDSPD06 '.
       01  PDSPD16                    PIC X(08) VALUE 'PDSPD16 '.
       01  RDSSND1                    PIC X(08) VALUE 'RDSSND1 '.
       01  PDSPD13                    PIC X(08) VALUE 'PDSPD13 '.
       01  RDSTART                    PIC X(08) VALUE 'RDSTART '.
      *
       01  WK-TIMESTAMP-DATA-ORA.
           05  WK-AA                         PIC X(4).
           05  WK-MM                         PIC X(2).
           05  WK-GG                         PIC X(2).
           05  WK-H                          PIC X(2).
           05  WK-M                          PIC X(2).
           05  WK-S                          PIC X(2).
      *---------------------------- GESTIONE DATA DB2 -----------------*
       01  WW-DB2-DATA.
           05  WW-DB2-GG                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-MM                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-AA.
               10  WW-DB2-SEC                PIC X(2)    VALUE '00'.
               10  WW-DB2-ANNO               PIC X(2)    VALUE '01'.
       01  WK-DB2-DATA REDEFINES WW-DB2-DATA PIC X(10).
      *
      *---------------------------- GESTIONE ORA PRE-FILE -------------*
       01  WW-DB2-TIME.
           05  WW-DB2-HH                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-T-MM                   PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-SS                     PIC X(2)    VALUE '01'.
      *
      *** PER IL TRASFERIMENTO DELLA DATA NEL CORRISPONDENTE CAMPO DELLA
      ***  TABELLA DB2 E' NECESSARIO UTILIZZARE UN CAMPO NON SOTTOLIVEL-
      ***  LATO, PER CUI SI MUOVERA'  'WK'.
      *
       01  WK-DB2-TIME REDEFINES WW-DB2-TIME PIC X(8).
      *
       01  R-STAMPA.
           02  filler                 pic x(200).
      *
      *
      *----------------------------------------------------------------*
      *    A R E A   D I   C O M U N I C A Z I O N E    S  Q  L        *
      *----------------------------------------------------------------*
      *
           EXEC SQL INCLUDE SQLCA  END-EXEC.
      *
      *---------------------------- COPY PER GESTIONE ABEND -----------*
      *
           COPY             DSWABNDB.
      *
      *---------------------------- TRACCIATI TABELLE DB2 DI PROGRAMMA *
      *
      *--2---------------------  Riepilogo dati pagamenti            *
      *GG RIEPILOGO
          EXEC SQL INCLUDE TDSRPG00 END-EXEC.
      *GG APPOGGIO
          EXEC SQL INCLUDE TDSAPIO0 END-EXEC.
      *GG ASUR1
          EXEC SQL INCLUDE TDSASUR1 END-EXEC.
      *GG ASUR2
          EXEC SQL INCLUDE TDSASUR2 END-EXEC.
      *GG TDSSINDA
          EXEC SQL INCLUDE TDSSINDA END-EXEC.
      *GG TDSREPOR
          EXEC SQL INCLUDE TDSREPOR END-EXEC.
      *GG TDSSX00
          EXEC SQL INCLUDE TDSSX00  END-EXEC.
      *
      *GG TDSCONTB
          EXEC SQL INCLUDE TDSCONTB END-EXEC.
      *
270122*   EXEC SQL INCLUDE TDSWEBFV END-EXEC.
030222    EXEC SQL INCLUDE TDSSUSST END-EXEC.
      *
           EXEC SQL
              DECLARE  CURCATG CURSOR    WITH HOLD FOR
              SELECT
                     H_REGIONE1,
                     H_REGIONE2,
                     H_REGIONE3,
                     H_REGIONE4,
                     H_REGIONE5,
                     H_CODCTG,
                     H_REGCTG,
                     H_ANNOCTG,
                     H_DESCTG,
                     H_PROGCTG,
                     H_FINANZ,
                     H_CONTO1
             FROM  TDSSX00
             WHERE
                   H_REGCTG  >= :H-REGCTG AND
                   H_ANNOCTG >= :H-ANNOCTG
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURAIO CURSOR     WITH HOLD FOR
              SELECT
                    H_O0AADIMPSPE ,
                    H_O0AADRECUP ,
                    H_O0AADSTAPAG ,
                    H_O0ACQUISITO ,
                    H_O0CFISCALE ,
                    H_O0CODICE1 ,
                    H_O0CODICE2 ,
                    H_O0CODICE3 ,
                    H_O0CODICE4 ,
                    H_O0CODICE5 ,
                    H_O0CODICE6 ,
                    H_O0COMPATTO ,
                    H_O0COSEDE ,
                    H_O0DATAELABO ,
                    H_O0DCOANFRIC ,
                    H_O0DCOCENOPE ,
                    H_O0DCOCHIDOM ,
                    H_O0DCOCODFIS ,
                    H_O0DCOCODPAT ,
                    H_O0DCOCOOBAN ,
                    H_O0DCOCOTIDO ,
                    H_O0DCODTADEC ,
                    H_O0DCODTDESP ,
                    H_O0DCODTULSP ,
                    H_O0DCOPESTDI ,
                    H_O0DCOULESSP ,
                    H_O0DOMANDA ,
                    H_O0FACAL ,
                    H_O0FACDAL ,
                    H_O0FACDETFAM ,
                    H_O0FACDETLAV ,
                    H_O0FACGGDETR ,
                    H_O0FACGGPRES ,
                    H_O0FACIMPDET ,
                    H_O0FACIMPLOR ,
                    H_O0FACIMPNET ,
                    H_O0FACIMPONI ,
                    H_O0FACTREDIC ,
                    H_O0FADANFPAG ,
                    H_O0FADFINE ,
                    H_O0FADINIZIO ,
                    H_O0FADNETPAG ,
                    H_O0FADRECANF ,
                    H_O0FADRECIND ,
                    H_O0FADTRASIN ,
                    H_O0FAPAL ,
                    H_O0FAPALIQME ,
                    H_O0FAPDAL ,
                    H_O0FAPGGDETR ,
                    H_O0FAPGGPRES ,
                    H_O0FAPIMPDET ,
                    H_O0FAPIMPLOR ,
                    H_O0FAPIMPNET ,
                    H_O0FAPIMPONI ,
                    H_O0FAPTREDIC ,
                    H_O0FCODCOMUN ,
                    H_O0FCODPAGA1 ,
                    H_O0FCODPAGA2 ,
                    H_O0FCODPAGA3 ,
                    H_O0FCONGAC ,
                    H_O0FCONGAP ,
                    H_O0FIMPCOMAC ,
                    H_O0FIMPCOMAP ,
                    H_O0FIMPPAGA1 ,
                    H_O0FIMPPAGA2 ,
                    H_O0FIMPPAGA3 ,
                    H_O0FIMPPROAC ,
                    H_O0FIMPPROAP ,
                    H_O0FIMPREGAC ,
                    H_O0FIMPREGAP ,
                    H_O0IMPORTO1 ,
                    H_O0IMPORTO2 ,
                    H_O0IMPORTO3 ,
                    H_O0IMPORTO4 ,
                    H_O0IMPORTO5 ,
                    H_O0IMPORTO6 ,
                    H_O0PROCEDURA ,
                    H_O0PROGRESSI ,
                    H_O0PUADDIZC ,
                    H_O0PUADDIZR ,
                    H_O0PUCONG730 ,
                    H_O0PUCONGFIS ,
                    H_O0PUGGCALC ,
                    H_O0PUIMANFT ,
                    H_O0PUIMANFU ,
                    H_O0PUIMINT ,
                    H_O0PUIMINU ,
                    H_O0PUINDEB ,
                    H_O0PUIRPEFU ,
                    H_O0PUMAGANF ,
                    H_O0PUMAGANFT ,
                    H_O0PUTIPPROG ,
                    H_O0PUTRASIND ,
                    H_O0PUTSCAT ,
                    H_O0PUTSCONF ,
                    H_O0PUULASS ,
                    H_O0RECIMURE1 ,
                    H_O0RECIMURE2 ,
                    H_O0RECIMURE3 ,
                    H_O0RECPAGATO ,
                    H_O0RECTOREE1 ,
                    H_O0RECTOREE2 ,
                    H_O0RECTOREE3 ,
                    H_O0RECTORER1 ,
                    H_O0RECTORER2 ,
                    H_O0RECTORER3 ,
                    H_O0SUADDIZC ,
                    H_O0SUADDIZR ,
                    H_O0SUADDIZRC ,
                    H_O0SUADDIZRR ,
                    H_O0SUANFASUT ,
                    H_O0SUANFASUU ,
                    H_O0SUANNODEL ,
                    H_O0SUCFENTE ,
                    H_O0SUCONG730 ,
                    H_O0SUCONGFIS ,
                    H_O0SUEDIL ,
                    H_O0SUFIN ,
                    H_O0SUGGCALC ,
                    H_O0SUIMANFT ,
                    H_O0SUIMANFU ,
                    H_O0SUIMASUT ,
                    H_O0SUIMASUU ,
                    H_O0SUIMINT ,
                    H_O0SUIMINU ,
                    H_O0SUIMRIN ,
                    H_O0SUIMRINU ,
                    H_O0SUINCENT ,
                    H_O0SUINDEB ,
                    H_O0SUIRPEFU ,
                    H_O0SULPU ,
                    H_O0SUMAGANF ,
                    H_O0SUMAGANFT ,
                    H_O0SUMATASUT ,
                    H_O0SUMATASUU ,
                    H_O0SUNUMDEL ,
                    H_O0SURECRIN ,
                    H_O0SUTIPPRO ,
                    H_O0SUTRASIND ,
                    H_O0SUTRASINR ,
                    H_O0SUTSCAT ,
                    H_O0SUTSCONF ,
                    H_O0SUULASS ,
                    H_O0SXADDIZC ,
                    H_O0SXADDIZR ,
                    H_O0SXADDIZRC ,
                    H_O0SXADDIZRR ,
                    H_O0SXANNIND ,
                    H_O0SXCODIND ,
                    H_O0SXCONG730 ,
                    H_O0SXCONGFIS ,
                    H_O0SXDTAL1 ,
                    H_O0SXDTAL2 ,
                    H_O0SXGGCALC ,
                    H_O0SXIMANFT ,
                    H_O0SXIMANFU ,
                    H_O0SXIMINT ,
                    H_O0SXIMINU ,
                    H_O0SXIMRIN ,
                    H_O0SXIMRINU ,
                    H_O0SXINDEB ,
                    H_O0SXIRPEFU ,
                    H_O0SXNUML1 ,
                    H_O0SXNUML2 ,
                    H_O0SXRECRIN ,
                    H_O0SXREGIND ,
                    H_O0SXTRASIND ,
                    H_O0SXTRASINR ,
                    H_O0SXTSCAT ,
                    H_O0SXTSCONF ,
                    H_O0SXULASS
              FROM        TDSVPIO0
              WHERE
                     H_O0COSEDE       =  :H-O0COSEDE
                AND  H_O0PROCEDURA    =  :H-O0PROCEDURA
                AND  H_O0DCOCENOPE    =  :H-O0DCOCENOPE
                AND  H_O0PROGRESSI    =  :H-O0PROGRESSI
                AND  H_O0DATAELABO    =  :H-O0DATAELABO
           END-EXEC.
      *
      *----------------------------------Area comodo mappa 4
       01  VO-DSPFM034.
               05 DSPFM034-O .
                   06 M4A011 PIC X(50).
                   06 M4A012 PIC X(50).
                   06 M4A013 PIC X(50).
                   06 M4A014 PIC X(50).

      *----------------------------------Aree comodo stampa
       01  TABELLA-STAMPA.
           05  RIGA-STAMPA     PIC  X(200) OCCURS 1000.
      *
       01  WK-TESTASU.
      *    COPY  DDS-TESTASU-O  OF  SDSIO05.5.
          05 TESTASU-O.
            06 S5B101A PIC X(22).
            06 S5D102 PIC  9(8).
            06 S5N101S PIC  9(2).
            06 S5A101S PIC X(22).
            06 S5BBB1N PIC S9(2).
       01  WK-TESTLPU.
      *    COPY  DDS-TESTLPU-O  OF  SDSIO05.
          05 TESTLPU-O.
            06 S5B101A PIC X(22).
            06 S5D102 PIC  9(8).
            06 S5N101S PIC  9(2).
            06 S5A101S PIC X(22).
            06 S5BBB1N PIC S9(2).
       01  WK-TESTSX.
      *    COPY  DDS-TESTSX-O  OF  SDSIO05.
          05 TESTSX-O.
            06 S5B101A PIC X(22).
            06 S5D102 PIC S9(8).
            06 S5N101S PIC S9(2).
            06 S5A101S PIC X(22).
            06 S5BBB1N PIC S9(2).
       01   RWK-TOTALI.
            06 RTOTDA PIC -ZZZ.ZZZ.ZZ9,99.
            06 RTOTAV PIC -ZZZ.ZZZ.ZZ9,99.
       01  WK-TOTALI.
          05 TOTALI-O.
            06 TOTDA PIC S9(9)V9(2).
            06 TOTAV PIC S9(9)V9(2).
       01  WK-RIGASPE.
          05 RIGASPE-O.
            06 RECSPE PIC S9(9)V9(2)     VALUE 0.
       01  WK-APP-RECSPE PIC S9(9)V9(2)  VALUE 0.
       01  WK-RIGAIVA.
          05 RIGAIVA-O.
            06 RECIVA PIC S9(9)V9(2)     value 0.
       01  WK-APP-RECIVA PIC S9(9)V9(2)  value 0.
       01  WK-RIGA.
          05 RIGA-O.
            06 VOCE PIC X(52).
            06 ALFDA PIC X(3).
            06 NUMDA PIC X(6).
            06 IMPDA PIC S9(9)V9(2).
            06 ALFAV PIC X(3).
            06 NUMAV PIC X(6).
            06 NOVENOVE PIC X(4).
            06 IMPAV PIC S9(9)V9(2).
       01  WK-BIGSTORNO-04.
      *     06 S5B301A PIC X(22) value space.
      *     06 S5D402 PIC  9(8)  value 0.
      *     06 S5N301S PIC  9(2) value 0.
      *     06 S5A301S PIC X(22) value space.
            06 RSTORNO PIC -ZZZ.ZZZ.ZZ9,99.
            06 RTOTALE PIC -ZZZ.ZZZ.ZZ9,99.

       01   WK-STORNO.
          05 STORNO-O.
            06 STORNO PIC S9(9)V9(2).
            06 TOTALE PIC S9(9)V9(2).
      *
      *--------------------------------------------- File status
       01  STATO-FILE.
           03  F-LRIEPILOGO         pic  S9(9)  VALUE ZEROES.
           03  F-LANALITICO         pic  S9(9)  VALUE ZEROES.
           03  STATUS-ASUR1         PIC  S9(9)  VALUE ZEROES.
           03  STATUS-ASUR2         PIC  S9(9)  VALUE ZEROES.
           03  STATUS-CATEGORIE     PIC  S9(9)  VALUE ZEROES.
           03  STATUS-SINDACATO     PIC  S9(9)  VALUE ZEROES.
           03  F-LRIEPILOGO2        pic  S9(9)  VALUE ZEROES.
      *----------------------------------- Area comodo x gestione    *
       01  GESTIONI.
      *    02  W-PROCEDURA          pic x(3).
           02  W-FATTOCALCOLO       pic x    value spaces.
      *           se = " "  allora  lettura non effettuata
      *           se = "S"  allora   Si record presente
      *           se = "N"  allora   NO record presente
      *
           02  W-ERRORE             pic x    value "N".
      *           se = "S" allora è errore
           02  W-RECANALITICI       pic x    value  spaces.
      *           se = "S"  allora   SI record analitici presenti
      *           se = "N"  allora   NO record analitici presenti
           02  W-NIK                pic x    value "N".
      *                             = "S" x SVA  ;  =  "H" x Hcf     *
           02  W-FINE-ELABORA       pic x    value spaces.
      *           se = S  allora fine elaborazione
           02  W-FLAGYNCORSO        pic x   value  spaces.
      *           se = "S"  allora Flag elab.Yn corso su ADS3STOP
           02  W-CENTRA             pic x(55) value spaces.
      *           se = S  allora centralizzazione
           02  W-IVA                 pic  9(06)v99 value zeros.
           02  W-SPERIS              pic  9(06)v99 value zeros.
      *--------------------------------------------Contatori         *
       01  W-CONTATORI.
           03  W-LINE               pic  99   value  zeros.
           03  CHIUDIFILE           pic  9    value  zeros.
           03  CTR-LET-APPO         pic  9(08) value  zeros.
           03  XXX-REC   redefines  CTR-LET-APPO.
               05  filler           pic 9(6).
               05  DEC-LET-APPO     pic  99.
           03  W-CALCOLI             pic  9(10) value zeros.
      *------------------------------------------- Per controllo date*
       01  RISULT                    pic  99    value zeros.
       01  RESTO                     pic S99    value zeros.
           88  BISESTILE                        value zeros.
       01  GG-FEBBRAIO               pic  99    value 28.
       01  W-DATA-OK                 pic  x     value spaces.
      *              se = "S" la data é formalmente corretta         *
       01  W8-AAAAMMGG.
           02  W8-AAAA               pic  9(4)  value zeros.
           02  W8-MMGG.
               03  W8-MM             pic  99    value zeros.
               03  W8-GG             pic  99    value zeros.
       01  D8-GGMMAAAA.
           02  D8-GG                 pic  99    value zeros.
           02  D8-MM                 pic  99    value zeros.
           02  D8-AAAA               pic  9(04)  value zeros.
       01  W-VALTOZAC                pic  x(10)  value spaces.
      *------------------------------------ Data odierna (aa mm gg)  *
       01  DATA-ODIERNA.
           02  W-ODIERNA.
               03  W6-ODIAA         pic 99     value zeros.
               03  W6-ODIMM         pic 99     value zeros.
               03  W6-ODIGG         pic  99         value 0.
           02  W8-ODIERNA           PIC 9(8)   VALUE  ZEROS.
           02  R8-ODIERNA  REDEFINES  W8-ODIERNA.
               03  W8-ODIAA         pic 9999.
               03  W8-ODIMM         pic 99.
               03  W8-ODIGG         pic 99.
           02  W4-ANNO-1            pic 9(4)   value zeros.
      *
      *------------------- Centralizzazione e  Tabella contabile  ---*
      *
       01  TABINT1.
           03  EL-TABINT1     occurs  300  times.
               05  T-BCA-CONTO     pic  x(10).
               05  T-BCA-SEZIONE   pic  x(01).
               05  T-BCA-IMPORTO   pic  9(12)V9(02).
               05  T-BCA-NUMERO    pic  9(05).
      *
      *
       01  RABINT1.
           03  EL-RABINT1     occurs  300  times.
               05  R-BCA-CONTO     pic  x(10).
               05  R-BCA-SEZIONE   pic  x(01).
               05  R-BCA-IMPORTO   pic  ZZZ.ZZZ.ZZZ.ZZ9,9(02).
               05  R-BCA-NUMERO    pic  9(05).
      *
      *-------------------------------- Campi di comodo per verifica *
       01  W-PIERO                  pic  X(006)     value spaces.
       01  WTIPODOM                 pic X  VALUE SPACES.
       01  WK-CODPROV               pic 99 VALUE 0.
       01  S5B024N                  pic S9(010)V99  value 0.
       01  W-TOT-ASSEGNO            pic S9(010)V99  value 0.
       01  W-TOT-GPA10052           pic S9(010)V99  value 0.
       01  W-TOT-GPA10029           pic S9(010)V99  value 0.
       01  W-DIFFERENZA             pic S9(010)V99  value 0.
       01  INVIO                    pic X      value spaces.
      *
       01  DAL-730                  PIC 9(8) VALUE 99999999.
       01  AL-730                   PIC 9(8) VALUE 00000000.
      *================= INIZIO AREA CONTABILE ======================*
      *  campi di comodo
       01  NDR1                     pic 9(005)     value 0.
      * SSS correttivo per sindacati da 10 03 in poi
       01  IND-SIND                 PIC 999 VALUE 0.
       01  WK-SINCODSIN             PIC 999 VALUE 0.
       01  WK-SINCATSIN             PIC 999 VALUE 0.
      * SSS-F
       01  IND-REC                  PIC 999 VALUE 0.
       01  IND-R                    PIC 999 VALUE 0.
       01  IND-ASU                  PIC 99 VALUE 0.
       01  IND-LPU                  PIC 99 VALUE 0.
       01  IND-SX                   PIC 999 VALUE 0.
       01  IND-TR                   PIC 999 VALUE 0.
040222 01  IND-SAVE                 PIC 999 VALUE 0.
       01  W-TR-CONTO               pic  x(10).
       01  W-TR-SEZIONE             pic  x(01).
       01  W-TR-IMPORTO             pic  9(12)V9(02).
       01  CONTA-RIGHE              PIC 99 VALUE 0.
       01  W-CONNUM-N                        PIC 9(5) VALUE 0.
       01  W-CONNUM-A REDEFINES W-CONNUM-N   PIC X(5).
       01  W-CONTO                  PIC X(6) VALUE "  /   ".
       01  TOTALE-ACCR              pic  S9(9)V99 VALUE 0.
       01  TOTALE-CONT              pic  S9(9)V99 VALUE 0.
       01  TOTALE-DEBI              pic  S9(9)V99 VALUE 0.
       01  TOTALE-DARE              pic  S9(9)V99 VALUE 0.
       01  TOTALE-AVERE             pic  S9(9)V99 VALUE 0.
       01  BIGASU-O.
           03  ASU                  pic  S9(9)V99 VALUE 0.
           03  ASUREG               pic  S9(9)V99 VALUE 0.
           03  ASUREGEG             pic  S9(9)V99 VALUE 0.
           03  ASUEGCOF             pic  S9(9)V99 VALUE 0.
           03  ASUEGAUT             pic  S9(9)V99 VALUE 0.
           03  ASUFORM1             pic  S9(9)V99 VALUE 0.
           03  ASUFORM2             pic  S9(9)V99 VALUE 0.
           03  ASUEDIL              pic  S9(9)V99 VALUE 0.
           03  LSU71                pic  S9(9)V99 VALUE 0.
           03  LSU72                pic  S9(9)V99 VALUE 0.
           03  LSU73                pic  S9(9)V99 VALUE 0.
           03  LPU74                pic  S9(9)V99 VALUE 0.
           03  LPU75                pic  S9(9)V99 VALUE 0.
           03  LPU76                pic  S9(9)V99 VALUE 0.
           03  RIN                  pic  S9(9)V99 VALUE 0.
           03  ANTIC                pic  S9(9)V99 VALUE 0.
           03  INCENTIVO            pic  S9(9)V99 VALUE 0.
           03  MATERNITA            pic  S9(9)V99 VALUE 0.
           03  MATREG               pic  S9(9)V99 VALUE 0.
           03  MATREGEG             pic  S9(9)V99 VALUE 0.
           03  MATERNEDIL           pic  S9(9)V99 VALUE 0.
           03  MATERNEG             pic  S9(9)V99 VALUE 0.
           03  ANFASU               pic  S9(9)V99 VALUE 0.
           03  ANFREG               pic  S9(9)V99 VALUE 0.
           03  ANFREGEG             pic  S9(9)V99 VALUE 0.
           03  ANFASUEG             pic  S9(9)V99 VALUE 0.
           03  ANFFORM1             pic  S9(9)V99 VALUE 0.
           03  ANFFORM2             pic  S9(9)V99 VALUE 0.
           03  ANFEDIL              pic  S9(9)V99 VALUE 0.
           03  ANF71                pic  S9(9)V99 VALUE 0.
           03  ANF72                pic  S9(9)V99 VALUE 0.
           03  ANF73                pic  S9(9)V99 VALUE 0.
           03  ANF74                pic  S9(9)V99 VALUE 0.
           03  ANF75                pic  S9(9)V99 VALUE 0.
           03  ANF76                pic  S9(9)V99 VALUE 0.
           03  RECU                 pic  S9(9)V99 VALUE 0.
           03  RECURIN              pic  S9(9)V99 VALUE 0.
           03  RECUANT              pic  S9(9)V99 VALUE 0.
           03  RECUINC              pic  S9(9)V99 VALUE 0.
           03  IRPEF                pic  S9(9)V99 VALUE 0.
           03  IRPEFS               pic  S9(9)V99 VALUE 0.
           03  CONGRIMB             pic  S9(9)V99 VALUE 0.
           03  CONGDEB              pic  S9(9)V99 VALUE 0.
           03  ADDREG               pic  S9(9)V99 VALUE 0.
           03  ADDCOM               pic  S9(9)V99 VALUE 0.
           03  ADDREGR              pic  S9(9)V99 VALUE 0.
           03  ADDCOMR              pic  S9(9)V99 VALUE 0.
           03  RIMB730              pic  S9(9)V99 VALUE 0.
           03  DEB730               pic  S9(9)V99 VALUE 0.
           03  DEBITI               pic  S9(9)V99 VALUE 0.
           03  DEBASU               pic  S9(9)V99 VALUE 0.
           03  DEBITIEG             pic  S9(9)V99 VALUE 0.
           03  DEBITIINC            pic  S9(9)V99 VALUE 0.
           03  ACCERD               pic  S9(9)V99 VALUE 0.
           03  ACCERA               pic  S9(9)V99 VALUE 0.
           03  ACCEREGD             pic  S9(9)V99 VALUE 0.
           03  ACCEREGA             pic  S9(9)V99 VALUE 0.
           03  ACCREGD              pic  S9(9)V99 VALUE 0.
           03  ACCREGA              pic  S9(9)V99 VALUE 0.
           03  ACCEGD               pic  S9(9)V99 VALUE 0.
           03  ACCEGA               pic  S9(9)V99 VALUE 0.
      *
       01  BIGLPU-O.
           03  LPU280I              pic  S9(9)V99 VALUE 0.
           03  LPU280R              pic  S9(9)V99 VALUE 0.
           03  MATERNITA            pic  S9(9)V99 VALUE 0.
           03  ANF280I              pic  S9(9)V99 VALUE 0.
           03  ANF280R              pic  S9(9)V99 VALUE 0.
           03  RECU                 pic  S9(9)V99 VALUE 0.
           03  DEBITI               pic  S9(9)V99 VALUE 0.
           03  IRPEF                pic  S9(9)V99 VALUE 0.
           03  IRPEFS               pic  S9(9)V99 VALUE 0.
           03  CONGRIMB             pic  S9(9)V99 VALUE 0.
           03  CONGDEB              pic  S9(9)V99 VALUE 0.
           03  ADDREG               pic  S9(9)V99 VALUE 0.
           03  ADDCOM               pic  S9(9)V99 VALUE 0.
           03  RIMB730              pic  S9(9)V99 VALUE 0.
           03  DEB730               pic  S9(9)V99 VALUE 0.
      *
      * TABELLA ASU
       01 TAB-ASU.
      * 0001
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. DEC.LEG.81/2000 A CARICO DEL FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/026".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0002
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. REG. ANTICIPAZIONE FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/006".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0003
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. EX FONDO OCC QUOTA REGIONE".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/017".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0004
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. EX FONDO OCC QUOTA ENTE UTILIZZATORE".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/019".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0005
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. COFINANZIATI QUOTA ENTE UTILIZZATORE".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/012".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0006
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. AUTOFINANZIATI DA ENTE UTILIZZATORE".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/010".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0007
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. FORMAZIONE CON ASSUNZIONE DIFFERITA".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/022".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0008
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. STAGES DI FORMAZIONE CON ASSUNZ.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/028".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0009
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. LAV.EDILI ART.45 C.10 L.144/99".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/027".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0010
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.S.U. INTERREGIONALI".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/082".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0011
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.S.U. REGIONALI A CARICO DEL FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/081".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0012
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.S.U. REGIONALI A CARICO ENTI GESTORI".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/083".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0013
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.P.U. INTERREGIONALI".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/085".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0014
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.P.U. REGIONALI A CARICO DEL FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/084".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0015
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.P.U. REGIONALI A CARICO ENTI GESTORI".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/086".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0016
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ANTICIPAZIONE L.S.U./L.P.U. PER RINUNCIA".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/094".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0017
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ANTICIPAZIONE A.S.U.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/107".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0018
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "INCENTIVO DEC.MIN. 21/5/98".
             05 FILLER        PIC X(3) VALUE "GAW".
             05 FILLER        PIC X(6) VALUE "32/033".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0019
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "INDENNITA'' PER MATERNITA''FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/088".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0020
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IND. MATERNITA'' REG. ANTIC. FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/006".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0021
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "INDENNITA''PER MATERNITA''QUOTA REGIONE".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/017".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0022
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "INDENNITA''PER MATERNITA''QUOTA ENTE UT.".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/019".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0023
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "MATERNITA''LAV. ED.ART.45 C.10 L.144/99".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/027".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0024
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "INDENN. PER MATERNITA''ASU AUTOFINANZIATI".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/010".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0025
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/026".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0026
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. REG. ANTIC. FONDO OCC.".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/093".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0027
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. EX FONDO OCC. QUOTA REGIONE".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/018".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0028
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. AUTOFINANZIATI".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/011".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0029
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. FORMAZ. CON ASSUNZ. DIFF.".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/022".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0030
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. STAGES FORM. CON ASSUNZ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/028".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0031
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F LAV.EDILI ART.45 C.10 L.144/99".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/025".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0032
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. LSU INTERREGIONALI                    ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/092".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0033
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. LSU REG. A CARICO DEL FONDO OCC.      ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/091".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0034
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. LSU REG. A CARICO ENTI GESTORI        ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/094".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0035
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. LPU INTERREGIONALI                    ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/096".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0036
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. LPU REG. A CARICO DEL FONDO OCC.      ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/095".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0037
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. LPU REG. A CARICO ENTI GESTORI        ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/097".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0038
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RECUPERI DA SPECIFICARE CON BCFC ALLEGATO    ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "52/099".
             05 FILLER        PIC X(4) VALUE "-99-".
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0039
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RECUPERI SU IND. CORRISPOSTA PER RINUNCIA    ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "24/042".
             05 FILLER        PIC X(4) VALUE "-99-".
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0040
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RECUPERI SU ANTICIPAZIONE A.S.U.             ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "24/107".
             05 FILLER        PIC X(4) VALUE "-99-".
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0041
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RITENUTE IRPEF TASSAZIONE CORRENTE           ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0042
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RITENUTE IRPEF TASSAZIONE SEPARATA           ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0043
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF CONGUAGLIO FISCALE                     ".
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "06/105".
      *      05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "29/105".
      *      05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0044
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF ADDIZIONALE REG. ANNO PRECEDENTE       ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "29/068".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0045
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF ADDIZIONALE COM. ANNO PRECEDENTE       ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "29/038".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0046
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF ADDIZIONALE REG. ANNO CORRENTE         ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "../...".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0047
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF ADDIZIONALE COM. ANNO CORRENTE         ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "25/193".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0048
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "CONGUAGLIO 730/                              ".
      *17072020 gestione conguaglio 730 anche in DARE
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "53/171".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "54/071".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0049
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "DEBITI VERSO BENEFICIARI A.S.U. FONDO OCC.   ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "10/018".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0050
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "DEBITI VERSO BENEFICIARI A.S.U. REGIONE      ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "11/010".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0051
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "DEBITI VERSO LAVORATORI ASU AUTOFINANZIATI   ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "11/010".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0052
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "DEBITI PER INCENTIVO DEC.MIN. 21/5/98        ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GAW".
             05 FILLER        PIC X(6) VALUE "10/033".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0053
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ACCERT. CRED. VERSO ENTI: ASU COFIN.         ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "00/012".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "25/012".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0054
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ACCERT. CRED. VERSO ENTI: ASU AUTOFIN.       ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "00/010".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "25/010".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0055
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ACCERT. CRED. VERSO REGIONE ASU COFIN.       ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "00/017".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "25/017".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0056
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ACCERT. CRED. VERSO ENTI: ASU COF. REG.      ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "00/019".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "25/019".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0057
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.S.U. COF. QUOTA REGIONE LAZIO  ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/198".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0058
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IND. MATERN. ASU COF. QUOTA REG. LAZIO       ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/198".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0059
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. A.S.U. COF. QUOTA REG. LAZIO          ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "35/198".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0060
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "ACCERT. CRED. VERSO REGIONE LAZIO            ".
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "00/198".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPZ".
             05 FILLER        PIC X(6) VALUE "25/198".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0061
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0062
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0063
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0064
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0065
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0066
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0067
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0068
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0069
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0070
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
       01 TAB-ASU-R REDEFINES TAB-ASU.
           03  EL-ASU OCCURS 70.
             05 EL-VOCE-ASU   PIC X(52).
             05 EL-ALF-ASU-D  PIC X(3).
             05 EL-NUM-ASU-D  PIC X(6).
             05 EL-IMP-ASU-D  PIC S9(9)V99.
             05 EL-ALF-ASU-A  PIC X(3).
             05 EL-NUM-ASU-A  PIC X(6).
             05 EL-99-ASU-A   PIC X(4).
             05 EL-IMP-ASU-A  PIC S9(9)V99.
      * TABELLA LPU
       01 TAB-LPU.
      * 0001
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.P.U. D.L. 280/97 INTERREGIONALI             ".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/067".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0002
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "L.P.U. D.L. 280/97 REGIONALI                  ".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/066".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0003
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "INDENNITA''PER MATERNITA''                    ".
             05 FILLER        PIC X(3) VALUE "GAU".
             05 FILLER        PIC X(6) VALUE "30/088".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0004
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. L.P.U. D.L. 280/97 INTERREGIONALI      ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/067".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0005
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "A.N.F. L.P.U. D.L. 280/97 REGIONALI           ".
             05 FILLER        PIC X(3) VALUE "GAT".
             05 FILLER        PIC X(6) VALUE "30/066".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0006
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RECUPERI DA SPECIFICARE CON BCFC ALLEGATO    ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "52/099".
             05 FILLER        PIC X(4) VALUE "-99-".
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0007
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "DEBITI VERSO BENEFICIARI L.P.U. D.L. 280/97  ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "10/018".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0008
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RITENUTE IRPEF TASSAZIONE CORRENTE           ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0009
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "RITENUTE IRPEF TASSAZIONE SEPARATA           ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0010
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF CONGUAGLIO FISCALE                     ".
             05 FILLER        PIC X(3) VALUE "GPA".
      *      05 FILLER        PIC X(6) VALUE "06/105".
             05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
      *      05 FILLER        PIC X(6) VALUE "29/105".
             05 FILLER        PIC X(6) VALUE "27/009".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0011
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF ADDIZIONALE REG. ANNO PRECEDENTE       ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "29/068".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0012
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "IRPEF ADDIZIONALE COM. ANNO PRECEDENTE       ".
             05 FILLER        PIC X(3) VALUE SPACES.
             05 FILLER        PIC X(6) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "29/038".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0013
           03 FILLER.
             05 FILLER       PIC X(52) VALUE
                 "CONGUAGLIO 730/                              ".
      *17072020 gestione conguaglio 730 anche in DARE
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "53/171".
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(3) VALUE "GPA".
             05 FILLER        PIC X(6) VALUE "54/071".
             05 FILLER        PIC X(4) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0014
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
      * 0015
           03 FILLER.
             05 FILLER        PIC X(61) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
             05 FILLER        PIC X(13) VALUE SPACES.
             05 FILLER        PIC S9(9)V99 VALUE 0.
       01 TAB-LPU-R REDEFINES TAB-LPU.
           03  EL-LPU OCCURS 15.
             05 EL-VOCE-LPU   PIC X(52).
             05 EL-ALF-LPU-D  PIC X(3).
             05 EL-NUM-LPU-D  PIC X(6).
             05 EL-IMP-LPU-D  PIC S9(9)V99.
             05 EL-ALF-LPU-A  PIC X(3).
             05 EL-NUM-LPU-A  PIC X(6).
             05 EL-99-LPU-A   PIC X(4).
             05 EL-IMP-LPU-A  PIC S9(9)V99.
      * TABELLA SX
       01 TAB-SX.
           03  EL-SX OCCURS 160.
             05 EL-COD-SX      PIC X(4)   VALUE SPACES.
             05 EL-REG-SX      PIC S9(2)  VALUE 0.
             05 EL-ANNO-SX     PIC S9(2)  VALUE 0.
             05 EL-PROG-SX     PIC S9(11) VALUE 0.
             05 EL-FINANZ-SX   PIC X(1)   VALUE SPACES.
             05 EL-VOCE-SX     PIC X(40)  VALUE SPACES.
             05 EL-ALF-SX-D    PIC X(3)   VALUE SPACES.
             05 EL-NUM-SX-D    PIC X(6)   VALUE SPACES.
             05 EL-IMP-SX-D    PIC S9(9)V99  VALUE 0.
             05 EL-ALF-SX-A    PIC X(3)   VALUE SPACES.
             05 EL-NUM-SX-A    PIC X(6)   VALUE SPACES.
             05 EL-99-SX-A     PIC X(4).
             05 EL-IMP-SX-A    PIC S9(9)V99  VALUE 0.
      * TABELLA RECUPERI
       01 TAB-RECUPERI.
           03  EL-REC OCCURS 200.
             05 EL-VOCE-REC   PIC X(15) VALUE SPACES.
             05 EL-ALF-REC-A  PIC X(3)  VALUE SPACES.
             05 EL-NUM-REC-A  PIC X(6)  VALUE SPACES.
             05 EL-IMP-REC-A  PIC S9(9)V99  VALUE 0.
      * TABELLA SINDACATI
      * SSS correttivo per sindacati da 10 03 in poi
       01 TAB-SINDACATI.
160125*    03  EL-SIND OCCURS 300.
160125     03  EL-SIND OCCURS 400.
      * SSS-F
             05 EL-COD-SIND    PIC 9(2)  VALUE 0.
160125       05 EL-CAT-SIND    PIC 9(2)  VALUE 0.
             05 EL-VOCE-SIND   PIC X(15) VALUE SPACES.
             05 EL-ALF-SIND-A  PIC X(3)  VALUE SPACES.
             05 EL-NUM-SIND-A  PIC X(6)  VALUE SPACES.
             05 EL-IMP-SIND-A  PIC S9(9)V99  VALUE 0.
             05 EL-ALF-SIND-C  PIC X(3)  VALUE SPACES.
             05 EL-NUM-SIND-C  PIC X(6)  VALUE SPACES.
             05 EL-IMP-SIND-C  PIC S9(9)V99  VALUE 0.
             05 EL-ALF-SIND-D  PIC X(3)  VALUE SPACES.
             05 EL-NUM-SIND-D  PIC X(6)  VALUE SPACES.
             05 EL-IMP-SIND-D  PIC S9(9)V99  VALUE 0.
      *
      *-------------------------------------------------------------*
      *
       01  TS-NETTA                 PIC S9(5)V9(2).
       01  WK-DEBITO                PIC S9(7)V9(2) VALUE 0.
       01  DEBITO40X100             PIC S9(7)V9(2) VALUE 0.
       01  ANF40X100                PIC S9(7)V9(2) VALUE 0.
       01  WK-INCENTIVO             PIC S9(7)V9(2).
       01  WK-RINUNCIA              PIC S9(7)V9(2).
       01  WK-IRPEF-INC             PIC S9(7)V99  VALUE 0.
       01  ALIQINC                  PIC 99V99     VALUE 0.
       01  ALIQINCR                 PIC 99V999    VALUE 0.
       01  ALIQINCC                 PIC 99V999    VALUE 0.
       01  MEZZO-ASU                PIC S9(7)V9(2) VALUE 0.
       01  MEZZO-ANF                PIC S9(7)V9(2) VALUE 0.
      *
       01  TRATT-SIND               pic S9(006)V99  value 0.
       01  INDENNITA                pic S9(006)V99  value 0.
       01  ANF                      pic S9(006)V99  value 0.
       01  ASSEGNO                  pic S9(005)V99  value 0.
       01  DIFFERENZA               pic S9(002)V99  value 0.
       01  CONTA-POSITIVE           pic  9(005)     value 0.
       01  CONTA-NEGATIVE           pic  9(005)     value 0.
       01  TOTREC-IND               pic  9(007)V99  value 0.
       01  TOTREC-ANF               pic  9(007)V99  value 0.
      *-------------------------------Valore   Indicatori --         *
       01  APPO-INDE                pic S9(008)V99  value zeroes.
       01  RESTO-INDE               pic S9(009)V99  value zeroes.
       01  APPOGGIA-O               pic S9(008)V99  value zeroes.
       01  APPOGGIA-S               pic S9(008)V99  value zeroes.
      *-------------------------------------- Importo netto assegni  *
       01  W-BIGLIETTO              pic 9(10)V99 value zeros.
      *================== FINE AREA CONTABILE =======================*
      *                                                              *
      *-------------------------------------------------------------*
      *       Tabella per call a RDSPD06 per dettaglio recuperi     *
      *-------------------------------------------------------------*
       01  LTABRECUPERI.
           10  LRECELEM  occurs 30 times.
               15  LRECCOREAL    pic  X(003)   value spaces.
               15  LRECCORENU    pic  9(005)   value 0.
               15  LRECIMUREE    pic  9(5)V99  value 0.
      *-------------------------------------------------------------*
      *       CAMPI PER CALL PGM STAMPA B.C. 730                    *
      *-------------------------------------------------------------*
      *-----------------Definizioni necessarie alle routine usate    *
      *-------------------------------------------------------------*
      *-----    AREA PER CHIAMATA AL CONGUAGLIO 730        --------*
      *-------------------------------------------------------------*
      *17072020
      *    COPY POPCSIN.
      *
      *-----------------------------------------Per routine 'RNPYEAR'
           copy CNPYEAR.
      *--------------------------------------------- Routine  RDSDLY1*
       01  PER-RDSDLY1.
           02  R-TEMPO                 pic 99.
      *-----------------------------------------per routine "RDSUSR1"*
       01  PER-RDSUSR1.
           02  ID-LAVORO               pic x(10).
           02  RD-LAVORO  redefines  ID-LAVORO.
               04  ID8-LAVORO          pic x(08).
               04  filler              pic x(02).
           02  ID-UTENTE               pic x(10).
      *-----------------------------------------per routine "PDSPD16"*
       01  AREALINK-1.
           03 C-CODICE-SEDE           pic 9(04)  value zeros.
           03 C-NOME-SEDE             pic x(22)  value spaces.
           03 C-CODICE-STOP           pic 9(02)  value zeros.
           03 C-NOME-STOP             pic x(22)  value spaces.
           03 C-PROCEDURA             pic x(03)  value spaces.
           03 C-TIPOCALCOLO           pic x(01)  value spaces.
      *                       = "S"  simulazione x lista contrrollo  *
      *                       = "R"  reale x pagamento prestazione   *
           03 C-RICHIESTA             pic x(01)  value spaces.
      *                    se =  I - lettura Informazioni            *
      *                       =  C - richiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
      *                       =  R - ristampe                        *
           03 C-PROGRESSIVO           pic 9(03)  value zeros.
           03 C-RETCODE               pic x      value spaces.
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
       01  AREALINK-2.
           03 C-DIRIGENTE             pic x(30)  value spaces.
           03 C-ELABINCORSO           pic x      value spaces.
      *              se =  Y - Elaboraz. Yn corso medesima struttura *
      *                 =  K - Elaboraz. Kompletata                  *
           03 C-CONGUAGLIO            pic 9(2)   value zeros.
      *
      *-----------------------------------------Per routine 'PDSPD13'*
       01  PER-PDSPD13.
           03  Z-MATRICOLA            pic s9(08).
           03  Z-RETCODE              pic  x(01).
      *-----------------------------------------Per routine 'RDSTART'*
           copy  CDSTART1.
      *
      *--------------------------------------------------------------*
      *CONSTANT SECTION.
      *77 WK_VERSION     pic s9(9) comp-5  value is 20090915.
      *--------------------------------------------------------------*
       LINKAGE SECTION.
       01  COMMAREADS.
           03  LAREA1.
           05 L-CODICE-SEDE         pic 9(04).
           05 L-NOME-SEDE           pic x(22).
           05 L-CODICE-STOP         pic 9(02).
           05 L-NOME-STOP           pic x(22).
           05 L-PROCEDURA           pic x(03).
           05 L-TIPOCALCOLO         pic x(01).
           05 L-RICHIESTA           pic x(01).
           05 L-PROGRESSIVO         pic 9(03).
           05 L-RETCODE               pic x.
      *    se L-RETCODE =  "N" elaborazione Non effettuata
      *    se           =  "C" elaborazione Completata Correttamente
      *    se           =  "E" elaborazione in Errore
           03  LAREA-D.
           05  LCODOPE                pic x(02).
           05  LLIVAUTO               pic x(01).
           05  LMATRICOLA             pic x(08).
           03  L-DATAELABO            pic 9(08).
           03  FILLER                 PIC X(26922).
      *==============================================================*
       PROCEDURE  DIVISION  using  COMMAREADS.
       MAIN.
           perform  I00-INIZIALI      thru  I00-EX.
           perform  C00-CENTRALI      thru  C00-EX.
           perform  F00-FINALI        thru  F00-EX.
       MAIN-EX. exit.
      *
       A10-AGGIORNA.
      *-------------------------------------------- Elab. x ristampa *
      *
           if  L-RICHIESTA  =  "R"
               go  to  A10-EX
           END-IF.
      *
           move  L-PROCEDURA      to H-PPROCEDURA .
           move  L-CODICE-STOP    to H-PSTRUTTURA .
           move  "N"              to H-PBACKUP    .
      *
           PERFORM A10-DB2-SELECT THRU A10-DB2-SELECT-EX.
           IF SQLCODE NOT = 0
      *        move  "S"  to  W-ERRORE
      *        move  "E"  to  L-RETCODE
      *        perform  T73-TESTO73    thru  T73-EX
      *        perform  W10-MSGERRORE  thru  W10-EX
                EXEC CICS SYNCPOINT ROLLBACK END-EXEC
               go  to  A10-EX
           ELSE
               if  F-LRIEPILOGO  =   0
               then
                   continue
               else
                   move  "S"  to  W-ERRORE
                   move  "E"  to  L-RETCODE
                   EXEC CICS SYNCPOINT ROLLBACK END-EXEC
                   perform  T73-TESTO73    thru  T73-EX
                   perform  W10-MSGERRORE  thru  W10-EX
               end-if
           end-IF.
      *------------------------------------------?? Elab. x ristampa *
      *    if  L-RICHIESTA  =  "R"
      *------------------------------------------?? Elab. x NULLO    *
           if H-PZEROPAGAM   =  "S"    and
gga           H-PCODTELEMA  =  "NULLO"
           then
               EXEC CICS SYNCPOINT ROLLBACK END-EXEC
               go  to  A10-FLAGYNCORSO
           end-if.
      *
           if H-PIMPCONTAB                    =  zeroes
           then
               continue
           else
               if (H-PIMPCONTAB                    >  zeroes)  and
                  (H-PIMPTELEMA                    >  zeroes)  and
                  (H-PIMPCONTAB                    not  equal
                   H-PIMPTELEMA )
               then
                   continue
               else
                   EXEC CICS SYNCPOINT ROLLBACK END-EXEC
                   go  to  A10-FLAGYNCORSO
               end-if
           end-if.
      *
           if  W-ERRORE  =  "N"
           then
               if  W-CENTRA  equal  spaces
               then  continue
               else
                   perform  A20-TELEMATICO  thru  A20-EX
                   if  W-ERRORE  =  "S"
                   then
                       move  "E"  to  L-RETCODE
                       EXEC CICS SYNCPOINT ROLLBACK END-EXEC
      *                go  to  A10-EX
                   end-if
               end-if
           end-if.
      *------------------------------- Aggiorno record RIEPILOGO     *
      *    if  F-LRIEPILOGO  =  "00"   and
           if  W-ERRORE  =  "N"
           then
               perform  A12-UPD-RIEPILOGO  thru  A12-EX
           else
               move  "S"  to  W-ERRORE
               move  "E"  to  L-RETCODE
               EXEC CICS SYNCPOINT ROLLBACK END-EXEC
           end-if.
      *------------------------------------ Memorizzo fine elaboraz. *
       A10-FLAGYNCORSO.
           if  W-FLAGYNCORSO  =  "S"
           then
      *        continue
               perform  A14-FINE-ELAB  thru  A14-EX
      *    else
      *        go  to  A10-EX
           end-if.
      *
       A10-EX.  exit.
      *
      *
       E45-STAMPA-RPT.
      *
           EVALUATE WTIPODOM
             WHEN "B"
               perform  E31-DETASU   thru  E31-DETASU-EX
             WHEN "D"
               perform  E32-DETLPU   thru  E32-DETLPU-EX
             WHEN "E"
               perform  E33-DETSX    thru  E33-DETSX-EX
           END-EVALUATE.
      *
      *   RECUPERI
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  60
              IF EL-IMP-REC-A(NDR1) NOT = 0
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
      *          MOVE EL-VOCE-REC(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-REC-A(NDR1)
                        EL-NUM-REC-A(NDR1)(1:2)
                        EL-NUM-REC-A(NDR1)(4:3)
                  DELIMITED BY SIZE        INTO WK-CONTO-KEY
                 PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
                 STRING EL-ALF-REC-A(NDR1) ' '
                        EL-NUM-REC-A(NDR1)(1:3)
                        EL-NUM-REC-A(NDR1)(4:3)
                 DELIMITED BY SIZE        INTO WK-CONTO-AVERE
                 MOVE EL-IMP-REC-A(NDR1)     TO WK-IMPOR-AVERE
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           END-PERFORM.
      *
      *   SINDACATI AVERE
      *
           perform  varying  NDR1  from  1  by  1
      * SSS correttivo per sindacati da 10 03 in poi
160125*             until NDR1            >  300
160125              until NDR1            >  400
      * SSS-F
              IF EL-IMP-SIND-A(NDR1) NOT = 0
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
      *          MOVE EL-VOCE-SIND(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-SIND-A(NDR1)
                        EL-NUM-SIND-A(NDR1)(1:2)
                        EL-NUM-SIND-A(NDR1)(4:3)
                  DELIMITED BY SIZE        INTO WK-CONTO-KEY
                 PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
                 STRING EL-ALF-SIND-A(NDR1) ' '
                        EL-NUM-SIND-A(NDR1)(1:3)
                        EL-NUM-SIND-A(NDR1)(4:3)
                 DELIMITED BY SIZE        INTO WK-CONTO-AVERE
                 MOVE EL-IMP-SIND-A(NDR1)     TO WK-IMPOR-AVERE
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           END-PERFORM.
      *
      *   SINDACATI DARE  D
      *
           perform  varying  NDR1  from  1  by  1
      * SSS correttivo per sindacati da 10 03 in poi
160125*             until NDR1            >  300
160125              until NDR1            >  400
      * SSS-F
              IF EL-IMP-SIND-D(NDR1) NOT = 0
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
      *          MOVE EL-VOCE-SIND(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-SIND-D(NDR1)
                        EL-NUM-SIND-D(NDR1)(1:2)
                        EL-NUM-SIND-D(NDR1)(4:3)
                  DELIMITED BY SIZE        INTO WK-CONTO-KEY
                 PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
                 STRING EL-ALF-SIND-D(NDR1) ' '
                        EL-NUM-SIND-D(NDR1)(1:3)
                        EL-NUM-SIND-D(NDR1)(4:3)
                 DELIMITED BY SIZE        INTO WK-CONTO-DARE
                 MOVE EL-IMP-SIND-D(NDR1)     TO WK-IMPOR-DARE
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           END-PERFORM.
      *
      *   SINDACATI AVERE C
      *
           perform  varying  NDR1  from  1  by  1
      * SSS correttivo per sindacati da 10 03 in poi
160125*             until NDR1            >  300
160125              until NDR1            >  400
      * SSS-F
              IF EL-IMP-SIND-C(NDR1) NOT = 0
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
      *          MOVE EL-VOCE-SIND(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-SIND-C(NDR1)
                        EL-NUM-SIND-C(NDR1)(1:2)
                        EL-NUM-SIND-C(NDR1)(4:3)
                  DELIMITED BY SIZE        INTO WK-CONTO-KEY
                 PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
                 STRING EL-ALF-SIND-C(NDR1) ' '
                        EL-NUM-SIND-C(NDR1)(1:3)
                        EL-NUM-SIND-C(NDR1)(4:3)
                 DELIMITED BY SIZE        INTO WK-CONTO-AVERE
                 MOVE EL-IMP-SIND-C(NDR1)     TO WK-IMPOR-AVERE
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           END-PERFORM.
      *
           IF WK-APP-RECSPE NOT = 0
              MOVE SPACES                TO WK-CONTO-DARE
              MOVE 0                     TO WK-IMPOR-DARE
              MOVE SPACES                TO WK-CONTO-AVERE
              MOVE 0                     TO WK-IMPOR-AVERE
      *--
              MOVE "GPA24042"            TO WK-CONTO-KEY
              PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
              MOVE "GPA 24/042"          TO WK-CONTO-AVERE
              MOVE WK-APP-RECSPE         TO WK-IMPOR-AVERE
      *--
              MOVE SPACES               TO TDSREPORT-RIGA-REPORT
              STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                      INTO TDSREPORT-RIGA-REPORT
              ADD 1                     TO TDSREPORT-NUM-RIGA
              PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
           END-IF.
      *
           IF WK-APP-RECIVA NOT = 0
              MOVE SPACES                TO WK-CONTO-DARE
              MOVE 0                     TO WK-IMPOR-DARE
              MOVE SPACES                TO WK-CONTO-AVERE
              MOVE 0                     TO WK-IMPOR-AVERE
      *--
              MOVE "GPA24025"            TO WK-CONTO-KEY
              PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
              MOVE "GPA 24/025"          TO WK-CONTO-AVERE
              MOVE WK-APP-RECIVA         TO WK-IMPOR-AVERE
      *--
              MOVE SPACES               TO TDSREPORT-RIGA-REPORT
              STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                      INTO TDSREPORT-RIGA-REPORT
              ADD 1                     TO TDSREPORT-NUM-RIGA
              PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              MOVE SPACES               TO TDSREPORT-RIGA-REPORT
           END-IF.
      *
      * RIGA ERRORI
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  300
              IF ELE-RIGA-ERRORI(NDR1) NOT = SPACES
              THEN
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 ADD 1                      TO TDSREPORT-NUM-RIGA
                 STRING '04' ELE-RIGA-ERRORI(NDR1) DELIMITED BY SIZE
                                          INTO TDSREPORT-RIGA-REPORT
                 PERFORM S30-INSERT-REPORT  THRU S30-EX-INSERT-REPORT
              ELSE
                 MOVE 999                 TO NDR1
              END-IF
           end-perform.
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  300
              IF  RIGA-STAMPA(NDR1) NOT = SPACES
              THEN
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 ADD 1                      TO TDSREPORT-NUM-RIGA
                 MOVE RIGA-STAMPA(NDR1)     TO TDSREPORT-RIGA-REPORT
                 PERFORM S30-INSERT-REPORT  THRU S30-EX-INSERT-REPORT
              ELSE
                 MOVE 999                 TO NDR1
              END-IF
           end-perform.
      *
      * STAMPA BIGLIETTO CONTABILE 730
      *
      *17072020 eliminata perchè non si chiama più popwmain
      *    MOVE 0              TO  TDSREPORT-NUM-RIGA.
      *    MOVE 19             TO  TDSREPORT-NUM-RPT.
      *
      *    perform  varying  NDR1  from  1  by  1
      *             until NDR1            >  100
      *       IF BC-IMPORTO-SIN-1(NDR1) > 0
      *       THEN
      *          MOVE SPACES                TO WK-CONTO-DARE
      *          MOVE 0                     TO WK-IMPOR-DARE
      *          MOVE SPACES                TO WK-CONTO-AVERE
      *          MOVE 0                     TO WK-IMPOR-AVERE
      *          MOVE BC-IMPORTO-SIN-1(NDR1)  TO R-BCA-IMPORTO(NDR1)
      *          MOVE BC-CODICE-CONTO-SIN-1(NDR1) TO WK-CONTO-KEY
      *          PERFORM    E45-LEGGI-CONTO THRU E45-LEGGI-CONTO-EX
      *          MOVE "/"                       TO WK-BARRA
      *          MOVE WK-CONTO1-KEY             TO WK-CONTO-ALF
      *          MOVE WK-CONTO2-KEY             TO WK-CONTO-NUM1
      *          MOVE WK-CONTO3-KEY             TO WK-CONTO-NUM2
      *          IF BC-FLAG-DARE-AVERE-SIN-1(NDR1)  = "D"
      *          THEN
      *             MOVE WK-CONTO              TO WK-CONTO-DARE
      *             MOVE R-BCA-IMPORTO(NDR1)   TO WK-IMPOR-DARE
      *             ADD  BC-IMPORTO-SIN-1(NDR1)  TO WK-TOT-DARE
      *          ELSE
      *             MOVE WK-CONTO              TO WK-CONTO-AVERE
      *             MOVE R-BCA-IMPORTO(NDR1)   TO WK-IMPOR-AVERE
      *             ADD  BC-IMPORTO-SIN-1(NDR1)  TO WK-TOT-AVERE
      *          END-IF
      *          MOVE SPACES               TO TDSREPORT-RIGA-REPORT
      *          STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
      *                                  INTO TDSREPORT-RIGA-REPORT
      *          ADD 1                     TO TDSREPORT-NUM-RIGA
      *          PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
      *       ELSE
      *          MOVE 999                 TO NDR1
      *       END-IF
      *    end-perform.
      *-----------------------------------------------------------*
           IF WK-TOT-AVERE > 0
           then
              move WK-TOT-AVERE    to RTOTDA
              move WK-TOT-DARE     to RTOTAV
              ADD   1              TO TDSREPORT-NUM-RIGA
              MOVE SPACES          TO TDSREPORT-RIGA-REPORT
              STRING '02' RWK-TOTALI   DELIMITED BY SIZE
                     INTO TDSREPORT-RIGA-REPORT
              PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
           END-IF.
      *
       E45-STAMPA-RPT-EX.
           EXIT.
      *
       E45-LEGGI-CONTO.
      *
           MOVE WK-CONTO-KEY          TO H-CONNUMERO.
           PERFORM E45-DB2-SELECT     THRU E45-DB2-SELECT-EX.
           IF SQLCODE NOT = 0
              MOVE SPACES               TO WK-DESCR-CONTO
              STRING "Manca descrizione conto : "  WK-CONTO-KEY
                     DELIMITED BY SIZE  INTO WK-DESCR-CONTO
           ELSE
              MOVE H-CONDESCRI          TO WK-DESCR-CONTO
           END-IF.
      *
       E45-LEGGI-CONTO-EX.
           EXIT.
      *
       A12-UPD-RIEPILOGO.
           move  L-PROCEDURA      to H-PPROCEDURA .
           move  L-CODICE-STOP    to H-PSTRUTTURA .
           move  "N"              to H-PBACKUP    .
           PERFORM A10-DB2-SELECT THRU A10-DB2-SELECT-EX.
           IF SQLCODE NOT = 0
               move  "S"  to  W-ERRORE
               move  "E"  to  L-RETCODE
               EXEC CICS SYNCPOINT ROLLBACK END-EXEC
               go  to A12-EX
           ELSE
               if  F-LRIEPILOGO  =    0
               then
                   continue
               else
                   move  "S"  to  W-ERRORE
                   move  "E"  to  L-RETCODE
                   EXEC CICS SYNCPOINT ROLLBACK END-EXEC
                   go  to A12-EX
               end-if
           end-IF.
      *
           move  W-BIGLIETTO to           H-PIMPCONTAB.
           move  W8-ODIERNA  to           H-PDATAEMISS.
           PERFORM A12-DB2-UPDATE THRU A12-DB2-UPDATE-EX.
           IF SQLCODE NOT = 0
               move  "S"  to  W-ERRORE
               move  "E"  to  L-RETCODE
               EXEC CICS SYNCPOINT ROLLBACK END-EXEC
           ELSE
               if  F-LRIEPILOGO  =    0
               then
                   EXEC CICS SYNCPOINT END-EXEC
               else
                   move  "S"  to  W-ERRORE
                   move  "E"  to  L-RETCODE
                   EXEC CICS SYNCPOINT ROLLBACK END-EXEC
               end-if
           end-IF.
       A12-EX.  exit.
      *
       A14-FINE-ELAB.
      *------------------------------------ Memorizzo fine elaboraz. *
           move  L-CODICE-SEDE    to  C-CODICE-SEDE.
           move  L-CODICE-STOP    to  C-CODICE-STOP.
           move  L-NOME-SEDE      to  C-NOME-SEDE.
           move  L-NOME-STOP      to  C-NOME-STOP.
           move  L-PROCEDURA      to  C-PROCEDURA.
           move  "F"              to  C-RICHIESTA.
           move  L-PROGRESSIVO    to  C-PROGRESSIVO.
           move  zeros            to  C-CONGUAGLIO.
           move  spaces           to  C-DIRIGENTE
                                      C-ELABINCORSO
                                      C-RETCODE.
      *
           call  PDSPD16
                  using  WDFHEIBLK  WDFHCOMMAREA
                         AREALINK-1  AREALINK-2
           end-call.
           cancel  PDSPD16 .
      *-------------------------------------- Elaborazione corretta?
           if  C-RETCODE      =  "C"   and
               C-ELABINCORSO  =  "K"
           then
               continue
           else
               move  "S"  to  W-ERRORE
               perform  T76-TESTO76    thru  T76-EX
               perform  W10-MSGERRORE  thru  W10-EX
           end-if.
       A14-EX.  exit.
      *
      *
       A20-TELEMATICO.
      *
           move  L-CODICE-SEDE    to  C-CODICE-SEDE.
           move  L-CODICE-STOP    to  C-CODICE-STOP.
           move  L-NOME-SEDE      to  C-NOME-SEDE.
           move  L-NOME-STOP      to  C-NOME-STOP.
           move  L-PROCEDURA      to  C-PROCEDURA.
           move  L-RICHIESTA      to  C-RICHIESTA.
           move  L-PROGRESSIVO    to  C-PROGRESSIVO.
           move  zeros            to  C-CONGUAGLIO.
           move  spaces           to  C-DIRIGENTE
                                      C-ELABINCORSO
                                      C-RETCODE.
           move H-PDATAELABO   TO     WK-PDATAELABO.
      *
090523*    if  LMATRICOLA  =  "78360000"    and
      *        L-CODICE-SEDE  =  "0200"
      *    then
      *    display "NIK rdspd05,LMATRICOLA :   "  LMATRICOLA
      *    display "NIK rdspd05,W-BIGLIETTO:   "  W-BIGLIETTO
      *    display "NIK rdspd05,EL-TABINT1(1) :"  EL-TABINT1(1)
      *    display "NIK rdspd05,EL-TABINT1(2) :"  EL-TABINT1(2)
      *    display "NIK rdspd05,EL-TABINT1(3) :"  EL-TABINT1(3)
      *    display "NIK rdspd05,EL-TABINT1(4) :"  EL-TABINT1(4)
090523*    end-if.
      *
           call   RDSPD05   using
                 WDFHEIBLK  WDFHCOMMAREA
                 WK-PDATAELABO
                 H-PCODTELEMA
                 W-BIGLIETTO
                 AREALINK-1
                 LAREA-D
                 TABINT1
                 TAB-ERRORI
           end-call.
           cancel  RDSPD05 .
           if  C-RETCODE    =  "C"
           then  continue
           else  move  "S"  to  W-ERRORE
           end-if.
       A20-EX.
           exit.
      *
       C00-CENTRALI.
           if  W-ERRORE  =  "S"
           then
               go  to  C00-EX
           end-if.
           if  L-RETCODE  =  "N"
           then
               perform  E00-ELABORA       thru  E00-EX
                        until  W-FINE-ELABORA  =  "S"
           end-if.
           if  L-RETCODE  =  "C"
           then
      *
      *________________ Totalizzo
      *
               perform  E30-TOTALIZZA     thru  E30-EX
               perform  STAMPA-BIGLIETTO  thru  EX-BIGLIETTO
               perform  A10-AGGIORNA      thru  A10-EX
      *17072020 asteriscata sezione stampa cong 730
      *      INITIALIZE AREA-BC-SIN
      *      move DAL-730          to  REC-DATA-IN
      *      if  (DAL-730(5:2)  =  '08')
      *      or  (DAL-730(5:2)  =  '09')
      *      or  (DAL-730(5:2)  =  '10')
      *      or  (DAL-730(5:2)  =  '11')
      *      or  (DAL-730(5:2)  =  '12')
      *        if TOTDA of TOTALI-O > 0
      *            if  L-RICHIESTA  =  "R"
      *                perform STAMPA-730-74  thru  EX-730-74
      *            else
      *                perform STAMPA-730-73  thru  EX-730-73
      *                perform STAMPA-730-74  thru  EX-730-74
      *            end-if
      *        end-if
      *      end-if
           else
               if  H-PZEROPAGAM                   =  "S"
               then
                   perform  STAMPA-BIGLIETTO  thru  EX-BIGLIETTO
140121             perform  A10-AGGIORNA      thru  A10-EX
               end-if
           end-if.
       C00-EX.
           exit.
      *
       E00-ELABORA.
      *
           perform  E20-ELABORA20  thru  E20-EX.
      *
           PERFORM E30-DB2-FETCH  THRU E30-DB2-FETCH-EX.
           IF SQLCODE NOT = 0
                   move  "S"  to  W-FINE-ELABORA
           end-IF.
       E00-EX.  exit.
      *
       E20-ELABORA20.
      *------------------------------------------ Verifiche -        *
           if  (H-O0PROCEDURA  =  L-PROCEDURA)    and
               (H-O0DCOCENOPE  =  L-CODICE-STOP)  and
               (H-O0PROGRESSI  =  L-PROGRESSIVO)  and
               (H-O0DATAELABO  =  H-PDATAELABO)
           then
               add  1   to   CTR-LET-APPO
      *        move  CTR-LET-APPO  to  M2N013
               if  CTR-LET-APPO  =  1
               then
                   move H-O0DCOCOTIDO  to  WTIPODOM
               end-if
           else
               go  to  E20-EX
           end-if.
           if  H-O0DCOCOTIDO  =  WTIPODOM
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Tabella recuperi  *  00  -
           initialize  LTABRECUPERI.
           if  H-O0RECIMURE1  >  zeroes   or
               H-O0RECIMURE2  >  zeroes   or
               H-O0RECIMURE3  >  zeroes
           then
               call   RDSPD06 using
                           WDFHEIBLK  WDFHCOMMAREA
                           H-O0DATAELABO  H-O0DCOCHIDOM
                           LAREA1      LAREA-D
                           LTABRECUPERI
               end-call
               cancel   RDSPD06
           end-if.
      *
      *------------------------------------------ Importo assegno
      *    if  YRECPAGATO  = "S"
               if  H-O0FADNETPAG  >  1,99
               then
                   add  H-O0FADNETPAG    to  S5B024N
               else
                   if  ( H-O0RECIMURE1  >  zeros   or
                         H-O0RECIMURE2  >  zeros   or
                         H-O0RECIMURE3  >  zeros )
                   then
                       continue
                   else
                       go  to  E20-EX
                   end-if
               end-if.
      *    else
      *        if  YSUINDEB > 0
      *        then
      *            continue
      *        else
      *            go  to  E20-EX
      *        end-if
      *    end-if.
           move  "C"  to  L-RETCODE.
      *------------------------------------------ Scrivo B.C.F.C.
           perform  E40-BIGLIETTO   thru  E40-EX.
      *------------------------------------------ Per verifica
      *
      *    if  ID-UTENTE  =  "PNA200    "   and
      *        W-PIERO    =  " PIERO"
      *    then
      *        perform  Enn-VERIFICA    thru  Enn-EX
      *    end-if.
       E20-EX.  exit.
      *
       E40-BIGLIETTO.
           EVALUATE WTIPODOM
             WHEN "B"
               perform  E50-BIGASU   thru  E50-EX
             WHEN "D"
               perform  E60-BIGLPU   thru  E60-EX
             WHEN "E"
               perform  E70-BIGSX    thru  E70-EX
           END-EVALUATE.
       E40-EX.  exit.
      *
       E50-BIGASU.
      * imposta data inizio e fine elaborazione per b.c. 730
           IF H-O0DCODTULSP < DAL-730
               MOVE H-O0DCODTULSP TO DAL-730
           END-IF.
           IF H-O0DCODTULSP > AL-730
               MOVE H-O0DCODTULSP TO AL-730
           END-IF.
      * controlla se presente INCENTIVO
           IF H-O0DCODTDESP > 20021231
           AND H-O0SUINCENT = "S"
           AND H-O0SUIMRIN > 9296,21
               IF H-O0SUIMRINU > 9296,21
                   COMPUTE WK-RINUNCIA = H-O0SUIMRINU - 9296,22
                   MOVE 9296,22 TO WK-INCENTIVO
               ELSE
                   MOVE 0 TO WK-RINUNCIA
                   MOVE H-O0SUIMRINU TO WK-INCENTIVO
               END-IF
           ELSE
               MOVE H-O0SUIMRINU TO WK-RINUNCIA
               MOVE ZEROES TO WK-INCENTIVO
           END-IF.
      * correttivo su importo netto INCENTIVO
           MOVE 0 TO WK-IRPEF-INC.
           IF WK-INCENTIVO > 0
               COMPUTE ALIQINC  rounded = H-O0SUIRPEFU /
                                 (WK-RINUNCIA + WK-INCENTIVO)
               COMPUTE ALIQINCR rounded = H-O0SUADDIZRR /
                                 (WK-RINUNCIA + WK-INCENTIVO)
               COMPUTE ALIQINCC rounded = H-O0SUADDIZRC /
                                 (WK-RINUNCIA + WK-INCENTIVO)
               COMPUTE WK-IRPEF-INC rounded            =
                       WK-INCENTIVO                    *
                     ( ALIQINC + ALIQINCR + ALIQINCC )
           END-IF.
      *
           COMPUTE WK-DEBITO = H-O0SUIMINU  +
                               H-O0SUIMRINU +
                               WK-IRPEF-INC -
                               WK-INCENTIVO -
                               H-O0SUIRPEFU -
                               H-O0SUTRASIND -
                               H-O0SUADDIZR -
                               H-O0SUADDIZC -
                               H-O0SUCONG730 -
                               H-O0SUCONGFIS -
                               H-O0SUADDIZRR -
                               H-O0SUADDIZRC.
           IF H-O0RECIMURE3 > 0
               COMPUTE WK-DEBITO = WK-DEBITO - H-O0RECIMURE3
           END-IF.
      *
           EVALUATE   H-O0SUFIN ALSO H-O0DCODTDESP
             WHEN     01      ALSO   ANY
               PERFORM E510-VECCHIE
             WHEN     02      ALSO   00000000 THRU 20000430
               PERFORM E510-VECCHIE
             WHEN     02      ALSO   20000501 THRU 99999999
               PERFORM E520-NUOVE-2
             WHEN     03      ALSO   00000000 THRU 20000430
               PERFORM E510-VECCHIE
             WHEN     03      ALSO   20001101 THRU 20010630
               PERFORM E530-NUOVE-3
             WHEN     03      ALSO   20010701 THRU 99999999
               PERFORM E535-REGIO-3
             WHEN     04      ALSO   ANY
               PERFORM E540-NUOVE-4
             WHEN     05      ALSO   ANY
               PERFORM E550-NUOVE-5
             WHEN     06      ALSO   ANY
               PERFORM E560-REGIO-6
             WHEN     07      ALSO   ANY
               PERFORM E520-NUOVE-2
             WHEN     09      ALSO   00000000 THRU 20151231
               PERFORM E570-50FO-50REG
             WHEN     09      ALSO   20160101 THRU 99999999
               PERFORM E580-40FO-60REG
           END-EVALUATE.
      *
           IF H-O0DCODTDESP > 20021231
               ADD WK-RINUNCIA TO ANTIC   OF BIGASU-O
           ELSE
               ADD WK-RINUNCIA TO RIN     OF BIGASU-O
           END-IF.
           IF WK-INCENTIVO > 0 AND < 9296,22
               ADD H-O0SURECRIN TO INCENTIVO OF BIGASU-O
           ELSE
               IF H-O0DCODTDESP > 20021231
                   ADD H-O0SURECRIN TO ANTIC  OF BIGASU-O
               ELSE
                   ADD H-O0SURECRIN TO RIN    OF BIGASU-O
               END-IF
           END-IF.
      *
           ADD WK-INCENTIVO TO DEBITIINC OF BIGASU-O
                               INCENTIVO OF BIGASU-O.
           SUBTRACT WK-IRPEF-INC FROM DEBITIINC OF BIGASU-O.
      * recuperi
           ADD H-O0RECIMURE1 TO RECU    OF BIGASU-O.
           ADD H-O0RECIMURE2 TO RECU    OF BIGASU-O.
           ADD H-O0RECIMURE3 TO RECU    OF BIGASU-O.
      * gestione recuperi da rendere operative
           IF H-O0RECIMURE1 > 0
           OR H-O0RECIMURE2 > 0
           OR H-O0RECIMURE3 > 0
               PERFORM CARICA-TABELLA-RECUPERI
           END-IF.
      * recuperi su rinuncia o anticipazione
           IF WK-INCENTIVO > 0 AND < 9296,22
               ADD H-O0SURECRIN TO RECUINC OF BIGASU-O
           ELSE
               IF H-O0DCODTDESP > 20031231
                   ADD H-O0SURECRIN TO RECUANT OF BIGASU-O
               ELSE
                   ADD H-O0SURECRIN TO RECURIN OF BIGASU-O
               END-IF
           END-IF.
      * irpef
           ADD H-O0SUIRPEFU TO IRPEF    OF BIGASU-O.
           SUBTRACT H-O0FAPIMPNET FROM IRPEF OF BIGASU-O.
           ADD H-O0FAPIMPNET TO IRPEFS  OF BIGASU-O.
      * addizionali
           ADD H-O0SUADDIZR TO ADDREG   OF BIGASU-O.
           ADD H-O0SUADDIZC TO ADDCOM   OF BIGASU-O.
           ADD H-O0SUADDIZRR TO ADDREGR OF BIGASU-O.
           ADD H-O0SUADDIZRC TO ADDCOMR OF BIGASU-O.
      * conguaglio fiscale
           IF H-O0SUCONGFIS > 0
               ADD H-O0SUCONGFIS TO CONGDEB OF BIGASU-O
           ELSE
               COMPUTE CONGRIMB OF BIGASU-O =
                       CONGRIMB OF BIGASU-O +
                           H-O0SUCONGFIS * (-1)
           END-IF.
      * 17072020
      * conguaglio 730
           IF H-O0SUCONG730 > 0
               ADD H-O0SUCONG730 TO DEB730 OF BIGASU-O
           ELSE
               COMPUTE RIMB730 OF BIGASU-O =
                       RIMB730 OF BIGASU-O +
                           H-O0SUCONG730 * (-1)
           END-IF.
      * trattenute sindacali
160125*fatte correzioni su gestione sindacati
      * SSS correttivo per sindacati da 10 03 in poi
           IF H-O0SUTRASIND > 0
               ADD W-SPERIS    TO RECSPE OF RIGASPE-O
               ADD W-IVA       TO RECIVA OF RIGAIVA-O
               COMPUTE TS-NETTA = H-O0SUTRASIND - (W-SPERIS + W-IVA)
160125*        IF H-O0SUTSCONF = 10
160125*        AND H-O0SUTSCAT > 01
      **           ADD H-O0SUTRASIND TO EL-IMP-SIND-C(90)
160125*            ADD H-O0SUTRASIND
160125*                TO EL-IMP-SIND-C(H-O0SUTSCAT + 98)
160125*            IF H-PDATAELABO < 20120101
      **               ADD H-O0SUTRASIND TO EL-IMP-SIND-A(90)
160125*                ADD H-O0SUTRASIND
160125*                    TO EL-IMP-SIND-A(H-O0SUTSCAT + 98)
      **               ADD TS-NETTA   TO EL-IMP-SIND-D(90)
160125*                ADD TS-NETTA
160125*                    TO EL-IMP-SIND-D(H-O0SUTSCAT + 98)
160125*            END-IF
      * SSS-F
160125*        ELSE
160125*            ADD H-O0SUTRASIND TO EL-IMP-SIND-C(H-O0SUTSCONF)
160125*            IF H-PDATAELABO < 20120101
160125*                ADD H-O0SUTRASIND TO EL-IMP-SIND-A(H-O0SUTSCONF)
160125*                ADD TS-NETTA   TO EL-IMP-SIND-D(H-O0SUTSCONF)
160125*            END-IF
160125*        END-IF

160125         MOVE 1  TO IND-SIND
160125         PERFORM UNTIL IND-SIND > 400
160125           IF H-O0SUTSCONF  = EL-COD-SIND(IND-SIND) AND
160125              H-O0SUTSCAT   = EL-CAT-SIND(IND-SIND)
160125                ADD H-O0SUTRASIND TO EL-IMP-SIND-C(IND-SIND)
160125                IF H-PDATAELABO < 20120101
160125                    ADD H-O0SUTRASIND  TO EL-IMP-SIND-A(IND-SIND)
160125                    ADD TS-NETTA       TO EL-IMP-SIND-D(IND-SIND)
160125                END-IF
160125                move 401   to ind-sind
160125           ELSE
160125             add 1    to ind-sind
160125           END-IF
160125         END-PERFORM

               ADD H-O0SUTRASIND TO TOTALE-CONT
               IF H-PDATAELABO < 20120101
                   ADD H-O0SUTRASIND TO TOTALE-ACCR
                   ADD TS-NETTA   TO TOTALE-DEBI
               END-IF
           END-IF.
       E50-EX.  exit.
      *
       E510-VECCHIE.
           IF H-O0SUMATASUU > H-O0SUIMASUU
               MOVE H-O0SUIMASUU TO H-O0SUMATASUU
           END-IF.
           EVALUATE H-O0SUFIN ALSO H-O0SULPU ALSO H-O0SUTIPPRO
             WHEN 01 ALSO "S" ALSO "I"
               PERFORM E511-71
             WHEN 01 ALSO "S" ALSO "R"
               PERFORM E512-72
             WHEN 01 ALSO "P" ALSO "I"
               PERFORM E514-74
             WHEN 01 ALSO "P" ALSO "R"
               PERFORM E515-75
      *
             WHEN 02 ALSO "S" ALSO ANY
               PERFORM E513-73
             WHEN 02 ALSO "P" ALSO ANY
               PERFORM E516-76
      *
             WHEN 03 ALSO "S" ALSO "I"
               PERFORM E511-71
             WHEN 03 ALSO "S" ALSO "R"
               PERFORM E512-72
             WHEN 03 ALSO "P" ALSO "I"
               PERFORM E514-74
             WHEN 03 ALSO "P" ALSO "R"
               PERFORM E515-75
           END-EVALUATE.
      *
           ADD WK-DEBITO  TO DEBITI OF BIGASU-O.
           ADD H-O0SUIMANFU TO DEBITI OF BIGASU-O.
       E511-71.
           IF H-O0SUIMASUU < (H-O0SUIMINU + H-O0RECIMURE1)
      *                       + H-O0RECIMURE3)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMASUU TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMASUU TO ASU   OF BIGASU-O
               END-IF
               ADD H-O0SUIMINU    TO LSU71   OF BIGASU-O
               ADD H-O0RECIMURE1  TO LSU71   OF BIGASU-O
      *        ADD H-O0RECIMURE3  TO LSU71   OF BIGASU-O
               SUBTRACT H-O0SUIMASUU FROM LSU71 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMINU TO ASUEDIL OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASUEDIL OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMINU TO ASU    OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASU  OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASU  OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUMATASUT > 0
               IF H-O0SUEDIL = "S"
                   SUBTRACT H-O0SUMATASUU FROM ASUEDIL OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNEDIL OF BIGASU-O
               ELSE
                   SUBTRACT H-O0SUMATASUU FROM ASU OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUANFASUU < (H-O0SUIMANFU + H-O0RECIMURE2)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUANFASUU TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUANFASUU TO ANFASU OF BIGASU-O
               END-IF
               ADD H-O0SUIMANFU   TO ANF71   OF BIGASU-O
               ADD H-O0RECIMURE2  TO ANF71   OF BIGASU-O
               SUBTRACT H-O0SUANFASUU FROM ANF71 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMANFU TO ANFEDIL OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMANFU TO ANFASU OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFASU OF BIGASU-O
               END-IF
           END-IF.
       E512-72.
           IF H-O0SUIMASUU < (H-O0SUIMINU + H-O0RECIMURE1)
      *                       + H-O0RECIMURE3)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMASUU TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMASUU TO ASU   OF BIGASU-O
               END-IF
               ADD H-O0SUIMINU    TO LSU72   OF BIGASU-O
               ADD H-O0RECIMURE1  TO LSU72   OF BIGASU-O
      *        ADD H-O0RECIMURE3  TO LSU72   OF BIGASU-O
               SUBTRACT H-O0SUIMASUU FROM LSU72 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMINU TO ASUEDIL OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASUEDIL OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMINU TO ASU    OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASU  OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASU  OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUMATASUT > 0
               IF H-O0SUEDIL = "S"
                   SUBTRACT H-O0SUMATASUU FROM ASUEDIL OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNEDIL OF BIGASU-O
               ELSE
                   SUBTRACT H-O0SUMATASUU FROM ASU OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUANFASUU < (H-O0SUIMANFU + H-O0RECIMURE2)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUANFASUU TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUANFASUU TO ANFASU OF BIGASU-O
               END-IF
               ADD H-O0SUIMANFU   TO ANF72   OF BIGASU-O
               ADD H-O0RECIMURE2  TO ANF72   OF BIGASU-O
               SUBTRACT H-O0SUANFASUU FROM ANF72 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMANFU TO ANFEDIL OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMANFU TO ANFASU OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFASU OF BIGASU-O
               END-IF
           END-IF.
       E513-73.
           ADD H-O0SUIMINU     TO LSU73     OF BIGASU-O.
           ADD H-O0RECIMURE1   TO LSU73     OF BIGASU-O.
      *    ADD H-O0RECIMURE3   TO LSU73     OF BIGASU-O.
           IF H-O0SUMATASUT > 0
               SUBTRACT H-O0SUMATASUU FROM LSU73 OF BIGASU-O
               ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
           END-IF.
           ADD H-O0SUIMANFU    TO ANF73     OF BIGASU-O.
           ADD H-O0RECIMURE2   TO ANF73     OF BIGASU-O.
       E514-74.
           IF H-O0SUIMASUU < (H-O0SUIMINU + H-O0RECIMURE1)
      *                       + H-O0RECIMURE3)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMASUU TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMASUU TO ASU   OF BIGASU-O
               END-IF
               ADD H-O0SUIMINU    TO LPU74   OF BIGASU-O
               ADD H-O0RECIMURE1  TO LPU74   OF BIGASU-O
      *        ADD H-O0RECIMURE3  TO LPU74   OF BIGASU-O
               SUBTRACT H-O0SUIMASUU FROM LPU74 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMINU TO ASUEDIL OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASUEDIL OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMINU TO ASU    OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASU  OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASU  OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUMATASUT > 0
               IF H-O0SUEDIL = "S"
                   SUBTRACT H-O0SUMATASUU FROM ASUEDIL OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNEDIL OF BIGASU-O
               ELSE
                   SUBTRACT H-O0SUMATASUU FROM ASU OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUANFASUU < (H-O0SUIMANFU + H-O0RECIMURE2)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUANFASUU TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUANFASUU TO ANFASU OF BIGASU-O
               END-IF
               ADD H-O0SUIMANFU   TO ANF74   OF BIGASU-O
               ADD H-O0RECIMURE2  TO ANF74   OF BIGASU-O
               SUBTRACT H-O0SUANFASUU FROM ANF74 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMANFU TO ANFEDIL OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMANFU TO ANFASU OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFASU OF BIGASU-O
               END-IF
           END-IF.
       E515-75.
           IF H-O0SUIMASUU < (H-O0SUIMINU + H-O0RECIMURE1)
      *                       + H-O0RECIMURE3)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMASUU TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMASUU TO ASU   OF BIGASU-O
               END-IF
               ADD H-O0SUIMINU    TO LPU75   OF BIGASU-O
               ADD H-O0RECIMURE1  TO LPU75   OF BIGASU-O
      *        ADD H-O0RECIMURE3  TO LPU75   OF BIGASU-O
               SUBTRACT H-O0SUIMASUU FROM LPU75 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMINU TO ASUEDIL OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASUEDIL OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASUEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMINU TO ASU    OF BIGASU-O
                   ADD H-O0RECIMURE1 TO ASU  OF BIGASU-O
      *            ADD H-O0RECIMURE3 TO ASU  OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUMATASUT > 0
               IF H-O0SUEDIL = "S"
                   SUBTRACT H-O0SUMATASUU FROM ASUEDIL OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNEDIL OF BIGASU-O
               ELSE
                   SUBTRACT H-O0SUMATASUU FROM ASU OF BIGASU-O
                   ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
               END-IF
           END-IF.
           IF H-O0SUANFASUU < (H-O0SUIMANFU + H-O0RECIMURE2)
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUANFASUU TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUANFASUU TO ANFASU OF BIGASU-O
               END-IF
               ADD H-O0SUIMANFU   TO ANF75   OF BIGASU-O
               ADD H-O0RECIMURE2  TO ANF75   OF BIGASU-O
               SUBTRACT H-O0SUANFASUU FROM ANF75 OF BIGASU-O
           ELSE
               IF H-O0SUEDIL = "S"
                   ADD H-O0SUIMANFU TO ANFEDIL OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFEDIL OF BIGASU-O
               ELSE
                   ADD H-O0SUIMANFU TO ANFASU OF BIGASU-O
                   ADD H-O0RECIMURE2 TO ANFASU OF BIGASU-O
               END-IF
           END-IF.
       E516-76.
           ADD H-O0SUIMINU    TO LPU76     OF BIGASU-O.
           ADD H-O0RECIMURE1  TO LPU76     OF BIGASU-O.
      *    ADD H-O0RECIMURE3  TO LPU76     OF BIGASU-O.
           IF H-O0SUMATASUT > 0
               SUBTRACT H-O0SUMATASUU FROM LPU76 OF BIGASU-O
               ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
           END-IF.
           ADD H-O0SUIMANFU   TO ANF76     OF BIGASU-O.
           ADD H-O0RECIMURE2  TO ANF76     OF BIGASU-O.
      *------------------------------------------------------------
       E520-NUOVE-2.
           ADD H-O0SUIMINU   TO   ASUEGAUT OF BIGASU-O.
           ADD H-O0RECIMURE1 TO   ASUEGAUT OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO   ASUEGAUT OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUEGAUT OF BIGASU-O.
           ADD H-O0SUMATASUU TO   MATERNEG OF BIGASU-O.
           ADD H-O0SUIMANFU  TO   ANFASUEG OF BIGASU-O.
           ADD H-O0RECIMURE2 TO   ANFASUEG OF BIGASU-O.
      *
           ADD WK-DEBITO     TO   DEBITIEG OF BIGASU-O.
           ADD H-O0SUIMANFU  TO   DEBITIEG OF BIGASU-O.
      *------------------------------------------------------------
       E530-NUOVE-3.
           IF H-O0SUEDIL = "S"
               ADD H-O0SUIMASUU TO ASUEDIL   OF BIGASU-O
               ADD H-O0SUMATASUU TO MATERNEDIL OF BIGASU-O
           ELSE
               ADD H-O0SUIMASUU TO ASU       OF BIGASU-O
               ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O
           END-IF.
      *
           ADD H-O0SUIMINU    TO   ASUEGCOF  OF BIGASU-O.
           ADD H-O0RECIMURE1  TO   ASUEGCOF  OF BIGASU-O.
      *    ADD H-O0RECIMURE3  TO   ASUEGCOF  OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUEGCOF OF BIGASU-O.
           SUBTRACT H-O0SUIMASUU FROM ASUEGCOF OF BIGASU-O.
      *
           IF H-O0SUEDIL = "S"
               ADD H-O0SUIMANFU TO ANFEDIL OF BIGASU-O
               ADD H-O0RECIMURE2 TO ANFEDIL OF BIGASU-O
           ELSE
               ADD H-O0SUIMANFU TO ANFASU OF BIGASU-O
               ADD H-O0RECIMURE2 TO ANFASU OF BIGASU-O
           END-IF.
      *
           ADD WK-DEBITO  TO DEBITI OF BIGASU-O.
           ADD H-O0SUIMANFU TO DEBITI OF BIGASU-O.
      *------------------------------------------------------------
       E535-REGIO-3.
           ADD H-O0SUIMASUU TO ASUREG    OF BIGASU-O.
           COMPUTE MATREG   OF BIGASU-O =
                   MATREG   OF BIGASU-O +
                             (H-O0SUMATASUU / 2).
           COMPUTE MATREGEG OF BIGASU-O =
                   MATREGEG OF BIGASU-O +
                             (H-O0SUMATASUU / 2).
      *
           ADD H-O0SUIMINU TO  ASUREGEG  OF BIGASU-O.
           ADD H-O0RECIMURE1 TO ASUREGEG OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO ASUREGEG OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUREGEG OF BIGASU-O.
           SUBTRACT H-O0SUIMASUU FROM ASUREGEG OF BIGASU-O.
      *
           ADD H-O0SUIMANFU TO ANFREG OF BIGASU-O.
           ADD H-O0RECIMURE2 TO ANFREG OF BIGASU-O.
      *
           IF H-R2SINO = "SI"
               ADD WK-DEBITO  TO DEBITI OF BIGASU-O
               ADD H-O0SUIMANFU TO DEBITI OF BIGASU-O
           ELSE
               ADD WK-DEBITO  TO DEBASU OF BIGASU-O
               ADD H-O0SUIMANFU TO DEBASU OF BIGASU-O
           END-IF.
      *------------------------------------------------------------
       E540-NUOVE-4.
           ADD H-O0SUIMINU TO  ASUFORM1  OF BIGASU-O.
           ADD H-O0RECIMURE1 TO ASUFORM1 OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO ASUFORM1 OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUFORM1 OF BIGASU-O.
           ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O.
           ADD H-O0SUIMANFU TO  ANFFORM1  OF BIGASU-O.
           ADD H-O0RECIMURE2 TO ANFFORM1  OF BIGASU-O.
      *
           ADD WK-DEBITO   TO   DEBITI    OF BIGASU-O.
           ADD H-O0SUIMANFU TO  DEBITI    OF BIGASU-O.
      *------------------------------------------------------------
       E550-NUOVE-5.
           ADD H-O0SUIMINU TO  ASUFORM2  OF BIGASU-O.
           ADD H-O0RECIMURE1 TO ASUFORM2 OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO ASUFORM2 OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUFORM2 OF BIGASU-O.
           ADD H-O0SUMATASUU TO MATERNITA OF BIGASU-O.
           ADD H-O0SUIMANFU TO ANFFORM2  OF BIGASU-O.
           ADD H-O0RECIMURE2 TO ANFFORM2 OF BIGASU-O.
      *
           ADD WK-DEBITO  TO   DEBITI    OF BIGASU-O.
           ADD H-O0SUIMANFU TO DEBITI    OF BIGASU-O.
      *------------------------------------------------------------
       E560-REGIO-6.
           ADD H-O0SUIMINU TO  ASUREG  OF BIGASU-O.
           ADD H-O0RECIMURE1 TO ASUREG OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO ASUREG OF BIGASU-O.
           ADD H-O0SUMATASUU TO MATREG OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUREG OF BIGASU-O.
      *
           ADD H-O0SUIMANFU TO ANFREG OF BIGASU-O.
           ADD H-O0RECIMURE2 TO ANFREG OF BIGASU-O.
      *
           IF H-R2SINO = "SI"
               ADD WK-DEBITO  TO DEBITI OF BIGASU-O
               ADD H-O0SUIMANFU TO DEBITI OF BIGASU-O
           ELSE
               ADD WK-DEBITO  TO DEBASU OF BIGASU-O
               ADD H-O0SUIMANFU TO DEBASU OF BIGASU-O
           END-IF.
      *------------------------------------------------------------
       E570-50FO-50REG.
           ADD H-O0SUIMASUU TO ASUREG    OF BIGASU-O.
      *    COMPUTE MEZZO-ASU = (H-O0SUMATASUU / 2).
           COMPUTE MATREG   OF BIGASU-O =
                   MATREG   OF BIGASU-O +
                   H-O0SUMATASUU.
      *            MEZZO-ASU.
           COMPUTE MATREGEG OF BIGASU-O =
                   MATREGEG OF BIGASU-O +
      *            (H-O0SUMATASUU - MEZZO-ASU).
                   H-O0SUMATASUU.
      *
           ADD H-O0SUIMINU TO  ASUREGEG  OF BIGASU-O.
           ADD H-O0RECIMURE1 TO ASUREGEG OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO ASUREGEG OF BIGASU-O.
      * ho0sumatasuu x 2 perchè devo sottrarre importo intero maternità
           SUBTRACT H-O0SUMATASUU FROM ASUREGEG OF BIGASU-O.
           SUBTRACT H-O0SUMATASUU FROM ASUREGEG OF BIGASU-O.
           SUBTRACT H-O0SUIMASUU FROM ASUREGEG OF BIGASU-O.
      *
           COMPUTE MEZZO-ANF = (H-O0SUIMANFU + H-O0RECIMURE2) / 2.
           COMPUTE ANFREG   OF BIGASU-O =
                   ANFREG   OF BIGASU-O +
                   MEZZO-ANF.
           COMPUTE ANFREGEG OF BIGASU-O =
                   ANFREGEG OF BIGASU-O +
                   (H-O0SUIMANFU + H-O0RECIMURE2) -
                   MEZZO-ANF.
      *
           COMPUTE DEBITI OF BIGASU-O =
                   DEBITI OF BIGASU-O +
                   (WK-DEBITO / 2).
           COMPUTE DEBITI OF BIGASU-O =
                   DEBITI OF BIGASU-O +
                   (H-O0SUIMANFU / 2).
      *
           COMPUTE MEZZO-ASU    = WK-DEBITO / 2.
           COMPUTE MEZZO-ANF    = H-O0SUIMANFU / 2.
           COMPUTE DEBASU OF BIGASU-O =
                   DEBASU OF BIGASU-O +
                   (WK-DEBITO - MEZZO-ASU).
           COMPUTE DEBASU OF BIGASU-O =
                   DEBASU OF BIGASU-O +
                   (H-O0SUIMANFU - MEZZO-ANF).
      *------------------------------------------------------------
       E580-40FO-60REG.
      * fsof 40%
           ADD H-O0SUIMASUU TO ASUREG    OF BIGASU-O.
           ADD H-O0SUMATASUU TO MATREG    OF BIGASU-O.
           ADD H-O0SUANFASUU TO ANFREG    OF BIGASU-O.
      * regione 60%
      * maternità
           COMPUTE MATREGEG OF BIGASU-O =
                   MATREGEG OF BIGASU-O +
                   (H-O0SUMATASUU * 1,5).
      * assegno asu
           ADD H-O0SUIMINU   TO ASUREGEG  OF BIGASU-O.
           ADD H-O0RECIMURE1 TO ASUREGEG OF BIGASU-O.
      *    ADD H-O0RECIMURE3 TO ASUREGEG OF BIGASU-O.
      * ho0sumatasuu x 2 perchè devo sottrarre importo intero maternità
           SUBTRACT H-O0SUMATASUU FROM ASUREGEG OF BIGASU-O.
           COMPUTE ASUREGEG OF BIGASU-O =
                   ASUREGEG OF BIGASU-O -
                   (H-O0SUMATASUU * 1,5).
           SUBTRACT H-O0SUIMASUU FROM ASUREGEG OF BIGASU-O.
      *
           ADD H-O0SUIMANFU  TO ANFREGEG OF BIGASU-O.
           ADD H-O0RECIMURE2 TO ANFREGEG OF BIGASU-O.
           SUBTRACT H-O0SUANFASUU FROM ANFREGEG OF BIGASU-O.
      *
           COMPUTE DEBITO40X100 = WK-DEBITO * 0,4.
           COMPUTE ANF40X100    = H-O0SUIMANFU * 0,4.
      *
           COMPUTE DEBITI OF BIGASU-O =
                   DEBITI OF BIGASU-O +
                   DEBITO40X100.
           COMPUTE DEBITI OF BIGASU-O =
                   DEBITI OF BIGASU-O +
                   ANF40X100.
      *
           COMPUTE DEBASU OF BIGASU-O =
                   DEBASU OF BIGASU-O +
                   WK-DEBITO -
                   DEBITO40X100.
           COMPUTE DEBASU OF BIGASU-O =
                   DEBASU OF BIGASU-O +
                   H-O0SUIMANFU -
                   ANF40X100.
      *------------------------------------------------------------
       E60-BIGLPU.
      * imposta data inizio e fine elaborazione per b.c. 730
           IF H-O0DCODTULSP < DAL-730
               MOVE H-O0DCODTULSP TO DAL-730
           END-IF.
           IF H-O0DCODTULSP > AL-730
               MOVE H-O0DCODTULSP TO AL-730
           END-IF.
      *
           COMPUTE WK-DEBITO = H-O0PUIMINU  -
                               H-O0PUIRPEFU -
                               H-O0PUTRASIND -
                               H-O0PUADDIZR -
                               H-O0PUADDIZC -
                               H-O0PUCONG730 -
                               H-O0PUCONGFIS.
           IF H-O0RECIMURE3 > 0
               COMPUTE WK-DEBITO = WK-DEBITO - H-O0RECIMURE3
           END-IF.
           IF H-O0PUTIPPROG = "I"
               ADD H-O0PUIMINU TO LPU280I OF BIGLPU-O
               ADD H-O0RECIMURE1 TO LPU280I OF BIGLPU-O
      *        ADD H-O0RECIMURE3 TO LPU280I OF BIGLPU-O
               ADD H-O0PUIMANFU TO ANF280I OF BIGLPU-O
               ADD H-O0RECIMURE2 TO ANF280I OF BIGLPU-O
           ELSE
               ADD H-O0PUIMINU TO LPU280R OF BIGLPU-O
               ADD H-O0RECIMURE1 TO LPU280R OF BIGLPU-O
      *        ADD H-O0RECIMURE3 TO LPU280R OF BIGLPU-O
               ADD H-O0PUIMANFU TO ANF280R OF BIGLPU-O
               ADD H-O0RECIMURE2 TO ANF280R OF BIGLPU-O
           END-IF.
           ADD WK-DEBITO  TO DEBITI OF BIGLPU-O.
           ADD H-O0PUIMANFU TO DEBITI OF BIGLPU-O.
      * recuperi
           ADD H-O0RECIMURE1 TO RECU    OF BIGLPU-O.
           ADD H-O0RECIMURE2 TO RECU    OF BIGLPU-O.
           ADD H-O0RECIMURE3 TO RECU    OF BIGLPU-O.
      * gestione recuperi
           IF H-O0RECIMURE1 > 0
           OR H-O0RECIMURE2 > 0
           OR H-O0RECIMURE3 > 0
               PERFORM CARICA-TABELLA-RECUPERI
           END-IF.
      * irpef
           ADD H-O0PUIRPEFU TO IRPEF    OF BIGLPU-O.
           SUBTRACT H-O0FAPIMPNET FROM IRPEF OF BIGLPU-O.
           ADD H-O0FAPIMPNET TO IRPEFS  OF BIGLPU-O.
      * addizionali
           ADD H-O0PUADDIZR TO ADDREG   OF BIGLPU-O.
           ADD H-O0PUADDIZC TO ADDCOM   OF BIGLPU-O.
      * conguaglio fiscale
           IF H-O0PUCONGFIS > 0
               ADD H-O0PUCONGFIS TO CONGDEB OF BIGLPU-O
           ELSE
               COMPUTE CONGRIMB OF BIGLPU-O =
                       CONGRIMB OF BIGLPU-O +
                           H-O0PUCONGFIS * (-1)
           END-IF.
      * 17072020
      * conguaglio 730
           IF H-O0PUCONG730 > 0
               ADD H-O0PUCONG730 TO DEB730 OF BIGLPU-O
           ELSE
               COMPUTE RIMB730 OF BIGLPU-O =
                       RIMB730 OF BIGLPU-O +
                           H-O0PUCONG730 * (-1)
           END-IF.
      * trattenute sindacali
160125*fatte correzioni su gestione sindacati
           IF H-O0PUTRASIND > 0
               ADD W-SPERIS    TO RECSPE OF RIGASPE-O
               ADD W-IVA       TO RECIVA OF RIGAIVA-O
               COMPUTE TS-NETTA = H-O0PUTRASIND - (W-SPERIS + W-IVA)
160125*        IF H-O0PUTSCONF = 10
160125*        AND H-O0PUTSCAT > 01
      **SSS correttivo per sindacati da 10 03 in poi
160125*            ADD H-O0PUTRASIND TO EL-IMP-SIND-C(90)
160125*            ADD H-O0PUTRASIND TO EL-IMP-SIND-C(H-O0PUTSCAT + 98)
160125*            IF H-PDATAELABO < 20120101
      **               ADD H-O0PUTRASIND TO EL-IMP-SIND-A(90)
160125*                ADD H-O0PUTRASIND
160125*                    TO EL-IMP-SIND-A(H-O0PUTSCAT + 98)
      **               ADD TS-NETTA   TO EL-IMP-SIND-D(90)
160125*                ADD TS-NETTA
160125*                    TO EL-IMP-SIND-D(H-O0PUTSCAT + 98)
160125*            END-IF
      * SSS-F
160125*        ELSE
160125*            ADD H-O0PUTRASIND TO EL-IMP-SIND-C(H-O0PUTSCONF)
160125*            IF H-PDATAELABO < 20120101
160125*                ADD H-O0PUTRASIND TO EL-IMP-SIND-A(H-O0PUTSCONF)
160125*                ADD TS-NETTA   TO EL-IMP-SIND-D(H-O0PUTSCONF)
160125*            END-IF
160125*        END-IF

160125         MOVE 1  TO IND-SIND
160125         PERFORM UNTIL IND-SIND > 400
160125           IF H-O0PUTSCONF  = EL-COD-SIND(IND-SIND) AND
160125              H-O0PUTSCAT   = EL-CAT-SIND(IND-SIND)
160125                ADD H-O0PUTRASIND TO EL-IMP-SIND-C(IND-SIND)
160125                IF H-PDATAELABO < 20120101
160125                    ADD H-O0PUTRASIND  TO EL-IMP-SIND-A(IND-SIND)
160125                    ADD TS-NETTA       TO EL-IMP-SIND-D(IND-SIND)
160125                END-IF
160125           ELSE
160125             add 1    to ind-sind
160125           END-IF
160125         END-PERFORM

               ADD H-O0PUTRASIND TO TOTALE-CONT
               IF H-PDATAELABO < 20120101
                   ADD H-O0PUTRASIND TO TOTALE-ACCR
                   ADD TS-NETTA   TO TOTALE-DEBI
               END-IF
           END-IF.
       E60-EX.  exit.
      *
       E70-BIGSX.
      * imposta data inizio e fine elaborazione per b.c. 730
           IF H-O0DCODTULSP < DAL-730
               MOVE H-O0DCODTULSP TO DAL-730
           END-IF.
           IF H-O0DCODTULSP > AL-730
               MOVE H-O0DCODTULSP TO AL-730
           END-IF.
      * anticipazione
           MOVE H-O0SXIMRINU TO WK-RINUNCIA.
           MOVE ZEROES TO WK-INCENTIVO.
      *
           COMPUTE WK-DEBITO = H-O0SXIMINU  +
                               H-O0SXIMRINU -
                               H-O0SXIRPEFU -
                               H-O0SXTRASIND -
                               H-O0SXADDIZR -
                               H-O0SXADDIZC -
                               H-O0SXCONG730 -
                               H-O0SXCONGFIS -
                               H-O0SXADDIZRR -
                               H-O0SXADDIZRC.
           IF H-O0RECIMURE3 > 0
               COMPUTE WK-DEBITO = WK-DEBITO - H-O0RECIMURE3
           END-IF.
      *
           MOVE 1 TO IND-SX.
           PERFORM UNTIL IND-SX > 160
               IF H-O0SXCODIND = EL-COD-SX(IND-SX)
               AND H-O0SXREGIND = EL-REG-SX(IND-SX)
               AND H-O0SXANNIND = EL-ANNO-SX(IND-SX)
                   PERFORM E71-BIGSX-CONTINUA THRU E71-EX
                   MOVE 160 TO IND-SX
               END-IF
               ADD 1 TO IND-SX
           END-PERFORM.
      *    perform  varying  NDR1  from  1  by  1
      *             until NDR1            >  160
      *       IF EL-IMP-SX-A(NDR1) = 0
      *           MOVE SPACES            TO EL-ALF-SX-A(NDR1)
      *           MOVE SPACES            TO EL-NUM-SX-A(NDR1)
      *       END-IF
      *       IF EL-IMP-SX-D(NDR1) = 0
      *           MOVE SPACES            TO EL-ALF-SX-D(NDR1)
      *           MOVE SPACES            TO EL-NUM-SX-D(NDR1)
      *       END-IF
      *    end-perform.
       E70-EX.  exit.
      *------------------------------------------------------------
       E71-BIGSX-CONTINUA.
      *------------------------------------------------------------
           ADD H-O0SXIMINU TO EL-IMP-SX-D(IND-SX).
           ADD H-O0RECIMURE1 TO EL-IMP-SX-D(IND-SX).
      *    ADD H-O0RECIMURE3 TO EL-IMP-SX-D(IND-SX).
           IF H-O0SXCODIND = "SSIS"
               ADD H-O0FIMPPAGA1 TO EL-IMP-SX-D(43)
               SUBTRACT H-O0FIMPPAGA1 FROM EL-IMP-SX-D(IND-SX)
           END-IF.
           EVALUATE EL-FINANZ-SX(IND-SX)
             WHEN "F"
               ADD WK-DEBITO  TO EL-IMP-SX-A(155)
               ADD H-O0SXIMANFU TO EL-IMP-SX-A(155)
               IF H-O0SXCODIND = "FTMD"
               OR H-O0SXCODIND = "FTAD"
               OR H-O0SXCODIND = "FTSO"
270122*        OR H-O0SXCODIND = "FTCG"
               OR H-O0SXCODIND = "FTPL"
               OR H-O0SXCODIND = "FTAI"
                   MOVE "DEB.PREST.INTEGR.ART5 C1 LETT.A DI 95269/16"
                                    TO EL-VOCE-SX(155)
                   MOVE "GVR"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "121"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
260324         IF H-O0SXCODIND = "FSAI"
270324         OR H-O0SXCODIND = "FSAD"
260324             MOVE "DEB.PREST.INTEGR.A6C1 LETT.B DI 103594/19  "
260324                              TO EL-VOCE-SX(155)
260324             MOVE "SAR"       TO EL-ALF-SX-A(155)
260324             MOVE "10"        TO W-CONTO(1:2)
260324             MOVE "121"       TO W-CONTO(4:3)
260324             MOVE W-CONTO     TO EL-NUM-SX-A(155)
260324         END-IF
100424         IF H-O0SXCODIND = "FTCI"
100424             MOVE "DEB.PREST.INTEGR. CIRCOLARE 32 07/02/2024  "
100424                              TO EL-VOCE-SX(155)
240424             MOVE "GVR"       TO EL-ALF-SX-A(155)
240424             MOVE "10"        TO W-CONTO(1:2)
240424             MOVE "130"       TO W-CONTO(4:3)
100424             MOVE W-CONTO     TO EL-NUM-SX-A(155)
100424*            MOVE 'GVR'       TO EL-ALF-SX-D(IND-SX)
100424*            MOVE '30/245'    TO EL-NUM-SX-D(IND-SX)
100424         END-IF
270122*inizio mod
               IF H-O0SXCODIND    = "FTCG"
040222           PERFORM LEGGI-TAB  THRU EX-LEGGI-TAB

030222*          IF H-WFRDETPVP = 'NC'
030222           IF H-SSTALFL2  = 'FTCA'
090222*                       or  'FTCB'
      * nuovo conto Alitalia 146/21
                   MOVE "DEB.PREST.INTEGR.ART10 C2 DL 146/21        "
                                    TO EL-VOCE-SX(155)
                   MOVE "GVR"       TO EL-ALF-SX-A(155)
040222             MOVE "10"        TO W-CONTO(1:2)
040222             MOVE "130"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)

040222             MOVE 'GVR'       TO EL-ALF-SX-D(IND-SX)
040222             MOVE '30/235'    TO EL-NUM-SX-D(IND-SX)
                 ELSE
                   MOVE "DEB.PREST.INTEGR.ART5 C1 LETT.A DI 95269/16"
                                    TO EL-VOCE-SX(155)
                   MOVE "GVR"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "121"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
                 END-IF
               END-IF
270122*fine mod
               IF H-O0SXCODIND = "FTCD"
               OR H-O0SXCODIND = "FTCC"
                   MOVE "DEB.PREST.INTEGR. L. 178/2020 - DL 41/2021 "
                                    TO EL-VOCE-SX(155)
                   MOVE "GVR"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "127"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
300125         IF H-O0SXCODIND = "FTCG" or "FTCD"
300125            IF H-O0SXIMANFT > 0
300125             MOVE "DEB.PREST.INTEGR.ART5 C1 95269/16 + INT."
300125                              TO EL-VOCE-SX(155)
300125             MOVE "GVR"       TO EL-ALF-SX-A(155)
300125             MOVE "10"        TO W-CONTO(1:2)
300125             MOVE "121"       TO W-CONTO(4:3)
300125             MOVE W-CONTO     TO EL-NUM-SX-A(155)
300125             MOVE "FSTA INTEGRAZIONE CIGS + INTERESSI      "
300125                              TO EL-VOCE-SX(IND-SX)
300125             MOVE 'GVR'       TO EL-ALF-SX-D(IND-SX)
300125             MOVE '30/121'    TO EL-NUM-SX-D(IND-SX)
300125            END-IF
300125         END-IF
               IF H-O0SXCODIND = "TRAC"
               OR H-O0SXCODIND = "TRAS"
               OR H-O0SXCODIND = "TRAD"
               OR H-O0SXCODIND = "TRAP"
               OR H-O0SXCODIND = "TRAF"
                   MOVE "DEBITI PER LAVORATORI TRASPORTO AEREO    "
                                    TO EL-VOCE-SX(155)
                   MOVE "GVR"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "130"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "CRED"
                   MOVE "DEBITI PER ASSEGNO EMERG. FONDO CREDITO  "
                                    TO EL-VOCE-SX(155)
                   MOVE "FBR"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "133"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "SELA"
               OR H-O0SXCODIND = "SEGS"
               OR H-O0SXCODIND = "SEIM"
                   MOVE "DEBITI PER UNA TANTUM SISMA EMILIA       "
                                    TO EL-VOCE-SX(155)
                   MOVE "GPA"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "029"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "SICI"
                   MOVE "DEBITI PER UNA TANTUM SISMA CENTRO ITALIA"
                                    TO EL-VOCE-SX(155)
                   MOVE "GPA"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "029"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "CRPM"
                   MOVE "DEBITI UNA TANTUM CROLLO PONTE MORANDI   "
                                    TO EL-VOCE-SX(155)
                   MOVE "GPA"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "029"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "CE45"
                   MOVE "DEBITI UNA TANTUM CHIUSURA E45           "
                                    TO EL-VOCE-SX(155)
                   MOVE "GPA"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "029"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "EELA"
                   MOVE "DEBITI EMERGENZA EPIDEM. LAV. AUTONOMI   "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "160"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "EE27"
               OR H-O0SXCODIND = "EE28"
               OR H-O0SXCODIND = "EE29"
               OR H-O0SXCODIND = "EJ29"
               OR H-O0SXCODIND = "EK29"
               OR H-O0SXCODIND = "EE30"
               OR H-O0SXCODIND = "EE38"
               OR H-O0SXCODIND = "EJ38"
               OR H-O0SXCODIND = "EK38"
               OR H-O0SXCODIND = "EE05"
               OR H-O0SXCODIND = "EJ05"
               OR H-O0SXCODIND = "EK05"
               OR H-O0SXCODIND = "EE10"
               OR H-O0SXCODIND = "EJ10"
               OR H-O0SXCODIND = "EK10"
               OR H-O0SXCODIND = "EEZR"
               OR H-O0SXCODIND = "EW29"
               OR H-O0SXCODIND = "EW38"
               OR H-O0SXCODIND = "EW2A"
               OR H-O0SXCODIND = "EW2B"
               OR H-O0SXCODIND = "EW2C"
               OR H-O0SXCODIND = "EW2D"
               OR H-O0SXCODIND = "EW05"
               OR H-O0SXCODIND = "EW10"
               OR H-O0SXCODIND = "EW13"
               OR H-O0SXCODIND = "EY29"
               OR H-O0SXCODIND = "EY38"
               OR H-O0SXCODIND = "EY2A"
               OR H-O0SXCODIND = "EY2B"
               OR H-O0SXCODIND = "EY2C"
               OR H-O0SXCODIND = "EY2D"
               OR H-O0SXCODIND = "EY05"
               OR H-O0SXCODIND = "EY10"
               OR H-O0SXCODIND = "EY13"
               OR H-O0SXCODIND = "EY3A"
               OR H-O0SXCODIND = "EX29"
               OR H-O0SXCODIND = "EX38"
               OR H-O0SXCODIND = "EX2A"
               OR H-O0SXCODIND = "EX2B"
               OR H-O0SXCODIND = "EX2C"
               OR H-O0SXCODIND = "EX2D"
               OR H-O0SXCODIND = "EX05"
               OR H-O0SXCODIND = "EX10"
               OR H-O0SXCODIND = "EX13"
               OR H-O0SXCODIND = "EX3A"
               OR H-O0SXCODIND = "EX87"
               OR H-O0SXCODIND = "EX88"
                   MOVE "DEB.V/BENEF.IND.U.T-D.L.18/20 D.L. 84/20 "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "250"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
211021         IF H-O0SXCODIND = "EX89"
                   MOVE "DEB.V/BENEF.IND. L.178/20                "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "273"       TO W-CONTO(4:3)
                   MOVE W-CONTO    TO EL-NUM-SX-A(155)
               END-IF
130422         IF H-O0SXCODIND = "E092"
                   MOVE "DEB.V/BENEF.IND. L.16/21                 "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "247"       TO W-CONTO(4:3)
                   MOVE W-CONTO    TO EL-NUM-SX-A(155)
190423             MOVE "CRED V/BENEF.IND. L.16/21                "
                                    TO EL-VOCE-SX(160)
                   MOVE "GAU"       TO EL-ALF-SX-D(160)
                   MOVE "30"        TO W-CONTO(1:2)
                   MOVE "247"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
080722         IF H-O0SXCODIND = "E109" or "E110" or "E112" or "E107"
231122             MOVE "DEB.V/BENEF.IND.U.T-ART.32 C.8-18 DL50/22"
                                    TO EL-VOCE-SX(155)
                   MOVE "GAZ"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "152"       TO W-CONTO(4:3)
                   MOVE W-CONTO    TO EL-NUM-SX-A(155)
                   MOVE "CRED V/BENEF.IND.U.T-ART.32 C.8-16 DL50/22"
                                    TO EL-VOCE-SX(160)
                   MOVE "GAZ"       TO EL-ALF-SX-D(160)
                   MOVE "30"        TO W-CONTO(1:2)
                   MOVE "152"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
130123         IF H-O0SXCODIND = "E159" or "E160" or "E162" or "E157"
                   MOVE "DEB.V/BENEF.IND.U.T-ART.19 C9-15 DL144/22"
                                    TO EL-VOCE-SX(155)
                   MOVE "GAZ"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "152"       TO W-CONTO(4:3)
                   MOVE W-CONTO    TO EL-NUM-SX-A(155)
                   MOVE "CRED V/BENEF.IND.U.T-ART.19 C9-15 DL144/22"
                                    TO EL-VOCE-SX(160)
                   MOVE "GAZ"       TO EL-ALF-SX-D(160)
                   MOVE "30"        TO W-CONTO(1:2)
                   MOVE "252"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "EE2A"
               OR H-O0SXCODIND = "EJ2A"
               OR H-O0SXCODIND = "EK2A"
               OR H-O0SXCODIND = "EE2B"
               OR H-O0SXCODIND = "EJ2B"
               OR H-O0SXCODIND = "EK2B"
               OR H-O0SXCODIND = "EE2C"
               OR H-O0SXCODIND = "EJ2C"
               OR H-O0SXCODIND = "EK2C"
               OR H-O0SXCODIND = "EE2D"
               OR H-O0SXCODIND = "EJ2D"
               OR H-O0SXCODIND = "EK2D"
               OR H-O0SXCODIND = "EE13"
               OR H-O0SXCODIND = "EJ13"
               OR H-O0SXCODIND = "EK13"
               OR H-O0SXCODIND = "EE22"
               OR H-O0SXCODIND = "EEMA"
                   MOVE "DEB.V/BENEF.IND.U.T-D.I.10/20            "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "266"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "DL76"
                   MOVE "DEBITI INDENNITA TIROCINIO GIOVANI DL 76 "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "200"       TO W-CONTO(4:3)
                   MOVE W-CONTO    TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "SOMM"
                   COMPUTE EL-IMP-SX-A(158) =
                           EL-IMP-SX-A(158) +
                           (WK-DEBITO / 2 )
                   COMPUTE EL-IMP-SX-A(155) =
                           EL-IMP-SX-A(155) -
                           (WK-DEBITO / 2 )
               END-IF
               IF H-O0SXCODIND = "COIP"
                   MOVE "DEBITI PER CONVENZIONE INDENNITA PESCA   "
                                    TO EL-VOCE-SX(155)
                   MOVE "GPA"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "029"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
               IF H-O0SXCODIND = "BRIO"
                   MOVE "DEBITI PER BONUS RIOCCUPAZIONE           "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "223"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
               END-IF
250124         IF H-O0SXCODIND =  "APAF"
                   MOVE "DEBITI PER AZIONI DI POLITICA ATTIVA FSOF"
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "281"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
110624         IF H-O0SXCODIND =  "TISC"
210624                        or  "TISM"
                   MOVE "DEBITO AZIONI POL. ATTIVA DLGS 148/2015 "
                                    TO EL-VOCE-SX(155)
                   MOVE "GAU"       TO EL-ALF-SX-A(155)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "281"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(155)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
             WHEN "R"
               ADD WK-DEBITO  TO EL-IMP-SX-A(156)
               ADD H-O0SXIMANFU TO EL-IMP-SX-A(156)
               ADD H-O0SXIMANFU TO EL-IMP-SX-D(160)
                                   EL-IMP-SX-A(160)
               ADD H-O0SXIMINU TO EL-IMP-SX-D(160)
                                 EL-IMP-SX-A(160)
               ADD H-O0RECIMURE1 TO EL-IMP-SX-D(160)
                                 EL-IMP-SX-A(160)
      *        ADD H-O0RECIMURE3 TO EL-IMP-SX-D(60)
      *                          EL-IMP-SX-A(60)
               IF H-O0SXCODIND = "SSEP"
                   ADD H-O0RECIMURE2 TO EL-IMP-SX-D(160)
                                        EL-IMP-SX-A(160)
               END-IF
               IF H-O0SXCODIND = "TYGM"
               OR H-O0SXCODIND = "TYAD"
140325         OR H-O0SXCODIND = "TYGP"
                   MOVE "DEBITI INDENNITA TIROCINIO GIOVANI       "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "195"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CREDITO V/REGIONI INDENN. DI TIROCINIO   "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "195"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "195"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "TYRG"
                   MOVE "DEBITI INDENNITA TIROCINIO GIOVANI       "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "232"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CREDITO V/REGIONI INDENN. DI TIROCINIO   "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "232"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "232"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "TYBL"
                   MOVE "DEBITI PER BORSE LAV. OVER 30 REG. MARCHE"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "279"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CREDITO V/REGIONI BORSE LAVORO OVER 30   "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "279"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "279"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "TYCR"
                   MOVE "DEBITI PER TIROCINIO CRATERE REG. MARCHE "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "280"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CREDITO V/REGIONI TIROCINIO CRATERE MARCHE"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "280"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "280"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "RATM"
               OR H-O0SXCODIND = "RATA"
                   MOVE "DEB.V/LAV.REDDITO ATTIVAZ. C/PAT DLGS 28/13"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "196"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/PROV. REDDITO ATTIV.LAV. D.LGS. 28/13"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "196"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "196"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "TEIG"
                   MOVE "DEB.V/LAV.GESIP TRATT.INTEGR. C/CPALERMO   "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "197"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/C.PALERMO ON.TRATT.INTEGR.GESIP      "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "197"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "197"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
140125*la gestione di apa* è corretta: verificata anche con Carla Boto
               IF H-O0SXCODIND = "APAR"
               OR H-O0SXCODIND = "APA2"
160125*        OR H-O0SXCODIND = "APA3"
241122         OR H-O0SXCODIND = "APA4"
                   MOVE "DEBITI PER AZ. POLITICA ATTIVA REG/PROV"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "282"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG./PROV. AZIONI POLITICA ATTIVA    "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "282"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "282"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "DLIA"
                   MOVE "DEBITI PER DOTE LAVORO INCLUSIONE ATTIVA"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "283"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG./PROV. DOTE LAVORO INCLUS. ATTIVA"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "283"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "283"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
281123         IF H-O0SXCODIND = "DLI2"
                   MOVE "DEBITI PER DOTE LAVORO INCLUS. ATT. CALABRIA"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "333"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG. DOTE LAVORO INCLUS.ATT. CALABRIA"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "35"        TO W-CONTO(1:2)
                   MOVE "333"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "333"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "PORM"
                   MOVE "DEBITI PER POR Marche FSE 2014-2010"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "285"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG./PROV. DOTE LAVORO INCLUS. ATTIVA"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "285"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "285"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
100522         IF H-O0SXCODIND = "POR2"
                   MOVE "DEBITI PER POR Marche FSE 2014-2010"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "285"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG./PROV. DOTE LAVORO INCLUS. ATTIVA"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "285"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "285"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
251023         IF H-O0SXCODIND = "POR3"
                   MOVE "DEBITI PER POR Marche FSE 2021-2027"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG. MARCHE BORSE RICERCA 2021-2027  "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "35"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
251023         IF H-O0SXCODIND = "POR4"
                   MOVE "DEBITI PER POR Marche FSE 2021-2027"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG. MARCHE BORSE LAVORO 2021-2027   "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "35"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
251023         IF H-O0SXCODIND = "POR5"
                   MOVE "DEBITI PER POR Marche FSE 2021-2027"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG. MARCHE BORSE TEMATICHE 2021-2027"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "35"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
251023         IF H-O0SXCODIND = "POR6"
                   MOVE "DEBITI PER POR Marche FSE 2021-2027"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED V/REG. MARCHE TIROC.EXTRACURR.2021-2027"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "35"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "331"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "TIPO"
                   MOVE "DEB.V/BENEF.INDENN.TIROCINIO C/REG.FVG   "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "199"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED.V/REG.FVG ONERI INDENN. TIROCINIO   "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "199"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "199"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "SRPT"
                   MOVE "DEBITI BENEFICIARI SUSS. REGIONE PUGLIA  "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "168"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CREDITO V/REG.PUGLIA: SUSS. STRAORD.     "
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "168"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "168"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "SSEP"
                   MOVE "DEB.SUSS.STR. ANF FINANZ.REG.SICILIA LRS 9/13"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "169"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "RIMB.DA REG.SICILIA SUSS.STR.ANF LRS 9/13"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "169"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "169"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
               IF H-O0SXCODIND = "SSRO"
                   MOVE "DEB.V/TIR.SUSS.FINANZ.REG.MARCHE DGR 1110/14"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "170"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   MOVE "CRED.V/REG.MARCHE ONERI.SUSS.TIR. DGR 1110/14"
                                    TO EL-VOCE-SX(160)
                   MOVE "GPZ"       TO EL-ALF-SX-A(160)
                   MOVE "25"        TO W-CONTO(1:2)
                   MOVE "170"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(160)
                   MOVE "GPZ"       TO EL-ALF-SX-D(160)
                   MOVE "00"        TO W-CONTO(1:2)
                   MOVE "170"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-D(160)
               END-IF
250124         IF H-O0SXCODIND = "TGOL" or "APA5"
160125                        or "APA3"
280125                        or "APA6"
240624*                       or "TGOC"
150426                        or "TIRA"
150426                        or "PIAC"
                   MOVE "DEBITI PER AZIONI DI POLITICA ATTIVA FSOF"
                                    TO EL-VOCE-SX(156)
                   MOVE "GAU"       TO EL-ALF-SX-A(156)
                   MOVE "10"        TO W-CONTO(1:2)
                   MOVE "281"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
301024         IF H-O0SXCODIND = "TGOC"
                   MOVE "DEBITI AZIONI POL.ATT. CALABRIA PAR GOL3"
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "335"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
130325         IF H-O0SXCODIND = "TGOV"
                   MOVE "DEBITI AZIONI POL.ATT. VENETO PAR GOL   "
                                    TO EL-VOCE-SX(156)
220525             MOVE "GPZ"       TO EL-ALF-SX-A(156)
220525             MOVE "11"        TO W-CONTO(1:2)
220525             MOVE "340"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
030925         IF H-O0SXCODIND = "TGOS"
                   MOVE "DEBITI AZIONI POL.ATT. SICILIA PAR GOL  "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "342"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
131125         IF H-O0SXCODIND = "TGOP"
                   MOVE "DEBITI AZIONI POL.ATT. PIEMONTE PAR GOL "
                                    TO EL-VOCE-SX(156)
                   MOVE "GPZ"       TO EL-ALF-SX-A(156)
                   MOVE "11"        TO W-CONTO(1:2)
                   MOVE "345"       TO W-CONTO(4:3)
                   MOVE W-CONTO     TO EL-NUM-SX-A(156)
                   initialize          EL-ALF-SX-D(159)
                                       EL-ALF-SX-D(160)
                                       EL-NUM-SX-D(159)
                                       EL-NUM-SX-D(160)
                                       EL-ALF-SX-A(159)
                                       EL-ALF-SX-A(160)
                                       EL-NUM-SX-A(159)
                                       EL-NUM-SX-A(160)
                                       EL-99-SX-A(159)
                                       EL-99-SX-A(160)
                                       EL-IMP-SX-D(159)
                                       EL-IMP-SX-D(160)
                                       EL-IMP-SX-A(159)
                                       EL-IMP-SX-A(160)
               END-IF
             WHEN "E"
               ADD WK-DEBITO  TO EL-IMP-SX-A(157)
               ADD H-O0SXIMANFU TO EL-IMP-SX-A(157)
               ADD H-O0SXIMANFU TO EL-IMP-SX-D(159)
                                   EL-IMP-SX-A(159)
               ADD H-O0SXIMINU TO EL-IMP-SX-D(159)
                                 EL-IMP-SX-A(159)
               ADD H-O0RECIMURE1 TO EL-IMP-SX-D(159)
                                 EL-IMP-SX-A(159)
      *        ADD H-O0RECIMURE3 TO EL-IMP-SX-D(159)
      *                          EL-IMP-SX-A(159)
             WHEN OTHER
               ADD WK-DEBITO  TO EL-IMP-SX-A(157)
               ADD H-O0SXIMANFU TO EL-IMP-SX-A(157)
           END-EVALUATE.
      * LAV. SOMMINISTRATI
           IF H-O0SXCODIND = "SOMM"
               COMPUTE EL-IMP-SX-D(142)               =
                       EL-IMP-SX-D(142)               +
      *        ((H-O0SXIMINU + H-O0RECIMURE1 + H-O0RECIMURE3) / 2)
               ((H-O0SXIMINU + H-O0RECIMURE1) / 2)
               COMPUTE EL-IMP-SX-D(IND-SX) =
                       EL-IMP-SX-D(IND-SX) -
      *        ((H-O0SXIMINU + H-O0RECIMURE1 + H-O0RECIMURE3) / 2)
               ((H-O0SXIMINU + H-O0RECIMURE1) / 2)
           END-IF.
      * anf
           IF H-O0SXCODIND = "SSEP"
               ADD H-O0SXIMANFU TO EL-IMP-SX-D(IND-SX)
               ADD H-O0RECIMURE2 TO EL-IMP-SX-D(IND-SX)
           END-IF.
      *    EVALUATE EL-FINANZ-SX(IND-SX)
      *      WHEN "F"
      *        ADD H-O0SXIMANFU TO EL-IMP-SX-D(139)
      *        ADD H-O0RECIMURE2 TO EL-IMP-SX-D(139)
      *      WHEN "R"
      *        ADD H-O0SXIMANFU TO EL-IMP-SX-D(140)
      *        ADD H-O0RECIMURE2 TO EL-IMP-SX-D(140)
      *      WHEN "E"
      *        ADD H-O0SXIMANFU TO EL-IMP-SX-D(141)
      *        ADD H-O0RECIMURE2 TO EL-IMP-SX-D(141)
      *    END-EVALUATE.
      * anticipazione
           ADD WK-RINUNCIA TO EL-IMP-SX-D(144)
      * correttivo per FTMD h_sstrecrin contiene contrib. correlata
           IF H-O0SXIMRIN > 0
           AND (   H-O0SXCODIND = "FTMD"
                OR H-O0SXCODIND = "FTAD"
270324          OR H-O0SXCODIND = "FSAD"
                OR H-O0SXCODIND = "CRED"   )
               ADD H-O0SXRECRIN TO EL-IMP-SX-D(144)
           END-IF.
      * recuperi
           ADD H-O0RECIMURE1 TO EL-IMP-SX-A(145).
           ADD H-O0RECIMURE2 TO EL-IMP-SX-A(145).
           ADD H-O0RECIMURE3 TO EL-IMP-SX-A(145).
      * gestione recuperi
           IF H-O0RECIMURE1 > 0
           OR H-O0RECIMURE2 > 0
           OR H-O0RECIMURE3 > 0
               PERFORM CARICA-TABELLA-RECUPERI
           END-IF.
      * recuperi su anticipazione
      * correttivo per FTMD h_sstrecrin contiene contrib. correlata
           IF H-O0SXIMRIN > 0
           AND (   H-O0SXCODIND = "FTMD"
                OR H-O0SXCODIND = "FTAD"
270324          OR H-O0SXCODIND = "FSAD"
                OR H-O0SXCODIND = "CRED"   )
               ADD H-O0SXRECRIN TO EL-IMP-SX-A(146)
           END-IF.
      * irpef
           ADD H-O0SXIRPEFU TO EL-IMP-SX-A(147).
           SUBTRACT H-O0FAPIMPNET FROM EL-IMP-SX-A(147).
           ADD H-O0FAPIMPNET TO EL-IMP-SX-A(148).
      * conguaglio fiscale
           IF H-O0SXCONGFIS > 0
               ADD H-O0SXCONGFIS TO EL-IMP-SX-A(149)
           ELSE
               COMPUTE EL-IMP-SX-D(149)     =
                       EL-IMP-SX-D(149)     +
                           H-O0SXCONGFIS * (-1)
           END-IF.
      * addizionali
           ADD H-O0SXADDIZR TO EL-IMP-SX-A(150).
           ADD H-O0SXADDIZC TO EL-IMP-SX-A(151).
           ADD H-O0SXADDIZRR TO EL-IMP-SX-A(152).
           ADD H-O0SXADDIZRC TO EL-IMP-SX-A(153).
      * 17072020
      * conguaglio 730
           IF H-O0SXCONG730 > 0
               ADD H-O0SXCONG730 TO EL-IMP-SX-A(154)
           ELSE
               COMPUTE EL-IMP-SX-D(154)    =
                       EL-IMP-SX-D(154)    +
                           H-O0SXCONG730 * (-1)
           END-IF.
      * trattenute sindacali
160125*fatte correzioni su gestione sindacati
           IF H-O0SXTRASIND > 0
               ADD W-SPERIS    TO RECSPE OF RIGASPE-O
               ADD W-IVA       TO RECIVA OF RIGAIVA-O
               COMPUTE TS-NETTA = H-O0SXTRASIND - (W-SPERIS + W-IVA)
160125*        IF H-O0SXTSCONF = 10
160125*        AND H-O0SXTSCAT > 01
      **SSS correttivo per sindacati da 10 03 in poi
160125*            ADD H-O0SXTRASIND TO EL-IMP-SIND-C(90)
160125*            ADD H-O0SXTRASIND TO EL-IMP-SIND-C(H-O0SXTSCAT + 98)
160125*            IF H-PDATAELABO < 20120101
      **               ADD H-O0SXTRASIND TO EL-IMP-SIND-A(90)
160125*                ADD H-O0SXTRASIND
160125*                    TO EL-IMP-SIND-A(H-O0SXTSCAT + 98)
      **               ADD TS-NETTA   TO EL-IMP-SIND-D(90)
160125*                ADD TS-NETTA
160125*                    TO EL-IMP-SIND-D(H-O0SXTSCAT + 98)
160125*            END-IF
      * SSS-F
160125*        ELSE
160125*            ADD H-O0SXTRASIND TO EL-IMP-SIND-C(H-O0SXTSCONF)
160125*            IF H-PDATAELABO < 20120101
160125*                ADD H-O0SXTRASIND TO EL-IMP-SIND-A(H-O0SXTSCONF)
160125*                ADD TS-NETTA   TO EL-IMP-SIND-D(H-O0SXTSCONF)
160125*            END-IF
160125*        END-IF

160125         MOVE 1  TO IND-SIND
160125         PERFORM UNTIL IND-SIND > 400
160125           IF H-O0SXTSCONF  = EL-COD-SIND(IND-SIND) AND
160125              H-O0SXTSCAT   = EL-CAT-SIND(IND-SIND)
160125                ADD H-O0SXTRASIND TO EL-IMP-SIND-C(IND-SIND)
160125                IF H-PDATAELABO < 20120101
160125                    ADD H-O0SXTRASIND  TO EL-IMP-SIND-A(IND-SIND)
160125                    ADD TS-NETTA       TO EL-IMP-SIND-D(IND-SIND)
160125                END-IF
160125           ELSE
160125             add 1    to ind-sind
160125           END-IF
160125         END-PERFORM

               ADD H-O0SXTRASIND TO TOTALE-CONT
               IF H-PDATAELABO < 20120101
                   ADD H-O0SXTRASIND TO TOTALE-ACCR
                   ADD TS-NETTA   TO TOTALE-DEBI
               END-IF
           END-IF.
      * 20/05/2014 Massimo
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  160
              IF EL-IMP-SX-D(NDR1) < 0
              THEN
      *           SUBTRACT EL-IMP-SX-D(NDR1) FROM TOTDA OF TOTALI-O
      *           SUBTRACT EL-IMP-SX-D(NDR1) FROM TOTAV OF TOTALI-O
                  COMPUTE EL-IMP-SX-A(NDR1) = EL-IMP-SX-A(NDR1)
                                            - EL-IMP-SX-D(NDR1)
                  MOVE 0 TO EL-IMP-SX-D(NDR1)
                  MOVE EL-ALF-SX-D(NDR1) TO EL-ALF-SX-A(NDR1)
                  MOVE EL-NUM-SX-D(NDR1) TO EL-NUM-SX-A(NDR1)
              END-IF
              IF EL-IMP-SX-A(NDR1) < 0
              THEN
      *           SUBTRACT EL-IMP-SX-A(NDR1) FROM TOTDA OF TOTALI-O
      *           SUBTRACT EL-IMP-SX-A(NDR1) FROM TOTAV OF TOTALI-O
                  COMPUTE EL-IMP-SX-D(NDR1) = EL-IMP-SX-D(NDR1)
                                            - EL-IMP-SX-A(NDR1)
                  MOVE 0 TO EL-IMP-SX-A(NDR1)
                  MOVE EL-ALF-SX-A(NDR1) TO EL-ALF-SX-D(NDR1)
                  MOVE EL-NUM-SX-A(NDR1) TO EL-NUM-SX-D(NDR1)
              END-IF
           end-perform.
       E71-EX.  exit.
      *------------------------------------------------------------
       E30-TOTALIZZA.
      *------------------------------------------------------------
           EVALUATE WTIPODOM
             WHEN "B"
               perform  E31-TOTASU   thru  E31-EX
             WHEN "D"
               perform  E32-TOTLPU   thru  E32-EX
             WHEN "E"
               perform  E33-TOTSX    thru  E33-EX
           END-EVALUATE.
       E30-EX.   exit.
      *------------------------------------------------------------
       E31-TOTASU.
      *------------------------------------------------------------
      *  Credito verso ente ASU cofinaziati fino al 30/06/2001
           MOVE ASUEGCOF OF BIGASU-O
             TO ACCERD   OF BIGASU-O
                ACCERA   OF BIGASU-O.
      *  Credito verso ente ASU cofinaziati dopo il 30/06/2001
      *    IF H-R2SINO NOT = "50"
           IF H-O0SUFIN NOT = 09
               COMPUTE ACCEGD   OF BIGASU-O   =
                       ASUREGEG OF BIGASU-O +
                       MATREGEG OF BIGASU-O
               MOVE ACCEGD   OF BIGASU-O
                 TO ACCEGA   OF BIGASU-O
           END-IF.
      *  Credito verso Regione ASU cofinaziati dopo il 30/06/2001
           IF H-R2SINO = "NO"
           AND H-O0SUFIN NOT = 09
               COMPUTE ACCREGD OF BIGASU-O  =
                       ASUREG OF BIGASU-O +
                       ANFREG OF BIGASU-O +
                       MATREG OF BIGASU-O
               MOVE ACCREGD   OF BIGASU-O
                 TO ACCREGA   OF BIGASU-O
           END-IF.
      *  Credito verso Regione LAZIO  ASU cof. REGIONE/FONDO
      *    IF H-R2SINO = "50"
           IF H-O0SUFIN = 09
               COMPUTE ACCREGD OF BIGASU-O  =
                       ASUREGEG OF BIGASU-O +
                       ANFREGEG OF BIGASU-O +
                       MATREGEG OF BIGASU-O
               MOVE ACCREGD   OF BIGASU-O
                 TO ACCREGA   OF BIGASU-O
           END-IF.
      *  Credito verso ente ASU autofinaziati
           COMPUTE ACCEREGD OF BIGASU-O   =
                   ASUEGAUT OF BIGASU-O +
                   MATERNEG OF BIGASU-O +
                   ANFASUEG OF BIGASU-O.
           MOVE ACCEREGD OF BIGASU-O
             TO ACCEREGA OF BIGASU-O.
      *
           COMPUTE TOTDA     OF TOTALI-O   =
                   ASU       OF BIGASU-O +
                   ASUREG    OF BIGASU-O +
                   ASUREGEG  OF BIGASU-O +
                   ASUEGCOF  OF BIGASU-O +
                   ASUEGAUT  OF BIGASU-O +
                   ASUFORM1  OF BIGASU-O +
                   ASUFORM2  OF BIGASU-O +
                   ASUEDIL   OF BIGASU-O +
                   LSU71     OF BIGASU-O +
                   LSU72     OF BIGASU-O +
                   LSU73     OF BIGASU-O +
                   LPU74     OF BIGASU-O +
                   LPU75     OF BIGASU-O +
                   LPU76     OF BIGASU-O +
                   RIN       OF BIGASU-O +
                   ANTIC     OF BIGASU-O +
                   INCENTIVO OF BIGASU-O +
                   MATERNITA OF BIGASU-O +
                   MATREG    OF BIGASU-O +
                   MATREGEG  OF BIGASU-O +
                   MATERNEDIL OF BIGASU-O +
                   MATERNEG  OF BIGASU-O +
                   ANFASU    OF BIGASU-O +
                   ANFREG    OF BIGASU-O +
                   ANFREGEG  OF BIGASU-O +
                   ANFASUEG  OF BIGASU-O +
                   ANFFORM1  OF BIGASU-O +
                   ANFFORM2  OF BIGASU-O +
                   ANFEDIL   OF BIGASU-O +
                   ANF71     OF BIGASU-O +
                   ANF72     OF BIGASU-O +
                   ANF73     OF BIGASU-O +
                   ANF74     OF BIGASU-O +
                   ANF75     OF BIGASU-O +
                   ANF76     OF BIGASU-O +
                   CONGRIMB  OF BIGASU-O   +
                   RIMB730   OF BIGASU-O   +
                   ACCERD    OF BIGASU-O   +
                   ACCEREGD  OF BIGASU-O   +
                   ACCREGD   OF BIGASU-O   +
                   ACCEGD    OF BIGASU-O   +
                   TOTALE-ACCR
           on  size  error
               move  "E"  to  L-RETCODE
           end-compute.
      *
           COMPUTE TOTAV     OF TOTALI-O   =
                   RECU      OF BIGASU-O +
                   RECURIN   OF BIGASU-O +
                   RECUANT   OF BIGASU-O +
                   IRPEF     OF BIGASU-O   +
                   IRPEFS    OF BIGASU-O   +
                   CONGDEB   OF BIGASU-O   +
                   ADDREG    OF BIGASU-O   +
                   ADDCOM    OF BIGASU-O   +
                   ADDREGR   OF BIGASU-O   +
                   ADDCOMR   OF BIGASU-O   +
                   DEB730    OF BIGASU-O   +
                   DEBITI    OF BIGASU-O   +
                   DEBASU    OF BIGASU-O   +
                   DEBITIEG  OF BIGASU-O   +
                   DEBITIINC OF BIGASU-O   +
                   ACCERA    OF BIGASU-O   +
                   ACCEREGA  OF BIGASU-O   +
                   ACCREGA   OF BIGASU-O   +
                   ACCEGA    OF BIGASU-O   +
                   TOTALE-CONT             +
                   TOTALE-DEBI             +
                   RECSPE    OF RIGASPE-O   +
                   RECIVA    OF RIGAIVA-O
           on  size  error
               move  "E"  to  L-RETCODE
           end-compute.
      *
           COMPUTE W-BIGLIETTO = DEBITI    OF BIGASU-O   +
                                 DEBASU    OF BIGASU-O   +
                                 DEBITIEG  OF BIGASU-O   +
                                 DEBITIINC OF BIGASU-O.
      *
           COMPUTE STORNO    OF STORNO-O    =
                   RECU      OF BIGASU-O +
                   RECURIN   OF BIGASU-O +
                   RECUANT   OF BIGASU-O.
           MOVE STORNO OF STORNO-O TO TOTALE OF STORNO-O.
       E31-EX.   exit.
      *
       E31-DETASU.
      *
           MOVE 0              TO  TDSREPORT-NUM-RIGA.
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  70
              IF EL-IMP-ASU-D(NDR1) > 0
              THEN
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
                 MOVE EL-VOCE-ASU(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-ASU-D(NDR1) ' '
                        EL-NUM-ASU-D(NDR1)
                        EL-NUM-ASU-D(NDR1)
                 DELIMITED BY SIZE        INTO WK-CONTO-DARE
                 MOVE EL-IMP-ASU-D(NDR1)     TO WK-IMPOR-DARE
      *--
                 IF WK-CONTO-DARE = 'GPA 06/105'
                    MOVE 'CREDITO IRPEF DA CONGUAGLIO FISCALE          '
                       TO WK-DESCR-CONTO
                 END-IF
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           end-perform.
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  70
              IF EL-IMP-ASU-A(NDR1) > 0
              THEN
      *--
                IF EL-ALF-ASU-A(NDR1) = 'GPA' AND
                   EL-NUM-ASU-A(NDR1) = '52/099'
                THEN
                   MOVE 1            TO SW-RECUPERI
                ELSE
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
                 MOVE EL-VOCE-ASU(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-ASU-A(NDR1) ' '
                        EL-NUM-ASU-A(NDR1)
                        EL-NUM-ASU-A(NDR1)
                 DELIMITED BY SIZE        INTO WK-CONTO-AVERE
                 MOVE EL-IMP-ASU-A(NDR1)     TO WK-IMPOR-AVERE
      *--
                 IF WK-CONTO-AVERE = 'GPA 29/105'
                    MOVE 'DEBITO IRPEF DA CONGUAGLIO FISCALE           '
                       TO WK-DESCR-CONTO
                 END-IF
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
                END-IF
              END-IF
           end-perform.
       E31-DETASU-EX.     exit.
      *------------------------------------------------------------
      *------------------------------------------------------------
       E32-TOTLPU.
      *------------------------------------------------------------
           COMPUTE TOTDA     OF TOTALI-O   =
                   LPU280I   OF BIGLPU-O +
                   LPU280R   OF BIGLPU-O +
                   MATERNITA OF BIGLPU-O +
                   ANF280I   OF BIGLPU-O +
                   ANF280R   OF BIGLPU-O +
                   CONGRIMB  OF BIGLPU-O   +
                   RIMB730   OF BIGLPU-O   +
                   TOTALE-ACCR
           on  size  error
               move  "E"  to  L-RETCODE
           end-compute.
      *
           COMPUTE TOTAV     OF TOTALI-O   =
                   RECU      OF BIGLPU-O +
                   IRPEF     OF BIGLPU-O   +
                   IRPEFS    OF BIGLPU-O   +
                   CONGDEB   OF BIGLPU-O   +
                   ADDREG    OF BIGLPU-O   +
                   ADDCOM    OF BIGLPU-O   +
                   DEB730    OF BIGLPU-O   +
                   DEBITI    OF BIGLPU-O   +
                   TOTALE-CONT              +
                   TOTALE-DEBI              +
                   RECSPE    OF RIGASPE-O   +
                   RECIVA    OF RIGAIVA-O
           on  size  error
               move  "E"  to  L-RETCODE
           end-compute.
      *
           COMPUTE W-BIGLIETTO = DEBITI OF BIGLPU-O.
      *
           COMPUTE STORNO    OF STORNO-O    =
                   RECU      OF BIGLPU-O.
           MOVE STORNO OF STORNO-O TO TOTALE OF STORNO-O.
       E32-EX.   exit.
      *
       E32-DETLPU.
      *
           MOVE 0              TO  TDSREPORT-NUM-RIGA.
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  60
              IF EL-IMP-LPU-D(NDR1) > 0
              THEN
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
                 MOVE EL-VOCE-LPU(NDR1)     TO WK-DESCR-CONTO
                 STRING EL-ALF-LPU-D(NDR1) ' '
                        EL-NUM-LPU-D(NDR1)
                        EL-NUM-LPU-D(NDR1)
                 DELIMITED BY SIZE        INTO WK-CONTO-DARE
                 MOVE EL-IMP-LPU-D(NDR1)     TO WK-IMPOR-DARE
      *--
                 IF WK-CONTO-DARE = 'GPA 06/105'
                    MOVE 'CREDITO IRPEF DA CONGUAGLIO FISCALE          '
                       TO WK-DESCR-CONTO
                 END-IF
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           end-perform.
      *
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  60
              IF EL-IMP-LPU-A(NDR1)  > 0
              THEN
      *--
                IF EL-ALF-LPU-A(NDR1) = 'GPA' AND
                   EL-NUM-LPU-A(NDR1) = '52/099'
                THEN
                   MOVE 1            TO SW-RECUPERI
                ELSE
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
                 MOVE EL-VOCE-LPU(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-LPU-A(NDR1) ' '
                        EL-NUM-LPU-A(NDR1)
                        EL-NUM-LPU-A(NDR1)
                 DELIMITED BY SIZE        INTO WK-CONTO-AVERE
                 MOVE EL-IMP-LPU-A(NDR1)     TO WK-IMPOR-AVERE
      *--
                 IF WK-CONTO-AVERE = 'GPA 29/105'
                    MOVE 'DEBITO IRPEF DA CONGUAGLIO FISCALE           '
                       TO WK-DESCR-CONTO
                 END-IF
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
                END-IF
              END-IF
           end-perform.
       E32-DETLPU-EX.     exit.
      *------------------------------------------------------------
       E33-TOTSX.
      *------------------------------------------------------------
           MOVE 0 TO TOTDA OF TOTALI-O
                     TOTAV OF TOTALI-O.
           MOVE 1 TO IND-SX.
           PERFORM UNTIL IND-SX > 160
               ADD EL-IMP-SX-D(IND-SX) TO TOTDA OF TOTALI-O
               on  size  error
                   move  "E"  to  L-RETCODE
               END-ADD
               ADD EL-IMP-SX-A(IND-SX) TO TOTAV OF TOTALI-O
               on  size  error
                   move  "E"  to  L-RETCODE
               END-ADD
               ADD 1 TO IND-SX
           END-PERFORM.
      *
           COMPUTE TOTDA     OF TOTALI-O    =
                   TOTDA     OF TOTALI-O    +
                   TOTALE-ACCR
           on  size  error
               move  "E"  to  L-RETCODE
           end-compute.
      *
           COMPUTE TOTAV     OF TOTALI-O    =
                   TOTAV     OF TOTALI-O    +
                   TOTALE-CONT              +
                   TOTALE-DEBI              +
                   RECSPE    OF RIGASPE-O   +
                   RECIVA    OF RIGAIVA-O
           on  size  error
               move  "E"  to  L-RETCODE
           end-compute.
      *
           COMPUTE W-BIGLIETTO = EL-IMP-SX-A(155)         +
                                 EL-IMP-SX-A(156)         +
                                 EL-IMP-SX-A(157)         +
                                 EL-IMP-SX-A(158).
      *
           COMPUTE STORNO    OF STORNO-O   =
                   EL-IMP-SX-A(145)        +
                   EL-IMP-SX-A(146).
           MOVE STORNO OF STORNO-O TO TOTALE OF STORNO-O.
       E33-EX.   exit.
      *
       E33-DETSX.
      *
           MOVE 0              TO  TDSREPORT-NUM-RIGA.
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  160
              IF EL-IMP-SX-D(NDR1) > 0
              THEN
      *--
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
                 MOVE EL-VOCE-SX(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-SX-D(NDR1) ' '
                        EL-NUM-SX-D(NDR1)
                        EL-NUM-SX-D(NDR1)
                 DELIMITED BY SIZE        INTO WK-CONTO-DARE
                 MOVE EL-IMP-SX-D(NDR1)     TO WK-IMPOR-DARE
      *--
                 IF WK-CONTO-DARE = 'GPA 06/105'
                    MOVE 'CREDITO IRPEF DA CONGUAGLIO FISCALE          '
                       TO WK-DESCR-CONTO
                 END-IF
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
              END-IF
           end-perform.
      *
      *
           perform  varying  NDR1  from  1  by  1
                    until NDR1            >  160
              IF EL-IMP-SX-A(NDR1) > 0
              THEN
      *--
                IF EL-ALF-SX-A(NDR1) = 'GPA' AND
                   EL-NUM-SX-A(NDR1) = '52/099'
                THEN
                   MOVE 1            TO SW-RECUPERI
                ELSE
                 MOVE SPACES                TO WK-CONTO-DARE
                 MOVE 0                     TO WK-IMPOR-DARE
                 MOVE SPACES                TO WK-CONTO-AVERE
                 MOVE 0                     TO WK-IMPOR-AVERE
      *--
                 MOVE EL-VOCE-SX(NDR1)      TO WK-DESCR-CONTO
                 STRING EL-ALF-SX-A(NDR1) ' '
                        EL-NUM-SX-A(NDR1)
                        EL-NUM-SX-A(NDR1)
                 DELIMITED BY SIZE        INTO WK-CONTO-AVERE
                 MOVE EL-IMP-SX-A(NDR1)     TO WK-IMPOR-AVERE
      *--
                 IF WK-CONTO-AVERE = 'GPA 29/105'
                    MOVE 'DEBITO IRPEF DA CONGUAGLIO FISCALE           '
                       TO WK-DESCR-CONTO
                 END-IF
      *--
                 MOVE SPACES               TO TDSREPORT-RIGA-REPORT
                 STRING '01' WK-RIGA-STAMPA   DELIMITED BY SIZE
                                         INTO TDSREPORT-RIGA-REPORT
                 ADD 1                     TO TDSREPORT-NUM-RIGA
                 PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
                END-IF
              END-IF
           end-perform.
       E33-DETSX-EX.     exit.
      *------------------------------------------------------------
       STAMPA-BIGLIETTO.
      *
      *------------------------------------------------ Prima   pagina
           move  L-PROGRESSIVO  to  S5BBB1N of TESTASU-O
                                    S5BBB1N of TESTLPU-O
                                    S5BBB1N of TESTSX-O.
      *
           move  L-NOME-SEDE    to  S5B101A of TESTASU-O
                                    S5B101A of TESTLPU-O
                                    S5B101A of TESTSX-O.
           move  L-CODICE-STOP  to  S5N101S of TESTASU-O
                                    S5N101S of TESTLPU-O
                                    S5N101S of TESTSX-O.
           move  L-NOME-STOP    to  S5A101S of TESTASU-O
                                    S5A101S of TESTLPU-O
                                    S5A101S of TESTSX-O.
      *
           EVALUATE WTIPODOM
             WHEN "B"
                 PERFORM STAMPA-ASU
             WHEN "D"
                 PERFORM STAMPA-LPU
             WHEN "E"
                 PERFORM STAMPA-SX
           END-EVALUATE.
      *
           PERFORM STAMPA-SINDACATI.
      *
      * gestione recuperi
           PERFORM STAMPA-RECUPERI.
      *
           PERFORM STAMPA-TOTALI.
      *
      *    if  STORNO OF STORNO-O >  zeroes
           if  SW-RECUPERI = 1
           then
               MOVE STORNO           TO RSTORNO
               MOVE TOTALE           TO RTOTALE
               MOVE SPACES           TO TDSREPORT-RIGA-REPORT
               STRING '03' WK-BIGSTORNO-04   DELIMITED BY SIZE
                                   INTO TDSREPORT-RIGA-REPORT
               ADD   1               TO TDSREPORT-NUM-RIGA
               MOVE TDSREPORT-RIGA-REPORT        TO
                    RIGA-STAMPA(2)
           end-if.
       EX-BIGLIETTO.  exit.
      *-----------------------------------------------------------*
      *-----------------------------------------------------------*
       STAMPA-ASU.
      *-----------------------------------------------------------*
           MOVE ASU           OF BIGASU-O TO EL-IMP-ASU-D(1).
           IF H-O0SUFIN = 09
               MOVE ASUREG    OF BIGASU-O TO EL-IMP-ASU-D(2)
               MOVE ASUREGEG  OF BIGASU-O TO EL-IMP-ASU-D(57)
           ELSE
               IF H-R2SINO = "SI"
                   MOVE ASUREG    OF BIGASU-O TO EL-IMP-ASU-D(2)
               END-IF
               IF H-R2SINO = "NO"
                   MOVE ASUREG    OF BIGASU-O TO EL-IMP-ASU-D(3)
               END-IF
               MOVE ASUREGEG      OF BIGASU-O TO EL-IMP-ASU-D(4)
           END-IF.
           MOVE ASUEGCOF      OF BIGASU-O TO EL-IMP-ASU-D(5).
           MOVE ASUEGAUT      OF BIGASU-O TO EL-IMP-ASU-D(6).
           MOVE ASUFORM1      OF BIGASU-O TO EL-IMP-ASU-D(7).
           MOVE ASUFORM2      OF BIGASU-O TO EL-IMP-ASU-D(8).
           MOVE ASUEDIL       OF BIGASU-O TO EL-IMP-ASU-D(9).
           MOVE LSU71         OF BIGASU-O TO EL-IMP-ASU-D(10).
           MOVE LSU72         OF BIGASU-O TO EL-IMP-ASU-D(11).
           MOVE LSU73         OF BIGASU-O TO EL-IMP-ASU-D(12).
           MOVE LPU74         OF BIGASU-O TO EL-IMP-ASU-D(13).
           MOVE LPU75         OF BIGASU-O TO EL-IMP-ASU-D(14).
           MOVE LPU76         OF BIGASU-O TO EL-IMP-ASU-D(15).
           MOVE RIN           OF BIGASU-O TO EL-IMP-ASU-D(16).
           MOVE ANTIC         OF BIGASU-O TO EL-IMP-ASU-D(17).
           MOVE INCENTIVO     OF BIGASU-O TO EL-IMP-ASU-D(18).
           MOVE MATERNITA     OF BIGASU-O TO EL-IMP-ASU-D(19).
           IF H-O0SUFIN = 09
               MOVE MATREG    OF BIGASU-O TO EL-IMP-ASU-D(20)
               MOVE MATREGEG  OF BIGASU-O TO EL-IMP-ASU-D(58)
           ELSE
               IF H-R2SINO = "SI"
                   MOVE MATREG    OF BIGASU-O TO EL-IMP-ASU-D(20)
               END-IF
               IF H-R2SINO = "NO"
                   MOVE MATREG    OF BIGASU-O TO EL-IMP-ASU-D(21)
               END-IF
               MOVE MATREGEG  OF BIGASU-O TO EL-IMP-ASU-D(22)
           END-IF.
           MOVE MATERNEDIL    OF BIGASU-O TO EL-IMP-ASU-D(23).
           MOVE MATERNEG      OF BIGASU-O TO EL-IMP-ASU-D(24).
           MOVE ANFASU        OF BIGASU-O TO EL-IMP-ASU-D(25).
           IF H-O0SUFIN = 09
               MOVE ANFREG    OF BIGASU-O TO EL-IMP-ASU-D(26)
               MOVE ANFREGEG  OF BIGASU-O TO EL-IMP-ASU-D(59)
           ELSE
               IF H-R2SINO = "SI"
                   MOVE ANFREG    OF BIGASU-O TO EL-IMP-ASU-D(26)
               END-IF
               IF H-R2SINO = "NO"
                   MOVE ANFREG    OF BIGASU-O TO EL-IMP-ASU-D(27)
               END-IF
           END-IF.
           MOVE ANFASUEG      OF BIGASU-O TO EL-IMP-ASU-D(28).
           MOVE ANFFORM1      OF BIGASU-O TO EL-IMP-ASU-D(29).
           MOVE ANFFORM2      OF BIGASU-O TO EL-IMP-ASU-D(30).
           MOVE ANFEDIL       OF BIGASU-O TO EL-IMP-ASU-D(31).
           MOVE ANF71         OF BIGASU-O TO EL-IMP-ASU-D(32).
           MOVE ANF72         OF BIGASU-O TO EL-IMP-ASU-D(33).
           MOVE ANF73         OF BIGASU-O TO EL-IMP-ASU-D(34).
           MOVE ANF74         OF BIGASU-O TO EL-IMP-ASU-D(35).
           MOVE ANF75         OF BIGASU-O TO EL-IMP-ASU-D(36).
           MOVE ANF76         OF BIGASU-O TO EL-IMP-ASU-D(37).
           MOVE RECU          OF BIGASU-O TO EL-IMP-ASU-A(38).
           MOVE RECURIN       OF BIGASU-O TO EL-IMP-ASU-A(39).
           MOVE RECUANT       OF BIGASU-O TO EL-IMP-ASU-A(40).
           IF WK-INCENTIVO > 0 AND < 9296,22
               MOVE "RECUPERI SU INCENTIVO DEC.MIN. 21/5/98       "
                 TO EL-VOCE-ASU(40)
               MOVE "GAU"                 TO EL-ALF-ASU-A(40)
               MOVE "24/046"              TO EL-NUM-ASU-A(40)
               MOVE RECUINC   OF BIGASU-O TO EL-IMP-ASU-A(40)
           END-IF.
      *
           MOVE IRPEF         OF BIGASU-O TO EL-IMP-ASU-A(41).
           MOVE IRPEFS        OF BIGASU-O TO EL-IMP-ASU-A(42).
           MOVE CONGDEB       OF BIGASU-O TO EL-IMP-ASU-A(43).
           MOVE CONGRIMB      OF BIGASU-O TO EL-IMP-ASU-D(43).
           MOVE ADDREG        OF BIGASU-O TO EL-IMP-ASU-A(44).
           MOVE ADDCOM        OF BIGASU-O TO EL-IMP-ASU-A(45).
           MOVE ADDREGR       OF BIGASU-O TO EL-IMP-ASU-A(46).
           MOVE ADDCOMR       OF BIGASU-O TO EL-IMP-ASU-A(47).
           MOVE DEB730        OF BIGASU-O TO EL-IMP-ASU-A(48).
           MOVE RIMB730       OF BIGASU-O TO EL-IMP-ASU-D(48).
           MOVE DEBITI        OF BIGASU-O TO EL-IMP-ASU-A(49).
      * Su indicazione D.ssa Di Cecca per cofinanz. Reg. Lazio
      * il debito vs i lavoratori sullo stesso conto del FO
           IF H-O0SUFIN = 09
               ADD  DEBASU        OF BIGASU-O TO EL-IMP-ASU-A(49)
           ELSE
               MOVE DEBASU        OF BIGASU-O TO EL-IMP-ASU-A(50)
           END-IF.
           MOVE DEBITIEG      OF BIGASU-O TO EL-IMP-ASU-A(51).
           MOVE DEBITIINC     OF BIGASU-O TO EL-IMP-ASU-A(52).
           MOVE ACCERD        OF BIGASU-O TO EL-IMP-ASU-A(53)
                                             EL-IMP-ASU-D(53).
           MOVE ACCEREGD      OF BIGASU-O TO EL-IMP-ASU-A(54)
                                             EL-IMP-ASU-D(54).
           IF H-O0SUFIN = 09
               MOVE ACCREGD       OF BIGASU-O TO EL-IMP-ASU-A(60)
                                                 EL-IMP-ASU-D(60)
           ELSE
               MOVE ACCREGD       OF BIGASU-O TO EL-IMP-ASU-A(55)
                                                 EL-IMP-ASU-D(55)
           END-IF.
           MOVE ACCEGD        OF BIGASU-O TO EL-IMP-ASU-A(56)
                                             EL-IMP-ASU-D(56).
      *
           MOVE 1 TO IND-ASU.
           PERFORM STAMPA-RIGA-ASU UNTIL IND-ASU > 70.
      *-----------------------------------------------------------*
       STAMPA-RIGA-ASU.
      *-----------------------------------------------------------*
           IF EL-IMP-ASU-D(IND-ASU) NOT = 0
           OR EL-IMP-ASU-A(IND-ASU) NOT = 0
               MOVE EL-VOCE-ASU(IND-ASU)        TO VOCE
               MOVE EL-ALF-ASU-D(IND-ASU)       TO ALFDA
               MOVE EL-NUM-ASU-D(IND-ASU)       TO NUMDA
               MOVE EL-IMP-ASU-D(IND-ASU)       TO IMPDA
               MOVE EL-ALF-ASU-A(IND-ASU)       TO ALFAV
               MOVE EL-NUM-ASU-A(IND-ASU)       TO NUMAV
               MOVE EL-99-ASU-A(IND-ASU)        TO NOVENOVE
               MOVE EL-IMP-ASU-A(IND-ASU)       TO IMPAV
               ADD 1 TO CONTA-RIGHE
      * gestione recuperi
               IF IND-ASU NOT = 38
                   PERFORM SCRIVI-TABINT1
               END-IF
           END-IF.
           INITIALIZE WK-RIGA.
           ADD 1 TO IND-ASU.
      *-----------------------------------------------------------*
       STAMPA-LPU.
      *-----------------------------------------------------------*
           MOVE LPU280I       OF BIGLPU-O TO EL-IMP-LPU-D(1).
           MOVE LPU280R       OF BIGLPU-O TO EL-IMP-LPU-D(2).
           MOVE MATERNITA     OF BIGLPU-O TO EL-IMP-LPU-D(3).
           MOVE ANF280I       OF BIGLPU-O TO EL-IMP-LPU-D(4).
           MOVE ANF280R       OF BIGLPU-O TO EL-IMP-LPU-D(5).
           MOVE RECU          OF BIGLPU-O TO EL-IMP-LPU-A(6).
           MOVE DEBITI        OF BIGLPU-O TO EL-IMP-LPU-A(7).
           MOVE IRPEF         OF BIGLPU-O TO EL-IMP-LPU-A(8).
           MOVE IRPEFS        OF BIGLPU-O TO EL-IMP-LPU-A(9).
           MOVE CONGRIMB      OF BIGLPU-O TO EL-IMP-LPU-D(10).
           MOVE CONGDEB       OF BIGLPU-O TO EL-IMP-LPU-A(10).
           MOVE ADDREG        OF BIGLPU-O TO EL-IMP-LPU-A(11).
           MOVE ADDCOM        OF BIGLPU-O TO EL-IMP-LPU-A(12).
           MOVE RIMB730       OF BIGLPU-O TO EL-IMP-LPU-D(13).
           MOVE DEB730        OF BIGLPU-O TO EL-IMP-LPU-A(13).
      *
           MOVE 1 TO IND-LPU.
           PERFORM STAMPA-RIGA-LPU UNTIL IND-LPU > 15.
      *-----------------------------------------------------------*
       STAMPA-RIGA-LPU.
      *-----------------------------------------------------------*
           IF EL-IMP-LPU-D(IND-LPU) NOT = 0
           OR EL-IMP-LPU-A(IND-LPU) NOT = 0
               MOVE EL-VOCE-LPU(IND-LPU)        TO VOCE
               MOVE EL-ALF-LPU-D(IND-LPU)       TO ALFDA
               MOVE EL-NUM-LPU-D(IND-LPU)       TO NUMDA
               MOVE EL-IMP-LPU-D(IND-LPU)       TO IMPDA
               MOVE EL-ALF-LPU-A(IND-LPU)       TO ALFAV
               MOVE EL-NUM-LPU-A(IND-LPU)       TO NUMAV
               MOVE EL-99-LPU-A(IND-LPU)        TO NOVENOVE
               MOVE EL-IMP-LPU-A(IND-LPU)       TO IMPAV
               ADD 1 TO CONTA-RIGHE
      * gestione recuperi
               IF IND-LPU NOT = 6
                   PERFORM SCRIVI-TABINT1
               END-IF
           END-IF.
           INITIALIZE WK-RIGA.
           ADD 1 TO IND-LPU.
      *-----------------------------------------------------------*
       STAMPA-SX.
      *-----------------------------------------------------------*
           MOVE 1 TO IND-SX.
           PERFORM STAMPA-RIGA-SX UNTIL IND-SX > 160.
      *-----------------------------------------------------------*
       STAMPA-RIGA-SX.
      *-----------------------------------------------------------*
           IF EL-IMP-SX-D(IND-SX) NOT = 0
           OR EL-IMP-SX-A(IND-SX) NOT = 0
               MOVE EL-VOCE-SX(IND-SX)        TO VOCE
               MOVE EL-ALF-SX-D(IND-SX)       TO ALFDA
               MOVE EL-NUM-SX-D(IND-SX)       TO NUMDA
               MOVE EL-IMP-SX-D(IND-SX)       TO IMPDA
               MOVE EL-ALF-SX-A(IND-SX)       TO ALFAV
               MOVE EL-NUM-SX-A(IND-SX)       TO NUMAV
               MOVE EL-99-SX-A(IND-SX)        TO NOVENOVE
               MOVE EL-IMP-SX-A(IND-SX)       TO IMPAV
               ADD 1 TO CONTA-RIGHE
      * gestione recuperi
               IF IND-SX NOT = 145
                   PERFORM SCRIVI-TABINT1
               END-IF
           END-IF.
           INITIALIZE WK-RIGA.
           ADD 1 TO IND-SX.
      *-----------------------------------------------------------*
       STAMPA-SINDACATI.
      *-----------------------------------------------------------*
           MOVE 1 TO IND-SIND.
      * SSS correttivo per sindacati da 10 03 in poi
      *    PERFORM UNTIL IND-SIND > 90
160125*    PERFORM UNTIL IND-SIND > 300
160125     PERFORM UNTIL IND-SIND > 400
      * SSS-F
               IF EL-IMP-SIND-A(IND-SIND) NOT = 0
                   STRING "ACCREDITAMENTO CONTRIBUTI SINDACALI "
                              DELIMITED BY SIZE
                          EL-VOCE-SIND(IND-SIND) DELIMITED BY SIZE
                     INTO VOCE
                   MOVE EL-ALF-SIND-A(IND-SIND)      TO ALFDA
                   MOVE EL-NUM-SIND-A(IND-SIND)      TO NUMDA
                   MOVE EL-IMP-SIND-A(IND-SIND)      TO IMPDA
                   MOVE SPACES                       TO ALFAV
                   MOVE SPACES                       TO NUMAV
                   MOVE SPACES                       TO NOVENOVE
                   MOVE ZEROES                       TO IMPAV
                   ADD 1 TO CONTA-RIGHE
                   PERFORM SCRIVI-TABINT1
               END-IF
               INITIALIZE WK-RIGA
               ADD 1 TO IND-SIND
           END-PERFORM.
      *
           MOVE 1 TO IND-SIND.
      * SSS correttivo per sindacati da 10 03 in poi
      *    PERFORM UNTIL IND-SIND > 90
160125*    PERFORM UNTIL IND-SIND > 300
160125     PERFORM UNTIL IND-SIND > 400
      * SSS-F
               IF EL-IMP-SIND-C(IND-SIND) NOT = 0
                   STRING "CONTRIBUTI SINDACALI " DELIMITED BY SIZE
                          EL-VOCE-SIND(IND-SIND)  DELIMITED BY SIZE
                     INTO VOCE
                   MOVE SPACES                       TO ALFDA
                   MOVE SPACES                       TO NUMDA
                   MOVE ZEROES                       TO IMPDA
                   MOVE EL-ALF-SIND-C(IND-SIND)      TO ALFAV
                   MOVE EL-NUM-SIND-C(IND-SIND)      TO NUMAV
                   MOVE SPACES                       TO NOVENOVE
                   MOVE EL-IMP-SIND-C(IND-SIND)      TO IMPAV
                   ADD 1 TO CONTA-RIGHE
                   PERFORM SCRIVI-TABINT1
               END-IF
               INITIALIZE WK-RIGA
               ADD 1 TO IND-SIND
           END-PERFORM.
      *
           MOVE 1 TO IND-SIND.
      * SSS correttivo per sindacati da 10 03 in poi
      *    PERFORM UNTIL IND-SIND > 90
160125*    PERFORM UNTIL IND-SIND > 300
160125     PERFORM UNTIL IND-SIND > 400
      * SSS-F
               IF EL-IMP-SIND-D(IND-SIND) NOT = 0
                   STRING "DEBITO VERSO "        DELIMITED BY SIZE
                          EL-VOCE-SIND(IND-SIND) DELIMITED BY SIZE
                     INTO VOCE
                   MOVE SPACES                       TO ALFDA
                   MOVE SPACES                       TO NUMDA
                   MOVE ZEROES                       TO IMPDA
                   MOVE EL-ALF-SIND-D(IND-SIND)      TO ALFAV
                   MOVE EL-NUM-SIND-D(IND-SIND)      TO NUMAV
                   MOVE SPACES                       TO NOVENOVE
                   MOVE EL-IMP-SIND-D(IND-SIND)      TO IMPAV
                   ADD 1 TO CONTA-RIGHE
                   PERFORM SCRIVI-TABINT1
               END-IF
               INITIALIZE WK-RIGA
               ADD 1 TO IND-SIND
           END-PERFORM.
      *
           IF RECSPE OF RIGASPE-O NOT = 0
               ADD 1 TO CONTA-RIGHE
               PERFORM SCRIVI-TABINT1-SPE
           END-IF.
           INITIALIZE WK-RIGASPE.
           IF RECIVA OF RIGAIVA-O NOT = 0
               ADD 1 TO CONTA-RIGHE
               PERFORM SCRIVI-TABINT1-IVA
           END-IF.
           INITIALIZE WK-RIGAIVA.
      *-----------------------------------------------------------*
      * gestione recuperi
       STAMPA-RECUPERI.
      *-----------------------------------------------------------*
           MOVE 1 TO IND-REC.
           PERFORM UNTIL IND-REC > 200
               IF EL-IMP-REC-A(IND-REC) NOT = 0
                   MOVE SPACES TO VOCE
                   MOVE "RECUPERI" TO VOCE
                   MOVE SPACES                      TO ALFDA
                   MOVE SPACES                      TO NUMDA
                   MOVE ZEROES                      TO IMPDA
                   MOVE EL-ALF-REC-A(IND-REC)       TO ALFAV
                   MOVE EL-NUM-REC-A(IND-REC)       TO NUMAV
                   MOVE SPACES                      TO NOVENOVE
                   MOVE EL-IMP-REC-A(IND-REC)       TO IMPAV
                   PERFORM SCRIVI-TABINT1
               END-IF
               ADD 1 TO IND-REC
           END-PERFORM.
      *-----------------------------------------------------------*
       STAMPA-TOTALI.
      *-----------------------------------------------------------*
           move   TOTDA         to RTOTDA.
           move   TOTAV         to RTOTAV.
           ADD   1           TO TDSREPORT-NUM-RIGA.
           STRING '02' RWK-TOTALI   DELIMITED BY SIZE
                           INTO TDSREPORT-RIGA-REPORT.
           MOVE TDSREPORT-RIGA-REPORT        TO
                RIGA-STAMPA(1).
      *
      *17072020 eliminate perform STAMPA-730-73 e STAMPA-730-74
      *-----------------------------------------------------------*
      *STAMPA-730-73.
      *-----------------------------------------------------------*
      *    if  W-NIK  =  "S"
      *    then
      *        display  " Attenzione: salto paragrafo STAMPA-730-73"
   GG *        accept  INVIO
      *        go  to  EX-730-73
      *    end-if.
      *-----------------------------------------------------------*
      *    initialize  area-input-in.
      *
      *    move DAL-730          to  REC-DATA-IN.
      *    MOVE DAL-730(5:2)     to  REC-RATA-IN.
      *    MOVE DAL-730(1:4)     to  REC-ANNO-IN.
      *    EVALUATE WTIPODOM
      *      WHEN "B"
      *        MOVE  "G05" TO  REC-PROCEDURA-CHIAMANTE-IN
      *      WHEN "D"
      *        MOVE  "G07" TO  REC-PROCEDURA-CHIAMANTE-IN
      *      WHEN "E"
      *        IF H-O0SXCODIND = "TRAC"
      *        OR H-O0SXCODIND = "TRAD"
      *        OR H-O0SXCODIND = "TRAS"
      *        OR H-O0SXCODIND = "TRAP"
      *        OR H-O0SXCODIND = "TRAF"
      *        OR H-O0SXCODIND = "FTMD"
      *        OR H-O0SXCODIND = "FTSO"
      *        OR H-O0SXCODIND = "FTCG"
      *        OR H-O0SXCODIND = "FTCD"
      *        OR H-O0SXCODIND = "FTCC"
      *        OR H-O0SXCODIND = "FTPL"
      *        OR H-O0SXCODIND = "FTAI"
      *        OR H-O0SXCODIND = "FTAD"
      *            MOVE  "G10" TO  REC-PROCEDURA-CHIAMANTE-IN
      *        ELSE
      *            IF H-O0SXCODIND = "CRED"
      *                MOVE  "G12" TO  REC-PROCEDURA-CHIAMANTE-IN
      *            ELSE
      *                MOVE  "G09" TO  REC-PROCEDURA-CHIAMANTE-IN
      *            END-IF
      *        END-IF
      *    END-EVALUATE.
      *    move L-CODICE-SEDE    to  REC-SEDE-IN.
      *    move L-CODICE-STOP    to  REC-SEDE-IN(5:2).
      *    MOVE SPACES    TO REC-RIELABORA.
      *    move  '015'           to  TIPO-RICHIESTA-IN-5.
      *    display 'GESTIONE730=' REC-PROCEDURA-CHIAMANTE-IN '-'
      *                           H-O0SXCODIND     ' - '
      *                           WTIPODOM    ' - '
      *                           REC-SEDE-IN ' - '
      *                           REC-DATA-IN ' -'
      *                           REC-RATA-IN '-'
      *                           REC-ANNO-IN '-'.
      *    call   POPCF74
      *    EXEC CICS LINK PROGRAM('POPWMAIN')                           03050003
      *                  COMMAREA(AREA-POPSIN)                          03050003
      *    END-EXEC.                                                    03050003
      *
      *    IF RETCODE-00  > '900000'
      *            move  'S'  to  W-ERRORE
      *            move  'E'  to  L-RETCODE
      *            EXEC CICS SYNCPOINT ROLLBACK END-EXEC
      *            MOVE SPACES TO  VO-DSPFM034
      *            move  '96' to  OUT-STATUS
      *            STRING DRETCODE-00 '-' RETCODE-00
      *                   DELIMITED BY SIZE INTO VO-DSPFM034
      *            perform  W10-MSGERRORE  thru  W10-EX
      *    END-IF.
      *
      *EX-730-73.  exit.
      *-----------------------------------------------------------*
      *STAMPA-730-74.
      *    if  W-NIK  =  "S"
      *    then
      *        display  " Attenzione: salto paragrafo STAMPA-730-74"
   GG *        accept  INVIO
      *        go  to  EX-730-74
      *    end-if.
      *-----------------------------------------------------------*
      *    initialize  area-input-in.
      *    move DAL-730          to  REC-DATA-IN.
      *    MOVE DAL-730(5:2)     to  REC-RATA-IN.
      *    MOVE DAL-730(1:4)     to  REC-ANNO-IN.
      *    EVALUATE WTIPODOM
      *      WHEN "B"
      *        MOVE  "G05" TO  REC-PROCEDURA-CHIAMANTE-IN
      *      WHEN "D"
      *        MOVE  "G07" TO  REC-PROCEDURA-CHIAMANTE-IN
      *      WHEN "E"
      *        IF H-O0SXCODIND = "TRAC"
      *        OR H-O0SXCODIND = "TRAD"
      *        OR H-O0SXCODIND = "TRAS"
      *        OR H-O0SXCODIND = "TRAP"
      *        OR H-O0SXCODIND = "TRAF"
      *        OR H-O0SXCODIND = "FTMD"
      *        OR H-O0SXCODIND = "FTSO"
      *        OR H-O0SXCODIND = "FTCG"
      *        OR H-O0SXCODIND = "FTCD"
      *        OR H-O0SXCODIND = "FTCC"
      *        OR H-O0SXCODIND = "FTPL"
      *        OR H-O0SXCODIND = "FTAI"
      *        OR H-O0SXCODIND = "FTAD"
      *            MOVE  "G10" TO  REC-PROCEDURA-CHIAMANTE-IN
      *        ELSE
      *            IF H-O0SXCODIND = "CRED"
      *                MOVE  "G12" TO  REC-PROCEDURA-CHIAMANTE-IN
      *            ELSE
      *                MOVE  "G09" TO  REC-PROCEDURA-CHIAMANTE-IN
      *            END-IF
      *        END-IF
      *    END-EVALUATE.
      *    move L-CODICE-SEDE    to  REC-SEDE-IN.
      *    move L-CODICE-STOP    to  REC-SEDE-IN(5:2).
      *    MOVE SPACES    TO REC-RIELABORA.
      *    move  '022'           to  TIPO-RICHIESTA-IN-5.
      *    display 'GESTIONE730=' REC-PROCEDURA-CHIAMANTE-IN '-'
      *                           H-O0SXCODIND     ' - '
      *                           WTIPODOM    ' - '
      *                           REC-SEDE-IN ' - '
      *                           REC-DATA-IN ' -'
      *                           REC-RATA-IN '-'
      *                           REC-ANNO-IN '-'.
      *    call   POPCF74
      *    EXEC CICS LINK PROGRAM('POPWMAIN')                           03050003
      *                  COMMAREA(AREA-POPSIN)                          03050003
      *    END-EXEC.                                                    03050003
      *
      *EX-730-74.  exit.
      *---------------------------------------------------------
       F00-FINALI.
           if  L-NOME-SEDE    =  "VALTOZAC"
           then  goback
           end-if.
      *
           perform  E45-STAMPA-RPT    thru  E45-STAMPA-RPT-EX.
      *
           if  OUT-STATUS = '96' OR OUT-STATUS = '99'
           then
              move   VO-DSPFM034  to  OUT-MESSAGGIO
           ELSE
              IF W-ERRORE = "S"
              move   "91"             TO OUT-STATUS
              STRING
                 WK-RPT-KEY "Squadratura Biglietto Cont."
              DELIMITED BY SIZE INTO OUT-MESSAGGIO
           ELSE
              move   "00"             TO OUT-STATUS
              move   WK-RPT-KEY   TO OUT-MESSAGGIO
           end-if.
           move   L-PROCEDURA      TO OUT-PROCEDURA.
           move   COMMAREADS-OUT   TO COMMAREADS.
      *
           Goback.
       F00-EX.  exit.
      *---------------------------------------------------------
       I00-INIZIALI.
           MOVE "PDSIO05 "     TO WABNDB-PGM.
           move "00"           TO OUT-STATUS.
           move  SPACES        to  TABELLA-STAMPA
                                   TAB-ERRORI.
           INITIALIZE              TABINT1.
      * 17072020
      *    INITIALIZE              AREA-BC-SIN.
      *
      * PREPARA TABELLA PER LA STAMPA
      *
           PERFORM IMPOSTA-RPT THRU EX-IMPOSTA-RPT.

           move  "N"     to  W-ERRORE.
           move  "N"     to  L-RETCODE.
           move  "N"     to  W-FINE-ELABORA.
      *---------------------------------------- Controllo           *
           move  " 2010 084 "  to  W-VALTOZAC.
           if  L-CODICE-SEDE  =  9090   and
               L-CODICE-STOP  =  90     and
               L-NOME-SEDE    =  "VALTOZAC"
           then
               move  W-VALTOZAC  to  L-NOME-STOP
               move  "S"         to  W-ERRORE
               go  to  I00-EX
           end-if.
      *----------------------------------------- Controllo accesso
           perform I07-ACCESSO       thru  I07-EX.
      *    if  W-ERRORE  =  "S"
      *    then
      *        go  to  I00-EX
      *    end-if.
      *
           perform I10-DATA-ORA      thru  I10-EX.
      *----------------------------------------- Open file
           perform I25-APROFILE      thru  I25-EX.
           if  W-ERRORE  =  "S"
           then
               go  to  I00-EX
           end-if.
      *
      *----------------------------------------- Controllo archivi
           perform  K10-KONTROLLO  thru  K10-EX.
           if  W-ERRORE  =  "S"
           then
               go  to  I00-EX
           end-if.
      *
      *----------------------------------------- Controllo archivi
      * TOLTI ASTERISCHI
           IF H-PDATAELABO < 20130101
               MOVE "GPA"       TO EL-ALF-ASU-A(43)
                                   EL-ALF-ASU-D(43)
                                   EL-ALF-LPU-A(10)
                                   EL-ALF-LPU-D(10)
               MOVE "27"        TO W-CONTO(1:2)
               MOVE "009"       TO W-CONTO(4:3)
               MOVE W-CONTO     TO EL-NUM-ASU-A(43)
               MOVE W-CONTO     TO EL-NUM-ASU-D(43)
               MOVE W-CONTO     TO EL-NUM-LPU-A(10)
               MOVE W-CONTO     TO EL-NUM-LPU-D(10)
      *
               MOVE "GPA"       TO EL-ALF-SX-A(149)
                                   EL-ALF-SX-D(149)
               MOVE "27"        TO W-CONTO(1:2)
               MOVE "009"       TO W-CONTO(4:3)
               MOVE W-CONTO     TO EL-NUM-SX-A(149)
               MOVE W-CONTO     TO EL-NUM-SX-D(149)
           END-IF.
      *------------- Determinazione importo spese riscoss. trat. sind.
           if H-PDATAELABO >= 20120101
           then  move ZEROES to W-SPERIS
                                W-IVA
           else
               if H-PDATAELABO >= 20100201
               then  move 0,54 to W-SPERIS
                   if H-PDATAELABO  >= 20110415
                   then  move 0    to W-IVA
                   else  move 0,11 to W-IVA
                   end-if
               else  move 0,60 to W-SPERIS
                     move 0,12 to W-IVA
               end-if
           end-if.
      *---------------------------------------------------------------
           perform  I05-AZZERO     thru  I05-EX.
      *
           initialize TABINT1.
           move 1 to IND-TR.
       I00-EX.  exit.
      *
      *
       I05-AZZERO.
           MOVE ZEROES TO ASU       OF BIGASU-O
                          ASUREG    OF BIGASU-O
                          ASUREGEG  OF BIGASU-O
                          ASUEDIL   OF BIGASU-O
                          ASUEGCOF  OF BIGASU-O
                          ASUEGAUT  OF BIGASU-O
                          ASUFORM1  OF BIGASU-O
                          ASUFORM2  OF BIGASU-O
                          LSU71     OF BIGASU-O
                          LSU72     OF BIGASU-O
                          LSU73     OF BIGASU-O
                          LPU74     OF BIGASU-O
                          LPU75     OF BIGASU-O
                          LPU76     OF BIGASU-O
                          RIN       OF BIGASU-O
                          ANTIC     OF BIGASU-O
                          INCENTIVO OF BIGASU-O
                          MATERNITA OF BIGASU-O
                          MATREG    OF BIGASU-O
                          MATREGEG  OF BIGASU-O
                          MATERNEDIL OF BIGASU-O
                          MATERNEG  OF BIGASU-O
                          ANFASU    OF BIGASU-O
                          ANFREG    OF BIGASU-O
                          ANFREGEG  OF BIGASU-O
                          ANFEDIL   OF BIGASU-O
                          ANFASUEG  OF BIGASU-O
                          ANFFORM1  OF BIGASU-O
                          ANFFORM2  OF BIGASU-O
                          ANF71     OF BIGASU-O
                          ANF72     OF BIGASU-O
                          ANF73     OF BIGASU-O
                          ANF74     OF BIGASU-O
                          ANF75     OF BIGASU-O
                          ANF76     OF BIGASU-O
                          RECU      OF BIGASU-O
                          RECURIN   OF BIGASU-O
                          RECUANT   OF BIGASU-O
                          IRPEF     OF BIGASU-O
                          IRPEFS    OF BIGASU-O
                          CONGRIMB  OF BIGASU-O
                          CONGDEB   OF BIGASU-O
                          ADDREG    OF BIGASU-O
                          ADDCOM    OF BIGASU-O
                          ADDREGR   OF BIGASU-O
                          ADDCOMR   OF BIGASU-O
                          RIMB730   OF BIGASU-O
                          DEB730    OF BIGASU-O
                          DEBITI    OF BIGASU-O
                          DEBASU    OF BIGASU-O
                          DEBITIEG  OF BIGASU-O
                          DEBITIINC OF BIGASU-O
                          ACCERD    OF BIGASU-O
                          ACCERA    OF BIGASU-O
                          ACCEREGD  OF BIGASU-O
                          ACCEREGA  OF BIGASU-O
                          ACCREGD   OF BIGASU-O
                          ACCREGA   OF BIGASU-O
                          ACCEGD    OF BIGASU-O
                          ACCEGA    OF BIGASU-O
                          TOTALE-ACCR
                          TOTALE-CONT
                          TOTALE-DEBI
                          RECSPE    OF RIGASPE-O
                          RECIVA    OF RIGAIVA-O
                          TOTDA     OF TOTALI-O
                          TOTAV     OF TOTALI-O
                          LPU280I   OF BIGLPU-O
                          LPU280R   OF BIGLPU-O
                          MATERNITA OF BIGLPU-O
                          ANF280I   OF BIGLPU-O
                          ANF280R   OF BIGLPU-O
                          RECU      OF BIGLPU-O
                          DEBITI    OF BIGLPU-O
                          IRPEF     OF BIGLPU-O
                          IRPEFS    OF BIGLPU-O
                          CONGRIMB  OF BIGLPU-O
                          CONGDEB   OF BIGLPU-O
                          ADDREG    OF BIGLPU-O
                          ADDCOM    OF BIGLPU-O
                          RIMB730   OF BIGLPU-O
                          DEB730    OF BIGLPU-O.
           move  zeros  to  STORNO OF STORNO-O.
       I05-EX.  exit.
      *
       I07-ACCESSO.
           move  "N"  to  W-NIK.
      *
           if  LLIVAUTO    =  "5"
           then
               move  LMATRICOLA    to  Z-MATRICOLA
               move  "N"           to  Z-RETCODE
               call   PDSPD13   using
                     WDFHEIBLK  WDFHCOMMAREA
                                       PER-PDSPD13
               end-call
               cancel  PDSPD13
               if  Z-RETCODE  =  "S"
               then
                   move  "S"  to  W-NIK
                   go  to  I07-EX
               end-if
           end-if.
      *------------------------------------------ Livello autorizz.
      *    if  LLIVAUTO  <  3
      *    then
      *        perform  T77-TESTO77    thru  T77-EX
      *        perform  W10-MSGERRORE  thru  W10-EX
      *        move  "S"  to  W-ERRORE
      *        go  to  I07-EX
      *    end-if.
      *------------------------------------- Privilegio SVA
           if  ID-LAVORO(1:8)  =  "P0098069"     or
               ID-LAVORO(1:8)  =  "P0098095"     or
               ID-LAVORO(1:8)  =  "P1098027"
           then
               if  ID-LAVORO(1:8)  =  "P0098095"
               then
                   move  "5"  to  LLIVAUTO
               end-if
               move  "S"  to  W-NIK
               move  "N"  to  W-ERRORE
           end-if.
       I07-EX.
           EXIT.
      *
       I10-DATA-ORA.
              MOVE FUNCTION CURRENT-DATE(1:8) TO
                   W8-ODIERNA.
      *
              move  W8-ODIAA      to  W6-ODIAA .
              move  W8-ODIMM      to  W6-ODIMM .
              move  W8-ODIGG      to  W6-ODIGG .
              compute  W4-ANNO-1  =  W8-ODIAA  -  1.
       I10-EX.
           exit.
      *
       I13-CENTRA.
      *    move  "S"     to  I-AZIONE.
      *    move  "G00"   to  I-ZKPROC.
      *    move  9999    to  I-ZKSEDE.
      *    move  11      to  I-ZKPROG.
      *    move  2009    to  I-ZKANNO.
      *    call  RDSTART
      *         using  I-START-AREA  O-START-AREA
      *    end-call.
      *    cancel   RDSTART .
      *    if  O-START-RTCD  =  "OK"
      *    then  if  O-ZDATA1  >  20091031
      *          then  continue
      *          else  move  "S"  to  W-ERRORE
      *                perform  T05-TESTO05    thru  T05-EX
      *                perform  W10-MSGERRORE thru  W10-EX
      *                go  to  I13-EX
      *          end-if
      *    else  move  "S"  to  W-ERRORE
      *          perform  T05-TESTO05    thru  T05-EX
      *          perform  W10-MSGERRORE thru  W10-EX
      *          go  to  I13-EX
      *    end-if.
      *
      *    if  H-PDATAELABO                 >=  O-ZDATA1
      *    then  move
                 move
      *     "*** DA  NON  TRASMETTERE  ALL''UFFICIO  RAGIONERIA  ***"
            "***   BIGLIETTO GIA''CONTABILIZZATO CENTRALMENTE    ***"
                                 to  W-CENTRA.
      *    else  move  spaces    to  W-CENTRA
      *          go  to  I13-EX
      *    end-if.
       I13-EX.
           exit.
       I25-APROFILE.
      *---------------------------------- Carico Tabella SX
           move  L-CODICE-SEDE(1:2)  to  WK-CODPROV.
           move  WK-CODPROV          to  H-R1CODPROV.
           PERFORM I25-DB2-SELECT-AS1 THRU I25-DB2-SELECT-AS1-EX.
           IF SQLCODE NOT = 0
               move  "96"             to  OUT-STATUS
               move  "S"              to  W-ERRORE
               move  "E"              to  L-RETCODE
               move  SPACES           to  VO-DSPFM034
               string   "errore TDSASUR1 prov=" WK-CODPROV
               DELIMITED BY SIZE       INTO VO-DSPFM034
               perform  W10-MSGERRORE thru  W10-EX
               go  to  I25-EX
           end-if.
           move  H-R1REG   to  H-R2REG.
           PERFORM I25-DB2-SELECT-AS2 THRU I25-DB2-SELECT-AS2-EX.
           IF SQLCODE NOT = 0
               move  "S"  to  W-ERRORE
               move  "E"  to  L-RETCODE
               move  "96"             to  OUT-STATUS
               move  SPACES           to  VO-DSPFM034
               string   "errore TDSASUR2 REG="  H-R2REG
               DELIMITED BY SIZE       INTO VO-DSPFM034
               perform  W10-MSGERRORE thru  W10-EX
               go  to  I25-EX
           end-if.
           INITIALIZE TAB-SX.
      *    MOVE 0 TO IND-SX.
      *    PERFORM 160 TIMES
      *        ADD 1 TO IND-SX
      *        MOVE SPACES      TO EL-COD-SX(IND-SX)
      *        MOVE 0           TO EL-REG-SX(IND-SX)
      *        MOVE 0           TO EL-ANNO-SX(IND-SX)
      *        MOVE SPACES      TO EL-VOCE-SX(IND-SX)
      *        MOVE 0           TO EL-PROG-SX(IND-SX)
      *        MOVE SPACES      TO EL-FINANZ-SX(IND-SX)
      *        MOVE SPACES      TO EL-ALF-SX-D(IND-SX)
      *        MOVE SPACES      TO EL-NUM-SX-D(IND-SX)
      *        MOVE SPACES      TO EL-ALF-SX-A(IND-SX)
      *        MOVE SPACES      TO EL-NUM-SX-A(IND-SX)
      *        MOVE SPACES      TO EL-99-SX-A(IND-SX)
      *        MOVE 0           TO EL-IMP-SX-D(IND-SX)
      *        MOVE 0           TO EL-IMP-SX-A(IND-SX)
      *    END-PERFORM.
      *
      *    MOVE SPACES TO H-CODCTG.
           MOVE ZEROES TO H-REGCTG
                          H-ANNOCTG.
           MOVE 1 TO IND-SX.
           PERFORM I25-DB2-DECL-CURS    THRU  I25-DB2-DECL-CURS-EX.
           PERFORM UNTIL IND-SX > 160
                      OR STATUS-CATEGORIE NOT = 0
               IF STATUS-CATEGORIE = 0
                   PERFORM I25-DB2-FETCH  THRU I25-DB2-FETCH-EX
               END-IF

               IF STATUS-CATEGORIE = 0
               AND H-REGIONE5 NOT = 30
               AND (    H-REGIONE1 = 0
                     OR H-REGIONE1 = 99
                     OR H-REGIONE1 = H-R1CODREG
                     OR H-REGIONE2 = H-R1CODREG
                     OR H-REGIONE3 = H-R1CODREG
                     OR H-REGIONE4 = H-R1CODREG
                     OR H-REGIONE5 = H-R1CODREG )
                   MOVE H-CODCTG      TO EL-COD-SX(IND-SX)
                   MOVE H-REGCTG      TO EL-REG-SX(IND-SX)
                   MOVE H-ANNOCTG     TO EL-ANNO-SX(IND-SX)
                   MOVE H-DESCTG      TO EL-VOCE-SX(IND-SX)
                   MOVE H-PROGCTG     TO EL-PROG-SX(IND-SX)
                   MOVE H-FINANZ      TO EL-FINANZ-SX(IND-SX)
                   MOVE H-CONTO1(1:3) TO EL-ALF-SX-D(IND-SX)
                   MOVE H-CONTO1(4:2) TO W-CONTO(1:2)
                   MOVE H-CONTO1(6:3) TO W-CONTO(4:3)
                   MOVE W-CONTO       TO EL-NUM-SX-D(IND-SX)

040222             IF EL-ALF-SX-D(IND-SX) = 'GVR'   and
040222                EL-NUM-SX-D(IND-SX) = '30121'
040222               initialize ind-save
040222               MOVE IND-SX  TO IND-SAVE
040222             END-IF

                   MOVE SPACES      TO EL-ALF-SX-A(IND-SX)
                   MOVE SPACES      TO EL-NUM-SX-A(IND-SX)
                   MOVE SPACES      TO EL-99-SX-A(IND-SX)
                   MOVE 0           TO EL-IMP-SX-D(IND-SX)
                   MOVE 0           TO EL-IMP-SX-A(IND-SX)
                   ADD 1 TO IND-SX
               END-IF
           END-PERFORM.
      *
           MOVE 139 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "A.N.F. SUSSIDIO FIN. FONDO OCC.     "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "XXX"       TO EL-ALF-SX-D(IND-SX).
           MOVE "00"        TO W-CONTO(1:2).
           MOVE "000"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-A(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-A(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 140 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "A.N.F. SUSSIDIO FIN. REGIONE        "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "XXX"       TO EL-ALF-SX-D(IND-SX).
           MOVE "00"        TO W-CONTO(1:2).
           MOVE "000"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-A(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-A(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 141 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "A.N.F. SUSSIDIO FIN. ENTE GESTORE   "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "XXX"       TO EL-ALF-SX-D(IND-SX).
           MOVE "00"        TO W-CONTO(1:2).
           MOVE "000"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-A(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-A(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 142 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "SUSS. LAV. SOMM. QUOTA ENTI BILAT.  "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "GPZ"       TO EL-ALF-SX-D(IND-SX).
           MOVE "35"        TO W-CONTO(1:2).
           MOVE "109"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-A(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-A(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 143 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "PROGETTO I.SO.LA. UNA TANTUM        "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "GPZ"       TO EL-ALF-SX-D(IND-SX).
           MOVE "35"        TO W-CONTO(1:2).
           MOVE "100"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-A(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-A(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 144 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "ANTICIPAZIONE SUSSIDIO STRAORDINARIO"
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "..."       TO EL-ALF-SX-D(IND-SX).
           MOVE ".."        TO W-CONTO(1:2).
           MOVE "..."       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-A(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-A(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 145 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "RECUPERI DA SPECIFICARE CON BCFC ALLEGATO"
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "52"        TO W-CONTO(1:2).
           MOVE "099"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX).
           MOVE "-99-"      TO EL-99-SX-A(IND-SX).
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 146 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "RECUPERI SU ANTICIPAZIONE SUSSIDIO       "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "..."       TO EL-ALF-SX-A(IND-SX).
           MOVE ".."        TO W-CONTO(1:2).
           MOVE "..."       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE "-99-"      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 147 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "RITENUTE IRPEF TASSAZIONE CORRENTE       "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX)
                               EL-ALF-SX-D(IND-SX).
           MOVE "27"        TO W-CONTO(1:2).
           MOVE "009"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
                               EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 148 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "RITENUTE IRPEF TASSAZIONE SEPARATA       "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX)
                               EL-ALF-SX-D(IND-SX).
           MOVE "27"        TO W-CONTO(1:2).
           MOVE "009"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
                               EL-NUM-SX-D(IND-SX).
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 149 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "IRPEF CONGUAGLIO FISCALE                 "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-D(IND-SX).
           MOVE "06"        TO W-CONTO(1:2).
           MOVE "105"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX)
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "29"        TO W-CONTO(1:2).
           MOVE "105"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 150 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "IRPEF ADDIZIONALE REG. ANNO PRECEDENTE   "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "29"        TO W-CONTO(1:2).
           MOVE "068"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 151 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "IRPEF ADDIZIONALE COM. ANNO PRECEDENTE   "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "29"        TO W-CONTO(1:2).
           MOVE "038"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 152 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "IRPEF ADDIZIONALE REG. ANNO CORRENTE     "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "29"        TO W-CONTO(1:2).
           MOVE "068"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 153 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "IRPEF ADDIZIONALE COM. ANNO CORRENTE     "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "25"        TO W-CONTO(1:2).
           MOVE "193"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 154 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "CONGUAGLIO 730/                          "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
      *17072020 gestione conguaglio 730 anche in DARE
           MOVE "GPA"       TO EL-ALF-SX-D(IND-SX).
           MOVE "53"        TO W-CONTO(1:2).
           MOVE "171"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX)
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "54"        TO W-CONTO(1:2).
           MOVE "071"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 155 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "DEBITI PER SUSS. STRAORD. FONDO OCC.     "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPA"       TO EL-ALF-SX-A(IND-SX).
           MOVE "10"        TO W-CONTO(1:2).
           MOVE "018"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 156 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "DEBITI PER SUSS. STRAORD. REGIONE        "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPZ"       TO EL-ALF-SX-A(IND-SX).
           MOVE "11"        TO W-CONTO(1:2).
           MOVE "100"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 157 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "DEBITI PER SUSS. STRAORD. ALTRI ENTI     "
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPZ"       TO EL-ALF-SX-A(IND-SX).
           MOVE "11"        TO W-CONTO(1:2).
           MOVE "100"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 158 TO IND-SX.
      *
           MOVE SPACES      TO EL-COD-SX(IND-SX).
           MOVE 0           TO EL-REG-SX(IND-SX).
           MOVE 0           TO EL-ANNO-SX(IND-SX).
           MOVE "DEBITI PER SUSS. STRAORD. ENTI BILATERALI"
                            TO EL-VOCE-SX(IND-SX).
           MOVE 0           TO EL-PROG-SX(IND-SX).
           MOVE SPACES      TO EL-FINANZ-SX(IND-SX).
           MOVE SPACES      TO EL-ALF-SX-D(IND-SX).
           MOVE SPACES      TO EL-NUM-SX-D(IND-SX).
           MOVE "GPZ"       TO EL-ALF-SX-A(IND-SX).
           MOVE "11"        TO W-CONTO(1:2).
           MOVE "109"       TO W-CONTO(4:3).
           MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
           MOVE SPACES      TO EL-99-SX-A(IND-SX)
           MOVE 0           TO EL-IMP-SX-D(IND-SX).
           MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 159 TO IND-SX.
      *
             MOVE SPACES      TO EL-COD-SX(IND-SX)
             MOVE 0           TO EL-REG-SX(IND-SX)
             MOVE 0           TO EL-ANNO-SX(IND-SX)
             MOVE "CREDITO VERSO ENTI: SUSS. STRAORD.       "
                              TO EL-VOCE-SX(IND-SX)
             MOVE 0           TO EL-PROG-SX(IND-SX)
             MOVE SPACES      TO EL-FINANZ-SX(IND-SX)
             MOVE "GPZ"       TO EL-ALF-SX-D(IND-SX)
             MOVE "00"        TO W-CONTO(1:2)
             MOVE "100"       TO W-CONTO(4:3)
             MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX)
             MOVE "GPZ"       TO EL-ALF-SX-A(IND-SX)
             MOVE "25"        TO W-CONTO(1:2)
             MOVE "100"       TO W-CONTO(4:3)
             MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
             MOVE SPACES      TO EL-99-SX-A(IND-SX)
             MOVE 0           TO EL-IMP-SX-D(IND-SX)
             MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *
           MOVE 160 TO IND-SX.
      *
             MOVE SPACES      TO EL-COD-SX(IND-SX)
             MOVE 0           TO EL-REG-SX(IND-SX)
             MOVE 0           TO EL-ANNO-SX(IND-SX)
             MOVE "CREDITO VERSO REGIONE: SUSS. STRAORD.    "
                              TO EL-VOCE-SX(IND-SX)
             MOVE 0           TO EL-PROG-SX(IND-SX)
             MOVE SPACES      TO EL-FINANZ-SX(IND-SX)
             MOVE "GPZ"       TO EL-ALF-SX-D(IND-SX)
             MOVE "00"        TO W-CONTO(1:2)
             MOVE "100"       TO W-CONTO(4:3)
             MOVE W-CONTO     TO EL-NUM-SX-D(IND-SX)
             MOVE "GPZ"       TO EL-ALF-SX-A(IND-SX)
             MOVE "25"        TO W-CONTO(1:2)
             MOVE "100"       TO W-CONTO(4:3)
             MOVE W-CONTO     TO EL-NUM-SX-A(IND-SX)
             MOVE SPACES      TO EL-99-SX-A(IND-SX)
             MOVE 0           TO EL-IMP-SX-D(IND-SX)
             MOVE 0           TO EL-IMP-SX-A(IND-SX).
      *---------------------------------- Apro file sindacati
      *---------------------------------- Carico tabella sindacati
160125* rivista la gestione dei sindacati
      *    MOVE 1 TO IND-SIND.
      * SSS correttivo per sindacati da 10 03 in poi
      *    PERFORM UNTIL IND-SIND > 90
      *    PERFORM UNTIL IND-SIND > 300
      * SSS-F
      *        MOVE IND-SIND TO WK-SINCODSIN
      *        MOVE WK-SINCODSIN (2:2) TO H-SINCODSIN
      *        MOVE "01" TO H-SINCATSIN
      *        PERFORM I25-DB2-SELECT THRU I25-DB2-SELECT-EX
      *        IF SQLCODE  = 0
      *            MOVE H-SINCODSIN   TO EL-COD-SIND(IND-SIND)
      *            MOVE H-SINDENSIN   TO EL-VOCE-SIND(IND-SIND)
      *            MOVE H-SINCONALF1  TO EL-ALF-SIND-A(IND-SIND)
      *            IF H-SINCONALF1 = "XXX"
      *                MOVE "GPA"  TO EL-ALF-SIND-A(IND-SIND)
      *            END-IF
      *            MOVE H-SINCONNUM1 TO W-CONNUM-N
      *            MOVE W-CONNUM-A(1:2) TO W-CONTO(1:2)
      *            MOVE W-CONNUM-A(3:3) TO W-CONTO(4:3)
      *            MOVE W-CONTO     TO EL-NUM-SIND-A(IND-SIND)
      *            MOVE 0           TO EL-IMP-SIND-A(IND-SIND)
      *            MOVE H-SINCONALF2  TO EL-ALF-SIND-C(IND-SIND)
      *            MOVE H-SINCONNUM2 TO W-CONNUM-N
      *            MOVE W-CONNUM-A(1:2) TO W-CONTO(1:2)
      *            MOVE W-CONNUM-A(3:3) TO W-CONTO(4:3)
      *            MOVE W-CONTO     TO EL-NUM-SIND-C(IND-SIND)
      *            MOVE 0           TO EL-IMP-SIND-C(IND-SIND)
      *            MOVE H-SINCONALF3  TO EL-ALF-SIND-D(IND-SIND)
      *            MOVE H-SINCONNUM3 TO W-CONNUM-N
      *            MOVE W-CONNUM-A(1:2) TO W-CONTO(1:2)
      *            MOVE W-CONNUM-A(3:3) TO W-CONTO(4:3)
      *            MOVE W-CONTO     TO EL-NUM-SIND-D(IND-SIND)
      *            MOVE 0           TO EL-IMP-SIND-D(IND-SIND)
      *        ELSE
      *            MOVE IND-SIND    TO EL-COD-SIND(IND-SIND)
      *            MOVE SPACES      TO EL-VOCE-SIND(IND-SIND)
      *            MOVE SPACES      TO EL-ALF-SIND-A(IND-SIND)
      *            MOVE SPACES      TO EL-NUM-SIND-A(IND-SIND)
      *            MOVE 0           TO EL-IMP-SIND-A(IND-SIND)
      *            MOVE SPACES      TO EL-ALF-SIND-C(IND-SIND)
      *            MOVE SPACES      TO EL-NUM-SIND-C(IND-SIND)
      *            MOVE 0           TO EL-IMP-SIND-C(IND-SIND)
      *            MOVE SPACES      TO EL-ALF-SIND-D(IND-SIND)
      *            MOVE SPACES      TO EL-NUM-SIND-D(IND-SIND)
      *            MOVE 0           TO EL-IMP-SIND-D(IND-SIND)
      *        END-IF
      *        ADD 1 TO IND-SIND
      *    END-PERFORM.
      * SSS correttivo per sindacati da 10 03 in poi
160125*    MOVE 100 TO IND-SIND.
160125     MOVE 1   TO IND-SIND.
160125*    MOVE 10  TO WK-SINCODSIN
160125*    MOVE 02  TO WK-SINCATSIN
160125     MOVE 01  TO WK-SINCODSIN
160125     MOVE 01  TO WK-SINCATSIN
160125*    MOVE WK-SINCODSIN (2:2) TO H-SINCODSIN
160125*    MOVE WK-SINCATSIN (2:2) TO H-SINCATSIN
160125*    PERFORM UNTIL IND-SIND > 300
160125     PERFORM UNTIL IND-SIND > 400
160125         MOVE WK-SINCODSIN (2:2) TO H-SINCODSIN
160125         MOVE WK-SINCATSIN (2:2) TO H-SINCATSIN
               PERFORM I25-DB2-SELECT THRU I25-DB2-SELECT-EX
               IF SQLCODE = 0
                 IF H-SINCONALF1 not = "XXX"
                   MOVE H-SINCODSIN TO EL-COD-SIND(IND-SIND)
160125             MOVE H-SINCATSIN TO EL-CAT-SIND(IND-SIND)
                   MOVE H-SINDENSIN TO EL-VOCE-SIND(IND-SIND)
                   MOVE H-SINCONALF1 TO EL-ALF-SIND-A(IND-SIND)
                   MOVE H-SINCONNUM1 TO W-CONNUM-N
                   MOVE W-CONNUM-A(1:2) TO W-CONTO(1:2)
                   MOVE W-CONNUM-A(3:3) TO W-CONTO(4:3)
                   MOVE W-CONTO TO EL-NUM-SIND-A(IND-SIND)
                   MOVE 0       TO EL-IMP-SIND-A(IND-SIND)
                   MOVE H-SINCONALF2 TO EL-ALF-SIND-C(IND-SIND)
                   MOVE H-SINCONNUM2 TO W-CONNUM-N
                   MOVE W-CONNUM-A(1:2) TO W-CONTO(1:2)
                   MOVE W-CONNUM-A(3:3) TO W-CONTO(4:3)
                   MOVE W-CONTO TO EL-NUM-SIND-C(IND-SIND)
                   MOVE 0       TO EL-IMP-SIND-C(IND-SIND)
                   MOVE H-SINCONALF3 TO EL-ALF-SIND-D(IND-SIND)
                   MOVE H-SINCONNUM3 TO W-CONNUM-N
                   MOVE W-CONNUM-A(1:2) TO W-CONTO(1:2)
                   MOVE W-CONNUM-A(3:3) TO W-CONTO(4:3)
                   MOVE W-CONTO TO EL-NUM-SIND-D(IND-SIND)
                   MOVE 0       TO EL-IMP-SIND-D(IND-SIND)
      *        display 'EL-COD-SIND(IND-SIND): '   EL-COD-SIND(IND-SIND)
      *        display 'EL-CAT-SIND(IND-SIND): '   EL-CAT-SIND(IND-SIND)
                 END-IF
160125           ADD 1 TO IND-SIND
160125           ADD 1 TO WK-SINCATSIN
               ELSE
160125             ADD  1 TO WK-SINCODSIN
160125             MOVE 1 TO WK-SINCATSIN

160125*            MOVE IND-SIND    TO EL-COD-SIND(IND-SIND)
160125*            MOVE SPACES      TO EL-VOCE-SIND(IND-SIND)
160125*            MOVE SPACES      TO EL-ALF-SIND-A(IND-SIND)
160125*            MOVE SPACES      TO EL-NUM-SIND-A(IND-SIND)
160125*            MOVE 0           TO EL-IMP-SIND-A(IND-SIND)
160125*            MOVE SPACES      TO EL-ALF-SIND-C(IND-SIND)
160125*            MOVE SPACES      TO EL-NUM-SIND-C(IND-SIND)
160125*            MOVE 0           TO EL-IMP-SIND-C(IND-SIND)
160125*            MOVE SPACES      TO EL-ALF-SIND-D(IND-SIND)
160125*            MOVE SPACES      TO EL-NUM-SIND-D(IND-SIND)
160125*            MOVE 0           TO EL-IMP-SIND-D(IND-SIND)
               END-IF
160125*        MOVE 10 TO WK-SINCODSIN
160125*        ADD 1 TO WK-SINCATSIN
160125*        MOVE WK-SINCODSIN (2:2) TO H-SINCODSIN
160125*        MOVE WK-SINCATSIN (2:2) TO H-SINCATSIN
           END-PERFORM.
      * SSS-F
      *
       I25-EX.
           exit.
      *
       I60-BLOCCO.
           move  "N"              to  W-FLAGYNCORSO.
      *------------------------------------ Memorizzo esecuzione
           move  L-CODICE-SEDE    to  C-CODICE-SEDE.
           move  L-CODICE-STOP    to  C-CODICE-STOP.
           move  L-NOME-SEDE      to  C-NOME-SEDE.
           move  L-NOME-STOP      to  C-NOME-STOP.
           move  L-PROCEDURA      to  C-PROCEDURA.
           move  "E"              to  C-RICHIESTA.
           move  L-PROGRESSIVO    to  C-PROGRESSIVO.
           move  zeros            to  C-CONGUAGLIO.
           move  spaces           to  C-DIRIGENTE
                                      C-ELABINCORSO
                                      C-RETCODE.
      *
           call  PDSPD16 USING
                     WDFHEIBLK  WDFHCOMMAREA
                     AREALINK-1  AREALINK-2
           end-call.
           cancel  PDSPD16 .
      *-------------------------------------- Elaborazione possibile?
           if  C-RETCODE      =  "C"   and
               C-ELABINCORSO  =  "Y"
           then
               move  "S"  to  W-FLAGYNCORSO
           else
               move  "S"  to  W-ERRORE
               perform  T76-TESTO76    thru  T76-EX
               perform  W10-MSGERRORE thru  W10-EX
           end-if.
       I60-EX.
           EXIT.
      *
       I70-DATISTRUTTURA.
           move  L-CODICE-SEDE  to  C-CODICE-SEDE.
           move  L-CODICE-STOP  to  C-CODICE-STOP.
           move  L-NOME-SEDE    to  C-NOME-SEDE.
           move  L-NOME-STOP    to  C-NOME-STOP.
           move  L-PROCEDURA    to  C-PROCEDURA.
           move  "I"            to  C-RICHIESTA.
           move  zeros          to  C-PROGRESSIVO
                                    C-CONGUAGLIO.
           move  spaces         to  C-DIRIGENTE
                                    C-ELABINCORSO
                                    C-RETCODE.
      *
           call  PDSPD16 USING
                     WDFHEIBLK  WDFHCOMMAREA
                     AREALINK-1  AREALINK-2
           end-call.
           cancel  PDSPD16 .
           if  C-RETCODE  =  "C"
           then
               go  to  I70-EX
           end-if.
           if  C-RETCODE  =  "E"
           then
               move  "S"  to  W-ERRORE
               perform  T70-TESTO70    thru  T70-EX
               perform  W10-MSGERRORE thru  W10-EX
               go  to  I70-EX
           end-if.
           if  C-RETCODE  =  "D"
           then
               move  "S"  to  W-ERRORE
               perform  T71-TESTO71    thru  T71-EX
               perform  W10-MSGERRORE thru  W10-EX
           end-if.
       I70-EX.
           EXIT.
      *
       K10-KONTROLLO.
           move  spaces       to  W-FATTOCALCOLO.
      *------------------------------------------- Controllo dati STOP
           perform I70-DATISTRUTTURA     thru  I70-EX.
           if  W-ERRORE  =  "S"
           then
               go  to  K10-EX
           end-if.
      *------------------------------------------- Ristampe          *
           if  L-RICHIESTA  =  "R"
           then
               perform  K30-CHK-RISTAMPE thru  K30-EX
               if  W-ERRORE  =  "S"
               then
                   go  to  K10-EX
               end-if
               go  to  K10-SALTO1
           end-if.
      *------------------------------------------- Dati calcolo/pagamen
           perform  K20-CHK-DATICALCOLO  thru  K20-EX.
           if  W-ERRORE  =  "S"
           then
               go  to  K10-EX
           end-if.
      *------------------------------------------- Dati rec.analitici
           perform  K25-CHK-LANALITICO   thru  K25-EX.
           if  W-ERRORE  =  "S"
           then
               go  to  K10-EX
           end-if.
      *------------------------------------------- Memorizzo esecuzione
           perform  I60-BLOCCO           thru  I60-EX.
           if  W-ERRORE  =  "S"
           then
               go  to  K10-EX
           end-if.
       K10-SALTO1.
      *---------------------------------------- Controllo centraliz. *
           perform I13-CENTRA        thru  I13-EX.
      *    if  W-ERRORE  =  "S"
      *    then
      *        go  to  K10-EX
      *GG  end-if.
      *------------------------------------------- Lettura fuori ciclo
      *
            IF  L-RICHIESTA  NOT =  "R"
                PERFORM K25-DB2-DECL-CURS    THRU
                        K25-DB2-DECL-CURS-EX
            END-IF.
      *
           PERFORM E30-DB2-FETCH  THRU E30-DB2-FETCH-EX.
           IF SQLCODE NOT = 0
                STRING "READ    "
                     "LDSAPRD1  "
                      F-LANALITICO
                DELIMITED BY SIZE INTO VO-DSPFM034
                move  "96" to  OUT-STATUS
                move  "S"  to  W-ERRORE
                move  "E"  to  L-RETCODE
           end-IF.
       K10-EX.
           EXIT.
      *
       K20-CHK-DATICALCOLO.
           initialize  DCLTDSRPG00.
           move  L-PROCEDURA      to  H-PPROCEDURA .
           move  L-CODICE-STOP    to  H-PSTRUTTURA .
      *    move  L-PROGRESSIVO  to  H-PPROGRESSI.
           move  "N"              to  H-PBACKUP    .
      *
           PERFORM K20-DB2-SELECT THRU K20-DB2-SELECT-EX.
           IF SQLCODE NOT = 0
               move  "N"        to  W-FATTOCALCOLO
           ELSE
               move  "S"        to  W-FATTOCALCOLO
           end-IF.
      *-------------------------------------- Verifica
           if  W-FATTOCALCOLO  =  "S"
           then
               if  H-PFINEPAGAM                 =  "S"
               then
                   move  zeros       to  W8-AAAAMMGG
                                         D8-GGMMAAAA
                   move  H-PDATAELABO
                                     to  W8-AAAAMMGG
                     move  W8-GG     to  D8-GG
                     move  W8-MM     to  D8-MM
                     move  W8-AAAA   to  D8-AAAA
      *            move  D8-GGMMAAAA to
      *                                  S5D102  S5D202
               else
                   move  "S"  to  W-ERRORE
                   perform  T73-TESTO73    thru  T73-EX
                   perform  W10-MSGERRORE thru  W10-EX
                   go  to  K20-EX
               end-if
               if  C-ELABINCORSO  =  "K"
               then
                   continue
               else
                   move  "S"  to  W-ERRORE
                   perform  T76-TESTO76    thru  T76-EX
                   perform  W10-MSGERRORE thru  W10-EX
                   go  to  K20-EX
               end-if
               if  (H-PPROGRESSI =                 L-PROGRESSIVO)  and
                   (H-PPROGRESSI =                 C-PROGRESSIVO)
               then
                   continue
               else
                   move  "S"  to  W-ERRORE
                   perform  T73-TESTO73    thru  T73-EX
                   perform  W10-MSGERRORE thru  W10-EX
                   go  to  K20-EX
               end-if
           else
               move  "S"  to  W-ERRORE
               perform  T73-TESTO73    thru  T73-EX
               perform  W10-MSGERRORE thru  W10-EX
           end-if.
       K20-EX.
           EXIT.
      *
       K25-CHK-LANALITICO.
           move  L-PROCEDURA      to  H-O0PROCEDURA.
           move  L-CODICE-STOP    to  H-O0DCOCENOPE.
           move  L-PROGRESSIVO    to  H-O0PROGRESSI.
           move  H-PDATAELABO
                              to  H-O0DATAELABO.
      *
           PERFORM K25-DB2-DECL-CURS    THRU  K25-DB2-DECL-CURS-EX.
           IF SQLCODE NOT = 0
               move  "N"        to  W-RECANALITICI
           ELSE
               move  "S"        to  W-RECANALITICI
           end-IF.
      *-------------------------------------- Verifica
           if  W-RECANALITICI  =  "S"
           then
               continue
           else
               move  "S"  to  W-ERRORE
               perform  T72-TESTO72    thru  T72-EX
               perform  W10-MSGERRORE thru  W10-EX
               go  to  K25-EX
           end-if.
       K25-EX.
           EXIT.
      *
       K30-CHK-RISTAMPE.
           initialize  DCLTDSRPG00.
      *
      *-------------------------------------- Ultimo pagamento?      *
      *
           move  L-PROCEDURA    to  H-PPROCEDURA.
           move  L-CODICE-STOP  to  H-PSTRUTTURA.
           move  "N"            to  H-PBACKUP   .
           move  L-PROGRESSIVO  to  H-PPROGRESSI.
           move  L-DATAELABO    to  H-PDATAELABO
           PERFORM K30R-DB2-SELECT THRU K30R-DB2-SELECT-EX
           IF SQLCODE NOT = 0
               move  "N"        to  W-FATTOCALCOLO
           ELSE
               move  "S"        to  W-FATTOCALCOLO
           end-IF.
      *
      *-------------------------------------- Pagamento in storico?  *
      *
           if  W-FATTOCALCOLO  =  "N"
           then
               move  L-PROCEDURA    to  H-PPROCEDURA
               move  L-CODICE-STOP  to  H-PSTRUTTURA
               move  "S"            to  H-PBACKUP
               move  L-PROGRESSIVO  to  H-PPROGRESSI
               move  L-DATAELABO    to  H-PDATAELABO
               PERFORM K30-DB2-SELECT THRU K30-DB2-SELECT-EX
               IF SQLCODE NOT = 0
                   move  "N"        to  W-FATTOCALCOLO
                   move  "S"        to  W-ERRORE
                   perform  T73-TESTO73    thru  T73-EX
                   perform  W10-MSGERRORE thru  W10-EX
                   go  to  K30-EX
               ELSE
                   move  "S"        to  W-FATTOCALCOLO
               end-IF
           end-if.
      *
      *------------------------------------------- dati mappa        *
      *
           move  zeros       to  W8-AAAAMMGG
                                 D8-GGMMAAAA.
           move  H-PDATAELABO
                             to  W8-AAAAMMGG.
           move  W8-GG       to  D8-GG.
           move  W8-MM       to  D8-MM.
           move  W8-AAAA     to  D8-AAAA.
      *    move  D8-GGMMAAAA to
      *                          S5D102  S5D202.
      *
      *------------------------------------------- Dati rec.analitici*
      *
           perform  K25-CHK-LANALITICO
           thru     K25-EX.
       K30-EX.  exit.
      *
       K30R-DB2-SELECT.
      *
           MOVE  'K30R-DB2-SELECT' TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PPROGRESSI,
                H_PDATAELABO,
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PPROGRESSI,
                :H-PDATAELABO,
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PPROCEDURA   =  :H-PPROCEDURA
                AND  H_PSTRUTTURA   =  :H-PSTRUTTURA
                AND  H_PPROGRESSI   =  :H-PPROGRESSI
                AND  H_PDATAELABO   =  :H-PDATAELABO
                AND  H_PCOSEDE      =  :H-PCOSEDE
                AND  H_PBACKUP      =  :H-PBACKUP
           END-EXEC.
           move  SQLCODE               to  F-LRIEPILOGO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       K30R-DB2-SELECT-EX.
           EXIT.
      *
      *-----------------------------------------------Testi msg
      *
       T04-TESTO04.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "ATTENZIONE:  errore generico nella consultazione  "
           to    M4A011.
           move  "dei valori di sistema;                            "
           to    M4A012.
           move  "                        Il programma termina.     "
           to    M4A013.
           move  '96'               to  OUT-STATUS.
       T04-EX.  exit.
      *
       T05-TESTO05.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "ATTENZIONE:  errore generico bloccante  nella     "
           to    M4A011.
           move  "richiesta di elaborazione.                        "
           to    M4A012.
           move  "                        Il programma termina.     "
           to    M4A013.
           move  '96'               to  OUT-STATUS.
       T05-EX.  exit.
      *
       T12-TESTO12.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "     Attenzione: sono in atto altre elaborazioni  "
           to    M4A011.
           move  "sullo stesso archivio, incompatibili con la fase  "
           to    M4A012.
           move  "richiesta.                                        "
           to    M4A013.
           move  "                       Il programma termina.      "
           to    M4A014.
           move  '96'               to  OUT-STATUS.
       T12-EX.  exit.
      *
       T14-TESTO14.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "     Attenzione: risulta già in uso l archivio di "
           to    M4A011.
           move  "ANALITICO  per il pagamento  della  indennità di  "
           to    M4A012.
           move  "disoccupazione ordinaria.                         "
           to    M4A013.
           move  "                       Il programma termina.      "
           to    M4A014.
           move  '96'               to  OUT-STATUS.
       T14-EX.  exit.
      *
       T70-TESTO70.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "ATTENZIONE:  Si è verificato un errore non gestito"
           to    M4A011.
           move  "nella consultazione dei  dati della struttura e   "
           to    M4A012.
           move  "quindi non è possibile continuare l elaborazione. "
           to    M4A013.
           move  '96'               to  OUT-STATUS.
       T70-EX.  exit.
      *
       T71-TESTO71.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "ATTENZIONE:  La  struttura  operativa  in uso  non"
           to    M4A011.
           move  "risulta  abilitata  alla  presenta  procedura  di "
           to    M4A012.
           move  "pagamento delle prestazioni: le relative funzioni "
           to    M4A013.
           move  "vengono inibite.                                  "
                to  M4A014.
           move  '96'               to  OUT-STATUS.
       T71-EX.  exit.
      *
       T72-TESTO72.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "ATTENZIONE:  E  stata rilevata una contraddizione "
           to    M4A011.
           move  "tra le informazioni relative alla struttura ed i  "
           to    M4A012.
           move  "pagamenti delle prestazioni in corso. Contattare  "
           to    M4A013.
           move  "i  numeri di assistenza indicati nell aiuto (F1). "
           to    M4A014.
           move  '96'               to  OUT-STATUS.
       T72-EX.  exit.
      *
       T73-TESTO73.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "ATTENZIONE:  Non sono presenti record di pagamento"
           to    M4A011.
           move  "relativi a codesta struttura, per i quali emettere"
           to    M4A012.
           move  "il documento richiesto.                           "
           to    M4A013.
           move  "                     Il programma termina.        "
           to    M4A014.
           move  '96'               to  OUT-STATUS.
       T73-EX.  exit.
      *
       T76-TESTO76.
           move  spaces  to  M4A011  M4A012  M4A013  M4A014.
           move  "Attenzione:  risulta avviata elaborazione da altra"
           to    M4A011.
           move  "unità sullo stesso archivio: il programma non può "
           to    M4A012.
           move  "continuare. Riprovare quando termina la fase in   "
           to    M4A013.
           move  "corso.                                            "
           to    M4A014.
           move  '96'               to  OUT-STATUS.
       T76-EX.  exit.
      *
       W10-MSGERRORE.
      *
           if  OUT-STATUS = '96' OR OUT-STATUS = '99'
           then
              move   VO-DSPFM034  to  OUT-MESSAGGIO
           end-if.
      *
       W10-EX.  exit.
      *--------------------------------------------------------*
       SCRIVI-TABINT1.
      *
090523     if  LMATRICOLA  =  "78360000"    and
               L-CODICE-SEDE  =  "0200"
           then
               display "NIK rdspd05,IMPDA      :   "  IMPDA
               display "NIK rdspd05,IMPAV      :   "  IMPAV
090523     end-if.
      *
           IF IMPDA > 0
               STRING ALFDA      DELIMITED BY SIZE
                      " "        DELIMITED BY SIZE
                      NUMDA      DELIMITED BY SIZE
      *               "/"        DELIMITED BY SIZE
      *               NUMDA(3:3) DELIMITED BY SIZE
                 INTO W-TR-CONTO
                 MOVE "D" TO W-TR-SEZIONE
                 MOVE IMPDA TO W-TR-IMPORTO
                 MOVE 1 TO IND-TR
                 PERFORM SCORRI-TABINT1 UNTIL IND-TR > 300
           END-IF.
           IF IMPAV > 0
               STRING ALFAV      DELIMITED BY SIZE
                      " "        DELIMITED BY SIZE
                      NUMAV      DELIMITED BY SIZE
                 INTO W-TR-CONTO
                 MOVE "A" TO W-TR-SEZIONE
                 MOVE IMPAV TO W-TR-IMPORTO
                 MOVE 1 TO IND-TR
                 PERFORM SCORRI-TABINT1 UNTIL IND-TR > 300
           END-IF.
      *
       SCRIVI-TABINT1-SPE.
           MOVE "GPA 24/042" TO W-TR-CONTO.
           MOVE "A" TO W-TR-SEZIONE
           MOVE RECSPE OF RIGASPE-O TO W-TR-IMPORTO
                                       WK-APP-RECSPE
           MOVE 1 TO IND-TR
           PERFORM SCORRI-TABINT1 UNTIL IND-TR > 300.
      *
       SCRIVI-TABINT1-IVA.
           MOVE "GPA 24/025" TO W-TR-CONTO.
           MOVE "A" TO W-TR-SEZIONE
           MOVE RECIVA OF RIGAIVA-O TO W-TR-IMPORTO
                                       WK-APP-RECIVA
           MOVE 1 TO IND-TR
           PERFORM SCORRI-TABINT1 UNTIL IND-TR > 300.
      *
       SCORRI-TABINT1.
GGA        IF  T-BCA-IMPORTO(IND-TR) = 0
      *    IF  T-BCA-CONTO(IND-TR) = SPACES
               MOVE W-TR-CONTO   TO T-BCA-CONTO(IND-TR)
               MOVE W-TR-SEZIONE TO T-BCA-SEZIONE(IND-TR)
               MOVE W-TR-IMPORTO TO T-BCA-IMPORTO(IND-TR)
               MOVE 301 TO IND-TR
           ELSE
               IF  W-TR-CONTO = T-BCA-CONTO(IND-TR)
               AND W-TR-SEZIONE = T-BCA-SEZIONE(IND-TR)
                   ADD W-TR-IMPORTO TO T-BCA-IMPORTO(IND-TR)
                   MOVE 301 TO IND-TR
               ELSE
                   ADD 1 TO IND-TR
               END-IF
           END-IF.
      *
090523     if  LMATRICOLA  =  "78360000"    and
               L-CODICE-SEDE  =  "0200"
           then
               display "NIK rdspd05, IND-TR  :   "  IND-TR
               display "NIK ,EL-TABINT1 :"  EL-TABINT1(IND-TR)
090523     end-if.
      *--------------------------------------------------------*
       CARICA-TABELLA-RECUPERI.
           MOVE 1 TO IND-R.
           MOVE 1 TO IND-REC.
           PERFORM UNTIL IND-R > 30
                      OR LRECCOREAL(IND-R) = SPACES
              MOVE 1 TO IND-REC
              PERFORM UNTIL IND-REC > 200
                 STRING LRECCORENU(IND-R)(1:2) DELIMITED BY SIZE
                        "/"                    DELIMITED BY SIZE
                        LRECCORENU(IND-R)(3:3) DELIMITED BY SIZE
                   INTO W-CONTO
                 IF  EL-ALF-REC-A(IND-REC) = SPACES
                    MOVE SPACES            TO EL-VOCE-REC(IND-REC)
                    MOVE LRECCOREAL(IND-R) TO EL-ALF-REC-A(IND-REC)
                    MOVE W-CONTO           TO EL-NUM-REC-A(IND-REC)
                    MOVE LRECIMUREE(IND-R) TO EL-IMP-REC-A(IND-REC)
                    MOVE 201 TO IND-REC
                 ELSE
                    IF  LRECCOREAL(IND-R) = EL-ALF-REC-A(IND-REC)
                    AND W-CONTO = EL-NUM-REC-A(IND-REC)
                       ADD LRECIMUREE(IND-R) TO EL-IMP-REC-A(IND-REC)
                       MOVE 201 TO IND-REC
                    ELSE
                       ADD 1 TO IND-REC
                    END-IF
                 END-IF
              END-PERFORM
              ADD 1 TO IND-R
           END-PERFORM.
       A10-DB2-SELECT.
      *
           MOVE  'A10-DB2-SELECT' TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PPROGRESSI,
                H_PDATAELABO,
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PPROGRESSI,
                :H-PDATAELABO,
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PPROCEDURA   =  :H-PPROCEDURA
                AND  H_PSTRUTTURA   =  :H-PSTRUTTURA
                AND  H_PCOSEDE      =  :H-PCOSEDE
                AND  H_PBACKUP      =  :H-PBACKUP
           END-EXEC.
           move  SQLCODE               to  F-LRIEPILOGO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
      *
       A10-DB2-SELECT-EX.
           EXIT.
      *
       K20-DB2-SELECT.
      *
           MOVE  'K20-DB2-SELECT' TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PPROGRESSI,
                H_PDATAELABO,
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PPROGRESSI,
                :H-PDATAELABO,
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PPROCEDURA   =  :H-PPROCEDURA
                AND  H_PSTRUTTURA   =  :H-PSTRUTTURA
                AND  H_PCOSEDE      =  :H-PCOSEDE
                AND  H_PBACKUP      =  :H-PBACKUP
           END-EXEC.
           move  SQLCODE               to  F-LRIEPILOGO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       K20-DB2-SELECT-EX.
           EXIT.
      *
       K30-DB2-SELECT.
      *
           MOVE  'K30-DB2-SELECT' TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PPROGRESSI,
                H_PDATAELABO,
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PPROGRESSI,
                :H-PDATAELABO,
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PPROCEDURA   =  :H-PPROCEDURA
                AND  H_PSTRUTTURA   =  :H-PSTRUTTURA
                AND  H_PPROGRESSI   =  :H-PPROGRESSI
                AND  H_PDATAELABO   =  :H-PDATAELABO
                AND  H_PCOSEDE      =  :H-PCOSEDE
                AND  H_PBACKUP      =  :H-PBACKUP
           END-EXEC.
           move  SQLCODE               to  F-LRIEPILOGO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
      *
       K30-DB2-SELECT-EX.
           EXIT.
      *
      *
       I25-DB2-SELECT-AS1.
      *
           MOVE  'I25-DB2-SELECT-AS1' TO  WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                    H_R1CODPROV,
                    H_R1CODREG,
                    H_R1REG,
                    H_R1CODPROV,
                    H_R1CODREG,
                    H_R1REG
           INTO
                    :H-R1CODPROV,
                    :H-R1CODREG,
                    :H-R1REG,
                    :H-R1CODPROV,
                    :H-R1CODREG,
                    :H-R1REG
              FROM TDSASUR1
              WHERE
                     H_R1CODPROV      =  :H-R1CODPROV
           END-EXEC.
           move  SQLCODE               to  STATUS-ASUR1.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSASUR1=' DCLTDSASUR1
               MOVE 'TDSASUR1'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I25-DB2-SELECT-AS1-EX.
           EXIT.
      *
       I25-DB2-SELECT-AS2.
      *
           MOVE 'I25-DB2-SELECT-AS2' TO  WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                    H_R2BLOCCO,
                    H_R2CODREG,
                    H_R2REG,
                    H_R2SINO,
                    H_R2BLOCCO,
                    H_R2CODREG,
                    H_R2REG,
                    H_R2SINO
           INTO
                    :H-R2BLOCCO,
                    :H-R2CODREG,
                    :H-R2REG,
                    :H-R2SINO,
                    :H-R2BLOCCO,
                    :H-R2CODREG,
                    :H-R2REG,
                    :H-R2SINO
              FROM TDSASUR2
              WHERE
                     H_R2REG          =  :H-R2REG
           END-EXEC.
           move  SQLCODE               to  STATUS-ASUR2.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSASUR2=' DCLTDSASUR2
               MOVE 'TDSASUR2'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I25-DB2-SELECT-AS2-EX.
           EXIT.
      *
       I25-DB2-SELECT.
      *
           MOVE  'I25-DB2-SELECT' TO  WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                    H_SINALIASU,
                    H_SINALIDS,
                    H_SINALIMOB,
                    H_SINALIRR,
                    H_SINCATSIN,
                    H_SINCODSIN,
                    H_SINCONALF1,
                    H_SINCONALF2,
                    H_SINCONALF3,
                    H_SINCONFED,
                    H_SINCONNUM1,
                    H_SINCONNUM2,
                    H_SINCONNUM3,
                    H_SINDENSIN,
                    H_SINSPERIS,
                    H_SINALIASU,
                    H_SINALIDS,
                    H_SINALIMOB,
                    H_SINALIRR,
                    H_SINCATSIN,
                    H_SINCODSIN,
                    H_SINCONALF1,
                    H_SINCONALF2,
                    H_SINCONALF3,
                    H_SINCONFED,
                    H_SINCONNUM1,
                    H_SINCONNUM2,
                    H_SINCONNUM3,
                    H_SINDENSIN,
                    H_SINSPERIS,
                    H_SINALIASU,
                    H_SINALIDS,
                    H_SINALIMOB,
                    H_SINALIRR,
                    H_SINCATSIN,
                    H_SINCODSIN,
                    H_SINCONALF1,
                    H_SINCONALF2,
                    H_SINCONALF3,
                    H_SINCONFED,
                    H_SINCONNUM1,
                    H_SINCONNUM2,
                    H_SINCONNUM3,
                    H_SINDENSIN,
                    H_SINSPERIS
           INTO
                    :H-SINALIASU,
                    :H-SINALIDS,
                    :H-SINALIMOB,
                    :H-SINALIRR,
                    :H-SINCATSIN,
                    :H-SINCODSIN,
                    :H-SINCONALF1,
                    :H-SINCONALF2,
                    :H-SINCONALF3,
                    :H-SINCONFED,
                    :H-SINCONNUM1,
                    :H-SINCONNUM2,
                    :H-SINCONNUM3,
                    :H-SINDENSIN,
                    :H-SINSPERIS,
                    :H-SINALIASU,
                    :H-SINALIDS,
                    :H-SINALIMOB,
                    :H-SINALIRR,
                    :H-SINCATSIN,
                    :H-SINCODSIN,
                    :H-SINCONALF1,
                    :H-SINCONALF2,
                    :H-SINCONALF3,
                    :H-SINCONFED,
                    :H-SINCONNUM1,
                    :H-SINCONNUM2,
                    :H-SINCONNUM3,
                    :H-SINDENSIN,
                    :H-SINSPERIS,
                    :H-SINALIASU,
                    :H-SINALIDS,
                    :H-SINALIMOB,
                    :H-SINALIRR,
                    :H-SINCATSIN,
                    :H-SINCODSIN,
                    :H-SINCONALF1,
                    :H-SINCONALF2,
                    :H-SINCONALF3,
                    :H-SINCONFED,
                    :H-SINCONNUM1,
                    :H-SINCONNUM2,
                    :H-SINCONNUM3,
                    :H-SINDENSIN,
                    :H-SINSPERIS
              FROM TDSSINDA
              WHERE
                     H_SINCODSIN      =  :H-SINCODSIN
                AND  H_SINCATSIN      =  :H-SINCATSIN
           END-EXEC.
           move  SQLCODE               to  STATUS-SINDACATO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSINDA=' DCLTDSSINDA
               MOVE 'TDSSINDA'    TO  WABNDB-TABL
               MOVE 'SELECT'      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I25-DB2-SELECT-EX.
           EXIT.
      *
       A12-DB2-UPDATE.
      *
           MOVE  'A12-DB2-UPDATE' TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           UPDATE TDSRPG00
           SET
               H_PIMPCONTAB        =  :H-PIMPCONTAB,
               H_PDATAEMISS        =  :H-PDATAEMISS
            WHERE
                     H_PCOSEDE        =  :H-PCOSEDE
                AND  H_PDATAELABO     =  :H-PDATAELABO
                AND  H_PPROCEDURA     =  :H-PPROCEDURA
                AND  H_PPROGRESSI     =  :H-PPROGRESSI
                AND  H_PSTRUTTURA     =  :H-PSTRUTTURA
           END-EXEC.
      *
           move  SQLCODE               to  F-LANALITICO.
      *
       A12-DB2-UPDATE-EX.
           EXIT.
      *
       E30-DB2-FETCH.
      *
           MOVE  'E30-DB2-FETCH' TO  WABNDB-LABEL.
           EXEC SQL
                 FETCH CURAIO
                  INTO
                    :H-O0AADIMPSPE ,
                    :H-O0AADRECUP ,
                    :H-O0AADSTAPAG ,
                    :H-O0ACQUISITO ,
                    :H-O0CFISCALE ,
                    :H-O0CODICE1 ,
                    :H-O0CODICE2 ,
                    :H-O0CODICE3 ,
                    :H-O0CODICE4 ,
                    :H-O0CODICE5 ,
                    :H-O0CODICE6 ,
                    :H-O0COMPATTO ,
                    :H-O0COSEDE ,
                    :H-O0DATAELABO ,
                    :H-O0DCOANFRIC ,
                    :H-O0DCOCENOPE ,
                    :H-O0DCOCHIDOM ,
                    :H-O0DCOCODFIS ,
                    :H-O0DCOCODPAT ,
                    :H-O0DCOCOOBAN ,
                    :H-O0DCOCOTIDO ,
                    :H-O0DCODTADEC ,
                    :H-O0DCODTDESP ,
                    :H-O0DCODTULSP ,
                    :H-O0DCOPESTDI ,
                    :H-O0DCOULESSP ,
                    :H-O0DOMANDA ,
                    :H-O0FACAL ,
                    :H-O0FACDAL ,
                    :H-O0FACDETFAM ,
                    :H-O0FACDETLAV ,
                    :H-O0FACGGDETR ,
                    :H-O0FACGGPRES ,
                    :H-O0FACIMPDET ,
                    :H-O0FACIMPLOR ,
                    :H-O0FACIMPNET ,
                    :H-O0FACIMPONI ,
                    :H-O0FACTREDIC ,
                    :H-O0FADANFPAG ,
                    :H-O0FADFINE ,
                    :H-O0FADINIZIO ,
                    :H-O0FADNETPAG ,
                    :H-O0FADRECANF ,
                    :H-O0FADRECIND ,
                    :H-O0FADTRASIN ,
                    :H-O0FAPAL ,
                    :H-O0FAPALIQME ,
                    :H-O0FAPDAL ,
                    :H-O0FAPGGDETR ,
                    :H-O0FAPGGPRES ,
                    :H-O0FAPIMPDET ,
                    :H-O0FAPIMPLOR ,
                    :H-O0FAPIMPNET ,
                    :H-O0FAPIMPONI ,
                    :H-O0FAPTREDIC ,
                    :H-O0FCODCOMUN ,
                    :H-O0FCODPAGA1 ,
                    :H-O0FCODPAGA2 ,
                    :H-O0FCODPAGA3 ,
                    :H-O0FCONGAC ,
                    :H-O0FCONGAP ,
                    :H-O0FIMPCOMAC ,
                    :H-O0FIMPCOMAP ,
                    :H-O0FIMPPAGA1 ,
                    :H-O0FIMPPAGA2 ,
                    :H-O0FIMPPAGA3 ,
                    :H-O0FIMPPROAC ,
                    :H-O0FIMPPROAP ,
                    :H-O0FIMPREGAC ,
                    :H-O0FIMPREGAP ,
                    :H-O0IMPORTO1 ,
                    :H-O0IMPORTO2 ,
                    :H-O0IMPORTO3 ,
                    :H-O0IMPORTO4 ,
                    :H-O0IMPORTO5 ,
                    :H-O0IMPORTO6 ,
                    :H-O0PROCEDURA ,
                    :H-O0PROGRESSI ,
                    :H-O0PUADDIZC ,
                    :H-O0PUADDIZR ,
                    :H-O0PUCONG730 ,
                    :H-O0PUCONGFIS ,
                    :H-O0PUGGCALC ,
                    :H-O0PUIMANFT ,
                    :H-O0PUIMANFU ,
                    :H-O0PUIMINT ,
                    :H-O0PUIMINU ,
                    :H-O0PUINDEB ,
                    :H-O0PUIRPEFU ,
                    :H-O0PUMAGANF ,
                    :H-O0PUMAGANFT ,
                    :H-O0PUTIPPROG ,
                    :H-O0PUTRASIND ,
                    :H-O0PUTSCAT ,
                    :H-O0PUTSCONF ,
                    :H-O0PUULASS ,
                    :H-O0RECIMURE1 ,
                    :H-O0RECIMURE2 ,
                    :H-O0RECIMURE3 ,
                    :H-O0RECPAGATO ,
                    :H-O0RECTOREE1 ,
                    :H-O0RECTOREE2 ,
                    :H-O0RECTOREE3 ,
                    :H-O0RECTORER1 ,
                    :H-O0RECTORER2 ,
                    :H-O0RECTORER3 ,
                    :H-O0SUADDIZC ,
                    :H-O0SUADDIZR ,
                    :H-O0SUADDIZRC ,
                    :H-O0SUADDIZRR ,
                    :H-O0SUANFASUT ,
                    :H-O0SUANFASUU ,
                    :H-O0SUANNODEL ,
                    :H-O0SUCFENTE ,
                    :H-O0SUCONG730 ,
                    :H-O0SUCONGFIS ,
                    :H-O0SUEDIL ,
                    :H-O0SUFIN ,
                    :H-O0SUGGCALC ,
                    :H-O0SUIMANFT ,
                    :H-O0SUIMANFU ,
                    :H-O0SUIMASUT ,
                    :H-O0SUIMASUU ,
                    :H-O0SUIMINT ,
                    :H-O0SUIMINU ,
                    :H-O0SUIMRIN ,
                    :H-O0SUIMRINU ,
                    :H-O0SUINCENT ,
                    :H-O0SUINDEB ,
                    :H-O0SUIRPEFU ,
                    :H-O0SULPU ,
                    :H-O0SUMAGANF ,
                    :H-O0SUMAGANFT ,
                    :H-O0SUMATASUT ,
                    :H-O0SUMATASUU ,
                    :H-O0SUNUMDEL ,
                    :H-O0SURECRIN ,
                    :H-O0SUTIPPRO ,
                    :H-O0SUTRASIND ,
                    :H-O0SUTRASINR ,
                    :H-O0SUTSCAT ,
                    :H-O0SUTSCONF ,
                    :H-O0SUULASS ,
                    :H-O0SXADDIZC ,
                    :H-O0SXADDIZR ,
                    :H-O0SXADDIZRC ,
                    :H-O0SXADDIZRR ,
                    :H-O0SXANNIND ,
                    :H-O0SXCODIND ,
                    :H-O0SXCONG730 ,
                    :H-O0SXCONGFIS ,
                    :H-O0SXDTAL1 ,
                    :H-O0SXDTAL2 ,
                    :H-O0SXGGCALC ,
                    :H-O0SXIMANFT ,
                    :H-O0SXIMANFU ,
                    :H-O0SXIMINT ,
                    :H-O0SXIMINU ,
                    :H-O0SXIMRIN ,
                    :H-O0SXIMRINU ,
                    :H-O0SXINDEB ,
                    :H-O0SXIRPEFU ,
                    :H-O0SXNUML1 ,
                    :H-O0SXNUML2 ,
                    :H-O0SXRECRIN ,
                    :H-O0SXREGIND ,
                    :H-O0SXTRASIND ,
                    :H-O0SXTRASINR ,
                    :H-O0SXTSCAT ,
                    :H-O0SXTSCONF ,
                    :H-O0SXULASS
          END-EXEC.
      *
           move  SQLCODE               to  F-LANALITICO.
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSVPIO0=' DCLTDSAPIO0
               MOVE 'TDSVPIO0'    TO  WABNDB-TABL
               MOVE 'FETCH '      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E30-DB2-FETCH-EX.
           EXIT.
      *
       I25-DB2-FETCH.
      *
           MOVE  'I25-DB2-FETCH' TO  WABNDB-LABEL.
           EXEC SQL
                 FETCH CURCATG
                  INTO
                    :H-REGIONE1,
                    :H-REGIONE2,
                    :H-REGIONE3,
                    :H-REGIONE4,
                    :H-REGIONE5,
                    :H-CODCTG,
                    :H-REGCTG,
                    :H-ANNOCTG,
                    :H-DESCTG,
                    :H-PROGCTG,
                    :H-FINANZ,
                    :H-CONTO1
          END-EXEC.
           move  SQLCODE               to  STATUS-CATEGORIE.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSX00 =' DCLTDSSX00
               MOVE 'TDSSX00 '    TO  WABNDB-TABL
               MOVE 'FETCH '      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I25-DB2-FETCH-EX.
           EXIT.
      *
       K10-DB2-CLSCUR.
      *
           MOVE  'K10-DB2-CLSCUR' TO  WABNDB-LABEL.
           EXEC SQL
                 CLOSE CURAIO
           END-EXEC.
           move  SQLCODE               to  F-LANALITICO.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSVPIO0'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       K10-DB2-CLSCUR-EX.
           exit.
      *
       I25-DB2-CLSCUR.
      *
           MOVE  'I25-DB2-CLSCUR' TO  WABNDB-LABEL.
           EXEC SQL
                 CLOSE CURCATG
           END-EXEC.
           move  SQLCODE               to  STATUS-CATEGORIE.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSSX00 '    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I25-DB2-CLSCUR-EX.
           exit.
      *
       K25-DB2-DECL-CURS.
      *
           MOVE  'K25-DB2-DECL-CURS     '  TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-O0COSEDE.
      *
           EXEC SQL
                 OPEN CURAIO
           END-EXEC.
           move  SQLCODE               to  F-LANALITICO.
      *
           IF SQLCODE NOT = ZERO
               DISPLAY 'DCLTDSVPIO0=' DCLTDSAPIO0
               MOVE 'TDSVPIO0'    TO  WABNDB-TABL
               MOVE 'OPEN   '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *

      *
       K25-DB2-DECL-CURS-EX.
           EXIT.
      *
      *
       I25-DB2-DECL-CURS.
      *
           MOVE  'I25-DB2-DECL-CURS     '  TO  WABNDB-LABEL.
      *
           EXEC SQL
                 OPEN CURCATG
           END-EXEC.
           move  SQLCODE               to  STATUS-CATEGORIE.
      *
           IF SQLCODE NOT = ZERO
               DISPLAY 'DCLTDSSX00 =' DCLTDSSX00
               MOVE 'TDSSX00 '    TO  WABNDB-TABL
               MOVE 'OPEN   '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *

       I25-DB2-DECL-CURS-EX.
           EXIT.
      *
      * INSERIMENTO RIGA DI STAMPA
      *
       S30-INSERT-REPORT.
      *
           MOVE  'S30-INSERT-REPORT     '  TO  WABNDB-LABEL.
      *
           EXEC SQL
                   INSERT  INTO TDSREPOR
                   VALUES  (:DCLTDSREPOR)
           END-EXEC.
      *
           IF    SQLCODE NOT = ZERO
                   DISPLAY 'DCLTDSREPOR=' DCLTDSREPOR
                   MOVE 'TDSREPOR' TO WABNDB-TABL
                   MOVE 'INSERT  ' TO WABNDB-FUNC
                   PERFORM ERRORE-SQL
           END-IF.
      *
       S30-EX-INSERT-REPORT.
      *
           EXIT.
      *
       E30-DB2-SELECT.
      *
           MOVE 'E30-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-O0COSEDE.
      *
           EXEC SQL
           SELECT
                     H_O0AADIMPSPE ,
                     H_O0AADRECUP ,
                     H_O0AADSTAPAG ,
                     H_O0ACQUISITO ,
                     H_O0CFISCALE ,
                     H_O0CODICE1 ,
                     H_O0CODICE2 ,
                     H_O0CODICE3 ,
                     H_O0CODICE4 ,
                     H_O0CODICE5 ,
                     H_O0CODICE6 ,
                     H_O0COMPATTO ,
                     H_O0COSEDE ,
                     H_O0DATAELABO ,
                     H_O0DCOANFRIC ,
                     H_O0DCOCENOPE ,
                     H_O0DCOCHIDOM ,
                     H_O0DCOCODFIS ,
                     H_O0DCOCODPAT ,
                     H_O0DCOCOOBAN ,
                     H_O0DCOCOTIDO ,
                     H_O0DCODTADEC ,
                     H_O0DCODTDESP ,
                     H_O0DCODTULSP ,
                     H_O0DCOPESTDI ,
                     H_O0DCOULESSP ,
                     H_O0DOMANDA ,
                     H_O0FACAL ,
                     H_O0FACDAL ,
                     H_O0FACDETFAM ,
                     H_O0FACDETLAV ,
                     H_O0FACGGDETR ,
                     H_O0FACGGPRES ,
                     H_O0FACIMPDET ,
                     H_O0FACIMPLOR ,
                     H_O0FACIMPNET ,
                     H_O0FACIMPONI ,
                     H_O0FACTREDIC ,
                     H_O0FADANFPAG ,
                     H_O0FADFINE ,
                     H_O0FADINIZIO ,
                     H_O0FADNETPAG ,
                     H_O0FADRECANF ,
                     H_O0FADRECIND ,
                     H_O0FADTRASIN ,
                     H_O0FAPAL ,
                     H_O0FAPALIQME ,
                     H_O0FAPDAL ,
                     H_O0FAPGGDETR ,
                     H_O0FAPGGPRES ,
                     H_O0FAPIMPDET ,
                     H_O0FAPIMPLOR ,
                     H_O0FAPIMPNET ,
                     H_O0FAPIMPONI ,
                     H_O0FAPTREDIC ,
                     H_O0FCODCOMUN ,
                     H_O0FCODPAGA1 ,
                     H_O0FCODPAGA2 ,
                     H_O0FCODPAGA3 ,
                     H_O0FCONGAC ,
                     H_O0FCONGAP ,
                     H_O0FIMPCOMAC ,
                     H_O0FIMPCOMAP ,
                     H_O0FIMPPAGA1 ,
                     H_O0FIMPPAGA2 ,
                     H_O0FIMPPAGA3 ,
                     H_O0FIMPPROAC ,
                     H_O0FIMPPROAP ,
                     H_O0FIMPREGAC ,
                     H_O0FIMPREGAP ,
                     H_O0IMPORTO1 ,
                     H_O0IMPORTO2 ,
                     H_O0IMPORTO3 ,
                     H_O0IMPORTO4 ,
                     H_O0IMPORTO5 ,
                     H_O0IMPORTO6 ,
                     H_O0PROCEDURA ,
                     H_O0PROGRESSI ,
                     H_O0PUADDIZC ,
                     H_O0PUADDIZR ,
                     H_O0PUCONG730 ,
                     H_O0PUCONGFIS ,
                     H_O0PUGGCALC ,
                     H_O0PUIMANFT ,
                     H_O0PUIMANFU ,
                     H_O0PUIMINT ,
                     H_O0PUIMINU ,
                     H_O0PUINDEB ,
                     H_O0PUIRPEFU ,
                     H_O0PUMAGANF ,
                     H_O0PUMAGANFT ,
                     H_O0PUTIPPROG ,
                     H_O0PUTRASIND ,
                     H_O0PUTSCAT ,
                     H_O0PUTSCONF ,
                     H_O0PUULASS ,
                     H_O0RECIMURE1 ,
                     H_O0RECIMURE2 ,
                     H_O0RECIMURE3 ,
                     H_O0RECPAGATO ,
                     H_O0RECTOREE1 ,
                     H_O0RECTOREE2 ,
                     H_O0RECTOREE3 ,
                     H_O0RECTORER1 ,
                     H_O0RECTORER2 ,
                     H_O0RECTORER3 ,
                     H_O0SUADDIZC ,
                     H_O0SUADDIZR ,
                     H_O0SUADDIZRC ,
                     H_O0SUADDIZRR ,
                     H_O0SUANFASUT ,
                     H_O0SUANFASUU ,
                     H_O0SUANNODEL ,
                     H_O0SUCFENTE ,
                     H_O0SUCONG730 ,
                     H_O0SUCONGFIS ,
                     H_O0SUEDIL ,
                     H_O0SUFIN ,
                     H_O0SUGGCALC ,
                     H_O0SUIMANFT ,
                     H_O0SUIMANFU ,
                     H_O0SUIMASUT ,
                     H_O0SUIMASUU ,
                     H_O0SUIMINT ,
                     H_O0SUIMINU ,
                     H_O0SUIMRIN ,
                     H_O0SUIMRINU ,
                     H_O0SUINCENT ,
                     H_O0SUINDEB ,
                     H_O0SUIRPEFU ,
                     H_O0SULPU ,
                     H_O0SUMAGANF ,
                     H_O0SUMAGANFT ,
                     H_O0SUMATASUT ,
                     H_O0SUMATASUU ,
                     H_O0SUNUMDEL ,
                     H_O0SURECRIN ,
                     H_O0SUTIPPRO ,
                     H_O0SUTRASIND ,
                     H_O0SUTRASINR ,
                     H_O0SUTSCAT ,
                     H_O0SUTSCONF ,
                     H_O0SUULASS ,
                     H_O0SXADDIZC ,
                     H_O0SXADDIZR ,
                     H_O0SXADDIZRC ,
                     H_O0SXADDIZRR ,
                     H_O0SXANNIND ,
                     H_O0SXCODIND ,
                     H_O0SXCONG730 ,
                     H_O0SXCONGFIS ,
                     H_O0SXDTAL1 ,
                     H_O0SXDTAL2 ,
                     H_O0SXGGCALC ,
                     H_O0SXIMANFT ,
                     H_O0SXIMANFU ,
                     H_O0SXIMINT ,
                     H_O0SXIMINU ,
                     H_O0SXIMRIN ,
                     H_O0SXIMRINU ,
                     H_O0SXINDEB ,
                     H_O0SXIRPEFU ,
                     H_O0SXNUML1 ,
                     H_O0SXNUML2 ,
                     H_O0SXRECRIN ,
                     H_O0SXREGIND ,
                     H_O0SXTRASIND ,
                     H_O0SXTRASINR ,
                     H_O0SXTSCAT ,
                     H_O0SXTSCONF ,
                     H_O0SXULASS
            INTO
                    :H-O0AADIMPSPE ,
                    :H-O0AADRECUP ,
                    :H-O0AADSTAPAG ,
                    :H-O0ACQUISITO ,
                    :H-O0CFISCALE ,
                    :H-O0CODICE1 ,
                    :H-O0CODICE2 ,
                    :H-O0CODICE3 ,
                    :H-O0CODICE4 ,
                    :H-O0CODICE5 ,
                    :H-O0CODICE6 ,
                    :H-O0COMPATTO ,
                    :H-O0COSEDE ,
                    :H-O0DATAELABO ,
                    :H-O0DCOANFRIC ,
                    :H-O0DCOCENOPE ,
                    :H-O0DCOCHIDOM ,
                    :H-O0DCOCODFIS ,
                    :H-O0DCOCODPAT ,
                    :H-O0DCOCOOBAN ,
                    :H-O0DCOCOTIDO ,
                    :H-O0DCODTADEC ,
                    :H-O0DCODTDESP ,
                    :H-O0DCODTULSP ,
                    :H-O0DCOPESTDI ,
                    :H-O0DCOULESSP ,
                    :H-O0DOMANDA ,
                    :H-O0FACAL ,
                    :H-O0FACDAL ,
                    :H-O0FACDETFAM ,
                    :H-O0FACDETLAV ,
                    :H-O0FACGGDETR ,
                    :H-O0FACGGPRES ,
                    :H-O0FACIMPDET ,
                    :H-O0FACIMPLOR ,
                    :H-O0FACIMPNET ,
                    :H-O0FACIMPONI ,
                    :H-O0FACTREDIC ,
                    :H-O0FADANFPAG ,
                    :H-O0FADFINE ,
                    :H-O0FADINIZIO ,
                    :H-O0FADNETPAG ,
                    :H-O0FADRECANF ,
                    :H-O0FADRECIND ,
                    :H-O0FADTRASIN ,
                    :H-O0FAPAL ,
                    :H-O0FAPALIQME ,
                    :H-O0FAPDAL ,
                    :H-O0FAPGGDETR ,
                    :H-O0FAPGGPRES ,
                    :H-O0FAPIMPDET ,
                    :H-O0FAPIMPLOR ,
                    :H-O0FAPIMPNET ,
                    :H-O0FAPIMPONI ,
                    :H-O0FAPTREDIC ,
                    :H-O0FCODCOMUN ,
                    :H-O0FCODPAGA1 ,
                    :H-O0FCODPAGA2 ,
                    :H-O0FCODPAGA3 ,
                    :H-O0FCONGAC ,
                    :H-O0FCONGAP ,
                    :H-O0FIMPCOMAC ,
                    :H-O0FIMPCOMAP ,
                    :H-O0FIMPPAGA1 ,
                    :H-O0FIMPPAGA2 ,
                    :H-O0FIMPPAGA3 ,
                    :H-O0FIMPPROAC ,
                    :H-O0FIMPPROAP ,
                    :H-O0FIMPREGAC ,
                    :H-O0FIMPREGAP ,
                    :H-O0IMPORTO1 ,
                    :H-O0IMPORTO2 ,
                    :H-O0IMPORTO3 ,
                    :H-O0IMPORTO4 ,
                    :H-O0IMPORTO5 ,
                    :H-O0IMPORTO6 ,
                    :H-O0PROCEDURA ,
                    :H-O0PROGRESSI ,
                    :H-O0PUADDIZC ,
                    :H-O0PUADDIZR ,
                    :H-O0PUCONG730 ,
                    :H-O0PUCONGFIS ,
                    :H-O0PUGGCALC ,
                    :H-O0PUIMANFT ,
                    :H-O0PUIMANFU ,
                    :H-O0PUIMINT ,
                    :H-O0PUIMINU ,
                    :H-O0PUINDEB ,
                    :H-O0PUIRPEFU ,
                    :H-O0PUMAGANF ,
                    :H-O0PUMAGANFT ,
                    :H-O0PUTIPPROG ,
                    :H-O0PUTRASIND ,
                    :H-O0PUTSCAT ,
                    :H-O0PUTSCONF ,
                    :H-O0PUULASS ,
                    :H-O0RECIMURE1 ,
                    :H-O0RECIMURE2 ,
                    :H-O0RECIMURE3 ,
                    :H-O0RECPAGATO ,
                    :H-O0RECTOREE1 ,
                    :H-O0RECTOREE2 ,
                    :H-O0RECTOREE3 ,
                    :H-O0RECTORER1 ,
                    :H-O0RECTORER2 ,
                    :H-O0RECTORER3 ,
                    :H-O0SUADDIZC ,
                    :H-O0SUADDIZR ,
                    :H-O0SUADDIZRC ,
                    :H-O0SUADDIZRR ,
                    :H-O0SUANFASUT ,
                    :H-O0SUANFASUU ,
                    :H-O0SUANNODEL ,
                    :H-O0SUCFENTE ,
                    :H-O0SUCONG730 ,
                    :H-O0SUCONGFIS ,
                    :H-O0SUEDIL ,
                    :H-O0SUFIN ,
                    :H-O0SUGGCALC ,
                    :H-O0SUIMANFT ,
                    :H-O0SUIMANFU ,
                    :H-O0SUIMASUT ,
                    :H-O0SUIMASUU ,
                    :H-O0SUIMINT ,
                    :H-O0SUIMINU ,
                    :H-O0SUIMRIN ,
                    :H-O0SUIMRINU ,
                    :H-O0SUINCENT ,
                    :H-O0SUINDEB ,
                    :H-O0SUIRPEFU ,
                    :H-O0SULPU ,
                    :H-O0SUMAGANF ,
                    :H-O0SUMAGANFT ,
                    :H-O0SUMATASUT ,
                    :H-O0SUMATASUU ,
                    :H-O0SUNUMDEL ,
                    :H-O0SURECRIN ,
                    :H-O0SUTIPPRO ,
                    :H-O0SUTRASIND ,
                    :H-O0SUTRASINR ,
                    :H-O0SUTSCAT ,
                    :H-O0SUTSCONF ,
                    :H-O0SUULASS ,
                    :H-O0SXADDIZC ,
                    :H-O0SXADDIZR ,
                    :H-O0SXADDIZRC ,
                    :H-O0SXADDIZRR ,
                    :H-O0SXANNIND ,
                    :H-O0SXCODIND ,
                    :H-O0SXCONG730 ,
                    :H-O0SXCONGFIS ,
                    :H-O0SXDTAL1 ,
                    :H-O0SXDTAL2 ,
                    :H-O0SXGGCALC ,
                    :H-O0SXIMANFT ,
                    :H-O0SXIMANFU ,
                    :H-O0SXIMINT ,
                    :H-O0SXIMINU ,
                    :H-O0SXIMRIN ,
                    :H-O0SXIMRINU ,
                    :H-O0SXINDEB ,
                    :H-O0SXIRPEFU ,
                    :H-O0SXNUML1 ,
                    :H-O0SXNUML2 ,
                    :H-O0SXRECRIN ,
                    :H-O0SXREGIND ,
                    :H-O0SXTRASIND ,
                    :H-O0SXTRASINR ,
                    :H-O0SXTSCAT ,
                    :H-O0SXTSCONF ,
                    :H-O0SXULASS
              FROM        TDSVPIO0
              WHERE
                     H_O0COSEDE       =  :H-O0COSEDE
                AND  H_O0PROCEDURA    =  :H-O0PROCEDURA
                AND  H_O0DCOCENOPE    =  :H-O0DCOCENOPE
                AND  H_O0PROGRESSI    =  :H-O0PROGRESSI
           END-EXEC.
      *
           move  SQLCODE               to  F-LANALITICO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSVPIO0=' DCLTDSAPIO0
               MOVE 'TDSVPIO0'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E30-DB2-SELECT-EX.
           EXIT.
      *
       E45-DB2-SELECT.
      *
           MOVE 'E45-DB2-SELECT'  TO WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                  H_CONDESCRI
                 INTO
                 :H-CONDESCRI
                 FROM TDSCONTB
                 WHERE
                          H_CONNUMERO      =  :H-CONNUMERO
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSCONTB=' DCLTDSCONTB
               MOVE 'TDSCONTB'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E45-DB2-SELECT-EX.
           EXIT.
270122****inizio mod
      ******************************************************************
       LEGGI-TAB.
      ******************************************************************

           MOVE 'LEGGI-TAB'       TO WABNDB-LABEL.

030222*inizio
      *    initialize h-wfrdetpvp.
      *
      *    EXEC SQL SELECT  H_WFRDETPVP
      *               INTO :H-WFRDETPVP
      *               FROM TDSWEBFV, TDSDATCO
      *              WHERE H_WFRNUMPROD  =  H_DCONUPRO
      *                AND H_WFRCODFIS   =  H_DCOCODFIS
      *                AND H_DCOCHIDOM   = :H-O0DCOCHIDOM
      *                AND H_DCOCODFIS   = :H-O0DCOCODFIS
      *     WITH UR
      *    END-EXEC.

           initialize h-sstalfl2.

           EXEC SQL SELECT  H_SSTALFL2
                      INTO :H-SSTALFL2
                      FROM TDSSUSST
                     WHERE H_SSTCHIDOM   = :H-O0DCOCHIDOM
            WITH UR
           END-EXEC.
030222*fine

           IF SQLCODE NOT = ZERO
               DISPLAY 'DCLTDSSUSST=' DCLTDSSUSST
               MOVE 'TDSSUSST'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.

       EX-LEGGI-TAB.
           EXIT.
270122****fine mod
      *
       IMPOSTA-RPT.
      *
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-TIMESTAMP-DATA-ORA.
           MOVE WK-GG      TO  WW-DB2-GG.
           MOVE WK-MM      TO  WW-DB2-MM.
           MOVE WK-AA      TO  WW-DB2-AA.
           MOVE WK-H       TO  WW-DB2-HH.
           MOVE WK-M       TO  WW-DB2-T-MM.
           MOVE WK-S       TO  WW-DB2-SS.
           MOVE WK-DB2-DATA   TO TDSREPORT-DTA-PRE.
           MOVE WK-DB2-TIME   TO TDSREPORT-ORA-PRE.
           MOVE 8             TO TDSREPORT-NUM-RPT.
           MOVE 0             TO TDSREPORT-NUM-RIGA.
           MOVE SPACES        TO TDSREPORT-RIGA-REPORT.
           MOVE L-CODICE-SEDE TO TDSREPORT-SEDE.
           MOVE L-CODICE-STOP TO TDSREPORT-CEOP.
           MOVE L-PROCEDURA   TO TDSREPORT-PROCEDURA.
           MOVE LMATRICOLA    TO TDSREPORT-MATRICOLA.
      *
           MOVE TDSREPORT-SEDE      TO WK-RPT-SEDE.
           MOVE TDSREPORT-CEOP      TO WK-RPT-CEOP.
           MOVE TDSREPORT-MATRICOLA TO WK-RPT-MATRICOLA.
           MOVE TDSREPORT-DTA-PRE   TO WK-RPT-DTA-PRE.
           MOVE TDSREPORT-ORA-PRE   TO WK-RPT-ORA-PRE.
      *
       EX-IMPOSTA-RPT.
           EXIT.
      *
      *----------------------------------------- COPY PER GESTIONE
      *
           EXEC SQL INCLUDE CDSABNDB END-EXEC.
