       IDENTIFICATION DIVISION.
       PROGRAM-ID. PDSIO13.
       AUTHOR. Nicola.
      *-------------- -----------------------------------------------*
      *  VERSIONE CICX--- caricata da AS400 il 12/10/2010            *
      *---------------- ---------------------------------------------*
      *  Ad ogni variazione aggiorna WK_VERSIO   <--------           *
      *  Per le variazioni in sospeso cerca: ***RIVEDERE             *
      *------------------------------- ------------------------------*
      *$ OPTION      *SRCDBG                                         *
      * 1° rilascio: xx/10/2004 -   Autore: NICOLA                   *
      * ALLINEATO PGM AS400 DEL 09.05.2012 *
      *
      *
      *  Data  15.04.2026
      *      Autore: Elena
      *            inserita gestione TIRA - INSERIMENTO-REINSERIMENTO
      *            ABRUZZO 2026, 23/02/2026 - 31/12/2028
      *            inserita gestione PIAC - INVECCHIAMENTO ATTIVO CAN-
      *            TIERI ABRUZZO 2026, 23/02/2026 - 31/12/2028
      *
      *  -     24.10.2025
      *      Autore: Elena
      *            inserita gestione TGOP - Tirocinio politiche attive
      *            Piemonte, 16/07/2025 - 31/12/2026.
      *
      *  -     17.09.2025
      *      Autore: Elena
      *            il controllo di coerenza tra il numero gg da pagare
      *            per il tirocinio e il periodo in pagamento, non va
      *            fatto se deca = deco.
      *
      *  -     30.07.2025
      *      Autore: Elena
      *            inserita gestione TGOS - Tirocinio politiche attive
      *            Sicilia, 02/07/2025 - 31/12/2026.
      *
      *  -     29.07.2025
      *      Autore: Elena
      *            inserito controllo su colonna h_newsuss per stabi-
      *            lire se la prestazione va lavorata con la nuova
      *            procedura.
      *
      *  -     14.07.2025
      *      Autore: Elena
      *            inserito blocco in presenza di sinonimi da arca.
      *
      *  -     17.03.2025
      *      Autore: Elena
      *            inserita gestione TYGP - Tirocinio PON Puglia, 2023
      *
      *
      *  -     14.03.2025
      *      Autore: Elena
      *            inserita gestione TYGP - Tirocinio PON Puglia, 2023
      *
      *  -     13.03.2025
      *      Autore: Elena
      *            inserita gestione TGOV - Tirocinio politiche attive
      *            Veneto, 2021-2027.
      *
      *  -     24.06.2024
      *      Autore: Elena
      *            inserita gestione TGOC - Tirocinio PAR GOL Calabria
      *            gennaio 2024 - dicembre 2025.
      *
      *  -     21.06.2024
      *      Autore: Elena
      *            inserita gestione TISM - Sussidio Lavori ad Utilità
      *            Diffusa - LUD - Regione Molise,  gennaio-dicembre
      *            2024.
      *
      *  -     06.05.2024
      *      Autore: Elena
      *            inserita gestione TISC - Sussidio Tirocini Inclusione
      *            Sociale Calabria, per il periodo gennaio-dicembre
      *            2024.
      *
      *  -     10.04.2024
      *      Autore: Elena
      *            inserita gestione FTCI - Fondo Trasporto aereo Cig ad
      *            Integrazione per i lavoratori di Alitalia Sai e
      *            Alitalia Cityliner, per il periodo gennaio-ottobre
      *            2024.
      *
      *  -     27.03.2024
      *      Autore: Elena
      *            inserita gestione FSAD - Fondo ServiziAmbientali
      *            Aspi/Naspi integrazione di durata  (come FTAD),
      *            18 mesi.
      *
      *  -     26.03.2024
      *      Autore: Elena
      *            inserita gestione FSAI - Fondo ServiziAmbientali
      *            Aspi/Naspi integrazione di importo (come FTAI).
      *
      *     -- variazione   Data:      28/11/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita gestione sussidio                    *
      *              DLI2 dOTE LAVORO INCLUS. ATTIVA CALABRIA        *
      *     -- variazione   Data:      25/10/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita gestione sussidi:
      *                    POR3 Borse ricerca POR Marche 2021-2027
      *                    POR4 Borse lavoro POR Marche 2021-2027
      *                    POR5 Borse tematiche POR Marche 2021-2027
      *                    POR6 Tirocini extra-curriculari POR Marche
      *                    2021-2027
      *                                                              *
      *     -- variazione   Data:      24/10/2023                    *
      *       Autore: Nicola                                         *
      *       Motivo:- aggiunto mese dicembre per conguaglio 730     *
      *                implementato controllo orario pagamento       *
      *                da agosto a dicembre                          *
      *                                                              *
      *     -- variazione   Data:      29/08/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inseriti controlli sul valore di h_sstnulm2   *
      *                per impedire pagamenti con importi non coeren-*
      *                ti con i giorni di prestazione.               *
      *     -- variazione   Data:      26/07/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- implementati i controlli sull'iban di modo che*
      *                siano allineati con quanto viene fatto per la *
      *                naspi.                                        *
      *                Dettaglio modifica:                           *
      *                - l'iban estero non viene gestito             *
      *                - inserita chiamata a SCUP                    *
      *                - inserita chiamata a routine verifica titola-*
      *                  rità                                        *
      *                                                              *
      *     -- variazione   Data:      13/01/2023                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita la gestione dei bonus E159/E160/E162/*
      *                E157                                          *
      *                                                              *
      *     -- variazione   Data:      23/11/2022                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita la gestione del bonus E107           *
      *                                                              *
      *     -- variazione   Data:      08/07/2022                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita la gestione dei bonus E109/E110/E112 *
      *                                                              *
      *     -- variazione   Data:      13/04/2022                    *
      *       Autore: Elena                                          *
      *       Motivo:- inserita la gestione del bonus E092           *
      *                                                              *
      *     -- variazione   Data:      01/07/2021                    *
      *       Autore: Massimo                                        *
      *       Motivo:- eliminato blocco per h_dcoflasu = 9           *
      *                                                              *
      *     -- variazione   Data:      15/12/2020                    *
      *       Autore: Massimo                                        *
      *       Motivo:- ridefinizione messaggi h_dcoflasu             *
      *                                                              *
      *     -- variazione   Data:      09/12/2020                    *
      *       Autore: Massimo                                        *
      *       Motivo:- agg. per nuovi sussidi covid 19               *
      *                                                              *
      *     -- variazione   Data:      25/11/2020                    *
      *       Autore: Massimo                                        *
      *       Motivo:- agg. per nuovi sussidi covid 19               *
      *                                                              *
      *     -- variazione   Data:      23/09/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- agg. per nuovi sussidi covid 19               *
      *                                                              *
      *     -- variazione   Data:      24/07/2020                    *
      *       Autore: Massimo                                        *
      *       Motivo:- agg. per eliminare chiamata al popwmain       *
      *                commentata perform E60-POP
      *    --  variazione   Data:      01/07/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- agg. per evitare  pagam. singolo delle sedi   *
      *                Agg.     DCOFLASU per evitare pagamento       *
      *    --  variazione   Data:      04/06/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- agg. per nuovi sussidi covid 19               *
      *                gestione DCOFLASU per evitare pagamento       *
      *    --  variazione   Data:      17/05/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- agg. per sussidi covid19                      *
      *                limitazione pagamenti 6000 domande per blocco *
      *     -- variazione   Data:      30/03/2020                    *
      *       Autore: Nicola                                         *
      *       Motivo:- agg. per sussidi covid19 - prest. E  opz  E   *
      *                esclusione controllo CF bloccati per covid19  *
      *                limitazione pagamenti 9999 domande per blocco *
      *     -- variazione   Data:      31/07/2019                    *
      *       Autore: Nicola                                         *
      *       Motivo:- agg. per BRIO                                 *
      *     -- variazione   Data:      10/04/2019                    *
      *       Autore: Massimo                                        *
      *       Motivo:- verifica importi per TDSPAG                   *
      *     -- variazione   Data:      09/05/2018                    *
      *       Autore: Massimo                                        *
      *       Motivo:- scrittura TDSPEERE per FTMD in stato L        *
      *     -- variazione   Data:      11/12/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Esclusione APAF & APAR controllo CF-RDSUT28   *
      *     -- variazione   Data:      15/11/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controlli E25-                       *
      *              - i controlli esito/data sono fatti in modo     *
      *                articolato dai pgm di calcolo di Massimo     *
      *              - il controllo sui 30 minuti non è applicato    *
      *                in quanto le domande sono solo consultate     *
      *                e questo è possibile solo in variazione       *
      *     -- variazione   Data:      31/10/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- inserito controllo E25- per TDSPAG            *
      *        variazione   Data:      27/10/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo E25-  e RDSPD13            *
      *     -- variazione   Data:      08/09/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:-  Tabella ANF         da  8 a 20  elementi     *
      *     -- variazione   Data:      10/05/2017                    *
      *       Autore: Nicola                                         *
      *       Motivo:-  Tabella sospensioni da 50 a 400 elementi     *
      *              -  Tabella Periodi eff.da 50 a 400 elementi     *
      *     -- variazione   Data:      05/12/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:-  Nuovi codici Fondo Volo                      *
      *     -- variazione   Data:      03/03/2016                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Sussidi SSEP                eliminato blocco  *
      *                pagamenti se COD.FISCALE presente su TDSBLKPA *
      *     -- variazione   Data:      05/02/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- commentata variazione del 25/01/16            *
      *                ...................................           *
      *     -- variazione   Data:      25/01/2016                    *
      *       Autore: Nicola                                         *
      *       Motivo:- Esclusione calcolo domande non telematiche    *
      *                ASU Fondo Occupazione                         *
      * Ultima variazione   Data:      25/01/2016                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Inserita cancellazione recupero 730 in caso   *
      *                di errore calcolo                             *
      *     -- variazione   Data:      24/12/2015                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Sussidi TYGM DL76 TIPO TYAD eliminato blocco  *
      *                pagamenti se COD.FISCALE presente su TDSBLKPA *
      *     -- variazione   Data:      19/11/2015                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Inserito pagamen. solo un sussidio alla volta *
      *    --- variazione   Data:      16/11/2015                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Blocco iban come altre preastazioni           *
      *     -- variazione   Data:      05/11/2015                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Blocco iban                                   *
      *     -- variazione   Data:      24/04/2015                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- tolto il controllo suTDSLOCK0 per domus       *
      *                ...............................               *
      *     -- variazione   Data:      21/03/2014                    *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione pag. ASUFIN 9 su opz 1               *
      *                                                              *
      *     -- variazione   Data:      21/03/2014                    *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Inserito controllo RDSUT28 per blocco dei     *
      *                pagamenti se COD.FISCALE presente su TDSBLKPA *
      *     -- variazione   Data: 27/01/2014                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica per pag. a terzi x deceduti  E25-    *
      *                --------------------------------------------  *
      *     -- variazione   Data: 18/12/2013                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Gestione indebito DATMORTE                    *
      *     -- variazione   Data: 21/10/2013                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Controllo ANFREDFAE (x NO diritto)            *
      *                gest WRK-RECTORERE x decimillesimi (sospeso)  *
      *     -- variazione   Data: 24/09/2013                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Controllo RECTORERE                           *
      *     -- variazione   Data: 23/07/2013                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Inserita gestione LC-TAB-ANF x PDSPD04        *
      *     -- variazione   Data: 07/02/2013                         *
      *       Autore: Giuseppe                                       *
      *       Motivo:- Corretto anomalia per selezione di tutte le   *
      *                domande , non elaborava tutto  anno<>anno1    *
      *     -- variazione   Data: 15/11/2012                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Carico solo ANF corretti per pagamento        *
      *     -- Variazione   Data: 25/11/2010                         *
      *       Autore: Giuseppe/Mongelli                              *
      *       Motivo:- Modifica I38-DSPFM-M8                         *
      *                esegue sempre anche per tipo pagamento -R-    *
      *     -- variazione   Data: 25/11/2010                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica aggiornamento e49-              30/11*
      *       Motivo:- Modifica aggiornamento recuperi          25/11*
      *       Motivo:- Modifica per cod fisc arca validato      24/11*
      *       Motivo:- Modifica per cod fisc arca in simulazione 5/11*
      *                ........................................      *
      *     -- variazione   Data: 08/10/2010                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Importo minimo pagamento 2.01                 *
      *     -- variazione   Data: 16/07/2010                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Fondo solidarietà del settore credito        *
      *               -  16,20/7......................               *
      *     -- variazione   Data: 20/07/2010                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Modifica x storico recuperi                  *
      *     -- variazione   Data: 12/04/2010                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Verifica Convenzione Sindacati               *
      *     -- variazione   Data: 13/01/2010                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Modifica controllo conto recupero            *
      *               - Modifica per redditi ANF nulli L28-..  3/2/10*
      *     -- variazione   Data: 13/01/2010                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Modifica sincronizzazione lista controllo    *
      *     -- variazione   Data:  7/01/2010                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Controllo conti recuperi                     *
      *     -- variazione   Data: 10/11/2009                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Gestione fino anno                           *
      *     -- variazione   Data: 15/09/2009                         *
      *       Autore: Nicola                                         *
      *        Motivo:- Commentata sospensione 730 dal 28/8          *
      *               - storico recuperi.....................        *
      *     -- variazione   Data: 27/07/2009                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x G11                               *
      *     -- variazione   Data:  4/02/2009                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x PNPGF00                           *
      *     -- variazione   Data: 10/10/2008                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x DCOIBAN                           *
      *     -- variazione   Data: 21/07/2008                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x controllo versioni web            *
      *               - Gestione elaborazione senza pagamenti        *
      *     -- variazione   Data: 12/06/2008                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x controllo accesso                 *
      *     -- variazione   Data:  7/05/2008                         *
      *       Autore: Nicola                                         *
      *        Motivo:- modifica x gestione hcf                      *
      *     -- variazione   Data: 26/03/2008                         *
      *       Autore: Nicola                                         *
      *       Motivo:- richiamo PDSLOCK       I62 & F30              *
      *     -- variazione   Data: 16/01/2008                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica gestione anno bisestile in I13       *
      *              - modifica controllo mesi in I38                *
      *     -- variazione   Data: 16/01/2008                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo 'SNI'                      *
      *     -- variazione   Data: 10/01/2008                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controllo decorrenza FTA             *
      *     -- variazione   Data:  3/01/2008                         *
      *       Autore: Nicola                                         *
      *       Motivo:- blocco record DANCCORE=0                      *
      *     -- variazione   Data: 16/05/2007                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modificata CDSIO13                21/05       *
      *              - Modifica per fondo volo....................   *
      *              - Gestione DCODTCODO     ...........21/06....   *
      *     -- variazione   Data: 16/05/2007                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modificata MDSPD13                15/03       *
      *     -- variazione   Data: 15/03/2007                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica E44-                     15/03       *
      *     -- variazione   Data:  1/03/2007                         *
      *       Autore: Nicola                                         *
      *       Motivo:- storico anf pdspd04                1/03       *
      *              - modifica msg kerr09........................   *
      *     -- variazione   Data: 28/02/2007                         *
      *       Autore: Nicola                                         *
      *       Motivo:- storico anf e sospensioni         28/02       *
      *     -- variazione   Data:  9/02/2007                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Controllo date routine RDSIO12                *
      *     -- variazione   Data:  5/12/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Modifica controllo RECIIRPEF      18/12       *
      *              - Verifica altra domanda pagata stesso giorno   *
      *                mediante routine RDSPD13           5/12       *
      *     -- variazione   Data: 29/11/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- Importo minimo pagamento 2.00                 *
      *     -- variazione   Data: 28/11/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica data pagamento dicembre 2006         *
      *     -- variazione   Data: 12/06/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica gestione errore recuperi             *
      *              - gestione aggiornamnto/commit riepilogo        *
      *     -- variazione   Data: 14/03/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione tabella sospensioni x SST            *
      *              - gestione nuovo sussidio straordinario         *
      *              - chiamata a routine di visualizzazione         *
      *     -- variazione   Data:  1/03/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica per cognomi + lunghi di 26 caratteri *
      *              - modificato OC-ASUINCENT..........             *
      *     -- variazione   Data:  9/02/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- controllo quadratura fiscale   ..             *
      *     -- variazione   Data: 31/01/2006                         *
      *       Autore: Nicola                                         *
      *       Motivo:- inserito controllo Dati Anf .....             *
      *     -- variazione   Data:  7/11/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modificata controlli J10 x pag. solo ANF     *
      *     -- variazione   Data: 18/10/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modificata tabella ANF                       *
      *     -- variazione   Data: 26/09/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- anticipata Open file video.                  *
      *     -- variazione   Data: 26/07/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controlli J10-.....                  *
      *              - controllo pagamento > 2.01                   *
      *     -- variazione   Data: 21/06/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- segnalo coordinate errate su lista controllo  *
      *              - sommo tratt.sindacali in totale trattenute    *
      *                del riepilogo finale lista controllo          *
      *              - mofifico segnalazione errori M43-...          *
      *     -- variazione   Data:  8/06/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- implementazione tabella adssitdo!!!!          *
      *              - modifica stampa lista controllo S20-          *
      *     -- variazione   Data:  8/06/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- modifica controlli J10-       ...             *
      *              - modifica stampa lista controllo S20-          *
      *     -- variazione   Data: 27/05/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- arrotondamento recuperi        .             *
      *     -- variazione   Data: 24/05/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- gestione ctr-scr-appo          .             *
      *     -- variazione   Data: 24/05/2005                         *
      *       Autore: Nicola                                         *
      *       Motivo:- controllo DANCAP e DCOCOOBAN.....             *
      *     -- Variazione   del   xx/xx/2004                         *
      *       Autore: Nicola                                         *
      *       Motivo:- .................................             *
      *--------------------------------------------------------------*
      * Funzione :  Calcolo domande  DS ordinaria                    *
      *                                                              *
      * PGM Chiamante : -------->  PDSIO01                           *
      * PGM chiamati:                                                *
      *             PDSIO02    per calcolo DS                        *
      *             PDSPD16    per gestione lavori struttura         *
      *             RDSUT11    per msg a video                       *
      *             RDSUT13    per decodifica comuni                 *
      *             RDSUT15    per Anagrafica                        *
      *             RDSJOB1    per modifica cola lavori              *
      *             RDSUSR1    per identif. utente                   *
      *             RDSERR0    per mappa errori                      *
      *             RDSOR12    per strutture attive                  *
      *      ex     PNPGFE0    per gestione fiscale                  *
      *      new    PNPGFD0    per gestione fiscale                  *
      *             RNPYEAR    per data                              *
      *                                                              *
      * Dati ricevuti :  L-AREA                                      *
      * Dati passati  :  L-AREA                                      *
      *                                                              *
      * ARCHIVI        :  Input/Output                               *
      *  1  video      -   MDSPD13    -  Mappa video                 *
      *  2  RIEPILOGO  -   ADSRPG00   -  Riepilogo pagamenti G00     *
      *  3  DATICOMUNI -   LFDATCO2   -  logico su ADSDATCO          *
      *  4  RECUPERI       ADSRECUP   -  File recuperi               *
      *  5  EFFEROGATI     LFPEERE1   -  Logico su ADSPEERE          *
      *  6  APPOGGIO       ADSAPIO0   -  Analitico Pagamenti         *
      *  7  FILE40         ADSASU     -  file Enti                   *
      *  8  FILE42         ADSASU2    -  file Delibere               *
      *  9  FILE47         ADSASU7    -  file anagrafiche lavoratori *
      * 10  FILE48         ADSASU8    -  file liste lavoratori       *
      * 11  FILE49         ADSASU9    -  file dati contabili pagament*
      * 12  FILE51         ADSATTSU   -  file Assegno ASU            *
      * 13  FILE52         ADSLAVPU   -  file Lav.Pubblica Utilità   *
      * 14  FILE53         ADSSUSST   -  file Sussidio Straordinario *
      * 22  SITUAZIODO     ADSSITDO   -  Situazione domanda          *
      *                                                              *
      * ARCHIVI        :  Input                                      *
      * 15  LRIEPILOGO -   LDSRPG01   -  logico su ADSRPG00          *
      * 16  ANAGRAFICI     ADSDATAN   -  File dati anagrafici        *
      * 17  DELEGHE        LFDELSI1   -  Logico su ADSDELSI          *
      * 18  DATIANF        LFMODAN1   -  Logico si ADSMODAN          *
      * 19  FILE64         ADSPERIO   -  Periodi LSU/LPU/BL          *
      * ??  L02COMUNI  -   LFDATCO2   -  logico su dati-comuni       *
      * 20  FILE65         ADSSX00    -  Tabella categorie           *
      * 23  FILE66         LFSOSPE1   -  Vista tabella sospensioni   *
      *                                                              *
      * ARCHIVI        :  Output                                     *
      * 21  STAMPA         SDSPD13    -  File di stampa              *
      *
      * ARCHIVI        :  non usare                                  *
      * xx  PAGAMENTI      ADSPAGME   -  non usato                   *
      * xx  DSCOMUNI       ADSDACOD   -  non usato                   *
      * xx  TEOEROGABI     LFPEERT1   -  non usato                   *
      * xx  PENSIONI       ADSPENSI   -  non usato                   *
      *--------------------------------------------------------------*
      *   NOME PGM:   PDSIO13                                        *
      *    Programma DiSoccupazione Interventi Occupazione n.13      *
      *--------------------------------------------------------------*
      * Display file :                                               *
      * 01  VIDEO          MDSPD13    -  File video                  *
      *--------------------------------------------------------------*
      * Printer file :                                               *
      * 21  STAMPA         SDSPD13    -  Printer file                *
      *--------------------------------------------------------------*
      *                                                              *
      * Descrizione funzionale : Gestione calcolo generalizzato      *
      *            domande attività socialmente utili                *
      *                                                              *
      *--------------------------------------------------------------*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.

      *SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.
       SPECIAL-NAMES.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
      *                                                              *
       I-O-CONTROL.
      *----------------------------------------------Nomi interni    *
      *
       DATA DIVISION.
      *
       FILE SECTION.
      *                                                              *
       WORKING-STORAGE SECTION.
      *                                                              *
      *-----------------------------------------Per pgm calcolo ?
       01  PER-CALCOLO.
           copy  CDSIO13.
      *
      *------------------ Servizio SCUP --------Per routine 'PNBTBLC2*
260723     copy PNLKBLC2.
      *------------------ Servizio titolarità --Per routine 'PNBTCFIB*
260723     copy PNLKCFIB.
      *
      * AREA APPOGGIO PER STAMPE
      *
       01  WK-RPT-KEY.
           05  WK-RPT-SEDE        PIC 9(04).
           05  WK-RPT-CEOP        PIC 9(02).
           05  WK-RPT-MATRICOLA   PIC 9(08).
           05  WK-RPT-DTA-PRE     PIC X(10).
           05  WK-RPT-ORA-PRE     PIC X(08).
      *
      * PER CHIAMATA CICS
      *
       01  WDFHCOMMAREA                PIC X(1).
       01  WDFHEIBLK                   PIC X(85).
      *
      * COMODO PER CHIAMATA CALL
      *
       01  PDSLOCK                    PIC X(08) VALUE 'PDSLOCK '.
       01  PDSPD04                    PIC X(08) VALUE 'PDSPD04 '.
       01  PDSPD06                    PIC X(08) VALUE 'PDSPD06 '.
       01  PDSPD07                    PIC X(08) VALUE 'PDSPD07 '.
       01  PDSPD13                    PIC X(08) VALUE 'PDSPD13 '.
       01  PDSPD16                    PIC X(08) VALUE 'PDSPD16 '.
       01  RDSPD13                    PIC X(08) VALUE 'RDSPD13 '.
161115*01  RDSUT09                    PIC X(08) VALUE 'RDSUT09 '.
161115 01  PITIBAN2                   PIC X(08) VALUE 'PITIBAN2'.
       01  RDSUT14                    PIC X(08) VALUE 'RDSUT15 '.
       01  RDSTART                    PIC X(08) VALUE 'RDSTART '.
      *
       01  PNPGFD0                    PIC X(08) VALUE 'PNPGF110'.
       01  PDSIO21                    PIC X(08) VALUE 'PDSIO21 '.
       01  PIOLP41                    PIC X(08) VALUE 'PIOLP41 '.
       01  PIOSX41                    PIC X(08) VALUE 'PIOSX41 '.
       01  RDSIO12                    PIC X(08) VALUE 'RDSIO12 '.
       01  RDSIO13                    PIC X(08) VALUE 'RDSIO13 '.
       01  RDSCONT                    PIC X(08) VALUE 'RDSCONT '.
       01  PIOSU41                    PIC X(08) VALUE 'PIOSU41 '.
       01  PIOSU42                    PIC X(08) VALUE 'PIOSU42 '.
       01  PIOSU43                    PIC X(08) VALUE 'PIOSU43 '.
       01  PIOSU44                    PIC X(08) VALUE 'PIOSU44 '.
       01  RDSUT27                    PIC X(08) VALUE 'RDSUT27 '.
       01  RDSUT28                    PIC X(08) VALUE 'RDSUT28 '.
       01  POPWMAIN                   PIC X(08) VALUE 'POPWMAIN'.
260723 01  PNBTCFIB                   PIC X(08) VALUE 'PNBTCFIB'.
260723 01  PNBTBLC2                   PIC X(08) VALUE 'PNBTBLC2'.

      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSUT50 PER CALCOLO GG INDENNIZZABILI  *
      *-------------------------------------------------------------*
290823 01  RDSUT50                   PIC X(7) VALUE 'RDSUT50'.
290823 01  LK-DATA1                  PIC 9(8) VALUE ZERO.
290823 01  LK-DATA2                  PIC 9(8) VALUE ZERO.
290823 01  WK-PER-SPET               PIC S9(4)  VALUE 0.
      *
      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSUT11 PER CALCOLO GG FRA DUE DATE    *
      *-------------------------------------------------------------*
110923 01  RDSUT11                   PIC X(7) VALUE 'RDSUT11'.
110923 01  PER-RDSUT11.
110923     02  R11-DATA-I              pic 9(6).
110923     02  R11-DATA-F              pic 9(6).
110923     02  R11-GIORNI              pic 9(4).
110923     02  R11-GIORNI-INDS         pic 9(4).
110923     02  R11-GIORNI-DANF         pic 9(4).
110923     02  R11-RC                  pic 9  value zeros.

      *
       01  WK-TIMESTAMP-DATA-ORA.
           05  WK-AA                         PIC X(4).
           05  WK-MM                         PIC X(2).
           05  WK-GG                         PIC X(2).
           05  WK-H                          PIC X(2).
           05  WK-M                          PIC X(2).
           05  WK-S                          PIC X(2).
241023 01  W-T-HH-MM.
           05  W-T-HH                        pic x(2)    value '00'.
           05  W-T-MM                        pic x(2)    value '01'.
241023 01  W-HH-MM   redefines W-T-HH-MM     pic 9(4).
      *---------------------------- GESTIONE DATA DB2 -----------------*
       01  WW-DB2-DATA.
           05  WW-DB2-GG                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-MM                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-AA.
               10  WW-DB2-SEC                PIC X(2)    VALUE '00'.
               10  WW-DB2-ANNO               PIC X(2)    VALUE '01'.
       01  WK-DB2-DATA REDEFINES WW-DB2-DATA PIC X(10).
      *
      *---------------------------- GESTIONE ORA PRE-FILE -------------*
       01  WW-DB2-TIME.
           05  WW-DB2-HH                     PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-T-MM                   PIC X(2)    VALUE '01'.
           05  FILLER                        PIC X       VALUE '.'.
           05  WW-DB2-SS                     PIC X(2)    VALUE '01'.
      *
      *** PER IL TRASFERIMENTO DELLA DATA NEL CORRISPONDENTE CAMPO DELLA
      ***  TABELLA DB2 E' NECESSARIO UTILIZZARE UN CAMPO NON SOTTOLIVEL-
      ***  LATO, PER CUI SI MUOVERA'  'WK'.
      *
       01  WK-DB2-TIME REDEFINES WW-DB2-TIME PIC X(8).
      *
       01  R-STAMPA.
           02  filler                 pic x(200).
      *
       01  W-PERIODI.
           03   ANNO-DAL-IN1      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN1    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN1       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN1     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN2      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN2    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN2       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN2     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN3      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN3    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN3       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN3     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN4      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN4    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN4       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN4     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN5      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN5    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN5       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN5     PIC S9(6)V USAGE COMP-3.
      *
           03   ANNO-DAL-IN6      PIC S9(4)V USAGE COMP-3.
           03   NUMERO-DAL-IN6    PIC S9(6)V USAGE COMP-3.
           03   ANNO-AL-IN6       PIC S9(4)V USAGE COMP-3.
           03   NUMERO-AL-IN6     PIC S9(6)V USAGE COMP-3.
      *
      *
      *----------------------------------------------------------------*
      *    A R E A   D I   C O M U N I C A Z I O N E    S  Q  L        *
      *----------------------------------------------------------------*
      *
           EXEC SQL INCLUDE SQLCA  END-EXEC.
      *
      *---------------------------- COPY PER GESTIONE ABEND -----------*
      *
           COPY             DSWABNDB.
      *
      *---------------------------- TRACCIATI TABELLE DB2 DI PROGRAMMA *
      *
      *--2---------------------  Riepilogo dati pagamenti            *
      *GG RIEPILOGO
          EXEC SQL INCLUDE TDSRPG00 END-EXEC.
      *--5---------------------  Dati comuni tutte prestazioni       *
      *GG DATICOMUNI
      * LFDATCO2 VIEW
          EXEC SQL INCLUDE TDSDATCO END-EXEC.
      *--6---------------------  Tabella Recuperi/acconti          *
      *GG RECUPERI
          EXEC SQL INCLUDE TDSRECUP END-EXEC.
      *--7---------------------  Periodi erogati effettivi           *
      *GG EFFEROGATI
      * LFPEERE1  VIEW
          EXEC SQL INCLUDE TDSPEERE END-EXEC.
      *--8---------------------  Situazione domanda                  *
      *GG SITUAZIODO
          EXEC SQL INCLUDE TDSSITDO END-EXEC.
      *-10---------------------  File appoggio                       *
      *GG APPOGGIO
          EXEC SQL INCLUDE TDSAPIO0 END-EXEC.
      *-12---------------------  Dati ANAgrafici                     *
      *GG ANAGRAFICI
          EXEC SQL INCLUDE TDSDATAN END-EXEC.
      *-13---------------------  Deleghe sindacali                   *
      *GG DELEGHE
      * lFDELSI1 VIEW
          EXEC SQL INCLUDE TDSDELSI END-EXEC.
      *-14---------------------  Dati Assegno Nucleo Familiare       *
      *GG DATIANF
      * lFMODAN1 VIEW
          EXEC SQL INCLUDE TDSMODAN END-EXEC.
      *-16---------------------  Tabella   SOSpensioni               *
      *GG SOSPENSIONI
          EXEC SQL INCLUDE TDSSOSPE END-EXEC.
      *-16---------------------  Tabella   anf                       *
      *GG ANFDIR
          EXEC SQL INCLUDE TDSANFDI END-EXEC.
      *-12---------------------  Tabella ASU                       *
      *GG ASU
          EXEC SQL INCLUDE TDSASU   END-EXEC.
      *-13---------------------  Tabella ASU                       *
      *GG ASU2
          EXEC SQL INCLUDE TDSASU2  END-EXEC.
      *-14---------------------  Tabella ASU                       *
      *GG ASU7
          EXEC SQL INCLUDE TDSLIST  END-EXEC.
      *-15---------------------  Tabella ASU                       *
      *GG ASU8
          EXEC SQL INCLUDE TDSLAV   END-EXEC.
      *-16---------------------  Tabella ASU                       *
      *GG ASU9
          EXEC SQL INCLUDE TDSPAG   END-EXEC.
      *-17---------------------  Tabella                           *
      *GG ATTSU
          EXEC SQL INCLUDE TDSATTSU END-EXEC.
      *-18---------------------  Tabella ANF                       *
      *GG LAVPU
          EXEC SQL INCLUDE TDSLAVPU END-EXEC.
      *-19---------------------  Tabella ANF                       *
      *GG SUSSUT
          EXEC SQL INCLUDE TDSSUSST END-EXEC.
      *-20---------------------  Tabella ANF                       *
      *GG PERIO
          EXEC SQL INCLUDE TDSPERIO END-EXEC.
      *-21---------------------  Tabella ANF                       *
      *GG SX00
          EXEC SQL INCLUDE TDSSX00  END-EXEC.
      *-22---------------------  Tabella appoggio Stampe           *
      *-23---------------------  Tabella appoggio Stampe           *
      *GG TDSREPOR
          EXEC SQL INCLUDE TDSREPOR END-EXEC.
      *
      ******************************************************************
      *       DECLARE DEI CURSORI
      ******************************************************************
      *
      * FLAG SELEZIONE CURSORE
      * 1  = 1 RANGE
      * 2=2 RANGE
      * ...
      *
       01  WK-CURS          PIC X VALUE '1'.
      *
       01  C-IND            PIC 9.
      *
           EXEC SQL
              DECLARE  CURSDCO1 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOULESSP IN ('L', 'A')       AND
                H_DCOCOREIM = 0                 AND
                H_DCOPESTDI =      'S'          AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO2 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOULESSP IN ('L', 'A')       AND
                H_DCOCOREIM = 0                 AND
                H_DCOPESTDI =      'S'          AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO3 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOULESSP IN ('L', 'A')       AND
                H_DCOCOREIM = 0                 AND
                H_DCOPESTDI =      'S'          AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO4 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOULESSP IN ('L', 'A')       AND
                H_DCOCOREIM = 0                 AND
                H_DCOPESTDI =      'S'          AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO5 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOULESSP IN ('L', 'A')       AND
                H_DCOCOREIM = 0                 AND
                H_DCOPESTDI =      'S'          AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSDCO6 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOULESSP IN ('L', 'A')       AND
                H_DCOCOREIM = 0                 AND
                H_DCOPESTDI =      'S'          AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN6 AND :NUMERO-AL-IN6  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN6  AND   :ANNO-AL-IN6))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO1 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO2 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO3 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO4 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO5 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURSSCO6 CURSOR   WITH HOLD FOR
              SELECT
                    H_DCOCODFIS,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOCHIDOM,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

               FROM    TDSDATCO
               WHERE
                H_DCOCOTIDO IN ('B', 'D', 'E')  AND
                H_DCOCENOPE =      :H-DCOCENOPE AND
                H_DCOCOSEGR =      :H-DCOCOSEGR AND
                (( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN1 AND :NUMERO-AL-IN1  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN1  AND   :ANNO-AL-IN1)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN2 AND :NUMERO-AL-IN2  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN2  AND   :ANNO-AL-IN2)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN3 AND :NUMERO-AL-IN3  AND
                   H_DCOANVEPR BETWEEN
                 :ANNO-DAL-IN3  AND   :ANNO-AL-IN3)  OR
                 ( H_DCONDVEPR BETWEEN
                 :NUMERO-DAL-IN4 AND :NUMERO-AL-IN4  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN4  AND   :ANNO-AL-IN4)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN5 AND :NUMERO-AL-IN5  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN5  AND   :ANNO-AL-IN5)  OR
                  ( H_DCONDVEPR BETWEEN
                  :NUMERO-DAL-IN6 AND :NUMERO-AL-IN6  AND
                    H_DCOANVEPR BETWEEN
                  :ANNO-DAL-IN6  AND   :ANNO-AL-IN6))
               ORDER BY H_DCOANVEPR, H_DCONDVEPR
           END-EXEC.
           EXEC SQL
              DECLARE  CURRECUP CURSOR   WITH HOLD FOR
              SELECT
                H_RECCHIDOM,
                H_RECPROREC,
                H_RECTOREEE,
                H_RECTORERE,
                H_RECCOREAL,
                H_RECCORENU,
                H_RECIMPRAE,
                H_RECCAUREC,
                H_RECTIPREC,
                H_RECCHDDVI,
                H_RECIMUREE,
                H_RECDTESRE,
                H_RECNUMRAT,
                H_RECCODBIL,
                H_RECIIRPEF,
                H_RECCOSEDE
               FROM    TDSRECUP
               WHERE
                H_RECCHIDOM =  :H-RECCHIDOM
            AND H_RECCOSEDE =  :H-RECCOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURDELEG CURSOR   WITH HOLD FOR
              SELECT
                H_DSICHIDOM,
                H_DSIDTINIS,
                H_DSIDTFIIS,
                H_DSICODSIN,
                H_DSICATSIN,
                H_DSICOSEDE
               FROM    TDSDELSI
               WHERE
                H_DSICHIDOM =  :H-DSICHIDOM
            AND H_DSICOSEDE =  :H-DSICOSEDE
           END-EXEC.
      *
           EXEC SQL
              DECLARE  CURANF CURSOR   WITH HOLD FOR
              SELECT
                H_ANFCOSEDE,
                H_ANFCODFIS,
                H_ANFDTDEVA,
                H_ANFCHIDOM,
                H_ANFCONUFA,
                H_ANFNUMFIG,
                H_ANFNUMGEN,
                H_ANFPREINV,
                H_ANFTIPINV,
                H_ANFFIGMIN,
                H_ANFTIPNUC,
                H_ANFREDFAE,
                H_ANFANRIRE,
                H_ANFTABELLA,
                H_ANFIMPMENS,
                H_ANFIMPGIOR
               FROM    TDSMODAN
               WHERE
                H_ANFCHIDOM =  :H-ANFCHIDOM
            AND H_ANFCODFIS =  :H-ANFCODFIS
            AND H_ANFCOSEDE =  :H-ANFCOSEDE
            ORDER BY  H_ANFDTDEVA
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURPERI CURSOR   WITH HOLD FOR
              SELECT
                  H_PERCHIDOM,
                  H_PERCODICE,
                  H_PERCOSEDE,
                  H_PERDAAL ,
                  H_PERDADAL ,
                  H_PERORELAV,
                  H_PERTIPOPRE,
                  H_PERCHIDOM ,
                  H_PERCODICE ,
                  H_PERCOSEDE ,
                  H_PERDAAL ,
                  H_PERDADAL ,
                  H_PERORELAV ,
                  H_PERTIPOPRE
               FROM    TDSPERIO
               WHERE
                H_PERCHIDOM =  :H-PERCHIDOM
            AND H_PERCOSEDE =  :H-PERCOSEDE
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURSOSP CURSOR   WITH HOLD FOR
              SELECT
                H_SOSCOSEDE,
                H_SOSCODFIS,
                H_SOSDTINSOS,
                H_SOSCHIDOM,
                H_SOSDTFISOS,
                H_SOSCODSOS,
                H_SOSDTCOM
               FROM    TDSSOSPE
               WHERE
                H_SOSCHIDOM =  :H-SOSCHIDOM
            AND H_SOSCOSEDE =  :H-SOSCOSEDE
            ORDER BY H_SOSDTINSOS
           END-EXEC.
      *                                                              *
           EXEC SQL
              DECLARE  CURREC43 CURSOR   WITH HOLD FOR
              SELECT
                H_RECCHIDOM,
                H_RECPROREC,
                H_RECTOREEE,
                H_RECTORERE,
                H_RECCOREAL,
                H_RECCORENU,
                H_RECIMPRAE,
                H_RECCAUREC,
                H_RECTIPREC,
                H_RECCHDDVI,
                H_RECIMUREE,
                H_RECDTESRE,
                H_RECNUMRAT,
                H_RECCODBIL,
                H_RECIIRPEF,
                H_RECCOSEDE
               FROM    TDSRECUP
               WHERE
                H_RECCHIDOM =  :H-RECCHIDOM
            AND H_RECCOSEDE =  :H-RECCOSEDE
           END-EXEC.
      *                                                              *
      *                                                              *
       01  INVIO                 pic  x     value spaces.
      *------------------------------ Chiave subfile                 *
       01  KEY-VIDEO             pic  9(3)  value zeros.
      *------------------------------ Flag lettura (Valori S o N)
       01  W-FLAGLETTURA.
           05  WL-TABPIENA           pic x     value  'N'.
           05  WL-DATICOMUNI         pic x     value  'N'.
           05  WL-RECUPERI           pic x     value  'N'.
           05  WL-FILE40             pic x     value  'N'.
           05  WL-FILE42             pic x     value  'N'.
      *    05  WL-FILE47             pic x     value  'N'.
      *    05  WL-FILE48             pic x     value  'N'.
      *    05  WL-FILE49             pic x     value  'N'.
           05  WL-FILE51             pic x     value  'N'.
           05  WL-FILE52             pic x     value  'N'.
           05  WL-FILE53             pic x     value  'N'.
      *    05  WL-FILE65             pic x     value  'N'.
           05  WL-SITUAZIODO         pic x     value  'N'.
      *------------------------------ Flag scrittura (Valori S o N)  *
       01  W-FLAGSCRITTURA.
           05  WS-APPOGGIO           pic x     value  'N'.
           05  WS-RIEPILOGO          pic x     value  'N'.
      *---------------------------------- Key APPOGGIO x I39-        *
       01  WB-DOMANDA            pic 9(10) value  zeros.
       01  WB-DOMANDA-R  redefines  WB-DOMANDA.
           05  WB-ANNO           pic 9(4).
           05  WB-NUMERO         pic 9(6).
      *----------------------------------Area comodo mappa 4         *
       01  VO-DSPFM134.
               05 DSPFM134-O .
                   06 M4A011 PIC X(67).
                   06 M4A012 PIC X(67).
                   06 M4A013 PIC X(67).
                   06 M4A014 PIC X(67).
       01  VO-DSPFM13B.
               05 DSPFM13B-O .
                   06 MBA099 PIC X(10).
                   06 MBN002 PIC  9(10).
                   06 MBA051 PIC S9(13).
                   06 MBA004 PIC X(31).
                   06 MBN005 PIC  9(8).
                   06 MBA052 PIC X(16).
                   06 MBA006 PIC X(24).
                   06 MBN007 PIC S9(5).
                   06 MBA008 PIC X(23).
                   06 MBA009 PIC X(2).
                   06 MBA010 PIC X(33).
                   06 MBN012 PIC  9(8).
                   06 MBN013 PIC S9(9)V9(2).
 BL08A             06 MBN014 PIC S9(9)V9(2).
 BL08A             06 MBN015 PIC S9(4).
 BL08A             06 MBN016 PIC S9(8)V9(2).
 BL08A             06 MBN017 PIC S9(8)V9(2).
 BL08A             06 MBN019 PIC S9(8)V9(2).
 BL08A             06 MBN029 PIC S9(8)V9(2).
 BL08A             06 MBA031 PIC X(23).
 BL08A             06 MBN032 PIC S9(8)V9(2).
 BL08A             06 MBN033 PIC S9(8)V9(2).
 BL08A             06 MBN034 PIC S9(8)V9(2).
 BL08A             06 MBN021 PIC S9(5)V9(2).
 BL08A             06 MBN023 PIC S9(8)V9(2).
 BL08A             06 MBN024 PIC S9(8)V9(2).
 BL08A             06 MBN026 PIC S9(9)V9(2).
 BL08A             06 MBA041 PIC X(33).
      *
       01   RO-DSPFM13B.
               05 RIGA-13B-1 .
                   06 RBA099 PIC X(10).
                   06 RBN002 PIC  9(10).
                   06 RBA051 PIC  9(13).
                   06 RBA004 PIC X(31).
                   06 RBN005 PIC  9(8).
                   06 RBA052 PIC X(16).
                   06 RBA006 PIC X(24).
                   06 RBN007 PIC  9(5).
                   06 RBA008 PIC X(23).
                   06 RBA009 PIC X(2).
                   06 RBA010 PIC X(33).
                   06 RBN012 PIC  9(8).
               05 RIGA-13B-2 .
                   06 RBN013 PIC  -9(9).9(2).
                   06 RBN014 PIC  -9(9).9(2).
                   06 RBN015 PIC  9(4).
                   06 RBN016 PIC  -9(8).9(2).
                   06 RBN017 PIC  -9(8).9(2).
                   06 RBN019 PIC  -9(8).9(2).
                   06 RBN029 PIC  -9(8).9(2).
                   06 RBA031 PIC X(23).
                   06 RBN032 PIC  -9(8).9(2).
                   06 RBN033 PIC  -9(8).9(2).
                   06 RBN034 PIC  -9(8).9(2).
               05 RIGA-13B-3 .
                   06 RBN021 PIC  -9(8).9(2).
                   06 RBN023 PIC  -9(8).9(2).
                   06 RBN024 PIC  -9(8).9(2).
                   06 RBN026 PIC  -9(9).9(2).
                   06 RBA041 PIC X(33).
      *----------------------------------AREE COMODO STAMPA          *
       01  W-STAMPAT.
 RP08B*    COPY DDS-SDSPD13T-O   OF SDSPD13.
 RP08A    05 SDSPD13T-O.
 RP08A      06 S1A000 PIC X(22).
 RP08A      06 S1N001 PIC S9(2).
 RP08A      06 S1A002 PIC X(22).
 RP08A      06 S1A003 PIC X(25).
       01  W-STAMPAD.
 RP08A    05 SDSPD13D-O.
 RP08A      06 S2N001 PIC  9(4).
 RP08A      06 S2N002 PIC  9(6).
 RP08A      06 S2A003 PIC X(28).
 RP08A      06 S2D004 PIC  9(8).
 RP08A      06 S2A005 PIC X(10).
 RP08A      06 S2A006 PIC X(40).
 RP08A      06 S2A007 PIC X(2).
 RP08A      06 S2D008 PIC  9(8).
 RP08A      06 S2D009 PIC  9(8).
      *01  W-STAMPAC.
      *    COPY DDS-SDSPD13C-O   OF SDSPD13.
       01  W-STAMPAU.
 RP08B*    COPY DDS-SDSPD13U-O   OF SDSPD13.
 RP08A    05 SDSPD13U-O.
 RP08A      06 S3A000 PIC X(22).
 RP08A      06 S3N001 PIC S9(2).
 RP08A      06 S3A002 PIC X(22).
 RP08A      06 S3A003 PIC X(25).
       01  W-STAMPAE.
 RP08A    05 SDSPD13E-O.
 RP08A      06 S4N001 PIC  9(4).
 RP08A      06 S4N002 PIC  9(6).
 RP08A      06 S4A003 PIC X(28).
 RP08A      06 S4N005 PIC S9(6)V9(2).
 RP08A      06 S4N006 PIC S9(6)V9(2).
 RP08A      06 S4N007 PIC S9(6)V9(2).
 RP08A      06 S4N008 PIC S9(6)V9(2).
 RP08A      06 S4N009 PIC S9(6)V9(2).
 RP08A      06 S4A010 PIC X(1).
 RP08A      06 S4D011 PIC  9(8).
 RP08A      06 S4D012 PIC  9(8).
 RP08A      06 S4N023 PIC S9(4).
      *
       01  R-STAMPAE.
            06 R4ANNDOM            PIC  9(4).
            06 R4NUMDOM            PIC  Z(6).
            06 R4NOMECOGNOME       PIC  X(28).
            06 R4IMINU             PIC -Z(6).9(2).
            06 R4PMEANFUIME        PIC -Z(6).9(2).
            06 R4PMEULIRN1E        PIC -Z(6).9(2).
            06 R4PMEUITRSIE        PIC -Z(6).9(2).
            06 R4PMEAIMULASE       PIC -Z(6).9(2).
            06 R4DCODTADEC         PIC X(1).
            06 R4PMEULPEDAL        PIC  9(8).
            06 R4PMEULPEAL         PIC  9(8).
      *     06 R4N022              PIC -Z(3).9(2).
            06 R4PMEULPEGG         PIC  Z(4).
      *
       01  W-STAMPAS.
 RP08A    05 SDSPD13S-O.
 RP08A      06 S5A000 PIC X(22).
 RP08A      06 S5N001 PIC S9(2) VALUE 0.
 RP08A      06 S5A002 PIC X(22).
 RP08A      06 S5A003 PIC X(25).
 RP08A      06 S5N004 PIC S9(6) VALUE 0.
 RP08A      06 S5N005 PIC S9(10)V9(2) VALUE 0.
 RP08A      06 S5N007 PIC S9(10)V9(2) VALUE 0.
 RP08A      06 S5N006 PIC S9(10)V9(2) VALUE 0.
 RP08A      06 S5N008 PIC S9(10)V9(2) VALUE 0.
 RP08A      06 S5N009 PIC S9(10)V9(2) VALUE 0.
 RP08A      06 S5N011 PIC S9(6)       VALUE 0.
 RP08A      06 S5N012 PIC S9(10)V9(2) VALUE 0.
       01  R-STAMPAS.
            06 R5N001 PIC  9(2).
            06 R5N004 PIC  Z(6).
            06 R5N005 PIC -Z(10).9(2).
            06 R5N007 PIC -Z(10).9(2).
            06 R5N006 PIC -Z(10).9(2).
            06 R5N008 PIC -Z(10).9(2).
            06 R5N009 PIC -Z(10).9(2).
            06 R5N011 PIC  Z(5)9.
            06 R5N012 PIC -Z(09)9.9(2).
       01  W-STAMPAI.
 RP08A    05 SDSPD13I-O.
 RP08A      06 S6A000 PIC X(22).
 RP08A      06 S6N001 PIC S9(2).
 RP08A      06 S6A002 PIC X(22).
 RP08A      06 S6A003 PIC X(25).
 RP08A      06 S6D005 PIC S9(8).
 RP08A      06 S6A006 PIC X(21).
 RP08A      06 S6A011 PIC X(2).
 RP08A      06 S6A021 PIC X(50).
 RP08A      06 S6A012 PIC X(2).
 RP08A      06 S6A022 PIC X(50).
 RP08A      06 S6A013 PIC X(2).
 RP08A      06 S6A023 PIC X(50).
 RP08A      06 S6A014 PIC X(2).
 RP08A      06 S6A024 PIC X(50).
 RP08A      06 S6A015 PIC X(2).
 RP08A      06 S6A025 PIC X(50).
 RP08A      06 S6A016 PIC X(2).
 RP08A      06 S6A026 PIC X(50).
 RP08A      06 S6A017 PIC X(2).
 RP08A      06 S6A027 PIC X(50).
 RP08A      06 S6A018 PIC X(2).
 RP08A      06 S6A028 PIC X(50).
 RP08A      06 S6A019 PIC X(2).
 RP08A      06 S6A029 PIC X(50).
 RP08A      06 S6A031 PIC X(4).
 RP08A      06 S6A041 PIC X(6).
 RP08A      06 S6A051 PIC X(4).
 RP08A      06 S6A061 PIC X(6).
 RP08A      06 S6A032 PIC X(4).
 RP08A      06 S6A042 PIC X(6).
 RP08A      06 S6A052 PIC X(4).
 RP08A      06 S6A062 PIC X(6).
 RP08A      06 S6A033 PIC X(4).
 RP08A      06 S6A043 PIC X(6).
 RP08A      06 S6A053 PIC X(4).
 RP08A      06 S6A063 PIC X(6).
 RP08A      06 S6A034 PIC X(4).
 RP08A      06 S6A044 PIC X(6).
 RP08A      06 S6A054 PIC X(4).
 RP08A      06 S6A064 PIC X(6).
 RP08A      06 S6A035 PIC X(4).
 RP08A      06 S6A045 PIC X(6).
 RP08A      06 S6A055 PIC X(4).
 RP08A      06 S6A065 PIC X(6).
 RP08A      06 S6A036 PIC X(4).
 RP08A      06 S6A046 PIC X(6).
 RP08A      06 S6A056 PIC X(4).
 RP08A      06 S6A066 PIC X(6).
 RP08A      06 S6N071 PIC S9(6).
 RP08A      06 S6N072 PIC S9(6).
      *
      *----------------------------------------------File status     *
       01  STATO-FILE.
         03  W-FST-NOINI.
           05  FST-MDSPD13           pic S9(9)  VALUE ZEROES.
           05  FST-ADSRPG00          pic S9(9)  VALUE ZEROES.
           05  FST-LDSRPG01          pic S9(9)  VALUE ZEROES.
           05  FST-LFDATCO2          pic S9(9)  VALUE ZEROES.
           05  FST-SDSPD13           pic S9(9)  VALUE ZEROES.
         03  W-FST-SIINI.
           05  FST-ADSRECUP          pic S9(9)  VALUE ZEROES.
           05  FST-LFPEERE1          pic S9(9)  VALUE ZEROES.
           05  FST-ADSAPIO0          pic S9(9)  VALUE ZEROES.
           05  FST-ADSASU            pic S9(9)  VALUE ZEROES.
           05  FST-ADSASU2           pic S9(9)  VALUE ZEROES.
           05  FST-ADSASU7           pic S9(9)  VALUE ZEROES.
           05  FST-ADSASU8           pic S9(9)  VALUE ZEROES.
           05  FST-ADSASU9           pic S9(9)  VALUE ZEROES.
           05  FST-ADSATTSU          pic S9(9)  VALUE ZEROES.
           05  FST-ADSLAVPU          pic S9(9)  VALUE ZEROES.
           05  FST-ADSLIST           PIC -(10) VALUE ZERO.
           05  FST-ADSSUSST          pic S9(9)  VALUE ZEROES.
           05  FST-ADSDATAN          pic S9(9)  VALUE ZEROES.
           05  FST-LFDELSI1          pic S9(9)  VALUE ZEROES.
           05  FST-LFMODAN1          pic S9(9)  VALUE ZEROES.
           05  FST-ADSPERIO          pic S9(9)  VALUE ZEROES.
           05  FST-ADSSX00           pic S9(9)  VALUE ZEROES.
           05  FST-L02COMUNI         pic S9(9)  VALUE ZEROES.
           05  FST-ADSSITDO          pic S9(9)  VALUE ZEROES.
           05  FST-LFSOSPE1          pic S9(9)  VALUE ZEROES.
      *                                                              *
      *--------------------------------------------Contatori         *
       01  W-CONTATORI.
           05  W-LINE               pic 99   value  zeros.
           05  CHIUDIFILE           pic 99   value  zeros.
           05  CTR-VIDEO            pic 99   value  zeros.
           05  CTR-ATT-PAGME        pic 9(8) value  zeros.
           05  CTR-LET-DATCO        pic 9(8) value  zeros.
           05  CTR-ELA-DATCO        pic 9(8) value  zeros.
           05  CTR-SCR-DATCO        pic 9(8) value  zeros.
           05  XXX-REC   redefines CTR-SCR-DATCO.
               07  filler           pic 9(7).
               07  UNI-SCR-DATCO    pic 9.
           05  CTR-LET-DATAN        pic 9(8) value  zeros.
           05  CTR-ELA-DATAN        pic 9(8) value  zeros.
           05  CTR-SCR-DATAN        pic 9(8) value  zeros.
           05  CTR-LET-APPO         pic 9(8) value  zeros.
           05  CTR-SCR-APPO         pic 9(8) value  zeros.
           05  CTR-IMPREVISTI       pic 9(8) value  zeros.
           05  CTR-PAGATE           pic 9(8) value  zeros.
           05  CTR-INDEBITE         pic 9(8) value  zeros.
           05  CTR-DEFINITE         pic 9(8) value  zeros.
010720*----------------------- S / N - Identifico sussidi covid19    *
       01  W-SXCOVID19               PIC x    value 'N'.
      *-------------------------------Valore   Indicatori --         *
       01  IND1                     pic 99 VALUE 0.
      *------------------------------------------- Per operazioni    *
       01  RISULT                    PIC 99   value zeros.
       01  RESTO                     PIC 9.
           88  BISESTILE                      value 0.
       01  GG-FEBBRAIO               PIC 99   value 28.
      *------------------------------------------- Per controllo date*
       01  W8-AAAAMMGG               PIC 9(8) value zeros.
       01  R8-AAAAMMGG  redefines  W8-AAAAMMGG.
           02  W8-AAAA               PIC 9(4).
           02  W8-MMGG.
               03  W8-MM             PIC 99.
               03  W8-GG             PIC 99.
       01  D8-GGMMAAAA.
           02  D8-GG                 PIC 99   value zeros.
           02  D8-MM                 PIC 99   value zeros.
           02  D8-AAAA               PIC 9(4) value zeros.
      *
       01  WK-DATA-APPOGGIO.
           02  WK-DATA-GG            PIC XX .
           02  WK-DATA-PUNTO1        PIC X      VALUE '.'.
           02  WK-DATA-MM            PIC XX .
           02  WK-DATA-PUNTO2        PIC X      VALUE '.'.
           02  WK-DATA-AAAA          PIC X(4).
      *
      *
       01  W-VALTOZAC                pic x(10) value spaces.
      *------------------------------------------------- Per gestione*
       01  W-NOINIZIALIZZARE.
           05  W-NOMEDIR            pic x(30) value spaces.
           05  W-PROGRESSIVO        pic 9(3)  value zeros.
           05  W-CONGUAGLIO         pic 9(2)  value zeros.
           05  W-PROCEDURA          pic x(3)  value 'G05'.
           05  W-PAGAMINCORSO       pic x     value spaces.
      *                =  'S' (pagamento in corso)  oppure  =  'N'o  *
           05  WIC-DOMANDA          pic 9(10) value  zeros.
           05  RIC-DOMANDA  redefines  WIC-DOMANDA.
               07  WIC-ANNO         pic 9(4).
               07  WIC-NUMERO       pic 9(6).
           05  W-VALUTA             pic x     value 'E'.
           05  W-CONTINUA           pic x     value spaces.
      *           se = 'S'  allora continua perform, ......          *
           05  W-INIBIRE            pic x     value 'N'.
      *           se = '7'  allora no calcolo X conguaglio  730      *
      *           se = 'F'  allora no calcolo X conguaglio Fiscale   *
           05  W-NIK                pic x     value 'N'.
      *           se = 'S'  allora ----> .................           *
           05  W-AS400             pic x     value 'N'.
      *           se = 'S'  allora ----> .................           *
           05  W-FINE-ELABORA       pic x     value 'N'.
      *           se = 'S'  allora fine elaborazione                 *
           05  W-FLAGYNCORSO        pic x   value  spaces.
      *           se = 'S'  allora Flag elab.Yn corso su ADS3STOP    *
           05  W-FINE-INTERVALLO    pic x     value spaces.
      *           se = 'S'  allora fine intervallo                   *
           05  W-PAGARE             pic x     value spaces.
      *           se = S   elabora solo pagamenti Successivi         *
      *           se = P   elabora solo Prime liquidazioni           *
      *           se = T   elabora Tutti i record pagabili           *
           05  W-CAMPO2             pic xx    value spaces.
           05  W-CONTOREC.
             07  W-CONTOALFA        pic x(03) value spaces.
             07  W-CONTONUME        pic 9(05) value zeroes.
           05  W-COORDINATE.
             07  W-IBAN             pic x(04) value spaces.
             07  W-COOBAN           pic x(23) value spaces.
           05  W-DCOMODARR          pic 9     value zeros.
      *                                                              *
       01  W-GESTISCI.
           05  W-ERRORE             pic x     value 'N'.
      *           se = 'S'  allora è errore                          *
           05  W-XCALCOLO           pic x     value 'Y'.
      *           se = 'Y'   allora  passare a pgm di calcolo        *
      *           se  altri valori ==> errore I/O archivi            *
           05  W-SCELTA             pic x     value spaces.
      *           se = S   record selezionato per l'elaborazione     *
      *           se = N   non elabora record                        *
           05  FLG-COMMIT           pic x(01) value  spaces.
      *           se = S   esegui commit                             *
      *           se = N   esegui rollback                           *
           05  FLG-17               pic x     value spaces.
      *           se = S   esegui periodi con codice 17              *
      *           se = N   ............................              *
      *-------------------- I due seguenti x ASU F.O. cod.fin. 3,6   *
           05  W-DTBLOCCO-36        pic  9(08)  value  zeros.
           05  W-COD-SINO-36        pic  x(02)  value spaces.
      *                                                              *
       01  W-INIZIALIZZA.
           05  W-PGM                pic  x(07)  value spaces.
           05  W-DECORRENZA         pic  9(08)  value zeros.
           05  W-CALCOLI            pic  9(10)  value zeros.
           05  W-CHK-CAMPI          pic  x(50)  value spaces.
           05  W-ANNOINIZANF        pic  9(04)  value zeros.
      ***  05  W-ANNOFINEANF        pic  9(04)  value zeros.
           05  W-DATMORTE           pic  9(08)  value zeros.
           05  W-IMP-GPA10099       pic  9(09)v9(4) value zeros.
       01  W-ASSEGNA.
           05  W-SALTA              pic  x(01)  value 'N'.
      *           se = S   si salto                                  *
      *           se = N   no salto                                  *
           05  W-SALTA-ANF          pic  x(01)  value 'N'.
      *           se = S   si salto                                  *
      *           se = N   no salto                                  *
           05  W-SCRIVO             pic  x(01)  value 'N'.
      *           se = N   non scrivo su mappa                       *
      *           se = S   scrivo su mappa                           *
      ******* i due seguenti da utilizzare                           *
           05  W-ELABORA            pic x(01)   value 'N'.
      *           se = 'N'  non  elaborare                           *
      *           se = 'S'  allora elabora                           *
           05  W-CAMBIATO           pic x(01)   value 'N'.
      *           se = S   record modificato da riscrivere           *
      *           se = N   nessuna modifica                          *
           03  W-DIF-FISCALE        pic s9(10)v9(2) value zeroes.
      *----------------------------------------------- Per intervalli*
       01  W-INTERVALLI.
           03  W-DOMANDA-DAL        pic 9(10) value zeros.
           03  R-DOMANDA-DAL  redefines  W-DOMANDA-DAL.
               05  W-DAL-ANNO       pic 9(4).
               05  W-DAL-NUMERO     pic 9(6).
           03  W-DOMANDA-AL         pic 9(10) value zeros.
           03  R-DOMANDA-AL   redefines  W-DOMANDA-AL.
               05  W-AL-ANNO        pic 9(4).
               05  W-AL-NUMERO      pic 9(6).
      *---------------------------- Data odierna (6:   gg mm aa)     *
      *                                          (8: aaaa mm gg)     *
       01  DATA-ODIERNA.
         03  W6-ODIERNA           pic 9(6)   value zeros.
         03  R6-ODIERNA  redefines  W6-ODIERNA.
           05  W6-ODIGG           pic 99.
           05  W6-ODIMM           pic 99.
           05  W6-ODIAA           pic 99.
         03  W8-ODIERNA           pic 9(8)   value zeros.
         03  R8-ODIERNA  redefines  W8-ODIERNA.
           05  W8-ODIAA           pic 9999.
           05  W8-ODIMM           pic 99.
           05  W8-ODIGG           pic 99.
         03  W4-ANNO-1            pic 9(4)   value zeros.
      *----------------------------------------Indici tabelle        *
       01  W-INDICI.
           02  N1                    pic 999   value zeros.
           02  NDC1                  pic 999   value zeros.
           02  NDC2                  pic 999   value zeros.
           02  NDC3                  pic 999   value zeros.
           02  NDT2                  pic 999   value zeros.
           02  NDC11                 pic 999   value zeros.
           02  I-ANF                 pic 9(03) value zeros.
           02  I-PER                 pic 9(03) value zeros.
           02  I-SOS                 pic 9(03) value zeros.
      *    02  IO-PET                pic 9(03) value zeros.
      *    02  IS-PET                pic 9(03) value zeros.
      *    02  I-PEN                 pic 9(03) value zeros.
      *---------------------------------------- Codici prestazioni   *
       01  W-CODIFICA-PRESTAZ.
           05  W-PRESTAZIONE         pic  xx    value spaces.
           05  W-OPZIONE             pic  x     value spaces.
           05  W-DECODIFICA          pic  x(50) value spaces.
           05  W-CODICEUNO           pic  99    value zeros.
           05  W-CODICEDUE           pic  99    value zeros.
      *------------------------------Tabella 1: Tipo prestazioni     *
      *01  T1-TIPO-PRESTAZ.
      *    02  T1-ELEMENTO     occurs 8  times.
      *        03  T1-PRESTAZIONE    pic  x(02).
      *        03  T1-OPZIONE        pic  x(01).
      *        03  T1-DESCRIZIONE    pic  x(50).
      *                                                              *
       01  X1-CHEPRESTA.
           02  X1-CHELEMEN     occurs 8  times.
               03  X1-PRESTAZIONE    pic  x.
      *------------------------------Tabella 2: Intervalli da elabora*e
       01  T2-INTERVALLI.
           02  T2-ELEMENTO     occurs  6  times.
               03  T2-ANNO-DAL       pic  9(4).
               03  T2-NUMERO-DAL     pic  9(6).
               03  T2-ANNO-AL        pic  9(4).
               03  T2-NUMERO-AL      pic  9(6).
      *                                                              *
      *-------------------------------- Per compattamento Cognome/Nom*
       01  FLD-1                  value spaces.
           02  BT-1  occurs 32       pic X.
       01  FLD-2                 value spaces.
           02  BT-2  occurs 32       pic X.
      *-------------------------------- Campi comodo dati anagrafici *
       01  W-ANAGRAFICI.
           03  WIC-COGNOME           pic  x(36)     value spaces.
           03  WIC-NOME              pic  x(36)     value spaces.
           03  WIC-ACQUISITO         pic  x(36)     value spaces.
           03  WIC-DTNASCITA         pic  9(08)     value zeroes.
           03  WIC-DANCOCORE         pic  x(36)     value spaces.
           03  WIC-DANSIPRRE         pic  x(02)     value spaces.
           03  WIC-DANIND            pic  x(52)     value spaces.
           03  WIC-DANCAP            pic  9(05)     value zeroes.
      *--------------------- Per segnalare coordinate inesatte       *
       01  W-COMPATTO                pic  x(28)     value zeroes.
       01  R-COMPATTO  redefines  W-COMPATTO.
           03  W10-COMPATTO          pic  x(10).
           03  W-ERR-COOBAN          pic  x(18).
      *--------------------- Campi per utilizzo stringhe/numeri      *
       01  W-ALFANUMERICI.
           02 W-2CIFRE               pic 99     value zeros.
           02 R-2STRINGA  redefines  W-2CIFRE
                                     pic xx.
           02 W-8CIFRE               pic 9(8)   value zeros.
           02 R-8STRINGA  redefines  W-8CIFRE
                                     pic x(8).
      *01  W-NUMERICI.
      *    02 WRK-RECTOREEE        pic S9(9)v9(2)     value zeros.
      *    02 WRK-RECTORERE        pic S9(9)v9(2)     value zeros.
      *-------------------- Campi per conversione in EURO            *
       01  W-CONTA-P                PIC S9(7)V9(2)   USAGE COMP-3.
       01  W-EURO                   pic   9(4)v9(2)    value zeros.
       01  W-CONVERSIONI.
           05  W-IMPORTO-EURO       pic  S9(8)v9(8)    value zeros.
           05  W-IMPORTO-LIRE       pic  S9(10)        value zeros.
           05  W-ASSEGNO-EURO       pic  S9(10)v9(2)   value zeros.
           05  W-DIFFERENZA         pic  S9(10)v9(2)   value zeros.
           05  W-SQUADRATURA        pic  Z,ZZZ,ZZ9.99- value zeros.
           05  R-SQUADRATURA  redefines  W-SQUADRATURA
                                    pic  x(12).
      *    05  W-CHKCAMPI           pic  x(100)  duplica??   spaces.
      *                                                              *
      *-----------------Definizioni necessarie alle routine usate    *
      *------------------------------ Per programma PNPGF00 e PNPGF80*
      *01  PER-PNPGFD0.
           COPY  CNPGF001.
           COPY  DSGFCOPY.
      *-------------------------- Data finale pagam.prestaz.calcolata*
       01  W-CALCOLO-AL              pic 9(8)  value zeros.
       01  R-CALCOLO-AL  redefines  W-CALCOLO-AL.
           02  R-ANNO-AL             pic 9(4).
           02  R-MESE-AL             pic 9(2).
           02  R-GIORNO-AL           pic 9(2).
      *01  W-CALCOLO-AL-PIU1         pic 9(8)  value zeros.
      *-------------------------- Data finale pagam.prestaz.inserita *
       01  W-INSDATA-AL              pic 9(8)  value zeros.
       01  R-INSDATA-AL  redefines  W-INSDATA-AL.
           02  R-INSANNO-AL          pic 9(4).
           02  R-INSMESE-AL          pic 9(2).
           02  R-INSGIORNO-AL        pic 9(2).
      *                                                              *
      *-----------------------------------------Per pgm calcolo ?
      *01  PER-CALCOLO.
      *    copy  CDSIO13.
      *
      *
      *--Chiamata POP per annullamento recupero------------ 'POP'
      *
           COPY POPCSIN.
      *
      *---------------------------------------------------- 'RDSUSR1'*
       01  PER-RDSUSR1.
           02  ID-LAVORO               pic x(10).
           02  ID-UTENTE               pic x(10).
      *---------------------------------------------------- 'RDSUT11'*
      *01  PER-RDSUT11.
      *    02  RDSUT11-STRINGA       pic X(100)  value spaces.
      *-----------------------------------------Per routine 'RDSUT14'*
      *01  PER-RDSUT14.                                              *
           copy CDSUT14.
      *-----------------------------------------Per routine 'RNPYEAR'*
      *01  PER-RNPYEAR.                                              *
           copy CNPYEAR.
      *---------------------------------------------------- 'RDSUT28'*
       01  PER-RDSUT28.
          02 LK-CODFIS            PIC X(16).
      *  risposta: S/N
          02 LK-RISP                 PIC X.
      *------------------------------------------- x PDSPD16/PDSIO21 *
       01  AREALINK-1.
           03 C-CODICE-SEDE           pic 9(04)  value zeros.
           03 C-NOME-SEDE             pic x(22)  value spaces.
           03 C-CODICE-STOP           pic 9(02)  value zeros.
           03 C-NOME-STOP             pic x(22)  value spaces.
           03 C-PROCEDURA             pic x(03)  value spaces.
           03 C-TIPOCALCOLO           pic x(01)  value spaces.
      *                       = 'S'  simulazione x lista contrrollo  *
      *                       = 'R'  reale x pagamento prestazione   *
           03 C-RICHIESTA             pic x(01)  value spaces.
      *                    se =  I - lettura Informazioni            *
      *                       =  C - richiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
           03 C-PROGRESSIVO           pic 9(03)  value zeros.
           03 C-RETCODE               pic x      value spaces.
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
       01  AREALINK-2.
           03 C-DIRIGENTE             pic x(30)  value spaces.
           03 R-DIRIGENTE  redefines  C-DIRIGENTE.
              05  filler              pic x(20).
              05  C-DTBLOCCO          pic 9(08).
              05  C-COD-SINO          pic x(02).
           03 C-ELABINCORSO           pic x      value spaces.
      *              se =  Y - Elaboraz. Yn corso medesima struttura *
      *                 =  K - Elaboraz. Kompletata                  *
           03 C-CONGUAGLIO            pic 9(2)   value zeros.
      *
      *-----------------------------------------per routine 'RDSERR0'*
       01  PER-RDSERR0.
           COPY  CDSERR0.
      *-----------------------------------------Per routine 'RDSTART'*
           copy  CDSTART1.

      *------------------------------------Per routine  RDSOR12      *
      *----rivedere
      *01 PER-RDSOR12.
      *    02 R12-CODICE-SEDE         pic 9(4)   value zeros.
      *    02 R12-CODICE-STOP         pic 9(2)   value zeros.
      *    02 R12-NOME-SEDE           pic x(22)  value spaces.
      *    02 R12-NOME-STOP           pic x(22)  value spaces.
      *    02 R12-BLOCCO              pic 9(2)   value zeros.
      *    02 R12-TIPO                pic x(30)  value spaces.
      *    02 R12-RTCD                pic 9      value zeros.
      *------------------ in input
      *    se R12-RTCD  =  5 controllo  password                     *
      *    se           =  6 controlla strutture attive              *
      *    se           =  8 funzioni particolari                    *
      *------------------ in output                                  *
      *    se R12-RTCD  =  9 Elaborazione non eseguita               *
      *    se           =  1 Elaborazione completata correttamente   *
      *    se           =  2 Elaborazione errata per motivi vari     *
      *------------------ se in input la richiesta = 6 allora in output
      *    se PXX-RTCD  =  1 in PXX-BLOCCO trovo numero strutture attiv
      *------------------------------------Per routine  RDSUT13  ----*
       01 PER-RDSUT13.
          02 R13-CODICECOMUNE          pic 9(6).
          02 R13-NOMECOMUNE            pic x(23).
          02 R13-PROVINCIA             pic xx.
          02 R13-RETCODE               pic xx.
      *     *decodifica = 00  -  comune trovato                      *
      *                 = 47  -  comune NON trovato                  *
      *     *  codifica = 00  -  comune trovato                      *
      *                 = 47  -  comune NON trovato                  *
      *                 = 60  -  trovato più di un comune            *
      *                 = 61  -  trovati più di 40 sinonimi          *
      *                 = 98  -  errore nei parametri                *
      *                 = 99  -  errore generico                     *
          02 R13-RTCD-COCO             pic x(4).
          02 R13-DESC-COCO             pic x(50).
      *-----------------------------------------per routine 'RDSUT09'
161115*01  PER-RDSUT09.
      *    03  AREA-INPUT.
      *        05  R09-COOBAN         pic  x(23).
      *    03  AREA-OUTPUT.
      *        05  R09-RC             pic  9(01).
      *        05  R09-ERRMSG         pic  x(60).
161115*---------------------------------------per routine 'PITIBAN2' *
       01  PER-PITIBAN1.
           03  V-OK-IBAN               pic x(02)  value spaces.
           03  V-IBAN                  pic x(34)  value spaces.
           03  V-MSG-IBAN              pic x(75)  value spaces.
       01  P-COORDINATE.
           03  P-PAESE               PIC XX.
           03  P-CIN-1               PIC 99.
           03  P-BBAN.
               05  P-CIN-2               PIC X.
               05  P-CODABI-A            PIC 9(5).
               05  P-CODCAB-A            PIC 9(5).
               05  P-CCLIENTE-A          PIC X(12).
161115     03  FILLER                PIC X(07) VALUE SPACES.
      *----------------------------------------per routine 'RDSPD13'*
       01  PER-RDSPD13.
           03  LDCOCODFIS             pic  X(16).
           03  LDATAODIERNA           pic  9(08).
           03  LPAGAMENTO             pic  x(01).
           03  LSEDE-RDSPD13          pic  x(04).
           03  LDCOCHIDOM             pic  x(13).
      *--------------------per routine 'PDSPD04'/'PDSPD05'/PDSPD06'  *
       01  LC-RETCODE                 pic x(01).
      *------------------ in output
      *    se L-RETCODE =  N elaborazione Non eseguita
      *                 =  C elaborazione Completata Correttamente
      *                 =  E elaborazione Errata per motivi vari
      *I---------------23/07/2013  per PDSPD04----------------------*
       01  LC-TAB-ANF.
         05  LC-EL-ANF      occurs  20  times.
           07  LC-ANFDTDEVA        pic  9(08).
           07  LC-ANFCONUFA        pic  9(02).
           07  LC-ANFNUMFIG        pic  9(02).
           07  LC-ANFPREINV        pic  x(01).
           07  LC-ANFTIPINV        pic  x(01).
           07  LC-ANFFIGMIN        pic  9(02).
           07  LC-ANFTIPNUC        pic  x(01).
           07  LC-ANFREDFAE        pic  9(06)v9999.
           07  LC-ANFANRIRE        pic  9(04).
      *F---------------23/07/2013  ---------------------------------*
      *
      *----------------------------------------per routine 'PDSLOCK'*
      *01  PER-PDSLOCK.
       01 L-AREA-LOCK.
          05 K-MATRICOLA             pic x(08).
          05 K-NDOMUS                pic x(13).
          05 K-TIPO-DOMANDA          pic x(02).
          05 K-TIPO-RICHIESTA        pic x(02).
          05 K-CENTRO-OPERATIVO      pic x(02).
          05 K-RETURN-CODE           pic x(02).
          05 K-RETURN-MESSAGE        pic x(60).
          05 K-IS-LOCKED             pic x(01).
          05 K-TIPO-OPERAZIONE       pic x(01).
          05 K-ESITO-LOCK-UNLOCK     pic x(02).
          05 K-LOCK-UNLOCK-MESSAGE   pic x(60).
          05 K-AUTO-COMMIT           pic x(01).
          05 K-CODICESEDE            pic x(04).
          05 FILLER                  pic x(26842).
      *-----------------------------------------Per routine 'PDSPD13'*
       01  PER-PDSPD13.
           03  Z-MATRICOLA            pic s9(08).
           03  Z-RETCODE              pic  x(01).
      *-----------------------------------------Per routine 'RDSCONT'*
       01  PER-RDSCONT.
           03  Q-CONTO                pic  x(08).
           03  Q-DESCRCONTO           pic  x(80).
           03  Q-RETCODE              pic  9(02).
      *-----------------------  se = 00  --> ok                      *
      *-----------------------  se = 01  --> ko - conto non valorizz.*
      *-----------------------  se = 02  --> ko - conto non trovato  *
      *-----------------------  se = 99  --> ko - vedi msg           *
           03  Q-MSG                  pic  x(80).
           03  Q-FILLER               pic  x(130).
      *-----------------------------------------Per routine 'RDSUT27'*
           COPY CDSUT27.
      *-----------------------  se = OK  --> CONVENZIONE ATTIVA      *
      *-----------------------  se = KO  --> CONVENZIONE NO ATTIVA   *
      *--------------------------------------------------------------*
      *CONSTANT SECTION.
      *77 WK_VERSION     pic s9(9) comp-5  value is 20091007.

290725 01 W-NEWSUSS                   PIC X   VALUE SPACES.

      *--------------------------------------------------------------*
      *LINKAGE SECTION.
       01  L-AREA.
           03 L-CODICE-SEDE           pic 9(04).
           03 L-NOME-SEDE             pic x(22).
           03 L-CODICE-STOP           pic 9(02).
           03 L-NOME-STOP             pic x(22).
           03 L-PROCEDURA             pic x(03).
           03 L-TIPOCALCOLO           pic x(01).
      *                       = 'S'  simulazione x lista contrrollo  *
      *                       = 'R'  reale x pagamento prestazione   *
           03 PAGA-ELABO-IN           PIC X(01).
      *S/T/P------------------------------------ Elabora Singola
           03 L-RICHIESTA             pic x(01).
      *                    se =  I - lettura Informazioni            *
      *                       =  C - richiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
           03 L-PROGRESSIVO           pic 9(03).
           03 L-RETCODE               pic x(01).
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
      *                                                              *
       01  LAREA-D.
           03  LCODOPE                pic x(02).
           03  LLIVAUTO               pic x(01).
           03  LMATRICOLA             pic x(08).
      *                                                              *
       01  PARAMETRI-IN.
               05 DATA-ELABO-IN.
                  07 DATA-ELABO-AA           PIC 9(04).
                  07 DATA-ELABO-MM           PIC 9(02).
                  07 DATA-ELABO-GG           PIC 9(02).
      *1---------------------------------------- Elabora tutte
      *2---------------------------------------- Elabora Da A
      *3---------------------------------------- Elabora Singola
               05 TIPO-ELABO-IN           PIC X(01).
      *------------------------------Tabella 1: Tipo prestazioni     *
               05  T1-ELEMENTO     occurs 8  times.
                  07  T1-PRESTAZIONE    pic X(2).
                  07  T1-OPZIONE        pic  x(01).
               05 PERIODI-IN-LK.
                  07 ELE-PERIODI OCCURS 6.
                     09 ANNO-DAL-IN-LK    PIC  9(4).
                     09 NUMERO-DAL-IN-LK  PIC  9(6).
                     09 ANNO-AL-IN-LK     PIC  9(4).
                     09 NUMERO-AL-IN-LK   PIC  9(6).
      *
      *--------------------------------------------------------------*
      *-------------------------------------------------------------*
      *-CODICE DI RITORNO :
      *-------------------------------------------------------------*
      *-  00  OK -R-  Calcolo Reale -OUT-MESSAGGIO
      *-------------------------------------------------------------*
      *-  90
      *-  96  CALCOLO ERRATO                    -  OUT-MESSAGGIO
      *-  99  DB2 ERROR                         -  OUT-MESSAGGIO
      *-
      *==============================================================*
       LINKAGE SECTION.
      *
      *--------------------------------------------------------------*
       01  COMMAREADS.
           02  K-AREA.
               05 K-CODICE-SEDE           pic 9(04).
               05 K-NOME-SEDE             pic x(22).
               05 K-CODICE-STOP           pic 9(02).
               05 K-NOME-STOP             pic x(22).
               05 K-PROCEDURA             pic x(03).
               05 K-TIPOCALCOLO           pic x(01).
      *                       = 'S'  simulazione x lista controllo   *
      *                       = 'R'  reale x pagamento prestazione   *
               05 KAGA-ELABO-IN           PIC X(01).
      *S---------------------------------------- ELABORA PAGAM. SUCC.
      *P---------------------------------------- ELABORA PRIME LIQUID.
      *T---------------------------------------- ELABORA TUTTE
               05 K-RICHIESTA             pic x(01).
      *                    se =  I - lettura Informazioni            *
      *                       =  C - RIChiesta progressivo Calcolo   *
      *                       =  E - Indica Elaborazione in corso    *
      *                       =  F - Fine elaborazione               *
               05 K-PROGRESSIVO           pic 9(03).
               05 K-RETCODE               pic x(01).
      *             se  =  E - elaborazione in Errore (non eseguita) *
      *             se  =  C - elaborazione Completata Correttamente *
      *             se  =  D - struttura Disattiva                   *
      *             se  =  N - elaborazione Non eseguita             *
           02  KAREA-D.
               05  KCODOPE                pic x(02).
               05  KLIVAUTO               pic x(01).
               05  KMATRICOLA             pic x(08).
      *
           02  KARAMETRI-IN.
      *------------------------------------DATA DI ELABORAZIONE
               05 KATA-ELABO-IN           PIC 9(08).
      *1---------------------------------------- Elabora tutte
      *2---------------------------------------- Elabora Da A
      *3---------------------------------------- Elabora Singola
               05 KIPO-ELABO-IN           PIC X(01).
      *------------------------------Tabella 1: Tipo prestazioni     *
               05  K1-ELEMENTO     occurs 8  times.
                  07  K1-PRESTAZIONE    pic X(2).
                  07  K1-OPZIONE        pic x(01).
               05 KERIODI-IN.
                  07 KLE-PERIODI OCCURS 6.
                     09 KNNO-DAL-IN-LK    PIC  9(4).
                     09 KUMERO-DAL-IN-LK  PIC  9(6).
                     09 KNNO-AL-IN-LK     PIC  9(4).
                     09 KUMERO-AL-IN-LK   PIC  9(6).
           02  KASUSST.
                  07 KLE-ASUSSST OCCURS 5.
                     09 KCODIND           PIC  X(4).
                     09 KANNIND           PIC  9(2).
                     09 KREGIND           PIC  9(2).
           02  FILLER                     PIC X(26744).
      *-
      *LINKAGE SECTION.
      *-
      *01  DFHCOMMAREA                PIC X(27000).
      *==============================================================*
       PROCEDURE  DIVISION
                            USING  COMMAREADS.
       MAIN.
      *
      *    DISPLAY '**** PDSIO13 **** '.
      *
           move spaces   to COMMAREADS-OUT.
      *
           MOVE   K-AREA       TO L-AREA.
           MOVE   KARAMETRI-IN TO PARAMETRI-IN.
           MOVE   KAREA-D      TO LAREA-D.
      *    display 'L-AREA       ' L-AREA.
      *    display 'PARAMETRI-IN ' PARAMETRI-IN.
      *    display ' LAREA-D     ' LAREA-D.
      *
           MOVE   K-PROCEDURA  TO OUT-PROCEDURA.
      *
           perform  I00-INIZIALI      thru  I00-EX.
      *                                                              *
           perform  C00-CENTRALI      thru  C00-EX.
      *                                                              *
           perform  F00-FINALI        thru  F00-EX.
      *                                                              *
           MOVE   COMMAREADS-OUT      TO COMMAREADS.
      *                                                              *
       MAIN-EX.
           GOBACK.
      *                                                              *
       B20-PERSTART.
           MOVE  'B20-PERSTART' TO  WABNDB-LABEL.
           move  'N'                  to  W-ERRORE.
           move  zeros                to  FST-LFDATCO2.
      *--------------------------------- Chiave record iniziale      *
      *    move  'L'             to  H-DCOULESSP
           move  L-CODICE-STOP   to  H-DCOCENOPE
           move  zeros           to  H-DCOANVEPR
                                     H-DCONDVEPR
                                     WIC-DOMANDA.
           move  W-DOMANDA-DAL   to  WIC-DOMANDA.
           subtract  1          from WIC-DOMANDA.
           move  WIC-ANNO        to  H-DCOANVEPR .
           move  WIC-NUMERO      to  H-DCONDVEPR .
      *
      * modifica per trattare tutte le domanda con anno<>aano1
      *
           if  TIPO-ELABO-IN   =  1
           then
               move  1           to NUMERO-DAL-IN1
           end-if.
      *--------------------------------  File dati comuni (LFDATCO2) *
           PERFORM B20-DB2-DECL-CURS     THRU  B20-DB2-DECL-CURS-EX.
      *
           PERFORM  B20-DB2-FETCH    THRU  B20-DB2-FETCH-EX.
           IF  SQLCODE =    0
               move  'S'              to   WL-DATICOMUNI
               move  H-DCOANVEPR  to   WIC-ANNO
               move  H-DCONDVEPR  to   WIC-NUMERO
               add  1  to   CTR-LET-DATCO
           ELSE
               PERFORM DATICOMUNI-DB2-CLSCUR THRU
                       DATICOMUNI-DB2-CLSCUR-EX
               move  'N'              to   WL-DATICOMUNI
               move  '96'             to  OUT-STATUS
               perform  T18-TESTO18   thru  T18-EX
               perform  W10-MSGERRORE thru  W10-EX
           END-IF.
       B20-EX.
           exit.
      *
       C00-CENTRALI.
           if  W-ERRORE  =  'N'
           then
               continue
           else
               go  to  C00-EX
           end-if.
      *
           if  TIPO-ELABO-IN  <  3
           then
               perform  B20-PERSTART     thru  B20-EX
               if  FST-LFDATCO2  =  0
               then
                   move  'N'    to  W-FINE-INTERVALLO
                   perform  E00-ELABORA       thru  E00-EX
                     until  W-FINE-INTERVALLO  =  'S'
               end-if
           end-if.
      *
           move  'S'   to  W-FINE-ELABORA.
           perform  E60-SINCRONIZZO  thru  E60-EX.
      *
       C00-EX.
           exit.
      *
       E00-ELABORA.
      *
           if  WL-DATICOMUNI  =  'S'
           then
               perform  E20-ELABORA20  thru  E20-EX
           end-if.
      *
           if  W-NIK  =  'S'
           then
               if  W-CHK-CAMPI  = spaces
               then
                   continue
               else
                   perform  S20-ELENCA       thru  S20-EX
               end-if
            end-if.
      *-------------------------------------Sincronizzo ogni record
           if  WL-DATICOMUNI  =  'S'
           then
      *        if  WS-APPOGGIO  =  'S'
      *        then
                   perform  E60-SINCRONIZZO  thru  E60-EX
      *        end-if
               if  W-FINE-INTERVALLO  =  'S'
               then
                   go  to  E00-EX
               end-if
           end-if.
           perform  E15-INIZIALIZZO  thru  E15-EX .
300320*------------------- Limitazione numero pagamenti effettivi  ---*
           if  L-TIPOCALCOLO   =  'R'
           then
               if  CTR-PAGATE  >  5999
               then
                   perform  DATICOMUNI-DB2-CLSCUR
                      thru  DATICOMUNI-DB2-CLSCUR-EX
                   move  'N'         to  WL-DATICOMUNI
                   move  'S'         to  W-FINE-INTERVALLO
                   perform  E60-SINCRONIZZO  thru  E60-EX
                   go to  E00-EX
               end-if
300320     end-if.
      *
           PERFORM  B20-DB2-FETCH    THRU  B20-DB2-FETCH-EX.
           IF SQLCODE = 0
               move  'S'         to  WL-DATICOMUNI
               move  H-DCOANVEPR to  WIC-ANNO
               move  H-DCONDVEPR to  WIC-NUMERO
               add  1            to  CTR-LET-DATCO
                                     CTR-VIDEO
           ELSE
               PERFORM DATICOMUNI-DB2-CLSCUR
                  THRU DATICOMUNI-DB2-CLSCUR-EX
               move  'N'         to  WL-DATICOMUNI
               move  'S'         to  W-FINE-INTERVALLO
               perform  E60-SINCRONIZZO  thru  E60-EX
           END-IF.
       E00-EX.
           exit.
      *
       E15-INIZIALIZZO.
           initialize    DSPFM13B-O.
           initialize    IC-AREA
                         OC-AREA.
           initialize    W-ANAGRAFICI
                         W-FST-SIINI
                         W-INIZIALIZZA
                         W-CONVERSIONI
                         W-STAMPAD.
           initialize    DCLTDSDATCO
                         DCLTDSRECUP
                         DCLTDSPEERE
                         DCLTDSAPIO0
                         DCLTDSDATAN
                         DCLTDSDELSI
                         DCLTDSMODAN
                         DCLTDSSOSPE
                         DCLTDSASU
                         DCLTDSASU2
                         DCLTDSLIST
                         DCLTDSLAV
                         DCLTDSPAG
                         DCLTDSATTSU
                         DCLTDSLAVPU
                         DCLTDSSUSST
                         DCLTDSPERIO.
      *
           move  'Y'     to  W-XCALCOLO.
           move  'N'     to  WL-RECUPERI
                             WL-FILE40
                             WL-FILE42
                             WL-FILE51
                             WL-FILE52
                             WL-FILE53
      *                      WL-FILE65
                             WL-SITUAZIODO.
           move  'N'     to  WS-APPOGGIO.
           move  spaces  to  W-CHK-CAMPI.
       E15-EX.
           exit.

       E20-ELABORA20.
      *--------- RIVEDERE
      *    Inserisci gestione domande definite con soli ANF
      *    da pagare: codice 'K' ??!
      *------------------------------------------ Compresa ?
           if  WIC-DOMANDA    <  W-DOMANDA-DAL
           then
      *-anno<>anno1 --------------------------------------
             if  TIPO-ELABO-IN   =  1            and
                 H-DCOANVEPR = ANNO-DAL-IN-LK(1)
                 go  to  E20-EX
             end-if
           end-if.
      *    if  WIC-DOMANDA    <  W-DOMANDA-DAL
      *    then
      *        go  to  E20-EX
      *    end-if
      *------------------------------------------ Codice struttura
           if H-DCOCENOPE                   is  numeric
           then
               continue
           else
               move
                   'valore di DCOCENOPE/ADSDATCO non numerico.        '
                          to  W-CHK-CAMPI
               go  to  E20-EX
           end-if.
           if H-DCOCENOPE                   =  L-CODICE-STOP
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Stato disoccupazione
      *    if H-DCOPESTDI                   =  'S'
      *    then                  *
      *        continue          * Controllo sospeso per poter segnalar
      *    else                  * in simulazione tale situazione
      *        go  to  E20-EX    *
      *    end-if.
      *------------------------------------------ Esito II prestazione
           if H-DCOULESSP                   =  'A'   or
              H-DCOULESSP                   =  'L'
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Tipo prestazione
           if H-DCOCOTIDO                   =  spaces
           then
               move
                   'valore di DCOCOTIDO/ADSDATCO non presente.        '
                          to  W-CHK-CAMPI
               go  to  E20-EX
           end-if.
           if H-DCOCOTIDO                   =  'B '
                                        or  =  'D '
                                        or  =  'E '
           then
               continue
           else
               go  to  E20-EX
           end-if.
      *------------------------------------------ Selezione preliminare
           move  'N'         to  W-SCELTA.
           perform  varying  NDC1  from 1  by 1
             until NDC1         >  8        or
                   T1-PRESTAZIONE(NDC1)  =  spaces
               if H-DCOCOTIDO                   =  T1-PRESTAZIONE(NDC1)
               then
                   move  11   to  NDC1
                   move  'S'  to  W-SCELTA
               end-if
           end-perform.
      *
           add   1    to  CTR-ELA-DATCO.
      *    if  W-SALTA   =  'S'   or
           if  W-SCELTA  =  'N'
           then
               go  to  E20-EX
           end-if.
      *------------------------------------------ Lettura archivi    * 00  -
           move  'N'    to  W-ERRORE.
           perform  L10-LETTURA     thru  L10-EX.
           if  W-ERRORE  =  'S'   or
      *---rivedere: cambia/integra con W-SALTA?
               W-SCELTA  =  'N'
           then
               go  to  E20-EX
           end-if.
      *
           add   1    to  CTR-ELA-DATAN.
      *------------------------------------------ Selezione finale   *
           move  'N'         to  W-SCELTA.
           perform  varying  NDC1  from 1  by 1
             until NDC1         >  8        or
                   T1-PRESTAZIONE(NDC1)  =  spaces
               if H-DCOCOTIDO                   =  T1-PRESTAZIONE(NDC1)
                   and   W-OPZIONE              =  T1-OPZIONE(NDC1)
               then
                  move  11   to  NDC1
                  move  'S'  to  W-SCELTA
                  if H-DCOCOTIDO = 'E' AND W-OPZIONE = 'N'
                  then
                     perform varying  NDC11 from 1  by 1
191115                  until NDC11 > 1
191115*                 until NDC11 > 5
                           or KCODIND(NDC11)     = spaces
191115*                    or KLE-ASUSSST(NDC11) = '99999999'
                       if  KCODIND(NDC11) = H-SSTCODIND  and
                           KANNIND(NDC11) = H-SSTANNIND and
                           KREGIND(NDC11) = H-SSTREGIND
                       then
                           move   8   to  NDC11
                           move  'S'  to  W-SCELTA
                       else
      * correzione per gestione tutti i sussidi
      *                    move   8   to  NDC11
                           move  'N'  to  W-SCELTA
                       end-if
                     end-perform
                  end-if
               end-if
           end-perform.
      *    if  W-SALTA   =  'S'   or
           if  W-SCELTA  =  'N'
           then
               go  to  E20-EX
           end-if.
      *--------------------------------------- Verifica Blocco pagamento
           move  H-DCOCODFIS                  to  LK-CODFIS.
           move  'N'                          to  LK-RISP.
241215     if   H-DCOCOTIDO = 'E'    and
241215         (H-SSTCODIND = 'TYGM' or
241215                      = 'DL76' or
241215                      = 'TIPO' or
241215                      = 'TYAD' or
030316                      = 'SSEP' or
111217                      = 'TYRG' or
111217                      = 'TYBL' or
111217                      = 'TYCR' or
111217                      = 'APAF' or
111217                      = 'APAR' or
310719                      = 'BRIO' or
300320                      = 'EELA' or
                            = 'EE27' or
                            = 'EE28' or
                            = 'EE29' or
                            = 'EE30' or
300320                      = 'EE38' or
040620                      = 'EE2A' or
                            = 'EE2B' or
                            = 'EE2C' or
                            = 'EE2D' or
                            = 'EE05' or
040620                      = 'EE10' or
230920                      = 'EE13' or
                            = 'EE22' or
                            = 'EEZR' or
230920                      = 'EEMA' or
251120                      = 'EJ29' or
251120                      = 'EJ38' or
251120                      = 'EJ2A' or
251120                      = 'EJ2B' or
251120                      = 'EJ2C' or
251120                      = 'EJ2D' or
251120                      = 'EJ05' or
251120                      = 'EJ10' or
251120                      = 'EJ13' or
091220                      = 'EK29' or
091220                      = 'EK38' or
091220                      = 'EK2A' or
091220                      = 'EK2B' or
091220                      = 'EK2C' or
091220                      = 'EK2D' or
091220                      = 'EK05' or
091220                      = 'EK10' or
091220                      = 'EK13' or
260321                      = 'EW29' or
260321                      = 'EW38' or
260321                      = 'EW2A' or
260321                      = 'EW2B' or
260321                      = 'EW2C' or
260321                      = 'EW2D' or
260321                      = 'EW05' or
260321                      = 'EW10' or
260321                      = 'EW13' or
260321                      = 'EY29' or
260321                      = 'EY38' or
260321                      = 'EY2A' or
260321                      = 'EY2B' or
260321                      = 'EY2C' or
260321                      = 'EY2D' or
260321                      = 'EY05' or
260321                      = 'EY10' or
260321                      = 'EY13' or
260321                      = 'EY3A' or
220621                      = 'EX29' or
220621                      = 'EX38' or
220621                      = 'EX2A' or
220621                      = 'EX2B' or
220621                      = 'EX2C' or
220621                      = 'EX2D' or
220621                      = 'EX05' or
220621                      = 'EX10' or
220621                      = 'EX13' or
220621                      = 'EX3A' or
220621                      = 'EX87' or
220621                      = 'EX88' or
211021                      = 'EX89' or
130422                      = 'E092' or
080722                      = 'E109' or
080722                      = 'E110' or
080722                      = 'E112' or
231122                      = 'E107' or
130123                      = 'E159' or
130123                      = 'E160' or
130123                      = 'E162' or
130123                      = 'E157' or
140223                      = 'TGOL' or
251023                      = 'POR3' or
251023                      = 'POR4' or
251023                      = 'POR5' or
251023                      = 'POR6' or
271123                      = 'DLI2' or
060524                      = 'TISC' or
210624                      = 'TISM' or
240624                      = 'TGOC' or
130325                      = 'TGOV' or
300725                      = 'TGOS' or
241025                      = 'TGOP' or
140325                      = 'TYGP' or
150426                      = 'TIRA' or
150426                      = 'PIAC')
241215     then
241215         continue
241215     else
               CALL  RDSUT28  USING
                     WDFHEIBLK  WDFHCOMMAREA
                     PER-RDSUT28
               cancel  RDSUT28
               if  LK-RISP =  'S'
               then
                   move 'Pagamenti Bloccati per il Codice Fiscale'
                         to  W-CHK-CAMPI
                   go  to  E20-EX
               end-if
241215     end-if.
      *------------------------------------------ Anagrafica         *
           move  'N'    to  W-ERRORE.
           perform  E31-ANAGRAFICA   thru  E31-EX.
           if  W-ERRORE  =  'S'
           then
               perform  S20-ELENCA       thru  S20-EX
               go  to  E20-EX
           end-if.
      *------------------------------------------ Calcolo            *
           perform  E24-CALCOLO      thru  E24-EX.
      *
           if  OC-RETCODE  =  00   or
               OC-RETCODE  =  01
      *----------rivedere per valore = 01
           then
      *-------------2---------------------------- Verifica            *
               perform  J10-QUADRATURA     thru  J10-EX
               if  W-ERRORE  =  'S'
               then
                   if  W-NIK  =  'S'
                   then
                       perform  S20-ELENCA       thru  S20-EX
                       go  to  E20-EX
                   else
                       go  to  E20-EX
                   end-if
               end-if
               move   'C'    to  L-RETCODE
               perform  E30-AGGIORNA     thru  E30-EX
           else
               if  W-NIK  =  'S'
               then
                   perform  S20-ELENCA       thru  S20-EX
               end-if
           end-if.
       E20-EX.
           EXIT.
      *
       L10-LETTURA.
      *---- Non inserire uscite per le selezioni effettuate da       *
      *     operatore all'interno del paragrafo;                     *
      *     eccezione: W-PAGARE, preimpostare 'T' in I39             *
      *---------------------------------------- Codici prestazione   *
           move  zeroes   to  W-CODICEUNO
                              W-CODICEDUE.
           if H-DCOCOTIDO                   =  spaces
           then
               move
                   'valore di DCOCOTIDO/ADSDATCO non presente.        '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L10-EX
           end-if.
           evaluate H-DCOCOTIDO
             when  'B '      move   42     to  W-CODICEDUE
             when  'D '      move   44     to  W-CODICEDUE
             when  'E '      move   45     to  W-CODICEDUE
             when  other
                         move  'S'  to  W-ERRORE
                         go  to  L10-EX
           end-evaluate.
      *---------------------------------------- Dati comuni
           perform  L11-DATICOMUNI     thru  L11-EX.
110324     if  W-ERRORE  =  'S'
110324     then
110324         go  to  L10-EX
110324     end-if.
      *---------------------------------------- Pagamenti
      *    perform  L13-PAGAMENTI      thru  L13-EX.
      *---------------------------------------- Recuperi
           perform  L16-RECUPERI       thru  L16-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Situazione domanda   *
           perform  L19-SITUAZIODO     thru  L19-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Dati anagrafici
           perform  L22-ANAGRAFICI     thru  L22-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Deleghe sindacali
           perform  L25-DELEGHE        thru  L25-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  L10-EX
           end-if.
      *---------------------------------------- Dati A.N.F.
      *I------------------------------- new dal 23/07/2013           *
           initialize  LC-TAB-ANF.
      *F------------------------------- new dal 23/07/2013           *
      *    if H-DCOANFRIC                    =  'S'
      *    then
               perform  L28-DATIANF    thru  L28-EX.
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if.
      *    end-if.                                                   *
      *------------------------non usata------- Dati comuni DS/Ord.  *
      *    perform  L31-DSCOMUNI       thru  L31-EX.                 *
      *---------------------------------------- Dati Ord/Sanmarino   *
      *    perform  L34-ORDSANMARINO    thru  L34-EX                 *
      *--------------------------------- Rimpatriati Frontalieri Stag*
      *    perform  L37-RIMPATRIATI     thru  L37-EX                 *
      *--------------------------------- Regime Internazionale - CEE *
      *    perform  L40-REGIMECEE       thru  L40-EX                 *
      *---------------------------------------- Edili                *
      *    perform  L43-EDILI           thru  L43-EX                 *
      *---------------------------------------- Marittimi            *
      *    perform  L46-MARITTIMI       thru  L46-EX                 *
      *--------------------------------- Periodi erogabili Teorici   *
      *    perform  L52-TEOEROGABI     thru  L52-EX.                 *
      *--------------------------------- Pensioni                    *
      *    perform  L55-PENSIONI   thru  L55-EX                      *
      *--------------------------------- Periodi erogati effettivi   *
      *    perform  L58-EFFEROGATI     thru  L58-EX.                 *
      *--------------------------------- Assegno ASU                 *
      *    if H-DCOCOTIDO                   =  'B '                  *
           if  W-CODICEDUE  =  42
               perform  L61-FILE51     thru  L61-EX
               if  W-ERRORE  =  'S'   or
                   W-SCELTA  =  'N'
               then
                   go  to  L10-EX
               end-if
               perform  L62-FILE40     thru  L62-EX
           end-if.
      *--------------------------------- Assegno LPU D.L. 280/97     *
      *    if H-DCOCOTIDO                   =  'D '
           if  W-CODICEDUE  =  44
               perform  L64-FILE52     thru  L64-EX
               if  W-ERRORE  =  'S'   or
                   W-SCELTA  =  'N'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *--------------------------------- Sussidio straordinario      *
      *    if H-DCOCOTIDO                   =  'E '
           if  W-CODICEDUE  =  45
               perform  L67-FILE53     thru  L67-EX
               if  W-ERRORE  =  'S'   or
                   W-SCELTA  =  'N'
               then
                   go  to  L10-EX
               end-if
               perform  L73-FILE65     thru  L73-EX
290725         if  W-ERRORE  =  'S'
290725         then
290725             go  to  L10-EX
290725         end-if
      *---------------------------------------- Sospensioni          *
               perform  L49-FILE66     thru  L49-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *--------------------------------- Periodi ASU                 *
      *    if H-DCOCOTIDO                   =  'B '   or   'D '
           if  W-CODICEDUE  =  42
                        or  =  44
               perform  L70-FILE64     thru  L70-EX
               if  W-ERRORE  =  'S'
               then
                   go  to  L10-EX
               end-if
           end-if.
      *--------------------------------- Per selezione definitiva    *
           move  spaces  to  W-OPZIONE.
      *    if H-DCOCOTIDO                   =  'B '
           if  W-CODICEDUE  =  42
               perform  L75-TIPOASU    thru  L75-EX
           end-if.
      *    if H-DCOCOTIDO                   =  'E '
           if  W-CODICEDUE  =  45
010720         move  'N'               to  W-SXCOVID19
               perform  L77-TIPOSST    thru  L77-EX
           end-if.
       L10-EX.
           EXIT.
      *
       L11-DATICOMUNI.
      *---------------------------------------- Codice DOMUS         *
           if H-DCOCHIDOM                     is  numeric
           then
               move H-DCOCHIDOM                   to  IC-DCOCHIDOM
           else
               move
                   'valore di DCOCHIDOM /ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Per Massimo?         *
           move  L-CODICE-SEDE                to   IC-CODSEDE.
           move  L-CODICE-STOP                to   IC-STRUTTURA.
      *---------------------------------------- Codice struttura     *
           move H-DCOCENOPE                   to   IC-DCOCENOPE.
      *---------------------------------------- Anno e Numero        *
      *    move H-DCOANVEPR                   to   IC-xxxxxxxx
      *    move H-DCONDVEPR                   to   IC-xxxxxxxx
      *    if H-DCOANVEPR                    is  numeric
      *    then
      *        move H-DCOANVEPR                    to  IC-DCO?????
      *    else
      *        move
      *            'valore di DCO????   /ADSDATCO non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
      *
           move  WIC-DOMANDA    to  IC-DOMANDA.
           if  TIPO-ELABO-IN  =  3
           then
               move  WB-DOMANDA    to  IC-DOMANDA
           end-if.
      *---------------------------------------- Codice domanda       *
           if H-DCOCOTIDO                    =  spaces
           then
               move
                   'valore di DCOCOTIDO /ADSDATCO non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
           move H-DCOCOTIDO                   to  IC-DCOCOTIDO.
      *---------------------------------------- Codice fiscale       *
           if H-DCOCODFIS                    =  spaces
           then
               move
                   'valore di DCOCODFIS /ADSDATCO non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
           move H-DCOCODFIS                   to  IC-DCOCODFIS.
      *---------------------------------------- Data domanda         *
      *    if H-DCODTPRDO                    is  not  numeric
      *    then
      *        move
      *            'valore di DCODTPRDO /ADSDATCO non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
      *    move H-DCODTPRDO                   to  IC-DCODTPRDO.
      *---------------------------------------- Pensionato?          *
      *    if H-DCOPENS                      =  spaces
      *    then
      *        move
      *            'valore di DCOPENS   /ADSDATCO non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
      *    move H-DCOPENS                     to  IC-DCOPENS.
      *---------------------------------------- Richiesta ANF        *
      *    if H-DCOANFRIC                    =  spaces
      *    then
      *        move
      *            'valore di DCOANFRIC /ADSDATCO non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L11-EX
      *    end-if.
      *    move H-DCOANFRIC                   to  IC-DCOANFRIC.
      *---------------------------------------- Data Richiesta ANF   *
      *    if H-DCOANFRIC                    =  'K'
      *    then
      *        if H-DCODTANFPD                   is  numeric
      *        then
      *            move H-DCODTANFPD                  to  IC-DCODTANFPD
      *        else
      *            move
      *            'valore di DCOANFRIC /ADSDATCO non presente.       '
      *                      to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            go  to  L11-EX
      *        end-if
      *    end-if.
      *-----------------------------X ASU è= Termine prestazione     *
           if H-DCODTADEC                    is  numeric
           then
               move H-DCODTADEC                   to  IC-DCODTADEC
           else
               move
                   'valore di DCODTADEC /ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Esito 2° prestazione *
           if  (H-DCOULESSP                =  spaces)   or
               (H-DCOULESSP                  is  alphabetic)
           then
               move H-DCOULESSP                   to  IC-DCOULESSP
           else
               move
                   'valore di DCOULESSP /ADSDATCO non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data  2°pr.          *
           if H-DCODTULSP                    is  numeric
           then
               move H-DCODTULSP                   to  IC-DCODTULSP
           else
               move
                   'valore di DCODTULSP /ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data decorrenza SP   *
           if H-DCODTDECSP                   is  not  numeric
           then
               move
                   'valore di DCODTDECSP/ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- W-DECORRENZA         *
           move  zeros        to  W-DECORRENZA.
           if H-DCODTDECSP                 >  zeros
           then
               move H-DCODTDECSP
                                  to  W-DECORRENZA
                                      IC-DCODTDECSP
           end-if.
      *
           if  W-DECORRENZA  equal  zeros
           then
               move
                   'valore di DECORRENZA/ a.s.u.  non presente.       '
                             to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  L11-EX
           end-if.
      *----------------------------------------  Patronato
           move H-DCOCODPAT                   to  IC-DCOCODPAT.
051115*---------------------------------------- Coordinate bancarie
     g*    if  H-DCOCOOBAN  = 'H0608501004000000021353'
     g*    then
     g*        move
     g*          'IBAN BLOCCATO SU RICHIESTA A.G'
     g*                      to  W-CHK-CAMPI
     g*        move  'S'  to  W-ERRORE
     g*        go  to  L11-EX
     g*    end-if.
051115*---------------------------------------- Coordinate bancarie
      *---------------------------------------- Coordinate bancarie
     g*    if H-DCOCOOBAN                   equal  spaces
     g*    then
     g*        continue
     g*        move  zeroes                       to  R09-RC
     g*    else
     g*        move H-DCOCOOBAN                   to  R09-COOBAN
     g*        move  9                            to  R09-RC
     g*        CALL  RDSUT09  USING
     g*              WDFHEIBLK  WDFHCOMMAREA
     g*              PER-RDSUT09
     g*        cancel  RDSUT09
     g*        if  R09-RC  =  zeros
     g*        then
     g*            move H-DCOCOOBAN    to  IC-DCOCOOBAN
     g*            move H-DCOIBAN      to  IC-DCOIBAN
     g*        end-if
     g*    end-if.
161115*-----------------new
           move  spaces    to  W-IBAN
                               W-COOBAN.
           move  spaces    to  P-PAESE
                               P-CIN-2
                               P-CCLIENTE-A.
           move  zeros     to  P-CIN-1
                               P-CODABI-A
                               P-CODCAB-A.
           if  H-DCOCOOBAN  =  spaces
           then
               continue
           else
               move  H-DCOIBAN     to  W-IBAN
               move  H-DCOCOOBAN   to  W-COOBAN
      *        move  'IT'          to  P-PAESE
      *        move  zeros         to  P-CIN-1
      *        move  H-DCOCOOBAN   to  P-BBAN
               if  W-COORDINATE  =  'IT33H0608501004000000021353'
               then
                   move
                  'IBAN bloccato su richiesta Autorità Giudiziaria.  '
                              to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
                   go  to  L11-EX
               end-if
               if  W-COORDINATE  =  'IT01T36000032000A9H00000037'  or
                   W-COORDINATE  =  'IT98T36000032000A9H00000037'
               then
                   move
                  'IBAN non utilizzabile per il pagamento prestazioni'
                              to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
                   go  to  L11-EX
               end-if
      *-
               move  spaces        to  V-OK-IBAN
                                       V-MSG-IBAN
               move  W-COORDINATE  to  V-IBAN
               call  PITIBAN2
                   using  V-OK-IBAN  V-IBAN  V-MSG-IBAN
               end-call
               cancel  PITIBAN2
      *-
               if  V-OK-IBAN        =  'OK'
               then
                   move H-DCOCOOBAN     to  IC-DCOCOOBAN
                   move H-DCOIBAN       to  IC-DCOIBAN
               else
                   move  V-MSG-IBAN     to  W-CHK-CAMPI
                   move  'S'            to  W-ERRORE
                   go  to  L11-EX
               end-if
161115     end-if.
      *------------------------------ Controllo SCUP x IBAN          *
260723*    inserito controllo SCUP (come Naspi)
           if  IC-DCOCOOBAN  not =  spaces
               perform  L11S-SCUP-X-IBAN  thru  L11S-EX
               if  W-ERRORE  =  'S'
                 then  go  to  L11-EX
               end-if
           end-if.
      *---------------------------------------- Data  compl. domanda *
           if H-DCODTCODO                    is  numeric
           then
               move H-DCODTCODO                   to  IC-DCODTCODO
           else
               move
                  'valore di DCODTCODO /ADSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
      *---------------------------------------- Data valuta
      *    move H-DCODTVIR                    to  IC-DCODTVIR.
      *----------------------------------------  Stato disoccupazione
           move H-DCOPESTDI                   to  IC-DCOPESTDI.
250116*----------------------------------------  Modalità arrivo     -
           move  zeros  to  W-DCOMODARR.
           move H-DCOMODARR                   to  W-DCOMODARR.
040620*---------------------------------------- DcoFlasu   flag?     *
151220*---ridefinizione messaggi                                     *
           if H-DCOFLASU                     is  numeric
           then
               continue
           else
               move
                  'valore di DCOFLASU  /TDSDATCO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L11-EX
           end-if.
           if  H-DCOFLASU   not  equal  zeroes
010721*    and H-DCOFLASU   not  equal  9
           then
               evaluate H-DCOFLASU
                 when   01   move
                  'Doppio pagameno per giugno da verificare          '
                             to  W-CHK-CAMPI
                 when   02   move
                  'Domanda bloccata per rinuncia del richiedente.    '
                             to  W-CHK-CAMPI
                 when   03   move
                  'Domanda sospesa dalla Direzione centrale Antifrode'
                             to  W-CHK-CAMPI
                 when   04   move
                  'Domanda sospesa per riaccredito prestazione.      '
                             to  W-CHK-CAMPI
                 when   05   move
                  'Domanda bloccata per problemi IBAN                '
                             to  W-CHK-CAMPI
                 when   06   move
                  'Domanda bloccata per errato controllo RDC.        '
                             to  W-CHK-CAMPI
                 when   07   move
                  'Domanda con mensilità di giugno indebita.         '
                             to  W-CHK-CAMPI
                 when   08   move
                  'Domanda sospesa per riaccredito prestazione.      '
                             to  W-CHK-CAMPI
010721           when   09   move
010721            'Domanda bloccata per presenza domanda REM         '
010721                       to  W-CHK-CAMPI
               when  other   move
                  'valore di DCOFLASU  /TDSDATCO non previsto.       '
                             to  W-CHK-CAMPI
               end-evaluate
               move  'S'     to  W-ERRORE
               go  to  L11-EX
151220
040620     end-if.
      *---------------------------------------- Data  compl. domanda *
      *-GGA TOLT UPDATE---------- Valida sempre o per lista controllo?
       L11-EX.
           EXIT.
      *------------------------------ Controllo SCUP x IBAN          *
260723 L11S-SCUP-X-IBAN.
      *****                           BLC2-IBAN = pic x(40)          *
           initialize  BLC2-INPUT
                       BLC2-INPUT2
                       BLC2-OUTPUT.

           STRING IC-DCOIBAN IC-DCOCOOBAN DELIMITED BY SIZE
                               INTO  BLC2-IBAN.
           move  'AG500'         to  BLC2-TIPO.
           move  'S'             to  BLC2-CRITERIO.
           move  'S'             to  BLC2-WRITE.

           call  PNBTBLC2
                   using  PNLKBLC2
           end-call.

           if BLC2-IBAN-STATO  not =  'NF'
             move 'Coordinate IBAN non utilizzabili: verifica in SCUP'
                           to  W-CHK-CAMPI
             move  'S'  to  W-ERRORE
           end-if.

        L11S-EX.
            EXIT.
      *
       L16-RECUPERI.
      *    move  'N'     to  WL-RECUPERI.
      *
           move  H-DCOCHIDOM to H-RECCHIDOM .
           move  zeros       to H-RECPROREC .
      *
           PERFORM  L16-DB2-DECL-CURS    THRU  L16-DB2-DECL-CURS-EX.
           move  zeros  to  NDC2
           perform  varying  NDC1  from  1  by  1
                          until  NDC1  >  99
      *
           PERFORM  L16-DB2-FETCH    THRU  L16-DB2-FETCH-EX
           IF  SQLCODE = 0
               move  'S'  to  WL-RECUPERI
               perform  L17-CHKFLD-RECUPERI  thru  L17-EX
               if  W-ERRORE  =  'N'
               then
                   perform L18-SOMMA-RECUPERI thru L18-EX
               else
                   PERFORM RECUPERI-DB2-CLSCUR THRU
                           RECUPERI-DB2-CLSCUR-EX
                   move  111    to  NDC1
               end-if
           ELSE
               PERFORM RECUPERI-DB2-CLSCUR THRU
                       RECUPERI-DB2-CLSCUR-EX
               move  111    to  NDC1
           END-IF
      *
           end-perform.
      *-GGA TOLT UPDATE---------- Valida sempre o per lista controllo?
       L16-EX.
           EXIT.
      *
       L17-CHKFLD-RECUPERI.
      *-------------------------------->  Totale recupero da effettua*
           if  H-RECTOREEE                  is  not  numeric
           then
               move
                   'valore di RECTOREEE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Totale recupero residuo    *
           if  H-RECTORERE                  is  not  numeric
           then
               move
                   'valore di RECTORERE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
           if  H-RECTORERE                 =  zeroes
           then
               go  to  L17-EX
           end-if.
           if H-RECTORERE                  >  H-RECTOREEE
           then
               move
                   'Errore nei recuperi: segnalare alla S.R. Puglia.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *----------------------------------elimino decimillesimi       *
151013*    move  zeroes       to  WRK-RECTOREEE
151013*                           WRK-RECTORERE.
151013*    move H-RECTOREEE   to  WRK-RECTOREEE.
151013*    move H-RECTORERE   to  WRK-RECTORERE.
151013*    move  zeroes       to  H-RECTOREEE
151013*                           H-RECTORERE.
151013*    move WRK-RECTOREEE to  H-RECTOREEE.
151013*    move WRK-RECTORERE to  H-RECTORERE.
      *-------------------------------->  Conto (parte alfabetica)   *
           if  H-RECCOREAL                  =  spaces
           then
               move
                   'valore di RECCOREAL /ADSRECUP non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Conto (parte numerica)     *
           if  H-RECCORENU                  is  not  numeric
           then
               move
                   'valore di RECCORENU /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Controllo validità conto   *
           move  spaces                      to  W-CONTOALFA.
           move  zeroes                      to  W-CONTONUME.
           initialize  PER-RDSCONT.
           move H-RECCOREAL                  to  W-CONTOALFA.
           move H-RECCORENU                  to  W-CONTONUME.
      *
           move  W-CONTOREC  to  Q-CONTO.
           call  RDSCONT USING
                    WDFHEIBLK  WDFHCOMMAREA
                    PER-RDSCONT
           end-call.
           cancel  RDSCONT .
      *
           if  Q-RETCODE  =  00
           then
               continue
           else
               if  Q-RETCODE  =  99
               then
                   move  Q-MSG  to  W-CHK-CAMPI
               else
                   move
                   'Valore di Conto Recupero non previsto o errato.   '
                                to  W-CHK-CAMPI
               end-if
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Importo rata               *
      *    if  H-RECIMPRAE                  is  not  numeric
      *    then
      *        move
      *            'valore di RECIMPRAE /ADSRECUP non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  NDC1
      *        go  to  L17-EX
      *    end-if.
      *-------------------------------->  Causale recupero           *
           if  H-RECCAUREC                  =  spaces
           then
               move
                   'valore di RECCAUREC /ADSRECUP non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Tipo    recupero           *
           if  H-RECTIPREC                  =  spaces
           then
               move
                   'valore di RECTIPREC /ADSRECUP non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
270114*-------------------------------->  memorizzo x pag. a terzi   *
           if  H-RECCAUREC  =  '1'  and
               W-CONTOREC   =  'GPA10099'
           then
               move  H-RECTORERE  to  W-IMP-GPA10099
270114     end-if.
      *-------------------------------->  Importo ultimo recupero    *
           if  H-RECIMUREE                  is  not  numeric
           then
               move
                   'valore di RECIMUREE /ADSRECUP non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
      *-------------------------------->  Numero rate                *
      *    if  H-RECNUMRAT                  is  not  numeric
      *    then
      *        move
      *            'valore di RECNUMRAT /ADSRECUP non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  NDC1
      *        go  to  L17-EX
      *    end-if.
      *-------------------------------->  Tassazione Si / No         *
           if  H-RECCAUREC                  =  '2'
           then
               go  to  L17-EX
           end-if.
           if  H-RECIIRPEF                  =  spaces
           then
               move
                   'valore di RECIIRPEF /ADSRECUP non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L17-EX
           end-if.
       L17-EX.
           EXIT.
      *
       L18-SOMMA-RECUPERI.
           evaluate  H-RECCAUREC
      *----------------------------------------- Prestazione (RECupero  )
             when  '1'
               if  H-RECTORERE                >  zeros
               then
                   if  H-RECIIRPEF                =  'N'
                   then
                       add H-RECTOREEE      to  IC-RECTOREEE-1
                       add H-RECTORERE      to  IC-RECTORERE-1
      *                move H-RECCOREAL     to  IC-RECCOREAL-1
      *                move H-RECCORENU     to  IC-RECCORENU-1
                       add H-RECIMUREE      to  IC-RECIMUREE-1
                   end-if
      *----------------------------------------- Prestazione (acconto)
                   if  H-RECIIRPEF                =  'S'
                   then
                       add H-RECTOREEE     to  IC-RECTOREEE-3
                       add H-RECTORERE     to  IC-RECTORERE-3
      *                move H-RECCOREA     to  IC-RECCOREAL-3
      *                move H-RECCOREN     to  IC-RECCORENU-3
                       add H-RECIMUREE     to  IC-RECIMUREE-3
                   end-if
               end-if
      **       *--------------------- Anf (H-RECup/acconto)
             when  '2'
               if  H-RECTORERE                >  zeros
               then
                   add H-RECTOREEE      to  IC-RECTOREEE-2
                   add H-RECTORERE      to  IC-RECTORERE-2
      *            move H-RECCOREA      to  IC-RECCOREAL-2
      *            move H-RECCOREN      to  IC-RECCORENU-2
                   add H-RECIMUREE      to  IC-RECIMUREE-2
               end-if
             when  other
               move  111    to  NDC1
               move  'S'    to  W-ERRORE
           end-evaluate.
       L18-EX.
           EXIT.
      *
       L19-SITUAZIODO.
      *    move  'N'     to  WL-SITUAZIODO.
      *
           MOVE  'L19-SITUAZIODO' TO  WABNDB-LABEL.
      *
           move  H-DCOCHIDOM to  H-STDCHIDOM  .
           PERFORM   L19-DB2-SELECT    THRU  L19-DB2-SELECT-EX.
           IF  SQLCODE = 0
               move  'S'    to  WL-SITUAZIODO
           ELSE
               move
                   'errore in lettura di ADSSITDO.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'    to  W-ERRORE
               go  to  L19-EX
           END-IF.
      *-------------------------------->  Codice prima   prestazione *
      *    if H-STDCOTIPRU                   =  zeros
      *                                  or  =  xx   or  xx  or  xx
      *    then
      *        move  STDCOTIPRU                    to  IC-STDCOTIPRU
      *    else
      *        move
      *            'valore di STDCOTIPRU/ADSSITDO non valido.         '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L19-EX
      *    end-if.
      *    if H-STDCOTIPRU                   =  W-CODICEUNO
      *    then
      *        continue
      *    else
      *        move
      *            'valore di STDCOTIPRU/ADSSITDO non del tipo domanda'
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L19-EX
      *    end-if.
      *-------------------------------->  Codice seconda prestazione *
           if H-STDCOTIPRD                   =  zeros
                                         or  =  42   or  43
                                         or  =  44   or  45
           then
               continue
      *        move  STDCOTIPRD                    to  IC-STDCOTIPRD
           else
               move
                   'valore di STDCOTIPRD/ADSSITDO non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L19-EX
           end-if.
           if H-STDCOTIPRD                   =  W-CODICEDUE
           then
               continue
           else
               move
                   'valore di STDCOTIPRD/ADSSITDO non del tipo domanda'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L19-EX
           end-if.
      *-------------------------------->  Data movim. II prestazione *
      *    if H-STDDTMOPRD                   is  numeric
      *    then
      *        move  STDDTMOPRD                    to  IC-STDDTMOPRD
      *    else
      *        move
      *            'valore di STDDTMOPRD/ADSSITDO non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L19-EX
      *    end-if.
      *-------------------------------->  Esito       II prestazione *
      *    if H-STDESITPRD                   not  equal  spaces
      *    then
      *        move  STDESITPRD                    to  IC-STDESITPRD
      *    else
      *        move
      *            'valore di STDESITPRD/ADSSITDO non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L19-EX
      *    end-if.
           if H-STDESITPRD    equal  'A'   or
              H-STDESITPRD    equal  'L'
           then
               continue
           else
               move
                   'valore di STD-ESITO /ADSSITDO non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L19-EX
           end-if.
      *-TOLTA  UPDATE------------ Valida sempre o per lista controllo?
       L19-EX.
           EXIT.
      *
       L22-ANAGRAFICI.
      *
           move  H-DCOCODFIS to H-DANCODFIS .
           PERFORM L22-DB2-SELECT THRU L22-DB2-SELECT-EX
            IF  SQLCODE not = 0
               move
                   'errore in lettura di ADSDATAN.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
      *
      *------------------------------------- key anagr. vecchia proc.*
      *gg  if H-DANCHANVP                     is  numeric
      *    then
               move H-DANCHANVP                     to  IC-DANCHANVP
      *    else
      *        move
      *            'valore di DANCHANVP /ADSDATAN non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L22-EX
      *    end-if.
      *------------------------------------- Codice comune residenza *
           if H-DANCCORE                     is  numeric
           then
               if H-DANCCORE                     >   zeros
               then
                   move H-DANCCORE               to  IC-DANCCORE
               else
                   move
                   'valore di DANCCORE  /ADSDATAN non presente.       '
                                 to  W-CHK-CAMPI
                   move  'S'     to  W-ERRORE
                   go  to  L22-EX
               end-if
           else
               move
               'valore di DANCCORE  /ADSDATAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
      *-------------------Xmappa ----------- Comune residenza        *
           if H-DANCOCORE                    =  spaces
           then
               move
                   'valore di DANCOCORE /ADSDATAN non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
           move  H-DANCOCORE                     to  WIC-DANCOCORE.
      *------------------------------------- Provincia residenza
           if H-DANSIPRRE                    =  spaces
           then
               move
                   'valore di DANSIPRRE /ADSDATAN non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
           move  H-DANSIPRRE                     to  WIC-DANSIPRRE.
      *------------------------------------- Indirizzo residenza
           if H-DANIND                       =  spaces
           then
               move
                   'valore di DANIND    /ADSDATAN non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
           move  H-DANIND                        to  WIC-DANIND.
      *------------------------------------- C.A.P.
           if H-DANCAP                       is  numeric   and
               H-DANCAP                        >   zeroes
           then
               move  H-DANCAP                    to  WIC-DANCAP
           else
               move
                   'valore di DANCAP    /ADSDATAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L22-EX
           end-if.
       L22-EX.
           EXIT.
      *
       L25-DELEGHE.
      *    move  zeros       to  W-FINESINDACATO
      *                          I-DEL.
           move  H-DCOCHIDOM to H-DSICHIDOM .
      *    move  zeros       to H-DSIDTINIS .
           PERFORM  L25-DB2-DECL-CURS    THRU  L25-DB2-DECL-CURS-EX.
           perform  varying  NDC1  from  1  by  1
                         until  NDC1  >  99
      *
           PERFORM  L25-DB2-FETCH    THRU  L25-DB2-FETCH-EX
           IF SQLCODE = 0
              perform  L26-CHKFLD-DELEGHE   thru  L26-EX
              if  W-ERRORE   =  'N'
              then
                  perform  L27-CARICA-DELEGHE   thru  L27-EX
              else
                  perform DELEGHE-DB2-CLSCUR
                     THRU DELEGHE-DB2-CLSCUR-EX
                  move  111   to  NDC1
      *           move  'S'   to  W-ERRORE
              end-if
           ELSE
                  PERFORM DELEGHE-DB2-CLSCUR
                     THRU DELEGHE-DB2-CLSCUR-EX
                  move  111    to  NDC1
           END-IF
           end-perform.
      *
       L25-EX.
           EXIT.
      *
       L26-CHKFLD-DELEGHE.
      *------------------------------------- Data fine   delega      *
           if H-DSIDTFIIS                 is  not  numeric
           then
               move
                   'valore di DSIDTFIIS /ADSDELSI non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L26-EX
           end-if.
      *------------------------------------- Codice sindacato        *
           if H-DSICODSIN                 =  spaces
           then
               move
                   'valore di DSICODSIN /ADSDELSI non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L26-EX
           end-if.
      *------------------------------------- Categoria sindacato     *
           if H-DSICATSIN                 =  spaces
           then
               move
                   'valore di DSICATSIN /ADSDELSI non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L26-EX
           end-if.
       L26-EX.
           EXIT.
      *
       L27-CARICA-DELEGHE.
      *------------------------------------- Verifica convenzione    *
           initialize  PER-RDSUT27.
           move  spaces      to  LK-RETCODE.
           move H-DSICODSIN                  to  LK-CODSIN.
           move H-DSICATSIN                  to  LK-CATSIN.
           call   RDSUT27 USING
                      WDFHEIBLK  WDFHCOMMAREA
                      PER-RDSUT27
           end-call.
           cancel   RDSUT27 .
           if  LK-RETCODE  =  'OK'
           then
               continue
           else
               go  to  L27-EX
           end-if.
      *
           if H-DSIDTFIIS =  zeros
           then
               if  (H-DSICATSIN  =  '00')   or
                   (H-DSICODSIN  =  '00')
               then
                   continue
               else
                   move H-DSICODSIN     to  IC-DSICODSIN
                   move H-DSICATSIN     to  IC-DSICATSIN
                   perform DELEGHE-DB2-CLSCUR
                      THRU DELEGHE-DB2-CLSCUR-EX
                   move  111   to  NDC1
               end-if
           end-if.
      *    if H-DSIDTFIIS >  zeros
      *    then
      *        move  DSIDTFIIS                 to  W-FINESINDACATO
      *    else
      *        move  29991231                  to  W-FINESINDACATO
      *    end-if.
      *    if  W-FINESINDACATO   >   W-DECORRENZA
      *    then
      *        if  I-DEL  <  10
      *        then
      *            add  1  to  I-DEL
      *            move  DSIDTINIS
      *                                 to  IC-DSIDTINIS(I-DEL)
      *            move  DSIDTFIIS
      *                                 to  IC-DSIDTFIIS(I-DEL)
      *            move  DSICODSIN
      *                                 to  IC-DSICODSIN(I-DEL)
      *            move  DSICATSIN
      *                                 to  IC-DSICATSIN(I-DEL)
      *        else
      *            move
      *            'Stabellamento per elementi ADSDELSI.              '
      *                          to  W-CHK-CAMPI
      *            move  'S'     to  W-ERRORE
      *            move  111     to  NDC1
      *        end-if
      *    end-if.
       L27-EX.
           EXIT.
      *
       L28-DATIANF.
           move  zeros    to  W-ANNOINIZANF.
      *                       W-ANNOFINEANF.
           move  W-DECORRENZA(1:4)  to  W-ANNOINIZANF.
           if  W-DECORRENZA(5:2)  >  6
           then
               subtract  1   from  W-ANNOINIZANF
           else
               subtract  2   from  W-ANNOINIZANF
           end-if.
      *---------------------------------------- Modificato 20/12/2004
      *    move  H-DCOCODFIS
      *                      to H-ANFCODFIS .
      *    move  zeros       to H-ANFDTDEVA .
      *    move  zeros  to  NDC2
      *                     I-ANF.
      *    start  DATIANF
      *           key  is  greater  than
      *                             externally-described-key
      *      invalid  key
      *        continue
      *      not  invalid  key
      *        perform  varying  NDC1  from  1  by  1
      *                   until  NDC1  >  99
      *          read  DATIANF
      *              next  record
      *            at  end
      *              move  111    to  NDC1
      *            not  at  end
      *              if H-ANFCODFIS                  is  equal
      *                        DCOCODFIS
      *              then
      *                  perform  L29-CHKFLD-DATIANF   thru  L29-EX
      *                  if  W-ERRORE   =  'N'
      *                  then
      *                      if  (ANFANRIRE  >=  W-ANNOINIZANF)
      *                          and  (ANFANRIRE  <=  W-ANNOFINEANF)
      *                      then
      *                          perform  L30-CARICOANF   thru  L30-EX
      *                      end-if
      *                  else
      *                     move  111    to  NDC1
      *                  end-if
      *              else
      *                  move  111    to  NDC1
      *              end-if
      *          end-read
      *        end-perform
      *      end-start.
      *
           move  zeros       to  NDC1
                                 I-ANF.
           move  H-DCOCHIDOM  to H-ANFCHIDOM .
           move  H-DCOCODFIS  to H-ANFCODFIS .
           PERFORM  L28-DB2-DECL-CURS    THRU  L28-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
                      until  NDC1  >  99
      *
             PERFORM  L28-DB2-FETCH    THRU  L28-DB2-FETCH-EX
             IF SQLCODE = 0
                perform  L29-CHKFLD-DATIANF  thru  L29-EX
      *------------ Vengono gestiti solo record ANF corretti        -*
                if  W-ERRORE   =  'N'
                then
                    perform  L30-CARICOANF   thru  L30-EX
                else
                    PERFORM DATIANF-DB2-CLSCUR
                       THRU DATIANF-DB2-CLSCUR-EX
                    move  111     to  NDC1
                    move  'N'     to  W-ERRORE
                end-if
             ELSE
                PERFORM DATIANF-DB2-CLSCUR
                   THRU DATIANF-DB2-CLSCUR-EX
                move  111    to  NDC1
             END-IF
           end-perform.
      *
       L28-EX.
           EXIT.
      *
       L29-CHKFLD-DATIANF.
      *------------------------------------- Data decorrenza validità*
           if H-ANFDTDEVA                 is  not  numeric
           then
               move
                   'valore di ANFDTDEVA /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Componenti nucleo       *
           if H-ANFCONUFA                 is  not  numeric
           then
               move
                   'valore di ANFCONUFA /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Numero figli            *
           if H-ANFNUMFIG                 is  not  numeric
           then
               move
                   'valore di ANFNUMFIG /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Numero figli minori     *
           if H-ANFFIGMIN                 is  not  numeric
           then
               move
                   'valore di ANFFIGMIN /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Tipo nucleo             *
           if H-ANFTIPNUC                 =  spaces
           then
               move
                   'valore di ANFTIPNUC /ADSMODAN non presente.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Reddito familiare       *
           if H-ANFREDFAE                 is  not  numeric
           then
               move
                   'valore di ANFREDFAE /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Anno riferimento reddito*
           if H-ANFANRIRE                 is  not  numeric
           then
               move
                   'valore di ANFANRIRE /ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Tabella riferimento ANF *
      *    if H-ANFTABELLA                is  not  numeric
      *    then
      *        move
      *            'valore di ANFTABELLA/ADSMODAN non numerico.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  111     to  NDC1
      *        go  to  L29-EX
      *    end-if.
      *------------------------------------- Importo mensile     ANF *
           if H-ANFIMPMENS                is  not  numeric
           then
               move
                   'valore di ANFIMPMENS/ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *------------------------------------- Importo Giornaliero ANF *
           if H-ANFIMPGIOR                is  not  numeric
           then
               move
                   'valore di ANFIMPGIOR/ADSMODAN non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
               go  to  L29-EX
           end-if.
      *-------------- escludo record erronei con dati anni precedenti*
           if H-ANFANRIRE                 <  W-ANNOINIZANF
           then
               move  'S'     to  W-SALTA-ANF
      *        go  to  L29-EX
           else
               move  'N'     to  W-SALTA-ANF
           end-if.
       L29-EX.
           EXIT.
      *
       L30-CARICOANF.
           if  W-SALTA-ANF  =  'S'
           then
               go  to  L30-EX
           end-if.
080917     if  I-ANF  <  20
           then
               add  1  to  I-ANF
      *I-------------------------------- new dal 23/07/2013  --------*
               move H-ANFDTDEVA   to  IC-ANFDTDEVA(I-ANF)
                                      LC-ANFDTDEVA(I-ANF)
               move H-ANFCONUFA   to  IC-ANFCONUFA(I-ANF)
                                      LC-ANFCONUFA(I-ANF)
               move H-ANFNUMFIG   to  IC-ANFNUMFIG(I-ANF)
                                      LC-ANFNUMFIG(I-ANF)
               move H-ANFPREINV   to  IC-ANFPREINV(I-ANF)
                                      LC-ANFPREINV(I-ANF)
               move H-ANFTIPINV   to  IC-ANFTIPINV(I-ANF)
                                      LC-ANFTIPINV(I-ANF)
               move H-ANFFIGMIN   to  IC-ANFFIGMIN(I-ANF)
                                      LC-ANFFIGMIN(I-ANF)
               move H-ANFTIPNUC   to  IC-ANFTIPNUC(I-ANF)
                                      LC-ANFTIPNUC(I-ANF)
               if  H-ANFREDFAE    >   zeroes
               then  move H-ANFREDFAE to  IC-ANFREDFAE(I-ANF)
                                          LC-ANFREDFAE(I-ANF)
               else  move  1.9999     to  IC-ANFREDFAE(I-ANF)
                                          LC-ANFREDFAE(I-ANF)
               end-if
               move H-ANFANRIRE   to  IC-ANFANRIRE(I-ANF)
                                      LC-ANFANRIRE(I-ANF)
      *F-------------------------------- new dal 23/07/2013  --------*
               move H-ANFTABELLA  to  IC-ANFTABELLA(I-ANF)
211013         if  H-ANFREDFAE    >   999111.00
211013         then  move zeroes      to  IC-ANFIMPMENS(I-ANF)
211013                                    IC-ANFIMPGIOR(I-ANF)
211013         else
                   move H-ANFIMPMENS  to  IC-ANFIMPMENS(I-ANF)
                   move H-ANFIMPGIOR  to  IC-ANFIMPGIOR(I-ANF)
               end-if
           else
               move
                   'Stabellamento per elementi ADSMODAN               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  NDC1
           end-if.
       L30-EX.
           EXIT.
      *                                                              *
       L49-FILE66.
      *
           move  H-DCOCHIDOM to  H-SOSCHIDOM .
           move  zeros  to  I-SOS
      *
           PERFORM  L49-DB2-DECL-CURS    THRU  L49-DB2-DECL-CURS-EX.
      *
           perform  varying  NDC1  from  1  by  1
100517                    until  I-SOS >  400
           PERFORM  L49-DB2-FETCH    THRU  L49-DB2-FETCH-EX
      *
           IF SQLCODE = 0
              perform  L50-CHKFLD-SOSPE     thru  L50-EX
              if  (W-ERRORE   =  'N')
              then
                  perform  L51-CARICOSOS    thrU  L51-EX
               else
                  PERFORM SOSPENSIONI-DB2-CLSCUR                        CUR-
                     THRU SOSPENSIONI-DB2-CLSCUR-EX                     CUR-
              end-if
           ELSE
              PERFORM SOSPENSIONI-DB2-CLSCUR                            CUR-
                 THRU SOSPENSIONI-DB2-CLSCUR-EX                         CUR-
100517        move  444    to  I-SOS
           END-IF
           end-perform.
       L49-EX.
           EXIT.
      *
       L50-CHKFLD-SOSPE.
      *------------------------------------- Data inizio H-SOSpensione *
           if  H-SOSDTINSOS   is  not  numeric
           then
               move
                   'valore di SOSDTINSOS/ADSSOSPE non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
100517         move  444     to  I-SOS
               go  to  L50-EX
           end-if.
           if  H-SOSDTINSOS   >  zeros
           then
               continue
           else
               move
                   'valore di SOSDTINSOS/ADSSOSPE non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
100517         move  444     to  I-SOS
               go  to  L50-EX
           end-if.
      *------------------------------------- Data fine   H-SOSpensione *
           if  H-SOSDTFISOS   is  not  numeric
           then
               move
                   'valore di SOSDTFISOS/ADSSOSPE non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
100517         move  444     to  I-SOS
               go  to  L50-EX
           end-if.
      *------------------------------------- Codice      H-SOSpensione *
      *    if  H-SOSCODSOS   =  spaces
      *    then
      *        move
      *            'valore di SOSCODSOS /ADSSOSPE non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        move  444     to  I-SOS
      *        go  to  L50-EX
      *    end-if.
       L50-EX.
           EXIT.
      *
       L51-CARICOSOS.
100517     if  I-SOS  <  400
           then
               add   1    to  I-SOS
               move  H-SOSDTINSOS
                                     to  IC-SOSDTINSOS(I-SOS)
               move  H-SOSDTFISOS
                                     to  IC-SOSDTFISOS(I-SOS)
           else
               move
                   'Stabellamento per elementi ADSSOSPE               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
100517         move  444     to  I-SOS
               PERFORM SOSPENSIONI-DB2-CLSCUR                           CUR-
                  THRU SOSPENSIONI-DB2-CLSCUR-EX                        CUR-
           end-if.
       L51-EX.
           EXIT.
       L61-FILE51.
           move  H-DCOCHIDOM  to  H-ASUCHIDOM .
      *
           PERFORM L61-DB2-SELECT THRU L61-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
      *        display 'mongelli ' h-asuchidom '-' h-asucosede
      *        '-' fst-adsattsu
               move
                   'errore in lettura di ADSATTSU.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           ELSE
      *        continue                                              *
               move  'S'    to  WL-FILE51
           end-IF.
      *------------------------------------- Data decadenza          *
           if  H-ASUDADEC                    is  not  numeric
           then
               move
                   'valore di ASUDADEC  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUDADEC                    to  IC-ASUDADEC.
      *------------------------------------- Tipo flusso             *
           if  H-ASUFLUSSO                   is  not  numeric
           then
               move
                   'valore di ASUFLUSSO /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUFLUSSO                   to  IC-ASUFLUSSO.
      *------------------------------------- Ultimo trattamento perc.*
           if  H-ASUULTRA                    is  not  numeric
           then
               move
                   'valore di ASUULTRA  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUULTRA                    to  IC-ASUULTRA.
      *------------------------------------- Data pensione vecchiaia *
           if  H-ASUDAPE                     is  not  numeric
           then
               move
                   'valore di ASUDAPE   /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUDAPE                     to  IC-ASUDAPE.
      *------------------------------------- Codice prestazione      *
      *    if  H-ASUCODPRES                  =  spaces
      *    then
      *        move
      *            'valore di ASUCODPRES/ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUCODPRES                  to  IC-ASUCODPRES.
      *------------------------------------- Tipo progetto           *
      *    if  H-ASUTIPPROG                  =  spaces
      *    then
      *        move
      *            'valore di ASUTIPPROG/ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUTIPPROG                  to  IC-ASUTIPPROG.
      *------------------------------------- Impegnato LSU 31.12.91  *
      *    if  H-ASUIMPE                     =  spaces
      *    then
      *        move
      *            'valore di ASUIMPE   /ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUIMPE                     to  IC-ASUIMPE.
      *------------------------------------- flag LSU/LPU            *
      *    if  H-ASULPU                      =  spaces
      *    then
      *        move
      *            'valore di ASULPU    /ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASULPU                      to  IC-ASULPU.
      *------------------------------------- Tipo finanziamento      *
           if  H-ASUFIN                      is  not  numeric
           then
               move
                   'valore di ASUFIN    /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUFIN                      to  IC-ASUFIN.
250116*    if (IC-ASUFIN   =   3   or
      *                    =   6   or
      *                    =   9  )       and
      *        W-DCOMODARR      =  zeros  and
      *        IC-DOMANDA(1:4)  >  2015
      *    then
      *        move
      *            'Domanda non pagabile in quanto non telematica.    '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
250116*    end-if.
      *------------------------------------- flag edili              *
      *    if  H-ASUEDIL                     =  spaces
      *    then
      *        move
      *            'valore di ASUEDIL   /ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUEDIL                     to  IC-ASUEDIL.
      *------------------------------------- Cod. Fisc. Ente         *
           if  H-ASUCFENTE                   is  not  numeric
           then
               move
                   'valore di ASUCFENTE /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUCFENTE                   to  IC-ASUCFENTE.
      *------------------------------------- Anno delibera           *
           if  H-ASUANNODEL                  is  not  numeric
           then
               move
                   'valore di ASUANNODEL/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUANNODEL                  to  IC-ASUANNODEL.
      *------------------------------------- Numero delibera         *
           if  H-ASUNUMDEL                   is  not  numeric
           then
               move
                   'valore di ASUNUMDEL /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUNUMDEL                   to  IC-ASUNUMDEL.
      *------------------------------------- Diritto assegno ASU     *
      *    if  H-ASUDIRITTO                  =  spaces
      *    then
      *        move
      *            'valore di ASUDIRITTO/ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUDIRITTO                  to  IC-ASUDIRITTO.
      *------------------------------------- Data rinuncia           *
           if  H-ASUDARIN                    is  not  numeric
           then
               move
                   'valore di ASUDARIN  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUDARIN                    to  IC-ASUDARIN.
      *------------------------------------- Codice reiez.rinuncia   *
      *    if  H-ASUREIERIN                  =  spaces
      *    then
      *        move
      *            'valore di ASUREIERIN/ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUREIERIN                  to  IC-ASUREIERIN.
      *------------------------------------- Importo tot. rinuncia   *
           if  H-ASUIMRIN                    is  not  numeric
           then
               move
                   'valore di ASUIMRIN  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMRIN                    to  IC-ASUIMRIN.
      *------------------------------------- Importo ult. rinuncia   *
           if  H-ASUIMRINU                   is  not  numeric
           then
               move
                   'valore di ASUIMRINU /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMRINU                   to  IC-ASUIMRINU.
      *------------------------------------- H-RECupero su rinuncia  *
           if  H-ASURECRIN                   is  not  numeric
           then
               move
                   'valore di ASURECRIN /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASURECRIN                   to  IC-ASURECRIN.
      *------------------------------------- H-RECupero su rinuncia  *
      *    if  H-ASUINCENT                   =  spaces
      *    then
      *        move
      *            'valore di ASUINCENT /ADSATTSU non presente.       '
      *                      to  W-CHK-CAMPI
      *        move  'S'     to  W-ERRORE
      *        go  to  L61-EX
      *    end-if.
           move  H-ASUINCENT                   to  IC-ASUINCENT.
      *------------------------------------- Importo tot. calcolato  *
           if  H-ASUIMINT                    is  not  numeric
           then
               move
                   'valore di ASUIMINT  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMINT                    to  IC-ASUIMINT.
      *---------------------------------------- Verifica tipo pagare  *
           evaluate  W-PAGARE
             when  'S'
               if  H-ASUIMINT equal zeros
               then
                   move  'N'  to  W-SCELTA
                   go  to  L61-EX
               end-if
             when  'P'
               if  H-ASUIMINT not equal  zeros
               then
                   move  'N'  to  W-SCELTA
                   go  to  L61-EX
               end-if
             when  'T'
                   continue
             when  other
                   move  'N'  to  W-SCELTA
                   go  to  L61-EX
           end-evaluate.
      *------------------------------------- Importo indebito        *
           if  H-ASUINDEB                    is  not  numeric
           then
               move
                   'valore di ASUINDEB  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUINDEB                    to  IC-ASUINDEB.
      *------------------------------------- Importo tot. ANF        *
           if  H-ASUIMANFT                   is  not  numeric
           then
               move
                   'valore di ASUIMANFT /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMANFT                   to  IC-ASUIMANFT.
      *------------------------------------- Giornate calcolate      *
           if  H-ASUGGCALC                   is  not  numeric
           then
               move
                   'valore di ASUIMANFT /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUGGCALC                   to  IC-ASUGGCALC.
      *------------------------------------- Maggioraz. tot. ANF     *
           if  H-ASUMAGANFT                  is  not  numeric
           then
               move
                   'valore di ASUMAGANFT/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUMAGANFT                  to  IC-ASUMAGANFT.
      *------------------------------------- Data ult. giorno calcol.*
           if  H-ASUULASS                    is  not  numeric
           then
               move
                   'valore di ASUULASS  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUULASS                    to  IC-ASUULASS.
      *------------------------------------- Totale ASU              *
           if  H-ASUIMASUT                   is  not  numeric
           then
               move
                   'valore di ASUIMASUT /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMASUT                   to  IC-ASUIMASUT.
      *------------------------------------- Totale ANF ASU          *
           if  H-ASUANFASUT                  is  not  numeric
           then
               move
                   'valore di ASUANFASUT/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUANFASUT                  to  IC-ASUANFASUT.
      *------------------------------------- Totale maternità ASU    *
           if  H-ASUMATASUT                  is  not  numeric
           then
               move
                   'valore di ASUMATASUT/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUMATASUT                  to  IC-ASUMATASUT.
      *------------------------------------- Ult. indennità   H-ASU  *
           if  H-ASUIMINU                    is  not  numeric
           then
               move
                   'valore di ASUIMINU  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMINU                    to  IC-ASUIMINU.
      *------------------------------------- Ult. ANF         H-ASU  *
           if  H-ASUIMANFU                   is  not  numeric
           then
               move
                   'valore di ASUIMANFU /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMANFU                   to  IC-ASUIMANFU.
      *------------------------------------- Ult. IRPEF  netta       *
           if  H-ASUIRPEFU                   is  not  numeric
           then
               move
                   'valore di ASUIRPEFU /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIRPEFU                   to  IC-ASUIRPEFU.
      *------------------------------------- Ult. conguaglio Irpef   *
           if  H-ASUCONGFIS                  is  not  numeric
           then
               move
                   'valore di ASUCONGFIS/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUCONGFIS                  to  IC-ASUCONGFIS.
      *------------------------------------- Ult. addizionale regione*
           if  H-ASUADDIZR                   is  not  numeric
           then
               move
                   'valore di ASUADDIZR /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUADDIZR                   to  IC-ASUADDIZR.
      *------------------------------------- Ult. addizionale comune *
           if  H-ASUADDIZC                   is  not  numeric
           then
               move
                   'valore di ASUADDIZC /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUADDIZC                   to  IC-ASUADDIZC.
      *------------------------------------- Ult. maggioraz. ANF     *
           if  H-ASUMAGANF                   is  not  numeric
           then
               move
                   'valore di ASUMAGANF /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUMAGANF                   to  IC-ASUMAGANF.
      *------------------------------------- Ult. conguaglio 730     *
           if  H-ASUCONG730                  is  not  numeric
           then
               move
                   'valore di ASUCONG730/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUCONG730                  to  IC-ASUCONG730.
      *------------------------------------- Ult. tratt. sindacale   *
           if  H-ASUTRASIND                  is  not  numeric
           then
               move
                   'valore di ASUTRASIND/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUTRASIND                  to  IC-ASUTRASIND.
      *------------------------------------- Sind.: confederazione   *
           if  H-ASUTSCONF                   is  not  numeric
           then
               move
                   'valore di ASUTSCONF /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUTSCONF                   to  IC-ASUTSCONF.
      *------------------------------------- Sind.: categoria        *
           if  H-ASUTSCAT                    is  not  numeric
           then
               move
                   'valore di ASUTSCAT  /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUTSCAT                    to  IC-ASUTSCAT.
      *------------------------------------- Addiz. reg. su rinuncia *
           if  H-ASUADDIZRR                  is  not  numeric
           then
               move
                   'valore di ASUADDIZRR/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUADDIZRR                  to  IC-ASUADDIZRR.
      *------------------------------------- Addiz. com. su rinuncia *
           if  H-ASUADDIZRC                  is  not  numeric
           then
               move
                   'valore di ASUADDIZRC/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUADDIZRC                  to  IC-ASUADDIZRC.
      *------------------------------------- Tratt.sind..su rinuncia *
           if  H-ASUTRASINR                  is  not  numeric
           then
               move
                   'valore di ASUTRASINR/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUTRASINR                  to  IC-ASUTRASINR.
      *------------------------------------- ASU                     *
           if  H-ASUIMASUU                   is  not  numeric
           then
               move
                   'valore di ASUIMASUU /ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUIMASUU                   to  IC-ASUIMASUU.
      *------------------------------------- ANF ASU                 *
           if  H-ASUANFASUU                  is  not  numeric
           then
               move
                   'valore di ASUANFASUU/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUANFASUU                  to  IC-ASUANFASUU.
      *------------------------------------- Maternità ASU           *
           if  H-ASUMATASUU                  is  not  numeric
           then
               move
                   'valore di ASUMATASUU/ADSATTSU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L61-EX
           end-if.
           move  H-ASUMATASUU                  to  IC-ASUMATASUU.
       L61-EX.
           EXIT.
      *
       L62-FILE40.
           if  H-ASUCFENTE               equal  zeroes
           then
               go  to  L62-EX
           end-if.
           move  H-ASUCFENTE              to  CODFIS
                                   OF DCLTDSASU.
           PERFORM L62-DB2-SELECT THRU L62-DB2-SELECT-EX.
      *
           IF  SQLCODE NOT = 0
               go  to  L62-EX
           ELSE
      *        continue                                              *
               move  'S'    to  WL-FILE40
           end-IF.
      *------------------------------------- Codice fiscale Ente     *
           move    CODFIS  OF DCLTDSASU          to  IC-CODFIS.
      *------------------------------------- Codice fiscale Ente Prin*
           move    CFPRINC                       to  IC-CFPRINC.
      *
           PERFORM L63-FILE42      thru  L63-EX.
       L62-EX.
           EXIT.
      *
       L63-FILE42.
           if  H-ASUCFENTE               equal  zeroes
           then
               go  to  L63-EX
           end-if.
           move  H-ASUCFENTE      to  CODFIS  OF DCLTDSASU2.
           move  H-ASUANNODEL     to  ANNODEL OF DCLTDSASU2.
           move  H-ASUNUMDEL      to  NUMDEL  OF DCLTDSASU2.
           PERFORM L63-DB2-SELECT THRU L63-DB2-SELECT-EX.
      *
           IF  SQLCODE NOT = 0
               go  to  L63-EX
           ELSE
      *        continue                                              *
               move  'S'    to  WL-FILE42
           end-IF.
      *------------------------------------- Codice fiscale Ente     *
           move    CODFIS OF DCLTDSASU2          to  IC-CODFISD.
      *------------------------------------- Anno delibera           *
           move    ANNODEL OF DCLTDSASU2         to  IC-ANNODELIB.
      *------------------------------------- Num. delibera           *
           move    NUMDEL OF DCLTDSASU2          to  IC-NUMDELIB.
      *------------------------------------- Inizio                  *
      *    move    ASUINI OF DCLTDSASU2        to  IC-ASUINID.
           MOVE    ASUINI OF DCLTDSASU2     TO  WK-DATA-APPOGGIO.
           PERFORM CAMBIADATA-DA10-A8     THRU  CAMBIADATA-DA10-A8-EX.
           MOVE    W8-AAAAMMGG              TO  IC-ASUINID.
      *------------------------------------- Fine                    *
      *    move    ASUFIN OF DCLTDSASU2        to  IC-ASUFIND.
           MOVE    ASUFIN OF DCLTDSASU2     TO  WK-DATA-APPOGGIO.
           PERFORM CAMBIADATA-DA10-A8   THRU CAMBIADATA-DA10-A8-EX.
           MOVE    W8-AAAAMMGG              TO  IC-ASUFIND.
      *------------------------------------- Codice finanziamento    *
           move    CODFIN OF DCLTDSASU2          to  IC-CODFIND
      *------------------------------------- Pagam.consentito fino al*
      *    move    PAGFINOA OF DCLTDSASU2        to  IC-PAGFINOA.
      *
           MOVE    PAGFINOA OF DCLTDSASU2   TO  WK-DATA-APPOGGIO.
           PERFORM CAMBIADATA-DA10-A8   THRU CAMBIADATA-DA10-A8-EX.
           if W8-AAAAMMGG = 99991231 or
              W8-AAAAMMGG = 00010101
              MOVE    0                 TO  IC-PAGFINOA
           else
              MOVE    W8-AAAAMMGG       TO  IC-PAGFINOA
           end-if.
      *
      *------------------------------------- Flag chiusura elaboraz. *
           move    FLAGELAB OF DCLTDSASU2        to  IC-FLAGELAB.
      *------------------------------------- Data rendiconto         *
      *    move    DATAREND OF DCLTDSASU2        to  IC-DATAREND.
      *
           MOVE    DATAREND OF DCLTDSASU2   TO  WK-DATA-APPOGGIO.
           PERFORM CAMBIADATA-DA10-A8   THRU CAMBIADATA-DA10-A8-EX.
           MOVE    W8-AAAAMMGG              TO  IC-DATAREND.
      *
      *------------------------------------- a disposizione          *
      *GG  move    CAMPOD                        to  IC-CAMPOD.
       L63-EX.
           EXIT.
      *
       L64-FILE52.
           move  H-DCOCHIDOM
                             to  H-LPUCHIDOM.
           PERFORM L64-DB2-SELECT THRU L64-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               move
                   'errore in lettura di ADSLAVPU.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           ELSE
      *        continue                                              *
               move  'S'    to  WL-FILE52
           end-IF.
      *------------------------------------- Data decadenza          *
           if  H-LPUDADEC                      is  not  numeric
           then
               move
                   'valore di LPUDADEC  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUDADEC                      to  IC-LPUDADEC.
      *------------------------------------- Mesi spettanti          *
           if  H-LPUMESI                       is  not  numeric
           then
               move
                   'valore di LPUMESI   /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUMESI                       to  IC-LPUMESI.
      *------------------------------------- Tipo progetto           *
           move  H-LPUTIPPROG                  to  IC-LPUTIPPROG.
      *------------------------------------- Importo tot. calcolato  *
           if  H-LPUIMINT                      is  not  numeric
           then
               move
                   'valore di LPUIMINT  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUIMINT                      to  IC-LPUIMINT.
      *---------------------------------------- Verifica tipo pagare  *
           evaluate  W-PAGARE
             when  'S'
               if  H-LPUIMINT  equal  zeros
               then
                   move  'N'  to  W-SCELTA
                   go  to  L64-EX
               end-if
             when  'P'
               if  H-LPUIMINT  not  equal  zeros
               then
                   move  'N'  to  W-SCELTA
                   go  to  L64-EX
               end-if
             when  'T'
                   continue
             when  other
                   move  'N'  to  W-SCELTA
                   go  to  L64-EX
           end-evaluate.
      *------------------------------------- Importo indebito        *
           if  H-LPUINDEB                      is  not  numeric
           then
               move
                   'valore di LPUINDEB  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUINDEB                      to  IC-LPUINDEB.
      *------------------------------------- Importo tot. ANF        *
           if  H-LPUIMANFT                     is  not  numeric
           then
               move
                   'valore di LPUIMANFT /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUIMANFT                     to  IC-LPUIMANFT.
      *------------------------------------- Giornate calcolate      *
           if  H-LPUGGCALC                     is  not  numeric
           then
               move
                   'valore di LPUGGCALC /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUGGCALC                     to  IC-LPUGGCALC.
      *------------------------------------- Importo tot. maggior.ANF*
           if  H-LPUMAGANFT                    is  not  numeric
           then
               move
                   'valore di LPUMAGANFT/ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUMAGANFT                  to  IC-LPUMAGANFT.
      *------------------------------------- Data ult. giorno calcol.*
           if  H-LPUULASS                    is  not  numeric
           then
               move
                   'valore di LPUULASS  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUULASS                    to  IC-LPUULASS.
      *------------------------------------- Ult. indennità B.L.     *
           if  H-LPUIMINU                    is  not  numeric
           then
               move
                   'valore di LPUIMINU  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUIMINU                    to  IC-LPUIMINU.
      *------------------------------------- Ult. indennità B.L.     *
           if  H-LPUIMINU                    is  not  numeric
           then
               move
                   'valore di LPUIMINU  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUIMINU                    to  IC-LPUIMINU.
      *------------------------------------- Ult. ANF       B.L.     *
           if  H-LPUIMANFU                   is  not  numeric
           then
               move
                   'valore di LPUIMANFU /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUIMANFU                   to  IC-LPUIMANFU.
      *------------------------------------- Ult. IRPEF netta        *
           if  H-LPUIRPEFU                   is  not  numeric
           then
               move
                   'valore di LPUIRPEFU /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUIRPEFU                   to  IC-LPUIRPEFU.
      *------------------------------------- Ult. conguaglio Irpef   *
           if  H-LPUCONGFIS                  is  not  numeric
           then
               move
                   'valore di LPUCONGFIS/ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUCONGFIS                  to  IC-LPUCONGFIS.
      *------------------------------------- Ult. Addiz. regione     *
           if  H-LPUADDIZR                   is  not  numeric
           then
               move
                   'valore di LPUADDIZR /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUADDIZR                   to  IC-LPUADDIZR.
      *------------------------------------- Ult. Addiz. comune      *
           if  H-LPUADDIZC                   is  not  numeric
           then
               move
                   'valore di LPUADDIZC /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUADDIZC                   to  IC-LPUADDIZC.
      *------------------------------------- Ult. maggioraz. ANF     *
           if  H-LPUMAGANF                   is  not  numeric
           then
               move
                   'valore di LPUMAGANF /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUMAGANF                   to  IC-LPUMAGANF.
      *------------------------------------- Ult. conguaglio 730     *
           if  H-LPUCONG730                  is  not  numeric
           then
               move
                   'valore di LPUCONG730/ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUCONG730                  to  IC-LPUCONG730.
      *------------------------------------- Ult. tratt. sindacale   *
           if  H-LPUTRASIND                  is  not  numeric
           then
               move
                   'valore di LPUTRASIND/ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUTRASIND                  to  IC-LPUTRASIND.
      *------------------------------------- Sindac.: confederazione *
           if  H-LPUTSCONF                   is  not  numeric
           then
               move
                   'valore di LPUTSCONF /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUTSCONF                   to  IC-LPUTSCONF.
      *------------------------------------- Sindac.: categoria      *
           if  H-LPUTSCAT                    is  not  numeric
           then
               move
                   'valore di LPUTSCAT  /ADSLAVPU non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L64-EX
           end-if.
           move  H-LPUTSCAT                    to  IC-LPUTSCAT.
       L64-EX.
           EXIT.
      *
       L67-FILE53.
      *
           move  H-DCOCHIDOM  to  H-SSTCHIDOM .
           PERFORM L67-DB2-SELECT THRU L67-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               move
                   'errore in lettura di ADSSUSST.  Chiave invalida.  '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           ELSE
      *        continue                                              *
               move  'S'    to  WL-FILE53
           end-IF.
      *------------------------------------- Codice categoria        *
           move  H-SSTCODIND                   to  IC-SSTCODIND.
      *------------------------------------- Part time               *
           move  H-SSTPARTIM                   to  IC-SSTPARTIM.
      *------------------------------------- Data decadenza          *
           if  H-SSTDADEC                    is  not  numeric
           then
               move
                   'valore di SSTDADEC  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDADEC                    to  IC-SSTDADEC.
      *------------------------------------- Mesi contratto          *
           if  H-SSTMMCONTR                  is  not  numeric
           then
               move
                   'valore di SSTMMCONTR/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTMMCONTR                  to  IC-SSTMMCONTR.
      *------------------------------------- Data pensione vecchiaia *
           if  H-SSTDAPE                     is  not  numeric
           then
               move
                   'valore di SSTDAPE   /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDAPE                     to  IC-SSTDAPE.
      *------------------------------------- Retribuzione oraria     *
           if  H-SSTRETRORA                  is  not  numeric
           then
               move
                   'valore di SSTRETRORA/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTRETRORA                  to  IC-SSTRETRORA
      *------------------------------------- Ore contrattuali teoric.*
           if  H-SSTORE                      is  not  numeric
           then
               move
                   'valore di SSTORE    /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTORE                      to  IC-SSTORE.
      *------------------------------------- Minuti contrattuali teo.*
           if  H-SSTMIN                      is  not  numeric
           then
               move
                   'valore di SSTMIN    /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTMIN                      to  IC-SSTMIN.
      *------------------------------------- Ore contrattuali effett.*
           if  H-SSTOREEF                    is  not  numeric
           then
               move
                   'valore di SSTOREEF  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTOREEF                    to  IC-SSTOREEF.
      *------------------------------------- Minuti contrattuali eff.*
           if  H-SSTMINEF                    is  not  numeric
           then
               move
                   'valore di SSTMINEFF /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTMINEF                    to  IC-SSTMINEF.
      *------------------------------------- Importo totale calcolato*
           if  H-SSTIMINT                    is  not  numeric
           then
               move
                   'valore di SSTIMINT  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIMINT                    to  IC-SSTIMINT.
      *---------------------------------------- Verifica tipo pagare  *
           evaluate  W-PAGARE
             when  'S'
               if  H-SSTIMINT equal zeros
               then
                   move  'N'  to  W-SCELTA
                   go  to  L67-EX
               end-if
             when  'P'
               if  H-SSTIMINT not equal  zeros
               then
                   move  'N'  to  W-SCELTA
                   go  to  L67-EX
               end-if
             when  'T'
                   continue
             when  other
                   move  'N'  to  W-SCELTA
                   go  to  L67-EX
           end-evaluate.
      *------------------------------------- Importo indebito        *
           if  H-SSTINDEB                    is  not  numeric
           then
               move
                   'valore di SSTINDEB  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTINDEB                    to  IC-SSTINDEB.
      *------------------------------------- Giornate calcolate      *
           if  H-SSTGGCALC                   is  not  numeric
           then
               move
                   'valore di SSTGGCALC /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTGGCALC                   to  IC-SSTGGCALC.
      *------------------------------------- Data ult. giorno calcol.*
           if  H-SSTULASS                    is  not  numeric
           then
               move
                   'valore di SSTULASS  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTULASS                    to  IC-SSTULASS.
      *------------------------------------- Ult. importo sussidio   *
           if  H-SSTIMINU                    is  not  numeric
           then
               move
                   'valore di SSTIMINU  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIMINU                    to  IC-SSTIMINU.
      *------------------------------------- Ult. IRPEF netta        *
           if  H-SSTIRPEFU                   is  not  numeric
           then
               move
                   'valore di SSTIRPEFU /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIRPEFU                   to  IC-SSTIRPEFU.
      *------------------------------------- Ult. conguaglio Irpef   *
           if  H-SSTCONGFIS                  is  not  numeric
           then
               move
                   'valore di SSTCONGFIS/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTCONGFIS                  to  IC-SSTCONGFIS.
      *------------------------------------- Ult. addiz. regione     *
           if  H-SSTADDIZR                   is  not  numeric
           then
               move
                   'valore di SSTADDIZR /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTADDIZR                   to  IC-SSTADDIZR.
      *------------------------------------- Ult. addiz. comune      *
           if  H-SSTADDIZC                   is  not  numeric
           then
               move
                   'valore di SSTADDIZC /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTADDIZC                   to  IC-SSTADDIZC.
      *------------------------------------- Ult. conguaglio 730     *
           if  H-SSTCONG730                  is  not  numeric
           then
               move
                   'valore di SSTCONG730/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTCONG730                  to  IC-SSTCONG730.
      *------------------------------------- Ult. trattenuta sindaca.*
           if  H-SSTTRASIND                  is  not  numeric
           then
               move
                   'valore di SSTTRASIND/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTTRASIND                  to  IC-SSTTRASIND.
      *------------------------------------- Sindacato: confederazion*
           if  H-SSTTSCONF                   is  not  numeric
           then
               move
                   'valore di SSTTSCONF /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTTSCONF                   to  IC-SSTTSCONF.
      *------------------------------------- Sindacato: categoria    *
           if  H-SSTTSCAT                    is  not  numeric
           then
               move
                   'valore di SSTTSCAT  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTTSCAT                    to  IC-SSTTSCAT.
      *------------------------------------- Codice parte regione    *
           if  H-SSTREGIND                   is  not  numeric
           then
               move
                   'valore di SSTREGIND /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTREGIND                   to  IC-SSTREGIND.
      *------------------------------------- Codice parte anno       *
           if  H-SSTANNIND                   is  not  numeric
           then
               move
                   'valore di SSTANNIND /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTANNIND                   to  IC-SSTANNIND.
      *------------------------------------- Decorrenza anticipazione*
           if  H-SSTDARIN                    is  not  numeric
           then
               move
                   'valore di SSTDARIN  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDARIN                    to  IC-SSTDARIN.
      *------------------------------------- Importo    anticipazione*
           if  H-SSTIMRIN                    is  not  numeric
           then
               move
                   'valore di SSTIMRIN  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIMRIN                    to  IC-SSTIMRIN.
      *------------------------------------- Imp. ultimo anticipaz.  *
           if  H-SSTIMRINU                   is  not  numeric
           then
               move
                   'valore di SSTIMRINU /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIMRINU                   to  IC-SSTIMRINU.
      *------------------------------------- H-RECupero su anticipaz. *
           if  H-SSTRECRIN                   is  not  numeric
           then
               move
                   'valore di SSTRECRIN /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTRECRIN                   to  IC-SSTRECRIN.
      *------------------------------------- Data pagam. II  tranche *
           if  H-SSTDTA2T                    is  not  numeric
           then
               move
                   'valore di SSTDTA2T  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDTA2T                    to  IC-SSTDTA2T.
      *------------------------------------- Data pagam. III tranche *
           if  H-SSTDTA3T                    is  not  numeric
           then
               move
                   'valore di SSTDTA3T  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDTA3T                    to  IC-SSTDTA3T.
      *------------------------------------- Data pagam. IV  tranche *
           if  H-SSTDTA4T                    is  not  numeric
           then
               move
                   'valore di SSTDTA4T  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDTA4T                    to  IC-SSTDTA4T.
      *------------------------------------- Imp. totale ANF         *
           if  H-SSTIMANFT                   is  not  numeric
           then
               move
                   'valore di SSTIMANFT /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIMANFT                   to  IC-SSTIMANFT.
      *------------------------------------- Imp. ultimo ANF         *
           if  H-SSTIMANFU                   is  not  numeric
           then
               move
                   'valore di SSTIMANFU /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTIMANFU                   to  IC-SSTIMANFU.
      *------------------------------------- Add. reg. su rinuncia   *
           if  H-SSTADDIZRR                  is  not  numeric
           then
               move
                   'valore di SSTADDIZRR/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTADDIZRR                  to  IC-SSTADDIZRR.
      *------------------------------------- Add. com. su rinuncia   *
           if  H-SSTADDIZRC                  is  not  numeric
           then
               move
                   'valore di SSTADDIZRC/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTADDIZRC                  to  IC-SSTADDIZRC.
      *------------------------------------- Tra. sin. su rinuncia   *
           if  H-SSTTRASINR                  is  not  numeric
           then
               move
                   'valore di SSTTRASINR/ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTTRASINR                  to  IC-SSTTRASINR.
      *------------------------------------- Data libera 1           *
           if  H-SSTDTAL1                    is  not  numeric
           then
               move
                   'valore di SSTDTAL1  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDTAL1                    to  IC-SSTDTAL1.
      *------------------------------------- Data libera 2           *
           if  H-SSTDTAL2                    is  not  numeric
           then
               move
                   'valore di SSTDTAL2  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTDTAL2                    to  IC-SSTDTAL2.
      *------------------------------------- Num. libero 1           *
           if  H-SSTNUML1                    is  not  numeric
           then
               move
                   'valore di SSTNUML1  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTNUML1                    to  IC-SSTNUML1.
      *------------------------------------- Num. libero 2           *
           if  H-SSTNUML2                    is  not  numeric
           then
               move
                   'valore di SSTNUML2  /ADSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTNUML2                    to  IC-SSTNUML2.

290823*--Controllo coerenza tra n°gg e durata prestazione            *
           IF IC-DCODTADEC > 0
170925       AND (IC-DCODTADEC > IC-DCODTDECSP)
      *      MOVE IC-DCODTDECSP   TO LK-DATA1
      *      MOVE IC-DCODTADEC    TO LK-DATA2
      *      initialize  wk-per-spet
      *      CALL RDSUT50 USING
      *                         WDFHEIBLK  WDFHCOMMAREA
      *                         LK-DATA1
      *                         LK-DATA2
      *                         WK-PER-SPET
             initialize per-rdsut11
             MOVE IC-DCODTDECSP(3:2)    TO R11-DATA-I(5:2)
             MOVE IC-DCODTDECSP(5:2)    TO R11-DATA-I(3:2)
             MOVE IC-DCODTDECSP(7:2)    TO R11-DATA-I(1:2)
             MOVE IC-DCODTADEC(3:2)     TO R11-DATA-F(5:2)
             MOVE IC-DCODTADEC(5:2)     TO R11-DATA-F(3:2)
             MOVE IC-DCODTADEC(7:2)     TO R11-DATA-F(1:2)

             CALL  RDSUT11  USING
                         WDFHEIBLK  WDFHCOMMAREA
                                    PER-RDSUT11

      *      IF IC-SSTNUML2 > WK-PER-SPET
      * aggiungo 1 per fare in modo che vengano contati i 2 estremi
      * delle date
             IF IC-SSTNUML2 > R11-GIORNI
               move
                   'valore di SSTNUML2 /TDSSUSST non corretto.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
             END-IF
           ELSE
             IF IC-SSTNUML2 > 728
               move
                   'valore di SSTNUML2 /TDSSUSST non corretto: > 728.'
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
             END-IF
           END-IF.

      *------------------------------------- Alf. libero 1           *
           move  H-SSTALFL1                    to  IC-SSTALFL1.
      *------------------------------------- Alf. libero 2           *
           move  H-SSTALFL2                    to  IC-SSTALFL2.
      *------------------------------------- Imp. unatantum          *
           if  H-SSTRETSET                   is  not  numeric
           then
               move
                   'valore di SSTRETSET /TDSSUSST non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               go  to  L67-EX
           end-if.
           move  H-SSTRETSET                   to  IC-SSTRETSET.
       L67-EX.
           EXIT.
      *
       L70-FILE64.
           move  H-DCOCHIDOM to  H-PERCHIDOM .
           move  zeros       to  H-PERDADAL .
           move  zeros   to  I-PER
                             NDC1.
           move  'N'     to  FLG-17.
           PERFORM  L70-DB2-DECL-CURS    THRU  L70-DB2-DECL-CURS-EX.
           PERFORM varying NDC1    from  1  by  1
                          until  I-PER >  50
      *
           PERFORM  L70-DB2-FETCH    THRU  L70-DB2-FETCH-EX
           IF  SQLCODE NOT = 0
               move  111    to  I-PER
               PERFORM TDSPERIO-DB2-CLSCUR
                  THRU TDSPERIO-DB2-CLSCUR-EX
           ELSE
               PERFORM L71-CHKFLD-PERIO      thru  L71-EX
               if  (W-ERRORE   =  'N')
               then
                   PERFORM L72-CARICOPER     thru  L72-EX
               else
                   PERFORM TDSPERIO-DB2-CLSCUR
                      THRU TDSPERIO-DB2-CLSCUR-EX
               end-if
           END-IF
           end-PERFORM.
       L70-EX.
           EXIT.
      *                                                              *
       L71-CHKFLD-PERIO.
      *------------------------------------- Data inizio periodo     *
           if  H-PERDADAL                     is  not  numeric
           then
               move
                   'valore di PERDADAL  /ADSPERIO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  I-PER
               go  to  L71-EX
           end-if.
           if  H-PERDADAL                     >  zeros
           then
               continue
           else
               move
                   'valore di PERDADAL  /ADSPERIO non valido.         '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  I-PER
               go  to  L71-EX
           end-if.
      *------------------------------------- Data fine   H-PERiodo   *
           if  H-PERDAAL                      is  not  numeric
           then
               move
                   'valore di PERDAAL   /ADSPERIO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  I-PER
               go  to  L71-EX
           end-if.
      *------------------------------------- Codice periodo          *
           if  H-PERCODICE                    is  not  numeric
           then
               move
                   'valore di PERCODICE /ADSPERIO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  I-PER
               go  to  L71-EX
           end-if.
      *------------------------------------- Ore lavoro              *
           if  H-PERORELAV                    is  not  numeric
           then
               move
                   'valore di PERORELAV /ADSPERIO non numerico.       '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               move  111     to  I-PER
               go  to  L71-EX
           end-if.
       L71-EX.
           EXIT.
      *                                                              *
       L72-CARICOPER.
           if  I-PER  <  50
           then
               add   1    to  I-PER
               move  H-PERDADAL      to  IC-PERDADAL(I-PER)
               move  H-PERDAAL       to  IC-PERDAAL(I-PER)
               move  H-PERCODICE     to  IC-PERCODICE(I-PER)
               if  H-PERCODICE =  17
               then
                   move  'S'  to  FLG-17
               end-if
               move  H-PERORELAV     to  IC-PERORELAV(I-PER)
           else
               move
                   'Stabellamento per elementi ADSPERIO               '
                             to  W-CHK-CAMPI
               move  'S'     to  W-ERRORE
               PERFORM TDSPERIO-DB2-CLSCUR
                  THRU TDSPERIO-DB2-CLSCUR-EX
               move  111     to  I-PER
           end-if.
       L72-EX.
           EXIT.
      *
       L73-FILE65.
           if  H-SSTCODIND              =  spaces
           then
               go  to  L73-EX
           end-if.
           move  H-SSTCODIND               to  H-CODCTG.
           move  H-SSTREGIND               to  H-REGCTG.
           move  H-SSTANNIND               to  H-ANNOCTG .
           PERFORM L73-DB2-SELECT THRU L73-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               go  to  L73-EX
      *    ELSE
      *        continue
      *        move  'S'    to  WL-FILE65                            *
           end-IF.
      *------------------------------------- Codice categoria        *
           move  H-CODCTG                        to  IC-CODCTG.
      *------------------------------------- Progressivo categoria   *
           move  H-PROGCTG                       to  IC-PROGCTG.
      *------------------------------------- Durata  sussidio        *
           move  H-GGSUSS                        to  IC-GGSUSS.
      *------------------------------------- Importo sussidio        *
           move  H-IMPSUSS                       to  IC-IMPSUSS.

290725     IF W-NEWSUSS = 'Y'
290725       initialize out-messaggio
290725       STRING 'le domande ' H-SSTCODIND ' vanno '
290725              'elaborate con la nuova proc.'
290725         DELIMITED BY SIZE into  OUT-MESSAGGIO
290725       MOVE OUT-MESSAGGIO  TO  W-CHK-CAMPI
290725       MOVE '96'           TO  OUT-STATUS
290725       move 'S'            to  W-ERRORE
290725     END-IF.

       L73-EX.
           EXIT.
      *
       L75-TIPOASU.
      *--------------------------------------- Non alterare sequenza *
      *---- Le opzioni 4,5,6 sono state accorpate nella '4'          *
      *--------  '1-ASU Fondo Occupazione   Tipo fin. 3,6  (B)'      *
           if  (H-DCODTDECSP                  >   20000430)  and
               (H-ASUFIN                      =  3  or  6   or   9 )
           then
               move  '1'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
      *--------  '2-ASU convenzione Enti    Tipo fin. 2    (B)'      *
           if  (H-DCODTDECSP                  >   20000430)  and
               (H-ASUFIN                      =  2)
           then
               move  '2'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
      *--------  '3-Transitoristi ex F.O.   Tipo fin. 7    (B)'      *
           if  (H-DCODTDECSP                  >   20000430)  and
               (H-ASUFIN                      =  7)
           then
               move  '3'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
      *--------  '4-ASU F.O. fino  31/10/00 Tipo fin.1     (B)'      *
           if  (H-DCODTDECSP                  <=  20001031)  and
               (H-ASUFIN                      =  1)
           then
               move  '4'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
      *--------  '4-ASU F.O. fino  31/10/00 Tipo fin.1,4,5 (B)'      *
           if  (H-ASUFIN                      =  1  or  4  or  5)
           then
               move  '4'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
      *--------  '6-LSU/LPU Cod.17 SICILIA  Tipo fin. 2    (B)'      *
      *                        fino al 30/04/2000                    *
           if  (H-DCODTDECSP                  <=  20000430)  and
               (H-ASUFIN                      =  2)          and
               (FLG-17      =   'S')
           then
      *        move  '6'     to  W-OPZIONE
               move  '4'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
      *--------  '5-LSU/LPU  fino  30/04/00 Tipo fin. 2,3  (B)'      *
           if  (H-DCODTDECSP                  <=  20000430)  and
               (H-ASUFIN                      =  2  or  3)
           then
      *        move  '5'     to  W-OPZIONE
               move  '4'     to  W-OPZIONE
               go  to  L75-EX
           end-if.
       L75-EX.
           EXIT.
      *
      *
       L77-TIPOSST.
      *--------------------------------------- Non alterare sequenza *
      *--------  'Sussidio Straordinario Normale??         (E)'      *
      *    if  (DCODTDECSP                    >   2nnnnnnn)  and
      *        (xxxxxx      of  R-FILExx      =  n  or  n)
      *    then
      *        move  'N'     to  W-OPZIONE
      *        go  to  L77-EX
      *    end-if.
      *
           move  'N'     to  W-OPZIONE.
      *--------   W-OPZIONE = 'V'    settore Volo                    *
      *--------  'SST Fondo Speciale Trasporto Aereo       (E)'      *
           if  (H-DCODTDECSP                  >   20040000)  and
               (H-SSTCODIND                   =  'TRAC'  or
051216          H-SSTCODIND                   =  'FTMD'  or
                H-SSTCODIND                   =  'FTSO'  or
                H-SSTCODIND                   =  'FTCG'  or
                H-SSTCODIND                   =  'FTCD'  or
                H-SSTCODIND                   =  'FTCC'  or
                H-SSTCODIND                   =  'FTPL'  or
                H-SSTCODIND                   =  'FTAI'  or
051216          H-SSTCODIND                   =  'FTAD'  or
                H-SSTCODIND                   =  'TRAD'  or
                H-SSTCODIND                   =  'TRAS'  or
                H-SSTCODIND                   =  'TRAP'  or
                H-SSTCODIND                   =  'TRAF'  or
260324          H-SSTCODIND                   =  'FSAI'  or
270324          H-SSTCODIND                   =  'FSAD'  or
100424          H-SSTCODIND                   =  'FTCI')
           then
               move  'V'     to  W-OPZIONE
               go  to  L77-EX
           end-if.
      *--------   W-OPZIONE = 'C'    settore Credito                 *
      *--------  'SST Fondo Solidarietà Settore Credito    (E)'      *
           if  (H-DCODTDECSP                  >   20100000)  and
               (H-SSTCODIND                   =  'CRED')
           then
               move  'C'     to  W-OPZIONE
               go  to  L77-EX
           end-if.
300320*--------   W-OPZIONE = 'E'  Emergenza Covid19  DL18 17/03/2020*
      *--------  '...................................      (E)'      *
           if  (H-DCODTDECSP                  >   20200000)  and
      *        (H-SSTCODIND                   =  'EELA'  or
               (H-SSTCODIND                   =  'EE27'  or
                H-SSTCODIND                   =  'EE28'  or
                H-SSTCODIND                   =  'EE29'  or
251120          H-SSTCODIND                   =  'EJ29'  or
091220          H-SSTCODIND                   =  'EK29'  or
260321          H-SSTCODIND                   =  'EW29'  or
260321          H-SSTCODIND                   =  'EY29'  or
220621          H-SSTCODIND                   =  'EX29'  or
                H-SSTCODIND                   =  'EE30'  or
                H-SSTCODIND                   =  'EE38'  or
251120          H-SSTCODIND                   =  'EJ38'  or
091220          H-SSTCODIND                   =  'EK38'  or
260321          H-SSTCODIND                   =  'EW38'  or
260321          H-SSTCODIND                   =  'EY38'  or
220621          H-SSTCODIND                   =  'EX38')
           then
               move  'E'     to  W-OPZIONE
010720         move  'S'     to  W-SXCOVID19
               go  to  L77-EX
300320     end-if.
040620*--------   W-OPZIONE = 'E'  Emergenza Covid19  DL18 17/03/2020*
      *--------  'e DL 34 del 19 maggio 2020 .........     (E)'      *
           if  (H-DCODTDECSP                  >   20200000)  and
               (H-SSTCODIND                   =  'EE2A'  or
251120          H-SSTCODIND                   =  'EJ2A'  or
091220          H-SSTCODIND                   =  'EK2A'  or
260321          H-SSTCODIND                   =  'EW2A'  or
260321          H-SSTCODIND                   =  'EY2A'  or
220621          H-SSTCODIND                   =  'EX2A'  or
                H-SSTCODIND                   =  'EE2B'  or
251120          H-SSTCODIND                   =  'EJ2B'  or
091220          H-SSTCODIND                   =  'EK2B'  or
260321          H-SSTCODIND                   =  'EW2B'  or
260321          H-SSTCODIND                   =  'EY2B'  or
220621          H-SSTCODIND                   =  'EX2B'  or
                H-SSTCODIND                   =  'EE2C'  or
251120          H-SSTCODIND                   =  'EJ2C'  or
091220          H-SSTCODIND                   =  'EK2C'  or
260321          H-SSTCODIND                   =  'EW2C'  or
260321          H-SSTCODIND                   =  'EY2C'  or
220621          H-SSTCODIND                   =  'EX2C'  or
                H-SSTCODIND                   =  'EE2D'  or
251120          H-SSTCODIND                   =  'EJ2D'  or
091220          H-SSTCODIND                   =  'EK2D'  or
260321          H-SSTCODIND                   =  'EW2D'  or
260321          H-SSTCODIND                   =  'EY2D'  or
220621          H-SSTCODIND                   =  'EX2D'  or
                H-SSTCODIND                   =  'EE05'  or
251120          H-SSTCODIND                   =  'EJ05'  or
091220          H-SSTCODIND                   =  'EK05'  or
260321          H-SSTCODIND                   =  'EW05'  or
260321          H-SSTCODIND                   =  'EY05'  or
220621          H-SSTCODIND                   =  'EX05'  or
                H-SSTCODIND                   =  'EE10'  or
251120          H-SSTCODIND                   =  'EJ10'  or
091220          H-SSTCODIND                   =  'EK10'  or
260321          H-SSTCODIND                   =  'EW10'  or
260321          H-SSTCODIND                   =  'EY10'  or
220621          H-SSTCODIND                   =  'EX10')
           then
               move  'E'    to  W-OPZIONE
010720         move  'S'    to  W-SXCOVID19
               go  to  L77-EX
040620     end-if.
230920*--------   W-OPZIONE = 'E'  Emergenza Covid19 DL18-34-104/2020*
           if  (H-DCODTDECSP                  >   20200000)  and
               (H-SSTCODIND                   =  'EE13'  or
251120          H-SSTCODIND                   =  'EJ13'  or
091220          H-SSTCODIND                   =  'EK13'  or
260321          H-SSTCODIND                   =  'EW13'  or
260321          H-SSTCODIND                   =  'EY13'  or
220621          H-SSTCODIND                   =  'EX13'  or
260321          H-SSTCODIND                   =  'EY3A'  or
220621          H-SSTCODIND                   =  'EX3A'  or
220621          H-SSTCODIND                   =  'EX87'  or
220621          H-SSTCODIND                   =  'EX88'  or
211021          H-SSTCODIND                   =  'EX89'  or
130422          H-SSTCODIND                   =  'E092'  or
                H-SSTCODIND                   =  'EE22'  or
                H-SSTCODIND                   =  'EEZR'  or
                H-SSTCODIND                   =  'EEMA'  or
080722          H-SSTCODIND                   =  'E109'  or
080722          H-SSTCODIND                   =  'E110'  or
080722          H-SSTCODIND                   =  'E112'  or
231122          H-SSTCODIND                   =  'E107'  or
130123          H-SSTCODIND                   =  'E159'  or
130123          H-SSTCODIND                   =  'E160'  or
130123          H-SSTCODIND                   =  'E162'  or
130123          H-SSTCODIND                   =  'E157')
           then
               move  'E'    to  W-OPZIONE
               move  'S'    to  W-SXCOVID19
               go  to  L77-EX
230920     end-if.
       L77-EX.
           EXIT.
      *
       E23-CALCOLASU.
      *--------  '1-ASU Fondo Occupazione   Tipo fin. 3,6  (B)'      *
           if  W-OPZIONE  =  '1'
           then
               if  W-DTBLOCCO-36  >  zeros
               then
                   if  L-TIPOCALCOLO  =  'R'
                   then
                       if  IC-CALCOLOAL  >  W-DTBLOCCO-36
                       then
                           move  W-DTBLOCCO-36  to  IC-CALCOLOAL
                       end-if
                   end-if
               else
                   if  TIPO-ELABO-IN  =  3
                       and  L-TIPOCALCOLO  =  'S'
                   then
                       move  'ATTENZIONE: regione non autorizzata al pa-
      -                      'gamento della prestazione.               '
                                           to  OUT-MESSAGGIO
                       MOVE '96'           TO  OUT-STATUS
                   else
                       go  to  E23-EX
                   end-if
               end-if
               move  'PIOSU43'   to  W-PGM
               call   PIOSU43    using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        PER-CALCOLO
               end-call
               cancel PIOSU43
               go  to  E23-EX
           end-if.
      *--------  '2-ASU convenzione Enti    Tipo fin. 2    (B)'      *
           if  W-OPZIONE  =  '2'
           then
               move  'PIOSU42'   to  W-PGM
               call   PIOSU42    using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        PER-CALCOLO
               end-call
               cancel  PIOSU42
               go  to  E23-EX
           end-if.
      *--------  '3-Transitoristi ex F.O.   Tipo fin. 7    (B)'      *
           if  W-OPZIONE  =  '3'
           then
               move  'PIOSU44'   to  W-PGM
               call   PIOSU44    using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        PER-CALCOLO
               end-call
               cancel  PIOSU44
               go  to  E23-EX
           end-if.
      *-ex-----  '4-ASU F.O. fino  31/10/00 Tipo fin.1,4,5 (B)'      *
      *-new----  '4-ASU/LSU/LPU fino al 2000 fin.1,2,3,4,5 (B)'      *
           if  W-OPZIONE  =  '4'
           then
               move  'PIOSU41'   to  W-PGM
               call   PIOSU41    using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        PER-CALCOLO
               end-call
               cancel  PIOSU41
               go  to  E23-EX
           end-if.
      *----- le opzioni 6 e 5 sono state accorpate nella '4'         *
      *--------  '6-LSU/LPU Cod.17 SICILIA  Tipo fin. 2    (B)'      *
      *                        fino al 30/04/2000                    *
      *    if  W-OPZIONE  =  '6'
      *    then
      *        move  'PIOSU41'   to  W-PGM
      *        call  'PIOSU41'   using  PER-CALCOLO
      *        end-call
      *        cancel 'PIOSU41'
      *        go  to  E23-EX
      *    end-if.
      *--------  '5-LSU/LPU  fino  30/04/00 Tipo fin. 2,3  (B)'      *
      *    if  W-OPZIONE  =  '5'
      *    then
      *        move  'PIOSU41'   to  W-PGM
      *        call  'PIOSU41'   using  PER-CALCOLO
      *        end-call
      *        cancel 'PIOSU41'
      *        go  to  E23-EX
      *    end-if.
       E23-EX.
           EXIT.
      *
       E24-CALCOLO.
           move  99  to  OC-RETCODE.
      *
           if  W-XCALCOLO  =  'Y'
           then
               continue
           else
               go  to  E24-EX
           end-if.
      *------------------------------------------- Simulazione
           if  L-TIPOCALCOLO  =  'S'
           then
               move  'SIMULAZI'         to  IC-CHIAMANTE
               move  W-CALCOLO-AL       to  IC-CALCOLOAL
           end-if.
      *------------------------------------------- Calcolo reale
           if  L-TIPOCALCOLO  =  'R'
           then
               move  'EFFETTIV'         to  IC-CHIAMANTE
               move  W-CALCOLO-AL       to  IC-CALCOLOAL
      *                    oppure DATA ODIERNA ?
           end-if.
      *------------------------------------------ Scelta pgm calcolo *
      *--- ASU
           if  W-CODICEDUE  =  42
           then
               perform  E23-CALCOLASU  thru  E23-EX
           end-if.
      *--- LPU
           if  W-CODICEDUE  =  44
           then
               move  'PIOLP41'   to  W-PGM
               call   PIOLP41    using
                                 WDFHEIBLK  WDFHCOMMAREA
                                 PER-CALCOLO
               end-call
               cancel  PIOLP41
           end-if.
      *--- SUS
010720*    if  W-CODICEDUE  =  45
      *    then
      *        move  'PIOSX41'   to  W-PGM
      *        call   PIOSX41    using
      *               WDFHEIBLK  WDFHCOMMAREA
      *                          PER-CALCOLO
      *        end-call
      *        cancel  PIOSX41
      *    end-if.
010720*
010720     if  W-CODICEDUE  =  45
           then
               if  W-SXCOVID19   =  'S'
               then
                   if  L-TIPOCALCOLO  =  'R'
                   then
                       if  W-NIK  =  'S'
                       then
                           move  'PIOSX41'   to  W-PGM
                           call   PIOSX41    using
                                  WDFHEIBLK  WDFHCOMMAREA
                                             PER-CALCOLO
                           end-call
                           cancel  PIOSX41
                       else
                           move  98  to  OC-RETCODE
                           move
                           'il pagamento x COVID19 è centralizzato'
                                     to  OC-MESSAGGIO
                           go  to  E24-EX
                       end-if
                   else
                       move  'PIOSX41'   to  W-PGM
                       call   PIOSX41    using
                              WDFHEIBLK  WDFHCOMMAREA
                                         PER-CALCOLO
                       end-call
                       cancel  PIOSX41
                   end-if
               else
                   move  'PIOSX41'   to  W-PGM
                   call   PIOSX41    using
                          WDFHEIBLK  WDFHCOMMAREA
                                     PER-CALCOLO
                   end-call
                   cancel  PIOSX41
               end-if
010720     end-if.
      *----------------------------------- x verifica date          *
               move  'NICOLA  '     to  IC-CHIAMANTE.
               call   RDSIO12 using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        L-CODICE-SEDE
                                        L-CODICE-STOP
                                        L-NOME-SEDE
                                        L-NOME-STOP
                                        L-PROCEDURA
                                        PER-CALCOLO
                                        LAREA-D
               end-call.
               cancel  RDSIO12.
      *------------------------------------------ Post calcolo       *
           perform  E25-CONTROLLI  thru  E25-EX.
      *
           if  W-NIK  =  'S'
           then
               string  W-PGM   delimited  by  size
                       '-->'   delimited  by  size
                                      into  S2A005
               move  OC-RETCODE         to  S2A007
               perform  S10-STAMPA     thru  S10-EX
           end-if.
           if  OC-RETCODE  =  96
           then
               go  to  E24-EX
           end-if.
      *--------------------------------- Gestione solo definizioni   *
           if  OC-RETCODE  =  00
           then
               if  OC-FADNETTOPAG  >  2.00
               then
                   continue
               else
      *            perform  E26-NEGATIVE   thru  E26-EX
      *            if  OC-FADNETTOPAG  =  zeros   and
                   if  OC-DCOULESSP  =  'D'
                   then
                        continue
                   else
                       move  98  to  OC-RETCODE
                       move  'Anomalia Calcolo/Pagamento/Definizione'
                                 to  OC-MESSAGGIO
                   end-if
               end-if
               go  to  E24-EX
           end-if.
      *--------------------------------- Gestione definizione+indebit*
           if  OC-RETCODE  =  01
           then
               if  OC-DCOULESSP    =  'D'   and
                   OC-FADNETTOPAG  =  zeros
               then
                   continue
               else
                   move  98  to  OC-RETCODE
                   move  'Anomalia Calcolo/Pagamento/Definizione'
                             to  OC-MESSAGGIO
               end-if
               go  to  E24-EX
           else
               move  98  to  OC-RETCODE
               move  'Anomalia Calcolo/Pagamento/Definizione'
                         to  OC-MESSAGGIO
           end-if.
       E24-EX.
           EXIT.
      *
       E25-CONTROLLI.
151117*------------------- Verifica se pagata lo    stesso giorno    *
      *    if  W8-ODIERNA  =  IC-DCODTULSP
      *    then
      *        move  96  to  OC-RETCODE
      *        string
      *        'Avviso:   Prestazione non  pagabile oggi ma da'
      *        ' Domani in poi.         ' delimited by size
      *            into  OC-MESSAGGIO
      *        go  to  E25-EX
151117*    end-if.
100419*------------------- verifica importi                          *
           if  OC-IMPASUF  >  0   or
               OC-IMPANFF  >  0   or
               OC-IMPMATF  >  0   or
               OC-IMPASUE  >  0   or
               OC-IMPANFE  >  0   or
               OC-IMPMATE  >  0
           then  continue
           else  go  to  K25-KITE
100419     end-if.
311017*------------------- Verifica altri pagamenti stesso giorno    *
           move  OC-CFENTEP     to  CODFIS     of  DCLTDSPAG.
           move  OC-ANNODELIBP  to  ANNODEL    of  DCLTDSPAG.
           move  OC-NUMDELIBP   to  NUMDEL     of  DCLTDSPAG.
           move  IC-DCOCODFIS   to  CFLAV      of  DCLTDSPAG.
           move  L-CODICE-SEDE  to  CODSAP     of  DCLTDSPAG.
           move  zeros             to  WK-DATA-APPOGGIO
                                       W8-AAAAMMGG .
           MOVE  OC-DATAPAGP       TO  W8-AAAAMMGG .
           PERFORM CAMBIADATA-DA8-A10  THRU  CAMBIADATA-DA8-A10-EX.
           MOVE  WK-DATA-APPOGGIO  TO  DATULT   OF DCLTDSPAG.
           move  zeros  to  W-CONTA-P.
      *
           EXEC SQL
             SELECT    COUNT(*)
             INTO      :W-CONTA-P
               FROM  TDSPAG
               WHERE  CODFIS     =  :DCLTDSPAG.CODFIS
                 AND  ANNODEL    =  :DCLTDSPAG.ANNODEL
                 AND  NUMDEL     =  :DCLTDSPAG.NUMDEL
                 AND  CFLAV      =  :DCLTDSPAG.CFLAV
                 AND  CODSAP     =  :DCLTDSPAG.CODSAP
                 AND  DATULT     =  :DCLTDSPAG.DATULT
           END-EXEC.
      *
           if  W-CONTA-P  >  0   or    SQLCODE  not =  zero
           then
               move  96  to  OC-RETCODE
               string
               'Avviso:   Prestazione non  pagabile oggi ma da'
               ' Domani in poi.         ' delimited by size
                   into  OC-MESSAGGIO
               go  to  E25-EX
311017     end-if.
151117*------------------- Verifica altre operazioni in corso        *
      *    move  IC-DCOCODFIS  to  LDCOCODFIS.
      *    move  W8-ODIERNA    to  LDATAODIERNA.
      *    move  spaces        to  LPAGAMENTO.
      *    move  L-CODICE-SEDE to  LSEDE-RDSPD13.
      *    move  IC-DCOCHIDOM  to  LDCOCHIDOM.
      *    CALL  RDSPD13  USING
      *               WDFHEIBLK  WDFHCOMMAREA
      *               PER-RDSPD13
      *    end-call.
      *    cancel   RDSPD13 .
      *    if  LPAGAMENTO  =  'S'
      *    then
      *        move  96  to  OC-RETCODE
      *        string
      *       '**Avviso**  Prestazione in variazione;  non è '                 '
      *       'pagabile per 30 minuti. ' delimited by size
      *                into  OC-MESSAGGIO
      *        go  to  E25-EX
      *    end-if.
      *----Deceduti: gestisco def.con indebito o pag. a terzi        *
       K25-KITE.
270114     if  W-DATMORTE    >  zeroes
           then
               if  IC-DCODTADEC    >    zeroes      and
                   OC-FADFINE      <=   W-DATMORTE  and
                   OC-DCOULESSP    =    'D'         and
                   OC-FADNETTOPAG  =    zeroes      and
                   (
                   OC-ASUIMINU     =   zeroes      and
                   OC-LPUIMINU     =   zeroes      and
                   OC-SSTIMINU     =   zeroes
                   )
      *            or  (
      *            OC-ASUINDEB     >   zeroes      or
      *            OC-LPUINDEB     >   zeroes      or
      *            OC-SSTINDEB     >   zeroes      or
      *            ))
               then  go  to  E25-EX
               end-if
               if  OC-FADFINE      <=   W-DATMORTE  and
                   OC-DCOULESSP    =    'D'         and
                   OC-FADNETTOPAG  =    zeroes      and
                  (
                   ( OC-ASUIMINU     >   zeroes     and
      *              OC-ASUIMINU     =   W-IMP-GPA10099 )   or
                     OC-ASUIMINU     =   OC-RECIMUREE-1 )   or
                   ( OC-LPUIMINU     >   zeroes     and
      *              OC-LPUIMINU     =   W-IMP-GPA10099 )   or
                     OC-LPUIMINU     =   OC-RECIMUREE-1 )   or
                   ( OC-SSTIMINU     >   zeroes     and
      *              OC-SSTIMINU     =   W-IMP-GPA10099 )
                     OC-SSTIMINU     =   OC-RECIMUREE-1 )
                  )
               then  go  to  E25-EX
               end-if
      *
               move  96  to  OC-RETCODE
               move  'Non Gestibile *DECEDUTO* vedi msg 1654/2014'
                             to  OC-MESSAGGIO
      *        go  to  E25-EX
270114     end-if.

       E25-EX.
           EXIT.
      *
      *E26-NEGATIVE.
      *    if  OC-DCOULESPP  =  'D'
      *    then
      *        if  OC-DCOULESSP  =  spaces     or
      *            OC-DCOULESSP  =  'D'        or
      *            OC-DCOULESSP  =  'R'
      *        then
      *            continue
      *        else
      *            move  9  to  OC-RETCODE
      *        end-if
      *    end-if.
      *    if  OC-DCOULESSP  =  'D'
      *    then
      *        if  OC-DCOULESPP  =  spaces     or
      *            OC-DCOULESPP  =  'D'        or
      *            OC-DCOULESPP  =  'R'
      *        then
      *            continue
      *        else
      *            move  9  to  OC-RETCODE
      *        end-if
      *    end-if.
      *E26-EX.
      *    EXIT.
      *
       E30-AGGIORNA.
      *-------------------------------------------- Contatori
           if  OC-FADNETTOPAG  >  2.00
           then
               add   1              to  CTR-PAGATE
           else
               add   1              to  CTR-DEFINITE
           end-if.
      *    if  OC-FADNETTOPAG  <  2.01   and
      *        OC-FADNETTOPAG  >  zeros
      *    then
      *        add   1              to  CTR-DEFINITE
      *    end-if.
      *    if  OC-FADNETTOPAG  <=  zeros
      *    then
      *        add   1              to  CTR-INDEBITE
      *    end-if.
      *-------------------------------------------- Simulazione      *
           if  L-TIPOCALCOLO  =  'S'
           then
               add   1   to  CTR-SCR-APPO
               MOVE  1   to  TDSREPORT-NUM-RPT
               perform  S30-STAMPA        thru  S30-EX
               go  to  E30-EX
           end-if.
      *-------------------------------------------- Pagamento reale  *
           move  W-PROCEDURA      to  H-O0PROCEDURA.
           move  L-CODICE-STOP    to  H-O0DCOCENOPE.
           move  L-CODICE-SEDE    to  H-O0COSEDE.
           move  IC-DOMANDA       to  H-O0DOMANDA.
      *-------------------------------- Scrivo per lettura invalida  *
      *    move  'N'              to  WS-APPOGGIO.
           PERFORM E30-DB2-SELECT THRU E30-DB2-SELECT-EX.
      *
           IF  SQLCODE NOT = 0
                perform E33-DATI-APPOGGIO  thru  E33-EX
                PERFORM E30-DB2-INSERT THRU E30-DB2-INSERT-EX
                IF  SQLCODE = 0
      *               add   1                  to  CTR-SCR-APPO
                      move  'S'                to  WS-APPOGGIO
                      move  'S'                to  FLG-COMMIT
      *---------------------Aggiornamento file Sospeso prime prove
                      perform  E35-UPD-FILE    thru  E35-EX
                      move  'CALCOLATA '       to  S2A005
                      move  spaces             to  S2A006
                                                   S2A007
      *
      *--------------------- Prestazione indebita                    *
                      if  OC-ASUINDEB  >  zeros
                      then
                          move  'INDEBITA  '   to  S2A006
                      end-if
                      if  OC-LPUINDEB  >  zeros
                      then
                          move  'INDEBITA  '   to  S2A006
                      end-if
                      if  OC-SSTINDEB  >  zeros
                      then
                          move  'INDEBITA  '   to  S2A006
                      end-if
                      perform  S05-STAMPA-2   thru  S05-EX
                      perform  S10-STAMPA     thru  S10-EX
                end-if
             else
                 move  'READ      '       to  S2A005
                 move  'ADSAPIO0  '       to  S2A006
                 move  FST-ADSAPIO0       to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
                 add   1                  to  CTR-LET-APPO
           end-if.
       E30-EX.
           EXIT.
      *
       E31-ANAGRAFICA.
           move  spaces           to  FLD-1
                                      FLD-2.
           initialize  C14-I-AREA
                       C14-O-AREA.
           move  'L'              to  I-SISTEMA.
           move  'L'              to  I-RICHIESTA.
           move  091              to  I-ARCHGE.
           move  'A'              to  I-PROGETTO.
           move  'F'              to  I-TIPO-KEY.
      *
           STRING H-DCOCODFIS  L-CODICE-SEDE
                  DELIMITED BY SIZE INTO  I-CODIND .
      *
           move  spaces           to  I-PASSWORD.
           move  L-CODICE-SEDE    to  I-CODSEDE.
           move  L-CODICE-STOP    to  I-CODSTOP.
           move  LMATRICOLA       to  I-UTENTE.
140725     IF LMATRICOLA = '50000419'
140725       MOVE 'E0000419'      to  I-UTENTE
140725     END-IF.
      *
           CALL  RDSUT14  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 C14-I-AREA   C14-O-AREA .
           cancel RDSUT14.
      *
           if  O-RETURN-CODE    =  spaces
220425       or LMATRICOLA  = '50000419'
      *    or  AI-TIPO-RISPOSTA  not =  'U'
           then
               continue
           else
               if  W-NIK  =  'S'
               then
      *
      *            DISPLAY  ' GGA-ARCA RETCODE = '
      *              O-RETURN-CODE ' - ' O-MESSAGGIO-IN-CHIARO
      *            DISPLAY  ' codice fiscale   = ' H-DCOCODFIS
      *                     ' - ' H-DCOCHIDOM
      *
                   move  'Dati anagrafici non disponibili '
      *                                  to  AI-COGNOME
                                         to  IC-COMPATTO
                                             W-CHK-CAMPI
291122             move  'S'    to  W-ERRORE
                   go  to  E31-EX
               else
                   move  'S'    to  W-ERRORE
                   go  to  E31-EX
               end-if
           end-if.
      *    display ' W-ERRORE dopo arca: ' W-ERRORE
      *
           if  O-CFVALID  =  "S"
           then
               move  O-CODICE-FISCALE  to  IC-CODFISARCA
           else
130426       IF LMATRICOLA  = '50000419'
130426          move  H-DCOCODFIS    to  IC-CODFISARCA
130426       ELSE
               move  "Codice fiscale  non validato.   "
                                       to  IC-COMPATTO
                                           W-CHK-CAMPI
               move  O-CODICE-FISCALE  to  IC-CODFISARCA
               move  "S"  to  W-ERRORE
               go  to  E31-EX
             END-IF
           end-if.

140725*elena inizio
      *    if  O-COGNACQU = 'SINONIMIARCA'
      *    then
      *        move  "Presenza di sinonimi su Arca.   "
      *                                to  IC-COMPATTO
      *                                    W-CHK-CAMPI
      *        move  O-CODICE-FISCALE  to  IC-CODFISARCA
      *        move  "S"  to  W-ERRORE
      *        go  to  E31-EX
      *    end-if.
140725*elena fine

161115*----------------------------- Verifica Blocco pagamento x CF  *
231215*    move  IC-CODFISARCA         to  LK-CODFIS.
231215*    move  'N'                   to  LK-RISP.
231215*    call  RDSUT28  using
231215*          WDFHEIBLK  WDFHCOMMAREA
231215*          PER-RDSUT28
231215*    cancel  RDSUT28
231215*    if  LK-RISP =  'S'
231215*    then
231215*        move 'Pagamenti Bloccati per il Codice Fiscale'
231215*                                to  W-CHK-CAMPI
231215*                                    out-messaggio
231215*        move  'S'  to  W-ERRORE
231215*        go  to  E31-EX
231215*    end-if.
      *
           move  O-COGNOME         to  WIC-COGNOME
                                       FLD-1.
           move  spaces            to  FLD-1(27:6).
           move  O-NOME            to  WIC-NOME
                                       FLD-2.
      *------------------------------ Dati compattati per Video/Stampa
           move    32              to  NDC1.
           perform  until  NDC1           <  1   or
                           BT-1(NDC1) not = space
               compute  NDC1  =  NDC1  -  1
           end-perform.
           move  '/'             to  BT-1(NDC1  +  1)
           compute  NDC1  =  (NDC1)  +  2.
           move    1             to  NDC2.
           perform  until  NDC1  >  32
               move  BT-2(NDC2)  to  BT-1(NDC1)
               compute  NDC1  =  NDC1  +  1
               compute  NDC2  =  NDC2  +  1
           end-perform.
           move  FLD-1           to  IC-COMPATTO.
      *
           move  O-COGNACQU      to  WIC-ACQUISITO.
           move  O-DATNASCI      to  WIC-DTNASCITA.
051213*-------------------Verifica data decesso                      *
           move  zeros           to  W-8CIFRE.
           move  O-DATMORTE      to  R-8STRINGA.
           if  W-8CIFRE   is  numeric
           then
               if  W-8CIFRE  >  zeros
               then  move  "Presente data decesso in ARCA   "
270114*                                    to  IC-COMPATTO
                                           to  W-CHK-CAMPI
                                               out-messaggio
      *            move  O-DATMORTE        to  IC-xxxxxxARCA
181213*            move  "S"  to  W-ERRORE
181213             move  W-8CIFRE          to  W-DATMORTE
               end-if
110523* Elena: asteriscate le istruzioni successive perchè costituisco-
      * no un blocco elaborativo in sviluppo e sono asteriscate sul
      * pdsna13
      *    else
      *        if  W-NIK  =  'S'
      *        then  move  'Data morte non decifrabile      '
      *                        to  IC-COMPATTO   W-CHK-CAMPI
      *        end-if
051213     end-if.
260723*------------------------------ Verifica titolarità            *
      * inserito controllo per verifica titolarità iban (come per Naspi)
           if  IC-DCOCOOBAN  not =  spaces
               perform  E312-TITOLARITA  thru  E312-EX
               if  W-ERRORE  =  'S'
                 then  go  to  E31-EX
               end-if
           end-if.
      *
       E31-EX.
           EXIT.
260723*------------------------------ Verifica titolarità            *
       E312-TITOLARITA.

           if  L-PROCEDURA  not =  'G05'
                 go  to  E312-EX
           end-if.
      *-------------------------   no x definite senza pagamento     *
           if  OC-DCOULESSP   =  'D'      and
               OC-SSTULASS    <   2.01
                 go  to  E312-EX
           end-if.

           initialize  LCFIB-INPUT
                       LCFIB-OUTPUT.
           STRING IC-DCOIBAN IC-DCOCOOBAN DELIMITED BY SIZE
                               INTO  LCFIB-IBAN
           move  IC-CODFISARCA   to  LCFIB-CF.

           call  PNBTCFIB
                   using  PNLKCFIB
           end-call.

           if  LCFIB-STATO   =  'OK'
               if  LCFIB-F-CERT  =  'S'
               or  LCFIB-F-CERT  =  'E'
                  continue
               else
                  move
                  'Titolarità CF-IBAN non verificata: vedi SCUP.     '
                                       to  W-CHK-CAMPI
                                           out-messaggio
090224                                     IC-COMPATTO
                   move  'S'  to  W-ERRORE
                   go  to  E312-EX
               end-if
           else
               move  LCFIB-DESCR   to  W-CHK-CAMPI
                                       out-messaggio
090224                                 IC-COMPATTO
               move  'S'  to  W-ERRORE
               go  to  E312-EX
           end-if.

       E312-EX.
           EXIT.
      *
       E33-DATI-APPOGGIO.
      *------------------------ ..dati da PIOxx41 a ADSAPIO0        *
           initialize  DCLTDSAPIO0.
           move  W-PROCEDURA    to  H-O0PROCEDURA .
           move  L-CODICE-STOP  to  H-O0DCOCENOPE .
           move  W8-ODIERNA     to  H-O0DATAELABO .
           move  IC-DOMANDA     to  H-O0DOMANDA .
           move  W-PROGRESSIVO  to  H-O0PROGRESSI .
           move  'N'            to  H-O0RECPAGATO .
           move  IC-COMPATTO    to  H-O0COMPATTO .
           move  WIC-ACQUISITO  to  H-O0ACQUISITO .
           move  IC-CODFISARCA  to  H-O0CFISCALE .
      *------------------------ .. dati comuni                      *
           move  IC-DCOCODFIS   to  H-O0DCOCODFIS .
           move  IC-DCOCOTIDO   to  H-O0DCOCOTIDO .
           move  IC-DCOCHIDOM   to  H-O0DCOCHIDOM .
           move  OC-DCOULESSP   to  H-O0DCOULESSP .
           move  W8-ODIERNA     to  H-O0DCODTULSP .
           move  IC-DCODTDECSP  to  H-O0DCODTDESP .
           move  IC-DCOCODPAT   to  H-O0DCOCODPAT .
           move  IC-DCOCOOBAN   to  H-O0DCOCOOBAN .
           move  OC-DCODTADEC   to  H-O0DCODTADEC .
           move  IC-DCOPESTDI   to  H-O0DCOPESTDI .
      *------------------------ .. dati sindacato                   *
      *    move  IC-DSICODSIN   to  H-O0DSICODSIN .
      *    move  IC-DSICATSIN   to  H-O0DSICATSIN .
      *------------------------ .. dati RECUPERI                    *
           move  IC-RECTOREEE-1 to  H-O0RECTOREE1 .
           move  OC-RECTORERE-1 to  H-O0RECTORER1
      *    move  IC-RECCOREAL-1 to  H-O0RECCOREA1 .
      *    move  IC-RECCORENU-1 to  H-O0RECCOREN1 .
           move  OC-RECIMUREE-1 to  H-O0RECIMURE1 .
      *
           move  IC-RECTOREEE-2 to  H-O0RECTOREE2 .
           move  OC-RECTORERE-2 to  H-O0RECTORER2
      *    move  IC-RECCOREAL-2 to  H-O0RECCOREA2 .
      *    move  IC-RECCORENU-2 to  H-O0RECCOREN2 .
           move  OC-RECIMUREE-2 to  H-O0RECIMURE2 .
      *
           move  IC-RECTOREEE-3 to  H-O0RECTOREE3 .
           move  OC-RECTORERE-3 to  H-O0RECTORER3
      *    move  IC-RECCOREAL-3 to  H-O0RECCOREA3 .
      *    move  IC-RECCORENU-3 to  H-O0RECCOREN3 .
           move  OC-RECIMUREE-3 to  H-O0RECIMURE3 .
      *------------------------------------- da ADSATTSU             *
           move  IC-ASUTIPPROG  to  H-O0SUTIPPRO .
           move  IC-ASULPU      to  H-O0SULPU  .
           move  IC-ASUFIN      to  H-O0SUFIN  .
           move  IC-ASUEDIL     to  H-O0SUEDIL .
           move  IC-ASUCFENTE   to  H-O0SUCFENTE .
           move  IC-ASUANNODEL  to  H-O0SUANNODEL .
           move  IC-ASUNUMDEL   to  H-O0SUNUMDEL .
           move  OC-ASUIMRIN    to  H-O0SUIMRIN .
           move  OC-ASUIMRINU   to  H-O0SUIMRINU .
           move  OC-ASURECRIN   to  H-O0SURECRIN .
           move  IC-ASUINCENT   to  H-O0SUINCENT .
      *
           move  OC-ASUIMINT    to  H-O0SUIMINT .
           move  OC-ASUINDEB    to  H-O0SUINDEB .
           move  OC-ASUIMANFT   to  H-O0SUIMANFT .
           move  OC-ASUGGCALC   to  H-O0SUGGCALC .
           move  OC-ASUMAGANFT  to  H-O0SUMAGANFT .
           move  OC-ASUULASS    to  H-O0SUULASS .
           move  OC-ASUIMASUT   to  H-O0SUIMASUT .
           move  OC-ASUANFASUT  to  H-O0SUANFASUT .
           move  OC-ASUMATASUT  to  H-O0SUMATASUT .
      *
           move  OC-ASUIMINU    to  H-O0SUIMINU .
           move  OC-ASUIMANFU   to  H-O0SUIMANFU .
           move  OC-ASUIRPEFU   to  H-O0SUIRPEFU .
           move  OC-ASUCONGFIS  to  H-O0SUCONGFIS .
           move  OC-ASUADDIZR   to  H-O0SUADDIZR .
           move  OC-ASUADDIZC   to  H-O0SUADDIZC .
           move  OC-ASUMAGANF   to  H-O0SUMAGANF .
           move  OC-ASUCONG730  to  H-O0SUCONG730 .
           move  OC-ASUTRASIND  to  H-O0SUTRASIND .
           move  OC-ASUTSCONF   to  H-O0SUTSCONF .
           move  OC-ASUTSCAT    to  H-O0SUTSCAT .
           move  OC-ASUADDIZRR  to  H-O0SUADDIZRR .
           move  OC-ASUADDIZRC  to  H-O0SUADDIZRC .
           move  OC-ASUTRASINR  to  H-O0SUTRASINR .
           move  OC-ASUIMASUU   to  H-O0SUIMASUU .
           move  OC-ASUANFASUU  to  H-O0SUANFASUU .
           move  OC-ASUMATASUU  to  H-O0SUMATASUU .
      *------------------------------------- da ADSLAVPU
           move  IC-LPUTIPPROG  to  H-O0PUTIPPROG .
           move  OC-LPUIMINT    to  H-O0PUIMINT .
           move  OC-LPUINDEB    to  H-O0PUINDEB .
           move  OC-LPUIMANFT   to  H-O0PUIMANFT .
           move  OC-LPUGGCALC   to  H-O0PUGGCALC .
           move  OC-LPUMAGANFT  to  H-O0PUMAGANFT .
           move  OC-LPUULASS    to  H-O0PUULASS .
      *
           move  OC-LPUIMINU    to  H-O0PUIMINU .
           move  OC-LPUIMANFU   to  H-O0PUIMANFU .
           move  OC-LPUIRPEFU   to  H-O0PUIRPEFU .
           move  OC-LPUCONGFIS  to  H-O0PUCONGFIS .
           move  OC-LPUADDIZR   to  H-O0PUADDIZR .
           move  OC-LPUADDIZC   to  H-O0PUADDIZC .
           move  OC-LPUMAGANF   to  H-O0PUMAGANF .
           move  OC-LPUCONG730  to  H-O0PUCONG730 .
           move  OC-LPUTRASIND  to  H-O0PUTRASIND .
           move  OC-LPUTSCONF   to  H-O0PUTSCONF .
           move  OC-LPUTSCAT    to  H-O0PUTSCAT .
      *------------------------------------- da ADSSUSST
           move  IC-SSTCODIND   to  H-O0SXCODIND .
      *
           move  OC-SSTIMINT    to  H-O0SXIMINT .
           move  OC-SSTINDEB    to  H-O0SXINDEB .
           move  OC-SSTGGCALC   to  H-O0SXGGCALC .
           move  OC-SSTULASS    to  H-O0SXULASS .
      *
           move  OC-SSTIMINU    to  H-O0SXIMINU .
           move  OC-SSTIRPEFU   to  H-O0SXIRPEFU .
           move  OC-SSTCONGFIS  to  H-O0SXCONGFIS .
           move  OC-SSTADDIZR   to  H-O0SXADDIZR .
           move  OC-SSTADDIZC   to  H-O0SXADDIZC .
           move  OC-SSTCONG730  to  H-O0SXCONG730 .
           move  OC-SSTTRASIND  to  H-O0SXTRASIND .
           move  OC-SSTTSCONF   to  H-O0SXTSCONF .
           move  OC-SSTTSCAT    to  H-O0SXTSCAT .
      *---------- x nuovo sussidio (marzo 2006)                      *
           move  IC-SSTREGIND   to  H-O0SXREGIND .
           move  IC-SSTANNIND   to  H-O0SXANNIND .
           move  OC-SSTIMRIN    to  H-O0SXIMRIN .
           move  OC-SSTIMRINU   to  H-O0SXIMRINU .
           move  OC-SSTRECRIN   to  H-O0SXRECRIN .
           move  OC-SSTIMANFT   to  H-O0SXIMANFT .
           move  OC-SSTIMANFU   to  H-O0SXIMANFU .
           move  OC-SSTADDIZRR  to  H-O0SXADDIZRR .
           move  OC-SSTADDIZRC  to  H-O0SXADDIZRC .
           move  OC-SSTTRASINR  to  H-O0SXTRASINR .
           move  IC-SSTDTAL1    to  H-O0SXDTAL1 .
           move  IC-SSTDTAL2    to  H-O0SXDTAL2 .
           move  OC-SSTNUML1    to  H-O0SXNUML1 .
           move  OC-SSTNUML2    to  H-O0SXNUML2 .
      *    move                 to             .
      *------------------------------------- Sezione dati fiscali    *
           move  OC-FACDAL      to  H-O0FACDAL .
           move  OC-FACAL       to  H-O0FACAL  .
           move  OC-FACGGPREST  to  H-O0FACGGPRES .
           move  OC-FACIMPONIBILE
                                to  H-O0FACIMPONI .
           move  OC-FACTREDICESIMA
                                to  H-O0FACTREDIC .
           move  OC-FACIMPLORDA to  H-O0FACIMPLOR .
           move  OC-FACGGDETRAZ to  H-O0FACGGDETR .
           move  OC-FACIMPDETRAZ
                                to  H-O0FACIMPDET .
           move  OC-FACIMPNETTA to  H-O0FACIMPNET .
      *
           move  OC-FAPDAL      to  H-O0FAPDAL .
           move  OC-FAPAL       to  H-O0FAPAL  .
           move  OC-FAPGGPREST  to  H-O0FAPGGPRES .
           move  OC-FAPIMPONIBILE
                                to  H-O0FAPIMPONI .
           move  OC-FAPTREDICESIMA
                                to  H-O0FAPTREDIC .
           move  OC-FAPALIQMEDIA
                                to  H-O0FAPALIQME .
           move  OC-FAPIMPLORDA to  H-O0FAPIMPLOR .
           move  OC-FAPGGDETRAZ to  H-O0FAPGGDETR .
           move  OC-FAPIMPDETRAZ
                                to  H-O0FAPIMPDET .
           move  OC-FAPIMPNETTA to  H-O0FAPIMPNET .
      *
           move  OC-FADINIZIO   to  H-O0FADINIZIO .
           move  OC-FADFINE     to  H-O0FADFINE .
           move  OC-FADANFPAGATI
                                to  H-O0FADANFPAG .
           move  OC-FADRECSUANF to  H-O0FADRECANF .
           move  OC-FADRECSUIND to  H-O0FADRECIND .
           move  OC-FADTRATSIND to  H-O0FADTRASIN .
           move  OC-FADNETTOPAG to  H-O0FADNETPAG .
      *
           move  OC-FCONGAC     to  H-O0FCONGAC .
           move  OC-FCONGAP     to  H-O0FCONGAP .
           move  OC-FIMPREGAC   to  H-O0FIMPREGAC .
           move  OC-FIMPREGAP   to  H-O0FIMPREGAP .
           move  OC-FIMPPROAC   to  H-O0FIMPPROAC .
           move  OC-FIMPPROAP   to  H-O0FIMPPROAP .
           move  OC-FCODCOMUN   to  H-O0FCODCOMUN .
           move  OC-FIMPCOMAC   to  H-O0FIMPCOMAC .
           move  OC-FIMPCOMAP   to  H-O0FIMPCOMAP .
      *
           move  OC-FCODPAGA1   to  H-O0FCODPAGA1 .
           move  OC-FIMPPAGA1   to  H-O0FIMPPAGA1 .
           move  OC-FCODPAGA2   to  H-O0FCODPAGA2 .
           move  OC-FIMPPAGA2   to  H-O0FIMPPAGA2 .
           move  OC-FCODPAGA3   to  H-O0FCODPAGA3 .
           move  OC-FIMPPAGA3   to  H-O0FIMPPAGA3 .
      *
           move  OC-FACIMPDETRFAM
                                to  H-O0FACDETFAM .
           move  OC-FACIMPDETRLAV
                                to  H-O0FACDETLAV .
      *---------------------------------5.5.2005 Campi x contabilizz.*
           move  OC-CODICE1     to  H-O0CODICE1 .
           move  OC-IMPORTO1    to  H-O0IMPORTO1 .
           move  OC-CODICE2     to  H-O0CODICE2 .
           move  OC-IMPORTO2    to  H-O0IMPORTO2 .
           move  OC-CODICE3     to  H-O0CODICE3 .
           move  OC-IMPORTO3    to  H-O0IMPORTO3 .
           move  OC-CODICE4     to  H-O0CODICE4 .
           move  OC-IMPORTO4    to  H-O0IMPORTO4 .
           move  OC-CODICE5     to  H-O0CODICE5 .
           move  OC-IMPORTO5    to  H-O0IMPORTO5 .
           move  OC-CODICE6     to  H-O0CODICE6 .
           move  OC-IMPORTO6    to  H-O0IMPORTO6 .
       E33-EX.
           EXIT.
      *
      *
       E35-UPD-FILE.
      *-------------------------------------- Riscrivo DATICOMUNI    *
           if  WL-DATICOMUNI  =  'S'
           then
               perform  E39-UPD-DATICOMUNI     thru  E39-EX
           else
               go  to  E35-EX
           end-if.
      *--------------------------- rivedere: SERVE ???               *
      *    if  W-FINE-ELABORA     =  'S'   or
      *        W-FINE-INTERVALLO  =  'S'
      *    then
      *        go  to  E35-EX
      *    end-if.
      *-------------------------------------- Riscrivo RECUPERI      *
           if  WL-RECUPERI  =  'S'
           then
               perform  E43-UPD-RECUPERI       thru  E43-EX
           end-if.
      *-------------------------------------- Scrivo   EFFEROGATI    *
           if  (W-CODICEDUE    =  '42'       or
                W-CODICEDUE    =  '45')      and
      *         OC-DCOULESSP   =  'D'
      * 09/05/2018
               (OC-DCOULESSP   =  'D'        or
                IC-SSTCODIND       =  'CRED' or
                IC-SSTCODIND       =  'FTAD' or
270324          IC-SSTCODIND       =  'FSAD' or
                IC-SSTCODIND       =  'FTMD')
           then
               perform  E45-DLT-EFFEROGATI     thru  E45-EX
               perform  E46-WRT-EFFEROGATI     thru  E46-EX
           end-if.
      *-------------------------------------- Riscrivo SITUAZIONE    *
           if  WL-SITUAZIODO  =  'S'
           then
               perform  E47-UPD-SITUAZIODO     thru  E47-EX
           end-if.
      *-------------------------------------- Riscrivo Assegno ASU   *
           if  W-CODICEDUE    =  '42'   and
               WL-FILE51      =  'S'
           then
               perform  E51-UPD-FILE51         thru  E51-EX
      *        if  (IC-ASUCFENTE   not  =  zeros)   and
      *            (IC-ASUANNODEL  not  =  zeros)   and
      *            (IC-ASUNUMDEL   not  =  zeros)
               if  (OC-CFENTEP     not  =  zeros)   and
                   (OC-ANNODELIBP  not  =  zeros)   and
                   (OC-NUMDELIBP   not  =  zeros)
100419       and
                   (OC-IMPASUF  >  0   or
                    OC-IMPANFF  >  0   or
                    OC-IMPMATF  >  0   or
                    OC-IMPASUE  >  0   or
                    OC-IMPANFE  >  0   or
100419              OC-IMPMATE  >  0 )
               then
                   perform  E47A-UPD-FILE47    thru  E47A-EX
                   perform  E48-UPD-FILE48     thru  E48-EX
                   perform  E49-UPD-FILE49     thru  E49-EX
               end-if
           end-if.
      *-------------------------------------- Riscrivo Assegno LPU   *
           if  W-CODICEDUE    =  '44'   and
               WL-FILE52      =  'S'
           then
               perform  E52-UPD-FILE52         thru  E52-EX
           end-if.
      *-------------------------------------- Riscrivo Suss. Straord.*
           if  W-CODICEDUE    =  '45'   and
               WL-FILE53      =  'S'
           then
               perform  E53-UPD-FILE53         thru  E53-EX
      *        if  (OC-CODFIS         >  zeros)    and
      *            (OC-NOMEENTE  not  =  spaces)
               if  (OC-CFENTEP     not  =  zeros)   and
                   (OC-ANNODELIBP  not  =  zeros)   and
                   (OC-NUMDELIBP   not  =  zeros)
               then
                   perform  E40-UPD-FILE40     thru  E40-EX
                   perform  E42-UPD-FILE42     thru  E42-EX
                   perform  E47S-UPD-FILE47    thru  E47S-EX
                   perform  E48-UPD-FILE48     thru  E48-EX
                   perform  E49-UPD-FILE49     thru  E49-EX
               end-if
           end-if.
      *-------------------------------------- Scrivo storico ANF     *
           if  IC-ANFDTDEVA(1)  >  zeros
           then
               perform  E55-WRT-STOANF         thru  E55-EX
           end-if.
      *-------------------------------------- Scrivo storico SOS     *
           if  IC-SOSDTINSOS(1)  >  zeros
           then
               perform  E56-WRT-STOSOS         thru  E56-EX
           end-if.
      *-------------------------------------- incremento ctr-calcolat*
           if  FLG-COMMIT  =  'S'
           then
               add   1   to  CTR-SCR-APPO
           end-if.
       E35-EX.
           EXIT.
      *
       E39-UPD-DATICOMUNI.
           move  OC-DCOULESSP  TO  H-DCOULESSP .
           move  W8-ODIERNA    TO  H-DCODTULSP .
           move  'N'           TO  H-DCOTRDOCE .
           move  OC-DCODTADEC  TO  H-DCODTADEC .
           move  'N'           TO  H-DCOTRDODO .
           PERFORM E39-DB2-COM-UPD THRU E39-DB2-COM-UPD-EX.
       E39-EX.
           EXIT.
      *
      *
       E40-UPD-FILE40.
           initialize  DCLTDSASU.
           move  OC-CODFIS      to  CODFIS     OF DCLTDSASU.
           move  OC-NOMEENTE    to  NOMEENTE   OF DCLTDSASU.
GGA001*    move  IC-CFPRINC     to  CFPRINC    OF DCLTDSASU.
GGA001*    move  IC-NOMEFIN     to  NOMEFIN    OF DCLTDSASU.
           MOVE  H-O0DATAELABO  TO  W8-AAAAMMGG .
           PERFORM CAMBIADATA-DA8-A10     THRU CAMBIADATA-DA8-A10-EX.
           move WK-DATA-APPOGGIO to DATRAS     OF DCLTDSASU.
           move  OC-NOMEENTE    to  NOMEENTE   .
           MOVE '31'            TO  WW-DB2-GG.
           MOVE '12'            TO  WW-DB2-MM.
           MOVE '9999'          TO  WW-DB2-AA.
           MOVE WK-DB2-DATA     TO  CONVDATA
                                    CONVDAL
                                    CONVAL.
           PERFORM E40-DB2-FI40-INS THRU E40-DB2-FI40-INS-EX.
       E40-EX.
           EXIT.
      *
       E42-UPD-FILE42.
           initialize  DCLTDSASU2.
           move  IC-PROGCTG     to  CODFIS OF DCLTDSASU2.
           MOVE  H-O0DATAELABO            TO   W8-AAAAMMGG .
           PERFORM CAMBIADATA-DA8-A10     THRU CAMBIADATA-DA8-A10-EX.
           move WK-DATA-APPOGGIO to DATRAS OF DCLTDSASU2.
           move  1              to  ANNODEL OF DCLTDSASU2.
           move  1              to  NUMDEL  OF DCLTDSASU2.
           move  0              to  CODFIN  OF DCLTDSASU2.
           move '01.01.2004'    to  ASUINI .
           move '31.12.2999'    to  ASUFIN .
           MOVE '31'            TO  WW-DB2-GG.
           MOVE '12'            TO  WW-DB2-MM.
           MOVE '9999'          TO  WW-DB2-AA.
           MOVE WK-DB2-DATA     TO  PAGFINOA
                                    DATAREND .
           move '01.01.2004'    to  DATDEL  OF DCLTDSASU2.
           PERFORM E42-DB2-FI42-INS THRU E42-DB2-FI42-INS-EX.
       E42-EX.
           EXIT.
      *
       E43-UPD-RECUPERI.
           if  OC-RECIMUREE-1  =  zeroes   and
               OC-RECIMUREE-2  =  zeroes   and
               OC-RECIMUREE-3  =  zeroes
           then
               go  to  E43-EX
           end-if.
      *
           move  IC-DCOCHIDOM  to H-RECCHIDOM .
           move  zeros         to H-RECPROREC .
      *
           PERFORM  E43-DB2-DECL-CURS    THRU  E43-DB2-DECL-CURS-EX.
      *
           move  zeros  to  NDC2.
           perform  varying  NDC1  from  1  by  1
                      until  NDC1  >  99
      *
            PERFORM  E43-DB2-FETCH    THRU  E43-DB2-FETCH-EX
      *
            IF SQLCODE =    0
               move  'S'         to  WL-TABPIENA
               if  H-RECCHIDOM     is  equal IC-DCOCHIDOM
               then
                   perform E44-UPD-IMPORTI    thru E44-EX
                   if  OC-RECIMUREE-1  =  zeroes   and
                       OC-RECIMUREE-2  =  zeroes   and
                       OC-RECIMUREE-3  =  zeroes
                   then
                       PERFORM                                          CUR4
                          REC43-DB2-CLSCUR THRU REC43-DB2-CLSCUR-EX     CUR4
                       move  111    to  NDC1
                   end-if
               else
                   PERFORM                                              CUR4
                       REC43-DB2-CLSCUR THRU REC43-DB2-CLSCUR-EX        CUR4
                       move  111    to  NDC1
               end-if

             ELSE
               PERFORM                                                  CUR4
                   REC43-DB2-CLSCUR THRU REC43-DB2-CLSCUR-EX            CUR4
               move  111    to  NDC1
             END-IF
           end-perform.
      *------------------------------------- per i recuperi migrati  *
           if  OC-RECIMUREE-1  <  0.0100
           then
               move  zeroes   to  OC-RECIMUREE-1
           end-if.
           if  OC-RECIMUREE-2  <  0.0100
           then
               move  zeroes   to  OC-RECIMUREE-2
           end-if.
           if  OC-RECIMUREE-3  <  0.0100
           then
               move  zeroes   to  OC-RECIMUREE-3
           end-if.
      *------------------------------------------------ a regime     *
           if  OC-RECIMUREE-1  =  zeroes   and
               OC-RECIMUREE-2  =  zeroes   and
               OC-RECIMUREE-3  =  zeroes
           then
               continue
           else
               move  'N'     to  FLG-COMMIT
               move  'KO-START  '       to  S2A005
               move  'ADSRECUP  '       to  S2A006
               move  FST-ADSRECUP       to  S2A007
               perform  S10-STAMPA     thru  S10-EX
            end-if.
           IF WL-TABPIENA = 'N'
               move  'N'                to  FLG-COMMIT
               move  'KO-START  '       to  S2A005
               move  'ADSRECUP  '       to  S2A006
               move  FST-ADSRECUP       to  S2A007
               perform  S10-STAMPA     thru  S10-EX
           ELSE
               move  'N'                to  WL-TABPIENA
           END-IF.
      *
       E43-EX.
           EXIT.
      *
       E44-UPD-IMPORTI.
           if  H-RECTORERE                 =  zeroes
           then
               go  to  E44-EX
           end-if.
      *----------------------------------------- Recuperi Indennità  *
           if  OC-RECIMUREE-1  >  zeroes
           then
               if  (H-RECCAUREC                =  '1')   and
                   (H-RECTIPREC                =  'R')
               then
                   if  H-RECTORERE                =  OC-RECIMUREE-1
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-1
                                         to H-RECIMUREE
                       move  zeroes      to H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-1
                   end-if
                   if  H-RECTORERE                >  OC-RECIMUREE-1
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-1
                                         to H-RECIMUREE
                       subtract  OC-RECIMUREE-1
                                       from H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-1
                   end-if
                   if  H-RECTORERE                <  OC-RECIMUREE-1
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move H-RECTORERE
                                         to H-RECIMUREE
                       subtract H-RECTORERE
                                       from  OC-RECIMUREE-1
                       move  zeroes      to H-RECTORERE
                   end-if
               end-if
           end-if.
      *----------------------------------------- Recuperi/acconti ANF*
           if  OC-RECIMUREE-2  >  zeroes
           then
               if  H-RECCAUREC                =  '2'
               then
                   if  H-RECTORERE                =  OC-RECIMUREE-2
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-2
                                         to H-RECIMUREE
                       move  zeroes      to H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-2
                   end-if
                   if  H-RECTORERE                >  OC-RECIMUREE-2
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-2
                                         to H-RECIMUREE
                       subtract  OC-RECIMUREE-2
                                       from H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-2
                   end-if
                   if  H-RECTORERE                <  OC-RECIMUREE-2
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move H-RECTORERE
                                         to H-RECIMUREE
                       subtract H-RECTORERE
                                       from  OC-RECIMUREE-2
                       move  zeroes      to H-RECTORERE
                   end-if
               end-if
           end-if.
      *----------------------------------------- Acconto indennità   *
           if  OC-RECIMUREE-3  >  zeroes
           then
      *        if  H-RECTIPREC                =  'A'
               if  (H-RECCAUREC  =  "1")   and
                   (H-RECTIPREC  =  "A")
               then
                   if  H-RECTORERE                =  OC-RECIMUREE-3
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-3
                                         to H-RECIMUREE
                       move  zeroes      to H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-3
                   end-if
                   if  H-RECTORERE                >  OC-RECIMUREE-3
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move  OC-RECIMUREE-3
                                         to H-RECIMUREE
                       subtract  OC-RECIMUREE-3
                                       from H-RECTORERE
                       move  zeroes      to  OC-RECIMUREE-3
                   end-if
                   if  H-RECTORERE                <  OC-RECIMUREE-3
                   then
                       move  W8-ODIERNA  to H-RECDTESRE
                       move H-RECTORERE
                                         to H-RECIMUREE
                       subtract H-RECTORERE
                                       from  OC-RECIMUREE-3
                       move  zeroes      to H-RECTORERE
                   end-if
               end-if
           end-if.
      *------------------------------------- scrivo  storico REC   --*
           if  H-RECIMUREE    >  zeros      and
               H-RECDTESRE    =  W8-ODIERNA
           then
               perform  E441-WRT-STOREC  thru  E441-EX
           end-if.
      *--------------------------------------------- Aggiornamento
           PERFORM E44-DB2-REC-UPD THRU E44-DB2-REC-UPD-EX.
       E44-EX.
           EXIT.
      *
       E441-WRT-STOREC.
           move  'N'  to  LC-RETCODE.
      *
           call  PDSPD07 USING
                         WDFHEIBLK  WDFHCOMMAREA
                                   L-CODICE-SEDE
                                   W-PROCEDURA
                                   L-CODICE-STOP
                                   W8-ODIERNA
                                   IC-DOMANDA
                                   W-PROGRESSIVO
                                   IC-DCOCODFIS
                                   IC-DCOCHIDOM
                                   H-RECPROREC
                                   H-RECTOREEE
                                   H-RECTORERE
                                   H-RECCOREAL
                                   H-RECCORENU
                                   H-RECCAUREC
                                   H-RECTIPREC
                                   H-RECIMUREE
                                   LC-RETCODE
           end-call.
           cancel  PDSPD07 .
       E441-EX.
           EXIT.
      *
       E45-DLT-EFFEROGATI.
      *
           move  IC-DCOCHIDOM      to  H-PEECHIDOM .
           PERFORM E45-DB2-DELETE  THRU E45-DB2-DELETE-EX.
      *
       E45-EX.
           EXIT.
      *
       E46-WRT-EFFEROGATI.
      *--------------------------------- Seconda prestazione         *
           perform  varying  N1  from  1  by  1
             until  (OC-PEEPEERED(N1)  =  zeros
                or   N1  >  400)
             move  IC-DCOCODFIS       to H-PEECODFIS
             move  IC-DCOCHIDOM       to H-PEECHIDOM
             move  OC-PEEPEERED(N1)   to H-PEEPEERED
             move  W-CODICEDUE        to H-PEECOTIPR
             move  OC-PEEPEEREA(N1)   to H-PEEPEEREA
             move  OC-PEENUGIEE(N1)   to H-PEENUGIEE
      *
             PERFORM E46-DB2-EFFE-INS THRU E46-DB2-EFFE-INS-EX
           end-perform.
       E46-EX.
           EXIT.
      *
       E47-UPD-SITUAZIODO.
      *    move  W8-ODIERNA     to H-STDDTMOPRU .
      *    move  OC-DCOULESPP   to H-STDESITPRU .
           move  W8-ODIERNA     to H-STDDTMOPRD .
           move  OC-DCOULESSP   to H-STDESITPRD .
           PERFORM E47-DB2-SIT-UPD THRU E47-DB2-SIT-UPD-EX.
       E47-EX.
           EXIT.
      *
       E47A-UPD-FILE47.
      *---------------------------------------- Relativo ad ASU      *
           initialize  DCLTDSLIST.
           move  IC-CODFIS      to  CODFIS  OF DCLTDSLIST.
           move  IC-ANNODELIB   to  ANNODEL OF DCLTDSLIST.
           move  IC-NUMDELIB    to  NUMDEL  OF DCLTDSLIST.
           move  IC-DCOCODFIS   to  CFLAV   OF DCLTDSLIST.
           PERFORM E47A-DB2-SELECT THRU E47A-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
GGA001         move  IC-CODFIND     to  CODFIN OF DCLTDSLIST
               MOVE  H-O0DATAELABO  TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               move WK-DATA-APPOGGIO to    DATRAS OF DCLTDSLIST
               PERFORM E47A-DB2-FI47-INS  THRU
                       E47A-DB2-FI47-INS-EX
           ELSE
      *GG      if  (SITUAZL         T           =  'A')   or
               IF  (CODFIN OF DCLTDSLIST   not  =  IC-CODFIND)
               then
                   move  IC-CODFIND   to  CODFIN OF DCLTDSLIST
      *GG          move  zeroes       to  FLAGTL
      *GG          move  spaces       to  SITUAZL
      *GG          move  spaces       to  CAMPOL
                   PERFORM E47A-DB2-FI47-UPD THRU
                           E47A-DB2-FI47-UPD-EX
               end-if
           end-IF.
       E47A-EX.
           EXIT.
      *
       E47S-UPD-FILE47.
      *---------------------------------------- Relativo al Suss.Str.*
           initialize  DCLTDSLIST.
           move  IC-PROGCTG     to  CODFIS  OF DCLTDSLIST.
           move  1              to  ANNODEL OF DCLTDSLIST.
           move  1              to  NUMDEL  OF DCLTDSLIST.
           move  IC-DCOCODFIS   to  CFLAV   OF DCLTDSLIST.
           PERFORM E47S-DB2-SELECT THRU E47S-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               move  zeroes         to  CODFIN  OF DCLTDSLIST
GGA001         MOVE  H-O0DATAELABO  TO   W8-AAAAMMGG
GGA001         PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
GGA001         move WK-DATA-APPOGGIO to    DATRAS OF DCLTDSLIST
               PERFORM  E47S-DB2-FI47-INS THRU E47S-DB2-FI47-INS-EX
             ELSE
      *        if  SITUAZ OF DCLTDSLIST        =  'A'
      *        then
                   move  zeroes       to  CODFIN OF DCLTDSLIST
      *GG          move  zeroes       to  FLAGTL
      *GG          move  spaces       to  SITUAZL
      *GG          move  spaces       to  CAMPOL
                   PERFORM E47S-DB2-FI47-UPD THRU
                           E47S-DB2-FI47-UPD-EX
      *        end-if
           end-IF.
       E47S-EX.
           EXIT.
      *
       E48-UPD-FILE48.
           initialize  DCLTDSLAV.
           move  IC-DCOCODFIS   to    CFLAV  OF DCLTDSLAV.
      *  errata: corretta da Mongelli il 02.05.2005
      *    move  IC-CODFIS      to    CFLAV OF DCLTDSLAV.
           PERFORM E48-DB2-SELECT THRU E48-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               move  WIC-COGNOME    to    COGNOME OF DCLTDSLAV
               move  WIC-NOME       to    NOME    OF DCLTDSLAV
      *        move  WIC-DTNASCITA  to    DATNASC OF DCLTDSLAV
               move  WIC-DTNASCITA  TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE WK-DATA-APPOGGIO      TO   DATNASC OF DCLTDSLAV
               move  spaces         to    CODPROV OF DCLTDSLAV
               move  zeroes         to    IMPORTO OF DCLTDSLAV
               MOVE  H-O0DATAELABO  TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               move  WK-DATA-APPOGGIO to    DATRAS OF DCLTDSLAV
               PERFORM E48-DB2-FI48-INS THRU E48-DB2-FI48-INS-EX
             ELSE
               IF  (CODPROV OF DCLTDSLAV   not  =  spaces)    or
                   (DATNASC OF DCLTDSLAV   not  =  WIC-DTNASCITA)
               then
      *            move  WIC-DTNASCITA  to  DATNASC OF DCLTDSLAV
                   move  WIC-DTNASCITA  TO   W8-AAAAMMGG
           PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
                   MOVE WK-DATA-APPOGGIO TO  DATNASC OF DCLTDSLAV
                   move  spaces         to  CODPROV OF DCLTDSLAV
                   move  zeroes         to  IMPORTO OF DCLTDSLAV
                   PERFORM E48-DB2-FI48-UPD THRU
                           E48-DB2-FI48-UPD-EX
               end-if
           end-IF.
       E48-EX.
           EXIT.
      *
       E49-UPD-FILE49.
           initialize  DCLTDSPAG.
           move  OC-CFENTEP     to  CODFIS  OF DCLTDSPAG.
           move  OC-ANNODELIBP  to  ANNODEL OF DCLTDSPAG.
           move  OC-NUMDELIBP   to  NUMDEL  OF DCLTDSPAG.
           move  IC-DCOCODFIS   to  CFLAV   OF DCLTDSPAG.
      *    move  OC-DATAULPAG   to  DATULTGM OF DCLTDSPAG.
           MOVE  OC-DATAULPAG   TO   W8-AAAAMMGG .
           PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX.
           MOVE    WK-DATA-APPOGGIO   TO DATULTGM OF DCLTDSPAG.
           move  IC-CODSEDE     to  CODSAP  OF DCLTDSPAG.
      *    move  OC-DATAPAGP    to  DATULT   OF DCLTDSPAG.
           MOVE  OC-DATAPAGP    TO   W8-AAAAMMGG .
           PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX.
           MOVE    WK-DATA-APPOGGIO    TO DATULT   OF DCLTDSPAG.
           move  OC-IMPASUF     to  ASUFONDO OF DCLTDSPAG.
           compute ASUFONDO OF DCLTDSPAG =
                   ASUFONDO OF DCLTDSPAG * 0.01.
           move  OC-IMPANFF     to  ANFFONDO OF DCLTDSPAG.
           compute ANFFONDO OF DCLTDSPAG =
                   ANFFONDO OF DCLTDSPAG * 0.01.
           move  OC-IMPMATF     to  MATFONDO OF DCLTDSPAG.
           compute MATFONDO OF DCLTDSPAG =
                   MATFONDO OF DCLTDSPAG * 0.01.
           move  OC-IMPASUE     to  ASUENTE OF DCLTDSPAG.
           compute ASUENTE  OF DCLTDSPAG =
                   ASUENTE  OF DCLTDSPAG * 0.01.
           move  OC-IMPANFE     to  ANFENTE OF DCLTDSPAG.
           compute ANFENTE  OF DCLTDSPAG =
                   ANFENTE  OF DCLTDSPAG * 0.01.
           move  OC-IMPMATE     to  MATENTE OF DCLTDSPAG.
           compute MATENTE  OF DCLTDSPAG =
                   MATENTE  OF DCLTDSPAG * 0.01.
      *
           move  OC-COD1        to  CODPER1         .
      *
           if    OC-DATADAL1 > 0
           then
               MOVE  OC-DATADAL1          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO   TO   DATDAL1
               MOVE  OC-DATAAL1                TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO   TO   DATAL1
           ELSE
               MOVE '01.01.0001'          TO   DATDAL1 DATAL1
           END-IF.
      *
           move  OC-COD2        to  CODPER2         .
      *
           if    OC-DATADAL2 > 0
           then
               MOVE  OC-DATADAL2          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL2
               MOVE  OC-DATAAL2           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL2
           ELSE
                MOVE '01.01.0001'           TO DATDAL2 DATAL2
           END-IF.
      *
           move  OC-COD3        to  CODPER3         .
      *
           if    OC-DATADAL3 > 0
           then
               MOVE  OC-DATADAL3          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL3
               MOVE  OC-DATAAL3           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL3
           ELSE
                MOVE '01.01.0001'           TO DATDAL3 DATAL3
           END-IF.
      *
           move  OC-COD4        to  CODPER4         .
      *
           if    OC-DATADAL4 > 0
           then
               MOVE  OC-DATADAL4          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL4
               MOVE  OC-DATAAL4           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL4
           ELSE
                MOVE '01.01.0001'           TO DATDAL4 DATAL4
           END-IF.
      *
           move  OC-COD5        to  CODPER5         .
      *
           if    OC-DATADAL5 > 0
           then
               MOVE  OC-DATADAL5          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL5
               MOVE  OC-DATAAL5           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL5
           ELSE
                MOVE '01.01.0001'           TO DATDAL5 DATAL5
           END-IF.
      *
           move  OC-COD6        to  CODPER6         .
      *
           if    OC-DATADAL6 > 0
           then
               MOVE  OC-DATADAL6          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL6
               MOVE  OC-DATAAL6           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL6
           ELSE
                MOVE '01.01.0001'           TO DATDAL6 DATAL6
           END-IF.
      *
           move  OC-COD7        to  CODPER7         .
      *
           if    OC-DATADAL7 > 0
           then
               MOVE  OC-DATADAL7          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL7
               MOVE  OC-DATAAL7           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL7
           ELSE
                MOVE '01.01.0001'           TO DATDAL7 DATAL7
           END-IF.
      *
           move  OC-COD8        to  CODPER8         .
      *
           if    OC-DATADAL8 > 0
           then
               MOVE  OC-DATADAL8          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL8
               MOVE  OC-DATAAL8           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL8
           ELSE
                MOVE '01.01.0001'           TO DATDAL8 DATAL8
           END-IF.
      *
           move  OC-COD9        to  CODPER9         .
      *
           if    OC-DATADAL9 > 0
           then
               MOVE  OC-DATADAL9          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL9
               MOVE  OC-DATAAL9           TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL9
           ELSE
                MOVE '01.01.0001'           TO DATDAL9 DATAL9
           END-IF.
      *
           move  OC-COD10       to  CODPER10        .
      *
           if    OC-DATADAL10 > 0
           then
               MOVE  OC-DATADAL10         TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE  WK-DATA-APPOGGIO     TO   DATDAL10
               MOVE  OC-DATAAL10          TO   W8-AAAAMMGG
               PERFORM CAMBIADATA-DA8-A10 THRU CAMBIADATA-DA8-A10-EX
               MOVE    WK-DATA-APPOGGIO         TO   DATAL10
           ELSE
                MOVE '01.01.0001'           TO DATDAL10 DATAL10
           END-IF.
      *
           MOVE  H-O0DATAELABO              TO   W8-AAAAMMGG .
           PERFORM CAMBIADATA-DA8-A10     THRU CAMBIADATA-DA8-A10-EX.
           move WK-DATA-APPOGGIO to    DATRAS OF DCLTDSPAG.
           PERFORM E49-DB2-FI49-INS THRU E49-DB2-FI49-INS-EX.
       E49-EX.
           EXIT.
      *
       E51-UPD-FILE51.
           move  OC-ASUDADEC    to  H-ASUDADEC .
      *----------------------------------- Sezione rinuncia         -*
           move  OC-ASUIMRIN    to  H-ASUIMRIN .
           move  OC-ASUIMRINU   to  H-ASUIMRINU .
           move  OC-ASURECRIN   to  H-ASURECRIN .
      *    move  IC-ASUINCENT   to  H-ASUINCENT .
      *----------------------------- Sezione pagamenti complessivi  -*
           move  OC-ASUIMINT    to  H-ASUIMINT .
           move  OC-ASUINDEB    to  H-ASUINDEB .
           move  OC-ASUIMANFT   to  H-ASUIMANFT .
           move  OC-ASUGGCALC   to  H-ASUGGCALC .
           move  OC-ASUMAGANFT  to  H-ASUMAGANFT .
           move  OC-ASUULASS    to  H-ASUULASS .
           move  OC-ASUIMASUT   to  H-ASUIMASUT .
           move  OC-ASUANFASUT  to  H-ASUANFASUT .
           move  OC-ASUMATASUT  to  H-ASUMATASUT .
      *----------------------------- Sezione ultimo pagamento       -*
           move  OC-ASUIMINU    to  H-ASUIMINU .
           move  OC-ASUIMANFU   to  H-ASUIMANFU .
           move  OC-ASUIRPEFU   to  H-ASUIRPEFU .
           move  OC-ASUCONGFIS  to  H-ASUCONGFIS .
           move  OC-ASUADDIZR   to  H-ASUADDIZR .
           move  OC-ASUADDIZC   to  H-ASUADDIZC .
           move  OC-ASUMAGANF   to  H-ASUMAGANF .
           move  OC-ASUCONG730  to  H-ASUCONG730 .
           move  OC-ASUTRASIND  to  H-ASUTRASIND .
           move  OC-ASUTSCONF   to  H-ASUTSCONF .
           move  OC-ASUTSCAT    to  H-ASUTSCAT .
           move  OC-ASUADDIZRR  to  H-ASUADDIZRR .
           move  OC-ASUADDIZRC  to  H-ASUADDIZRC .
           move  OC-ASUTRASINR  to  H-ASUTRASINR .
           move  OC-ASUIMASUU   to  H-ASUIMASUU .
           move  OC-ASUANFASUU  to  H-ASUANFASUU .
           move  OC-ASUMATASUU  to  H-ASUMATASUU .
      *
           PERFORM E51-DB2-FI51-UPD THRU E51-DB2-FI51-UPD-EX.
       E51-EX.
           EXIT.
      *
       E52-UPD-FILE52.
           move  OC-LPUDADEC    to  H-LPUDADEC .
      *----------------------------- Sezione pagamenti complessivi  -*
           move  OC-LPUIMINT    to  H-LPUIMINT .
           move  OC-LPUINDEB    to  H-LPUINDEB .
           move  OC-LPUIMANFT   to  H-LPUIMANFT .
           move  OC-LPUGGCALC   to  H-LPUGGCALC .
           move  OC-LPUMAGANFT  to  H-LPUMAGANFT.
           move  OC-LPUULASS    to  H-LPUULASS .
      *----------------------------- Sezione ultimo pagamento       -*
           move  OC-LPUIMINU    to  H-LPUIMINU .
           move  OC-LPUIMANFU   to  H-LPUIMANFU .
           move  OC-LPUIRPEFU   to  H-LPUIRPEFU .
           move  OC-LPUCONGFIS  to  H-LPUCONGFIS.
           move  OC-LPUADDIZR   to  H-LPUADDIZR .
           move  OC-LPUADDIZC   to  H-LPUADDIZC .
           move  OC-LPUMAGANF   to  H-LPUMAGANF .
           move  OC-LPUCONG730  to  H-LPUCONG730.
           move  OC-LPUTRASIND  to  H-LPUTRASIND.
           move  OC-LPUTSCONF   to  H-LPUTSCONF .
           move  OC-LPUTSCAT    to  H-LPUTSCAT .
      *
           PERFORM E52-DB2-FI52-UPD THRU E52-DB2-FI52-UPD-EX.
       E52-EX.
           EXIT.
      *
       E53-UPD-FILE53.
      *----------------------------- Sezione pagamenti complessivi  -*
           move  OC-SSTIMINT    to  H-SSTIMINT .
           move  OC-SSTINDEB    to  H-SSTINDEB .
           move  OC-SSTGGCALC   to  H-SSTGGCALC .
           move  OC-SSTULASS    to  H-SSTULASS .
      *----------------------------- Sezione ultimo pagamento       -*
           move  OC-SSTIMINU    to  H-SSTIMINU .
           move  OC-SSTIRPEFU   to  H-SSTIRPEFU .
           move  OC-SSTCONGFIS  to  H-SSTCONGFIS .
           move  OC-SSTADDIZR   to  H-SSTADDIZR .
           move  OC-SSTADDIZC   to  H-SSTADDIZC .
           move  OC-SSTCONG730  to  H-SSTCONG730 .
           move  OC-SSTTRASIND  to  H-SSTTRASIND .
           move  OC-SSTTSCONF   to  H-SSTTSCONF .
           move  OC-SSTTSCAT    to  H-SSTTSCAT .
      *----------------------------- Sezione nuovo sussidio mar.2006-*
           move  OC-SSTIMRIN    to  H-SSTIMRIN .
           move  OC-SSTIMRINU   to  H-SSTIMRINU .
           move  OC-SSTRECRIN   to  H-SSTRECRIN .
           move  OC-SSTIMANFT   to  H-SSTIMANFT .
           move  OC-SSTIMANFU   to  H-SSTIMANFU .
           move  OC-SSTADDIZRR  to  H-SSTADDIZRR .
           move  OC-SSTADDIZRC  to  H-SSTADDIZRC .
           move  OC-SSTTRASINR  to  H-SSTTRASINR .
           move  OC-SSTNUML1    to  H-SSTNUML1 .
           move  OC-SSTNUML2    to  H-SSTNUML2 .
           move  OC-SSTRETSET   to  H-SSTRETSET.
      *
           PERFORM E53-DB2-FI53-UPD THRU E53-DB2-FI53-UPD-EX.
       E53-EX.
           EXIT.
      *
       E55-WRT-STOANF.
           move  'N'  to  LC-RETCODE.
      *
           call  PDSPD04 using
                        WDFHEIBLK  WDFHCOMMAREA
                                   L-CODICE-SEDE
                                   W-PROCEDURA
                                   L-CODICE-STOP
                                   W8-ODIERNA
                                   IC-DOMANDA
                                   W-PROGRESSIVO
                                   IC-DCOCODFIS
                                   IC-DCOCHIDOM
      *I------------------------------- new dal 23/07/2013           *
      *                            IC-TAB-ANF
                                   LC-TAB-ANF
      *F------------------------------- new dal 23/07/2013           *
                                   LC-RETCODE
           end-call.
           cancel  PDSPD04 .
       E55-EX.
           EXIT.
      *
       E56-WRT-STOSOS.
           move  'N'  to  LC-RETCODE.
      *
           call  PDSPD06     USING
                           WDFHEIBLK  WDFHCOMMAREA
                                   L-CODICE-SEDE
                                   W-PROCEDURA
                                   L-CODICE-STOP
                                   W8-ODIERNA
                                   IC-DOMANDA
                                   W-PROGRESSIVO
                                   IC-DCOCODFIS
                                   IC-DCOCHIDOM
                                   IC-TAB-SOSPE
                                   LC-RETCODE
           end-call.
           cancel  PDSPD06 .
       E56-EX.
           EXIT.
      *
       E60-SINCRONIZZO.
      *----------------------------------- Lista controllo
           if  L-TIPOCALCOLO  =  'S'
           then
 GGAS *    EXEC CICS
 GGAS *       SYNCPOINT  ROLLBACK
 GGAS *    END-EXEC
               if  W-FINE-ELABORA  =  'S' and TIPO-ELABO-IN < '3'
               then
               if  CTR-PAGATE  >  zeros OR CTR-INDEBITE >  zeros
               then
      *            EXEC CICS SYNCPOINT  ROLLBACK END-EXEC
                   perform  S40-IMPOSTAZIONI  thru  S40-EX
      *            MOVE S5A000       TO R5A000
                   MOVE S5N001       TO R5N001
      *            MOVE S5A002       TO R5A002
      *            MOVE S5A003       TO R5A003
                   MOVE S5N004       TO R5N004
                   MOVE S5N005       TO R5N005
                   MOVE S5N007       TO R5N007
                   MOVE S5N006       TO R5N006
                   MOVE S5N008       TO R5N008
                   MOVE S5N009       TO R5N009
                   MOVE S5N011       TO R5N011
                   MOVE S5N012       TO R5N012
      *            perform  S40-IMPOSTAZIONI  thru  S40-EX
                   MOVE R-STAMPAS    TO TDSREPORT-RIGA-REPORT
                   MOVE  0           TO TDSREPORT-NUM-RIGA
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
      *
               else
                   MOVE 'NESSUNA DOMANDA DA PAGARE' TO  OUT-MESSAGGIO
                   move  '96'           to  OUT-STATUS
               end-if
               end-if
               go  to  E60-EX
           end-if.
      *----------------------------------- Fine Calcolo reale
           if  W-FINE-ELABORA     =  'S'
           then
               if  CTR-PAGATE   >  zeros   or
                   CTR-DEFINITE >  zeros
               then
      ********* ELABORAZIONE TERMINATA *****
                   perform  S40-IMPOSTAZIONI  thru  S40-EX
                   MOVE R-STAMPAS    TO TDSREPORT-RIGA-REPORT
                   MOVE  0           TO TDSREPORT-NUM-RIGA
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
               else
                   perform  S40-IMPOSTAZIONI  thru  S40-EX
                EXEC CICS
                   SYNCPOINT  ROLLBACK
                END-EXEC
      ********* ELABORAZIONE TERMINATA *****
                   MOVE 'NESSUNA DOMANDA DA PAGARE' TO  OUT-MESSAGGIO
                   move  '96'           to  OUT-STATUS
                   go  to  E60-EX
               end-if
           end-if.
      *----------------------------------- Impostazione Riepilogo
           if  (CTR-PAGATE  >  zeros      or
                CTR-DEFINITE  >  zeros)   and
               (FLG-COMMIT  =  'S')
           then
               if  WS-RIEPILOGO  =  'N'
               then
                   perform  E62-SCRIVO         thru  E62-EX
               else
                   perform  E64-RISCRIVO       thru  E64-EX
               end-if
           end-if.
      *-------------------------------------- Sincronia intermedia
           if  WS-APPOGGIO  =  'S'
           then  continue
           else
      *          perform E60-POP      thru  E60-POP-EX
                 go  to  E60-EX
           end-if.

           if  CTR-PAGATE    >  zeros    or
               CTR-DEFINITE  >  zeros
           then
               if  FLG-COMMIT  =  'S'
               then
                  EXEC CICS
                   SYNCPOINT
                  END-EXEC
                   move  'N'    to  FLG-COMMIT
               else
              EXEC CICS
                   SYNCPOINT  ROLLBACK
              END-EXEC
      *            subtract  1           from  CTR-SCR-APPO
                   move  WIC-DOMANDA       to  W-DOMANDA-DAL
                   add   1                 to  W-DOMANDA-DAL
                   perform  B20-PERSTART  thru  B20-EX
               end-if
           end-if.
       E60-EX.
           EXIT.
      *
       E60-POP.
      *
      *----- GESTIONE ANNULLAMENTO RECUPERO IN CASO DI ABEND.
      *
      *     IF OC-FCODPAGA1    = '730'
           IF OC-CODICE2    = '730'
              initialize  area-input-in
              MOVE ZEROES           TO REC-IMPORTO-MASSIMO-IN
              MOVE SPACES           TO REC-NUMERO-PRATICA-IN
              MOVE ZEROES           TO REC-PROGRESSIVO-PRATICA-IN
              MOVE SPACES           TO REC-CHIAVE-RESTART-IN
              MOVE SPACES           TO REC-UTENZA
              MOVE ZEROES           TO REC-DATA-IN
              move W8-ODIERNA       to REC-DATA-IN
              MOVE REC-DATA-IN(5:2) to REC-RATA-IN
              MOVE REC-DATA-IN(1:4) to REC-ANNO-IN
              move L-CODICE-SEDE    to REC-SEDE-IN
              move L-CODICE-STOP    to REC-SEDE-IN(5:2)
              MOVE '035'            TO TIPO-RICHIESTA-IN-5
              MOVE 'G05'            TO REC-PROCEDURA-CHIAMANTE-IN
              MOVE IC-CODFISARCA    TO REC-CODICE-FISCALE-IN
      *       MOVE OC-FIMPPAGA1     TO REC-IMPORTO-TRATTATO-IN
              MOVE OC-IMPORTO2      TO REC-IMPORTO-TRATTATO-IN
              MOVE  '999999'        TO RETCODE-00
      *
              EXEC CICS LINK PROGRAM(POPWMAIN)                          03050003
                             COMMAREA(AREA-POPSIN)                      03050003
              END-EXEC                                                  03050003
      *
              IF RETCODE-00 not = '000000'
                 display  'POP RETCODE =' RETCODE-00 '-' H-DCOCHIDOM
                           '--' area-input-in(1:100)
              ELSE
                 display  'POP ANNULLATO RECUPERO =' H-DCOCHIDOM
                           '--' area-input-in(1:100)
              END-IF
           END-IF.
       E60-POP-EX.
           EXIT.

       E62-SCRIVO.
           initialize  DCLTDSRPG00.
      *----------------------------------- Impostazione key          *
           move  W8-ODIERNA     to  H-PDATAELABO.
           move  W-PROGRESSIVO  to  H-PPROGRESSI.
           move  W-PROCEDURA    to  H-PPROCEDURA.
           move  L-CODICE-STOP  to  H-PSTRUTTURA.
           move  L-CODICE-SEDE  to  H-PCOSEDE.
      *----------------------------------- Errore per lettura valida *
           PERFORM E62-DB2-SELECT THRU E62-DB2-SELECT-EX.
      *
           IF  SQLCODE = 0
                 move   7      to  NDT2
                 move  zeros   to  CTR-PAGATE
                 move  'S'     to  W-FINE-INTERVALLO
                 go  to  E62-EX
           end-IF.
      *----------------------------------- Impostazione dati         *
           move  'N'           to  H-PBACKUP.
           move  W8-ODIERNA    to  W8-AAAAMMGG.
           if  W8-MM     >  1
           then
               subtract     1   from  W8-MM
           else
               move  12           to  W8-MM
               subtract     1   from  W8-AAAA
           end-if.
           if  W8-MM     =  04   or  =  06   or  =  09   or  =  11
           then
               move  30           to  W8-GG
           else
               if  W8-MM     =  02
               then
                   move  28           to  W8-GG
               else
                   move  31           to  W8-GG
               end-if
           end-if.
           move  W8-AAAAMMGG      to  H-PCALCOLOAL.
           move  CTR-SCR-APPO     to  H-PCALCOLATI.
           move  zeroes           to  H-PRECPAGATI.
           move  'N'              to  H-PFINEPAGAM.
           if  CTR-PAGATE  >  zeros
           then
               move  " "          to  H-PZEROPAGAM
           else
               if  CTR-DEFINITE  >  zeros
               then
                   move  "S"      to  H-PZEROPAGAM
               end-if
           end-if.
           move  zeroes           to  H-PIMPCONTAB
                                      H-PIMPTELEMA.
           move  spaces           to  H-PCODTELEMA.
           move  zeroes           to  H-PDATAEMISS.
           move  W-PAGARE         to  H-PCHEDOMAND.
           move  X1-CHEPRESTA     to  H-PCHEPRESTA.
           move  PERIODI-IN-LK    to  H-PCHENUMERA.
      *    move  T2-INTERVALLI    to  H-PCHENUMERA.
      *
           PERFORM E62-DB2-INSERT THRU E62-DB2-INSERT-EX.
      *
           IF  SQLCODE NOT = 0
                 move  'WRITE     '   to  S2A005
                 move  'ADSRPG00  '   to  S2A006
                 move  FST-ADSRPG00   to  S2A007
                 perform  S10-STAMPA  thru  S10-EX
                 move   7             to  NDT2
                 move  zeros          to  CTR-PAGATE
                 move  'S'            to  W-FINE-INTERVALLO
                 go  to  E62-EX
           ELSE
                 move  'S'            to  WS-RIEPILOGO
                 continue
           end-IF.
       E62-EX.
           EXIT.
      *
       E64-RISCRIVO.
           move  CTR-SCR-APPO    to  H-PCALCOLATI.
      *
           if  CTR-PAGATE  >  zeros
           then
               move  ' '          to  H-PZEROPAGAM
           else
               if  CTR-DEFINITE  >  zeros
               then
                   move  'S'      to  H-PZEROPAGAM
               end-if
           end-if.
      *
           PERFORM E64-DB2-UPDATE THRU E64-DB2-UPDATE-EX.
      *
           IF  SQLCODE NOT = 0
                 move  'REWRITE   '       to  S2A005
                 move  'ADSRPG00  '       to  S2A006
                 move  FST-ADSRPG00       to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
                 perform  T13-TESTO13    thru  T13-EX
                 perform  W10-MSGERRORE  thru  W10-EX
                 move   7                 to  NDT2
                 move  zeros              to  CTR-PAGATE
                 move  'S'                to  W-FINE-INTERVALLO
                 go  to  E64-EX
           end-IF.
       E64-EX.
           EXIT.
      *
       F00-FINALI.
           if  W-FLAGYNCORSO  =  'S'
           then
               perform F20-FINYNCORSO   thru  F20-EX
           end-if.
      *
           if  (K-RETURN-CODE   not  =  'KO')  and
               (K-ESITO-LOCK-UNLOCK  =  'OK')  and
               (K-IS-LOCKED          =  'N' )
           then
               perform F30-FINELOCK     thru  F30-EX
           end-if.
      *
           if TIPO-ELABO-IN  = 3 and
              OUT-STATUS = '96'
      *       OUT-STATUS = '96'  and W-NIK = 'S'
           then
              if OUT-MESSAGGIO  NOT = SPACES
              then
                  move   OUT-MESSAGGIO TO DSPFM134-O
              else
                  move    OC-MESSAGGIO TO DSPFM134-O
              end-if
              move  SPACES          to  OUT-MESSAGGIO
                  STRING WK-RPT-KEY   DSPFM134-O
                         DELIMITED BY SIZE INTO  OUT-MESSAGGIO
           end-if.
      *
           if out-status = '00' and l-tipocalcolo = 'R'
           then
              STRING
                 WK-RPT-KEY
                 CTR-LET-DATCO
                 CTR-ELA-DATCO
                 CTR-SCR-DATCO
                 CTR-LET-DATAN
                 CTR-ELA-DATAN
                 CTR-SCR-DATAN
                 CTR-IMPREVISTI
                 CTR-PAGATE
                 CTR-DEFINITE
                 CTR-INDEBITE
                 CTR-ATT-PAGME
              DELIMITED BY SIZE INTO OUT-MESSAGGIO
              STRING
                 CTR-LET-DATCO
                 CTR-ELA-DATCO
                 CTR-SCR-DATCO
                 CTR-LET-DATAN
                 CTR-ELA-DATAN
                 CTR-SCR-DATAN
                 CTR-IMPREVISTI
                 CTR-PAGATE
                 CTR-DEFINITE
                 CTR-INDEBITE
                 CTR-ATT-PAGME
              DELIMITED BY SIZE INTO TDSREPORT-RIGA-REPORT
              MOVE  0           TO TDSREPORT-NUM-RIGA
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT
      *
           end-if.
      *    Goback.
       F00-EX.
           EXIT.

       F20-FINYNCORSO.
      *------------------------------------ Memorizzo fine esecuzione
           move  L-CODICE-SEDE    to  C-CODICE-SEDE.
           move  L-CODICE-STOP    to  C-CODICE-STOP.
           move  L-NOME-SEDE      to  C-NOME-SEDE.
           move  L-NOME-STOP      to  C-NOME-STOP.
           move  L-PROCEDURA      to  C-PROCEDURA.
           move  'F'              to  C-RICHIESTA.
           move  W-PROGRESSIVO    to  C-PROGRESSIVO.
           move  zeros            to  C-CONGUAGLIO.
           move  spaces           to  C-DIRIGENTE
                                      C-ELABINCORSO
                                      C-RETCODE.
      *
           CALL  PDSPD16  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 AREALINK-1  AREALINK-2.
           cancel PDSPD16.
      *-------------------------------------- Elaborazione possibile?
           if  C-RETCODE      =  'C'   and
               C-ELABINCORSO  =  'K'
           then
               continue
           else
               move  'E'  to  L-RETCODE
      *        move  'S'  to  W-ERRORE
               perform  T90-TESTO90    thru  T90-EX
               perform  W10-MSGERRORE  thru  W10-EX
           end-if.
       F20-EX.
           EXIT.
      *
       F30-FINELOCK.
      *------------------------------------ Memorizzo UNLOCK         *
           move  '61441000'        to  K-MATRICOLA.
           string  L-CODICE-STOP       delimited by size
                   L-PROCEDURA         delimited by size
                   W8-ODIERNA          delimited by size
                                 into  K-NDOMUS.
           move  'B '              to  K-TIPO-DOMANDA.
           move  'U '              to  K-TIPO-RICHIESTA.
           move  L-CODICE-STOP     to  K-CENTRO-OPERATIVO.
           move  'P'               to  K-TIPO-OPERAZIONE.
           move  'S'               to  K-AUTO-COMMIT.
           move  spaces            to  K-RETURN-CODE
                                       K-RETURN-MESSAGE
                                       K-IS-LOCKED
                                       K-ESITO-LOCK-UNLOCK
                                       K-LOCK-UNLOCK-MESSAGE.
           move L-CODICE-SEDE      TO  K-CODICESEDE.
      *    call  PDSLOCK USING
      *                 WDFHEIBLK
      *                 WDFHCOMMAREA
      *                 L-AREA-LOCK
      *    end-call.
      *    cancel  PDSLOCK .
      *
           EXEC CICS LINK PROGRAM(PDSLOCK)
                          COMMAREA(L-AREA-LOCK)
                          LENGTH(27000)
           END-EXEC.
           if  (K-RETURN-CODE   not  =  'KO')  and
               (K-ESITO-LOCK-UNLOCK  =  'OK')
           then
               continue
           else
               if  K-RETURN-CODE     =  'KO'
               then
                   move  K-RETURN-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO  OUT-STATUS
               end-if
               if  K-ESITO-LOCK-UNLOCK  =  'KO'
               then
                   move  K-LOCK-UNLOCK-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO  OUT-STATUS
               end-if
               move  'S'  to  W-ERRORE
      *        go  to  F30-EX
           end-if.
       F30-EX.
           EXIT.
      *
       I00-INIZIALI.
           MOVE 'PDSIO13 '     TO WABNDB-PGM.
           MOVE '00'           TO OUT-STATUS.
           initialize  RIGA-13B-1 RIGA-13B-2 RIGA-13B-3.
           perform I03-ASSEGNAZIONI  thru  I03-EX.
           if  L-CODICE-SEDE  =  9090   and
               L-CODICE-STOP  =  90     and
               L-NOME-SEDE    =  'VALTOZAC'
           then
               move  W-VALTOZAC  to  L-NOME-STOP
               move  'S'         to  W-ERRORE
               go  to  I00-EX
           end-if.
      *
      * PREPARA TABELLA PER LA STAMPA
      *
           PERFORM IMPOSTA-RPT THRU EX-IMPOSTA-RPT.
      *------------------------------------------- Verifica per date*
           perform I10-DATA-ORA      thru  I10-EX.
      *
241023*------------- da agosto a dicembre da ore 1.00 a 1.15 circa *
241023*------------- caricamento conguagli da assistenza fiscale   *
241023     if  W8-ODIGG  =  01
           then
               if  W8-ODIMM  >  07
               then
                   if  W-HH-MM  <  0131
                   then
                       if  L-TIPOCALCOLO  =  'R'
                       then
                           move  'S'  to  W-ERRORE
                           perform  T15-TESTO15    thru  T15-EX
                           perform  W10-MSGERRORE  thru  W10-EX
                           go  to  I00-EX
                       end-if
                   end-if
               end-if
241023     end-if.
      *
           perform  I13-CALCOLO-AL    thru  I13-EX.
           perform  I14-DATABLOCCO    thru  I14-EX
      *    if  W-INIBIRE  =  'S'
      *    then
      *        move  'S'  to  W-ERRORE
      *        go  to  I00-EX
      *    end-if.
      *----------------------------------------- Controllo accesso
           perform I07-ACCESSO        thru  I07-EX.
      *
      *-------------------------------------------Calcolo in corso ?
           perform I30-CHK-PAGAMENTO   thru  I30-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  I00-EX
           end-if.
      *---------------------------------------- Ripartenza e selezioni
           perform I32-SELEZIONI   thru  I32-EX.
      *-------------------------------------- Memorizzo elaborazione
           perform  I60-BLOCCO     thru  I60-EX.
       I00-EX.
           EXIT.
      *
       I03-ASSEGNAZIONI.
      *    initialize   W-FLAGLETTURA
      *                     replacing  alphanumeric  by  'N'.
      *    initialize   W-FLAGSCRITTURA
      *                     replacing  alphanumeric  by  'N'.
      *    initialize   W-FST-SIINI.
      *    initialize   W-FST-NOINI.
      *    initialize   W-CONTATORI.
      *    initialize   W-INIZIALIZZA.
           initialize   W-ASSEGNA
                            replacing  alphanumeric  by  'N'.
      *    initialize   W-INDICI.
      *    initialize   T1-TIPO-PRESTAZ.
           initialize   X1-CHEPRESTA.
           initialize   T2-INTERVALLI.
      *    initialize   W-ANAGRAFICI.
      *    initialize   W-CONVERSIONI.
           initialize   IC-AREA
                        OC-AREA.
      *
      *    move  'G05'    to  W-PROCEDURA.
      *    move  'E'      to  W-VALUTA.
      *    move  'N'      to  W-ERRORE.
      *    move  'Y'      to  W-XCALCOLO.
      *    move  'N'      to  W-NIK.
      *    move  'N'      to  W-FINE-ELABORA.
      *    move  'N'      to  W-INIBIRE.
           move  1936.27  to  W-EURO.
           move  ' 102 / 04 '  to  W-VALTOZAC.
           move  'N'      to  L-RETCODE.
       I03-EX.
           EXIT.
      *
       D50-INFORMAZIONE.
      *------------------------------- Attiva fino al 31.03.2001
           if  RNPYEAR-ANNO  =  2001
           then
               if  RNPYEAR-MESE  >  03
               then
                   go  to  D50-EX
               end-if
           else
               go  to  D50-EX
           end-if.
      *
           perform  T50-TESTO50    thru  T50-EX.
           perform  W10-MSGERRORE  thru  W10-EX.
       D50-EX.
           EXIT.
      *
       I07-ACCESSO.
           move  'N'  to  W-NIK.
      *
110523* inserita if su matricola Elena per consentire pagamento ef-
110523*fetivo in sviluppo
110523     if  LMATRICOLA  =  'E0000419'
110523     then
110523         move  50000419  to  LMATRICOLA
110523     end-if.
           if  LLIVAUTO    =  '5'
           then
               move  LMATRICOLA    to  Z-MATRICOLA
               move  'N'           to  Z-RETCODE
               CALL  PDSPD13  USING
                     WDFHEIBLK  WDFHCOMMAREA
                     PER-PDSPD13
               cancel PDSPD13
               if  Z-RETCODE  =  'S'
               then
                   move  'S'  to  W-NIK
                   go  to  I07-EX
               end-if
           end-if.
       I07-EX.
           EXIT.
      *
       I10-DATA-ORA.
               MOVE FUNCTION CURRENT-DATE(1:8) TO
                    W8-ODIERNA.
      *
      *        MOVE  '20091001'    TO  W8-ODIERNA .
               move  W8-ODIAA      to  W6-ODIAA .
               move  W8-ODIMM      to  W6-ODIMM .
               move  W8-ODIGG      to  W6-ODIGG .
               compute  W4-ANNO-1  =  W8-ODIAA  -  1.
      *
       I10-EX.
           EXIT.
      *
       I13-CALCOLO-AL.
      *---------------------------------------- Data fine calcolo
           move  zeros         to  W8-AAAAMMGG
                                   W-CALCOLO-AL.
           move  W8-ODIERNA    to  W8-AAAAMMGG.
      *    if  W8-MM     >  1
      *    then
      *        subtract     1   from  W8-MM
      *    else
      *        move  12           to  W8-MM
      *        subtract     1   from  W8-AAAA
      *    end-if.
      *    if  W8-MM     =  04   or  =  06   or  =  09   or  =  11
      *    then
      *        move  30           to  W8-GG
      *    else
      *        if  W8-MM     =  02
      *        then
      *            if  RNPYEAR-BISESTILE  =  'SI'
      *            then
      *                move  29       to  W8-GG
      *            else
      *                move  28       to  W8-GG
      *            end-if
      *        else
      *            move  31           to  W8-GG
      *        end-if
      *    end-if.
      *--------------------------------------- Inibire calcolo      *
      *    if  W8-MM  =  8   or  =  9   or  =  10   or  =  11
      *    then
      *        if  W8-GG  >  26
      *        then
      *            move  '7'  to  W-INIBIRE
      *            PERFORM T16-TESTO16     thru  T16-EX
      *            PERFORM W10-MSGERRORE thru    W10-EX
      *        end-if
      *    end-if.
      *varconfis*
           move  'S'           to  I-AZIONE.
           move  'G05'         to  I-ZKPROC.
    gg*    move  9999          to  I-ZKSEDE.
           move  L-CODICE-SEDE to  I-ZKSEDE.
           move  001           to  I-ZKPROG.
           move  2099          to  I-ZKANNO.
           call  RDSTART
                using
                       WDFHEIBLK     WDFHCOMMAREA
                       I-START-AREA  O-START-AREA
           end-call.
           cancel   RDSTART .
           if  O-START-RTCD  =  'OK'
           then  if  O-ZDATA2  >  20091031
                 then  continue
                 else  move  'S'  to  W-ERRORE
                       PERFORM T40-TESTO40     thru  T40-EX
                       PERFORM W10-MSGERRORE thru    W10-EX
                       go  to  I13-EX
                 end-if
           else  move  'S'  to  W-ERRORE
                 PERFORM T40-TESTO40     thru  T40-EX
                 PERFORM W10-MSGERRORE thru    W10-EX
                 go  to  I13-EX
           end-if.
      *--------------------------------------- BONUS COVID          *
      *
      *    if  W8-MM  =  1
      *    or  W8-MM  =  3
      *    or  W8-MM  =  5
      *    or  W8-MM  =  7
      *    or  W8-MM  =  8
      *    or  W8-MM  =  10
      *    or  W8-MM  =  12
      *        move  31    to  W8-GG
      *        move  W8-AAAAMMGG  to  W-CALCOLO-AL
      *        go  to  I13-EX
      *    else
      *        if  W8-MM  =  4
      *        or  W8-MM  =  6
      *        or  W8-MM  =  9
      *        or  W8-MM  =  11
      *            move  30    to  W8-GG
      *            move  W8-AAAAMMGG  to  W-CALCOLO-AL
      *            go  to  I13-EX
      *        else
      *            if  W8-MM  =  2
      *                divide 4 into W8-AAAA
      *                    giving RISULT remainder RESTO
      *                if BISESTILE
      *                then
      *                    move 29     to  W8-GG
      *                else
      *                    move 28     to  W8-GG
      *                end-if
      *                move W8-AAAAMMGG to W-CALCOLO-AL
      *                go to I13-EX
      *            end-if
      *        end-if
      *    end-if.
      *---------------------------------------                      *
      *--------------------------------------- Gennaio              *
           if  W8-MM  =  1
           then
               if  W8-GG     >  19
               then
                   move  31    to  W8-GG
               else
                   move  31    to  W8-GG
                   move  12    to  W8-MM
                   subtract    1   from  W8-AAAA
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
               go  to  I13-EX
           end-if.
      *--------------------------------------- Febbraio             *
           if  W8-MM  =  2
           then
               if  W8-GG     >  19
               then
      *            if  RNPYEAR-BISESTILE  =  'SI'
      *            then
      *                move  29      to  W8-GG
      *            else
      *                move  28      to  W8-GG
      *            end-if
                   divide  4  into  W8-AAAA
                       giving  RISULT  remainder RESTO
                   if  BISESTILE
                   then
                       move  29        to  W8-GG
                   else
                       move  28        to  W8-GG
                   end-if
               else
                   move  31    to  W8-GG
                   subtract    1   from  W8-MM
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
               go  to  I13-EX
           end-if.
      *--------------------------------------- Marzo                *
           if  W8-MM  =  3
           then
               if  W8-GG     >  19
               then
                   move  31    to  W8-GG
               else
      *            if  RNPYEAR-BISESTILE  =  'SI'
      *            then
      *                move  29      to  W8-GG
      *            else
      *                move  28      to  W8-GG
      *            end-if
                   divide  4  into  W8-AAAA
                       giving  RISULT  remainder RESTO
                   if  BISESTILE
                   then
                       move  29        to  W8-GG
                   else
                       move  28        to  W8-GG
                   end-if
                   subtract    1   from  W8-MM
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
               go  to  I13-EX
           end-if.
160414*-i------------------------------------- Apr./Giu./Set./Nov.  *
           if  W8-MM  =  04   or  =  06   or  =  09   or  =  11
           then
               if  W8-GG     >  19
               then
                   move  30    to  W8-GG
               else
                   move  31    to  W8-GG
                   subtract    1   from  W8-MM
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
               go  to  I13-EX
           end-if.
160414*-i------------------------------------- Apr./Giu./Set./Nov.  *
      *    if  W8-MM  =  04   and W8-AAAA = 2014
      *    then
      *        if  W8-GG     >  15
      *        then
      *            move  30    to  W8-GG
      *        else
      *            move  31    to  W8-GG
      *            subtract    1   from  W8-MM
      *        end-if
      *        move  W8-AAAAMMGG  to  W-CALCOLO-AL
      *        go  to  I13-EX
      *    end-if.
160414*-f------------------------------------- Mag./Lug./Ott.       *
           if  W8-MM  =  05   or  =  07   or  =  10
           then
               if  W8-GG     >  19
               then
                   move  31    to  W8-GG
               else
                   move  30    to  W8-GG
                   subtract    1   from  W8-MM
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
               go  to  I13-EX
           end-if.
      *--------------------------------------- Agosto               *
           if  W8-MM  =  08
           then
               if  W8-GG     >  19
               then
                   move  31    to  W8-GG
               else
                   move  31    to  W8-GG
                   subtract    1   from  W8-MM
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
               go  to  I13-EX
           end-if.
      *--------------------------------------- speciale dicembre 2007*
           if  W8-MM     =  12
           then
      *---------------------------- Gestione date C.F. in PDSIO01 ---*
      *        if  W8-GG  >  17
      *        then
      *            move  'F'  to  W-INIBIRE
      *            PERFORM T17-TESTO17     thru  T17-EX
      *            PERFORM W10-MSGERRORE thru    W10-EX
      *            go  to  I13-EX
      *        end-if
      *------------------------------------ pagare dicembre da ...  *
      *        if  W8-GG     >  6
               if  W8-ODIERNA(7:2)  >=  O-ZDATA2(7:2)
               then
                   move  31    to  W8-GG
               else
                   move  30    to  W8-GG
                   move  11    to  W8-MM
               end-if
               move  W8-AAAAMMGG  to  W-CALCOLO-AL
           end-if.
       I13-EX.
           EXIT.
      *
       I30-CHK-PAGAMENTO.
      *--------------------------------------- Calcolo simulato?
           if  L-TIPOCALCOLO  =  'S'
           then
               go  to I30-EX
           end-if.
           MOVE  5              TO TDSREPORT-NUM-RPT.
      *--------------------------------------- Controllo per stuttura
           move  L-CODICE-SEDE  to  C-CODICE-SEDE.
           move  L-CODICE-STOP  to  C-CODICE-STOP.
           move  L-NOME-SEDE    to  C-NOME-SEDE.
           move  L-NOME-STOP    to  C-NOME-STOP.
           move  W-PROCEDURA    to  C-PROCEDURA.
           move  'I'            to  C-RICHIESTA.
           move  zeros          to  C-PROGRESSIVO
                                    C-CONGUAGLIO.
           move  spaces         to  C-DIRIGENTE
                                    C-ELABINCORSO
                                    C-RETCODE.
      *
           CALL  PDSPD16  USING
                     WDFHEIBLK  WDFHCOMMAREA
                 AREALINK-1  AREALINK-2.
           cancel PDSPD16.
      *-------------------------------------- Elaborazione non valida
           if  C-RETCODE  =  'E'
           then
               move  'S'  to  W-ERRORE
               move  '96'              to  OUT-STATUS
               perform  T70-TESTO70    thru  T70-EX
               perform  W10-MSGERRORE  thru  W10-EX
               go  to  I30-EX
           end-if.
      *-------------------------------------- Struttura disattiva?
           if  C-RETCODE  =  'D'
           then
               move  'S'  to  W-ERRORE
               move  '96'              to  OUT-STATUS
               perform  T71-TESTO71    thru  T71-EX
               perform  W10-MSGERRORE  thru  W10-EX
           end-if.
      *-------------------------------------- Elaborazione corretta
           if  C-RETCODE  =  'C'
           then
               if  C-ELABINCORSO  =  'K'
               then
                   continue
               else
                   move  'S'  to  W-ERRORE
                   move  '96'              to  OUT-STATUS
                   perform  T10-TESTO10    thru  T10-EX
                   perform  W10-MSGERRORE  thru  W10-EX
                   go  to  I30-EX
               end-if
           end-if.
      *--------------------------------------- Controllo su ADSRPG00
           move  W-PROCEDURA    to  H-PPROCEDURA.
           move  L-CODICE-STOP  to  H-PSTRUTTURA.
           move  L-CODICE-SEDE  to  H-PCOSEDE.
           move  'N'            to  H-PBACKUP   .
      *
           PERFORM I30-DB2-SELECT THRU I30-DB2-SELECT-EX.
           IF  SQLCODE NOT = 0
               move  'N'        to  W-PAGAMINCORSO
           ELSE
               move  'S'        to  W-PAGAMINCORSO
           end-IF.
       I30-EX.
           EXIT.
      *
       I32-SELEZIONI.
      *
      *    MOVE PERIODI-IN-LK  TO W-PERIODI.
           move ANNO-DAL-IN-LK(1)  to  ANNO-DAL-IN1.
           move ANNO-AL-IN-LK(1)   to  ANNO-AL-IN1.
           move NUMERO-DAL-IN-LK(1) to NUMERO-DAL-IN1.
           move NUMERO-AL-IN-LK(1)  to NUMERO-AL-IN1.
      *
           move ANNO-DAL-IN-LK(2)  to  ANNO-DAL-IN2.
           move ANNO-AL-IN-LK(2)   to  ANNO-AL-IN2.
           move NUMERO-DAL-IN-LK(2) to NUMERO-DAL-IN2.
           move NUMERO-AL-IN-LK(2)  to NUMERO-AL-IN2.
           move ANNO-DAL-IN-LK(3)  to  ANNO-DAL-IN3.
           move ANNO-AL-IN-LK(3)   to  ANNO-AL-IN3.
           move NUMERO-DAL-IN-LK(3) to NUMERO-DAL-IN3.
           move NUMERO-AL-IN-LK(3)  to NUMERO-AL-IN3.
           move ANNO-DAL-IN-LK(4)  to  ANNO-DAL-IN4.
           move ANNO-AL-IN-LK(4)   to  ANNO-AL-IN4.
           move NUMERO-DAL-IN-LK(4) to NUMERO-DAL-IN4.
           move NUMERO-AL-IN-LK(4)  to NUMERO-AL-IN4.
           move ANNO-DAL-IN-LK(5)  to  ANNO-DAL-IN5.
           move ANNO-AL-IN-LK(5)   to  ANNO-AL-IN5.
           move NUMERO-DAL-IN-LK(5) to NUMERO-DAL-IN5.
           move NUMERO-AL-IN-LK(5)  to NUMERO-AL-IN5.
           move ANNO-DAL-IN-LK(6)  to  ANNO-DAL-IN6.
           move ANNO-AL-IN-LK(6)   to  ANNO-AL-IN6.
           move NUMERO-DAL-IN-LK(6) to NUMERO-DAL-IN6.
           move NUMERO-AL-IN-LK(6)  to NUMERO-AL-IN6.
      *
           MOVE WK-CURS                 TO  C-IND.
           move  zeros                  to  W-DOMANDA-DAL
                                            W-DOMANDA-AL
           move  ANNO-DAL-IN-LK(1)      to  W-DAL-ANNO.
           move  NUMERO-DAL-IN-LK(1)    to  W-DAL-NUMERO.
           move  ANNO-AL-IN-LK(C-IND)   to  W-AL-ANNO.
           move  NUMERO-AL-IN-LK(C-IND) to  W-AL-NUMERO .
      *
           perform  varying  IND1  from  1  by  1
                until  IND1  >  9
                MOVE T1-PRESTAZIONE(IND1) TO  X1-PRESTAZIONE(IND1)
           END-PERFORM.
      *---------------------------------------- Selezione 2
           if  TIPO-ELABO-IN   =  2
      *       MOVE '00'                 TO OUT-STATUS
              PERFORM I39-SELF-CURS     thru I39-EX-SELF-CURS
           ELSE
              MOVE '1'   TO WK-CURS
           END-IF.
      *-------------------tipo pagamento PrimeLiq/Tutti/S
           move PAGA-ELABO-IN   to  W-PAGARE.
      *---------------------------------------- Data fine calcolo
      *    if  L-TIPOCALCOLO  =  'S'
      *    then
      *        move DATA-ELABO-GG   TO  R-GIORNO-AL
      *        move DATA-ELABO-MM   TO  R-MESE-AL
      *        move DATA-ELABO-AA   TO  R-ANNO-AL
      *        perform  I38-DSPFM-M8         thru  I38-EX
      *    end-if.
      *-
           perform  I38-DSPFM-M8         thru  I38-EX.
      *-
      *---------------------------------------- Selezione 3
           if  TIPO-ELABO-IN   =  3
               and  L-TIPOCALCOLO  =  'S'
           then
              perform I39-DSPF-M9       thru I39-EX
           end-if.
      *
       I32-EX.
           EXIT.
      *
       I38-DSPFM-M8.
      *--------------------------------------- Giorno
           if  DATA-ELABO-GG            =  zeros
                                    or  >  31
           then
               go  to  I38-EX
           end-if.
      *
           if  DATA-ELABO-MM            =  4
                                    or  =  6
                                    or  =  9
                                    or  =  11
           then
               if  DATA-ELABO-GG            >  30
               then
                   go  to  I38-EX
               end-if
           end-if.
      *---------------------------------------Speciale febbraio !
           if  DATA-ELABO-MM            =  2
           then
      *------------------------------------------- anno bisestile ?
               divide  4  into  DATA-ELABO-AA
                   giving  RISULT  remainder RESTO
               if  BISESTILE
               then
                   move  29        to  GG-FEBBRAIO
               else
                   move  28        to  GG-FEBBRAIO
               end-if
               if  DATA-ELABO-GG            >  GG-FEBBRAIO
               then
                   go  to  I38-EX
               end-if
           end-if.
      *--------------------------------------- Mese
           if  DATA-ELABO-MM            =  zeros
                                    or  >  12
           then
               go  to  I38-EX
           end-if.
      *--------------------------------------- Anno
           if  (DATA-ELABO-AA            <  (W8-ODIAA - 1))  or
               (DATA-ELABO-AA            >  (W8-ODIAA + 1))
           then
               go  to  I38-EX
           end-if.
      *--------------------------------------- Fine mese             *
           IF  (DATA-ELABO-MM             =  2    and
                (DATA-ELABO-GG            =  28   and
                 GG-FEBBRAIO  =  28))
               or
               (DATA-ELABO-MM             =  2    and
                (DATA-ELABO-GG            =  29   and
                 GG-FEBBRAIO  =  29))
               or
               (DATA-ELABO-GG             =  30   and
                (DATA-ELABO-MM            =   4   or
                 DATA-ELABO-MM            =   6   or
                 DATA-ELABO-MM            =   9   or
                 DATA-ELABO-MM            =  11))
               or
               (DATA-ELABO-GG             =  31   and
                (DATA-ELABO-MM            =   1   or
                 DATA-ELABO-MM            =   3   or
                 DATA-ELABO-MM            =   5   or
                 DATA-ELABO-MM            =   7   or
                 DATA-ELABO-MM            =   8   or
                 DATA-ELABO-MM            =  10   or
                 DATA-ELABO-MM            =  12))
           then
               continue
           else
               go  to  I38-EX
           end-if.
      *------------------------------------- Imposto data fine calcolo
           move  DATA-ELABO-GG          to  R-INSGIORNO-AL.
           move  DATA-ELABO-MM          to  R-INSMESE-AL.
           move  DATA-ELABO-AA          to  R-INSANNO-AL.
      *------------------------------- confronto con data calcolata  *
           if  L-TIPOCALCOLO  =  "R"
           then
               if  W-INSDATA-AL  >  W-CALCOLO-AL
               then
                   go  to  I38-EX
               end-if
           end-if.
           move  W-INSDATA-AL  to  W-CALCOLO-AL.
           move  "N"           to  W-CONTINUA.
           go  to  I38-EX.
      *
       I38-EX.
           EXIT.
      *
       I39-SELF-CURS.
      *
           IF ANNO-DAL-IN6 > 0
              MOVE '6'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
      *
           IF ANNO-DAL-IN5 > 0
              MOVE '5'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN4 > 0
              MOVE '4'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN3 > 0
              MOVE '3'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN2 > 0
              MOVE '2'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
           IF ANNO-DAL-IN1 > 0
              MOVE '1'   TO WK-CURS
              GO TO I39-EX-SELF-CURS
           END-IF.
       I39-EX-SELF-CURS.
           EXIT.
      *
      *
       I14-DATABLOCCO.
           move  L-CODICE-SEDE  to  C-CODICE-SEDE.
           move  L-CODICE-STOP  to  C-CODICE-STOP.
           move  L-NOME-SEDE    to  C-NOME-SEDE.
           move  L-NOME-STOP    to  C-NOME-STOP.
           move  'G05'          to  C-PROCEDURA.
           move  'I'            to  C-RICHIESTA.
           move  zeros          to  C-PROGRESSIVO
                                    C-CONGUAGLIO.
           move  spaces         to  C-DIRIGENTE
                                    C-ELABINCORSO
                                    C-RETCODE.
      *                                                              *
           call  PDSIO21 USING
                        WDFHEIBLK  WDFHCOMMAREA
                        AREALINK-1  AREALINK-2
           end-call.
           cancel  PDSIO21 .
      *----------------------------------------------- Risultato     *
           if  C-RETCODE      =  'C'
           then
               move  C-DTBLOCCO        to  W-DTBLOCCO-36
               move  C-COD-SINO        to  W-COD-SINO-36
           else
               move  zeroes            to  W-DTBLOCCO-36
               move  spaces            to  W-COD-SINO-36
           end-if.
       I14-EX.
           EXIT.
      *
       I39-DSPF-M9.
      *
           perform  E15-INIZIALIZZO  thru  E15-EX.
      *
      *--------------------------------------- Lettura domanda
           move  zeros                    to  WB-DOMANDA.
           move  ANNO-DAL-IN1             to  WB-ANNO.
           move  NUMERO-DAL-IN1           to  WB-NUMERO .
      *----DAQUI
      *  inserisci possibilità calcolo simulato con CODICE-DOMUS
      *
           initialize  DCLTDSDATCO.
           move  WB-ANNO        to H-DCOANVEPR   .
           move  WB-NUMERO      to H-DCONDVEPR   .
           move  L-CODICE-SEDE  to H-DCOCOSEGR   .
           PERFORM I39-DB2-SELECT THRU I39-DB2-SELECT-EX.
      *
           IF  SQLCODE  = 0
                move  'S'     to  WL-DATICOMUNI
           ELSE
                move  'N'     to  WL-DATICOMUNI
      *         go  to  I39-EX
           END-IF.
      *
           IF  SQLCODE NOT = 0
               IF  SQLCODE = 100
                  MOVE '96'       TO OUT-STATUS
                  STRING 'Domanda non presente in archivio ' WB-DOMANDA
                  DELIMITED BY SIZE      INTO OUT-MESSAGGIO
                  go  to  I39-EX
               ELSE
                  MOVE '99'       TO OUT-STATUS
                  MOVE SQLCODE    TO WABNDB-SQLCODE
                  STRING 'ERRORE DB2  SQLCODE=' WABNDB-SQLCODE
                       'LABEL= I39-DB2-SELECT '
                  DELIMITED BY SIZE      INTO OUT-MESSAGGIO
                go  to  I39-EX
               END-IF
           END-IF.
      *
      *
      *------------------------------------------ Tipo prestazione   *
           if  H-DCOCOTIDO                  =  'B'
                                        or  =  'D '
                                        or  =  'E '
           then
               continue
           else
               move '96'    to OUT-STATUS
               move 'Prestazione  non gestita'
                        to  out-messaggio
               move 'S'     to W-ERRORE
               go  to  I39-EX
           end-if.
      *------------------------------------------ Esito prestazione  *
           if  H-DCOULESSP                 =  'A'   or
               H-DCOULESSP                   =  'L'
           then
               continue
           else
               move '96'    to OUT-STATUS
               move 'Stato domanda non compatibile'
                        to  out-messaggio
               move 'S'     to W-ERRORE
               go  to  I39-EX
           end-if.
      *------------------------------------------ Leggo archivi      * 00  -
           move  'T'    to  W-PAGARE.
           move  'N'    to  W-ERRORE.
           perform  L10-LETTURA     thru  L10-EX.
 GGAS *    EXEC CICS
 GGAS *       SYNCPOINT  ROLLBACK
 GGAS *    END-EXEC.
      *---------------- Verifica solo per W-ERRORE e non per W-SCELTA*
           if  W-ERRORE  =  'S'
           then
               perform  M43-READ-ERROR  thru  M43-EX
               go  to  I39-EX
           end-if.
      *--------------------------------------- Verifica Blocco pagamento
           move  H-DCOCODFIS                  to  LK-CODFIS.
           move  'N'                          to  LK-RISP.
241215     if   H-DCOCOTIDO = 'E'    and
241215         (H-SSTCODIND = 'TYGM' or
241215                      = 'DL76' or
241215                      = 'TIPO' or
241215                      = 'TYAD' or
030316                      = 'SSEP' or
111217                      = 'TYRG' or
111217                      = 'TYBL' or
111217                      = 'TYCR' or
111217                      = 'APAF' or
310719                      = 'BRIO' or
111217                      = 'APAR' or
300320                      = 'EELA' or
                            = 'EE27' or
                            = 'EE28' or
                            = 'EE29' or
                            = 'EE30' or
300320                      = 'EE38' or
040620                      = 'EE2A' or
                            = 'EE2B' or
                            = 'EE2C' or
                            = 'EE2D' or
                            = 'EE05' or
040620                      = 'EE10' or
230920                      = 'EE13' or
                            = 'EE22' or
                            = 'EEZR' or
230920                      = 'EEMA' or
251120                      = 'EJ29' or
251120                      = 'EJ38' or
251120                      = 'EJ2A' or
251120                      = 'EJ2B' or
251120                      = 'EJ2C' or
251120                      = 'EJ2D' or
251120                      = 'EJ05' or
251120                      = 'EJ10' or
251120                      = 'EJ13' or
091220                      = 'EK29' or
091220                      = 'EK38' or
091220                      = 'EK2A' or
091220                      = 'EK2B' or
091220                      = 'EK2C' or
091220                      = 'EK2D' or
091220                      = 'EK05' or
091220                      = 'EK10' or
091220                      = 'EK13' or
260321                      = 'EW29' or
260321                      = 'EW38' or
260321                      = 'EW2A' or
260321                      = 'EW2B' or
260321                      = 'EW2C' or
260321                      = 'EW2D' or
260321                      = 'EW05' or
260321                      = 'EW10' or
260321                      = 'EW13' or
260321                      = 'EY29' or
260321                      = 'EY38' or
260321                      = 'EY2A' or
260321                      = 'EY2B' or
260321                      = 'EY2C' or
260321                      = 'EY2D' or
260321                      = 'EY05' or
260321                      = 'EY10' or
260321                      = 'EY13' or
220621                      = 'EY3A' or
220621                      = 'EX29' or
220621                      = 'EX38' or
220621                      = 'EX2A' or
220621                      = 'EX2B' or
220621                      = 'EX2C' or
220621                      = 'EX2D' or
220621                      = 'EX05' or
220621                      = 'EX10' or
220621                      = 'EX13' or
220621                      = 'EX3A' or
220621                      = 'EX87' or
220621                      = 'EX88' or
211021                      = 'EX89' or
130422                      = 'E092' or
080722                      = 'E109' or
080722                      = 'E110' or
080722                      = 'E112' or
231122                      = 'E107' or
130123                      = 'E159' or
130123                      = 'E160' or
130123                      = 'E162' or
130123                      = 'E157' or
140325                      = 'TYGP')
241215     then
241215         continue
241215     else
               CALL  RDSUT28  USING
                     WDFHEIBLK  WDFHCOMMAREA
                     PER-RDSUT28
               cancel  RDSUT28
               if  LK-RISP =  'S'
               then
                   move '96'    to OUT-STATUS
                   move 'Pagamenti Bloccati per il Codice Fiscale'
                                to  out-messaggio
                   move 'S'     to W-ERRORE
                   go  to  I39-EX
               end-if
241215     end-if.
      *------------------------------------------ Anagrafica         *
           move  'N'    to  W-ERRORE.
           perform  E31-ANAGRAFICA   thru  E31-EX.
           if  W-ERRORE  =  'S'
090224       IF IC-COMPATTO = ' '
               move '96'    to OUT-STATUS
               move 'Dati Anagrafici non disponibili'
                       to  out-messaggio
               move 'S'     to W-ERRORE
               go  to  I39-EX
090224       ELSE
090224         move '96'    to OUT-STATUS
090224         move IC-COMPATTO   TO OUT-MESSAGGIO
090224         move 'S'     to W-ERRORE
090224         go  to  I39-EX
090224       END-IF
           end-if.
      *------------------------------------------                    *
           move  99  to  OC-RETCODE
      *    initialize   AREA1.
      *----------- con PER-CALCOLO                                   *
           move  'SIMULAZI'         to  IC-CHIAMANTE.
      *    move  W8-ODIERNA         to  IC-CALCOLOAL.
           move  W-CALCOLO-AL       to  IC-CALCOLOAL.
           move  L-CODICE-STOP      to  IC-STRUTTURA.
      *
           if  W-XCALCOLO  =  'Y'
           then
               continue
           else
               move  98   to  OC-RETCODE
               move  'Anomalia Calcolo/Pagamento/Definizione'
                          to  OC-MESSAGGIO
           end-if.
      *------------------------------------------ Scelta pgm calcolo *
      *--- ASU
           if  W-CODICEDUE  =  42
           then
               perform  E23-CALCOLASU  thru  E23-EX
           end-if.
      *--- LPU
           if  W-CODICEDUE  =  44
           then
               move  'PIOLP41'   to  W-PGM
               call   PIOLP41    using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        PER-CALCOLO
               end-call
               cancel  PIOLP41
           end-if.
      *--- SUS
           if  W-CODICEDUE  =  45
           then
               move  'PIOSX41'   to  W-PGM
               call   PIOSX41    using
                                        WDFHEIBLK  WDFHCOMMAREA
                                        PER-CALCOLO
               end-call
               cancel  PIOSX41
           end-if.
      *----------RIVEDERE: eliminare dopo test?                      *
 GGAS *    EXEC CICS
 GGAS *       SYNCPOINT  ROLLBACK
 GGAS *    END-EXEC.
      *----------------------------------- x RDSIO12 e RDSIO13      *
           if  W-NIK  =  'S'
           then
               perform  I41-PERSVA      thru  I41-EX
           end-if.
      *------------------------------------------ Anagrafica         *
      *    if  OC-RETCODE  =  00   or
      *        OC-RETCODE  =  01
      *    then
      *        move  'N'    to  W-ERRORE
      *        perform  E31-ANAGRAFICA   thru  E31-EX
      *        if  W-ERRORE  =  'S'
      *        then
      *            move  IND-ON  to  IN35  of  DSPFM139-O-INDIC
      *            go  to  I39-EX
      *        end-if
      *    end-if.
      *--------------------------------- Controlli pagamenti + / -   *
           if  OC-RETCODE  equal  zeroes
           then
               perform  E25-CONTROLLI  thru  E25-EX
           end-if.
           if  (OC-RETCODE  =  00)   or
               (OC-RETCODE  =  01)   or
               (OC-RETCODE  =  96)
           then
      *-------------------------------------------- Verifica         *
               perform  J10-QUADRATURA     thru  J10-EX
      *-------------------------------------------- Visualizzo       *
               move  'E'          to  W-VALUTA
               perform  M39-DSPF-M13B    thru  M39-EX
           else
               perform  M41-ERR-CALCOLO  thru  M41-EX
           end-if.
       I39-EX.
           EXIT.
      *
       I41-PERSVA.
      *----------------------------------- x RDSIO12   9/2/2007     *
           call   RDSIO12    using
                             WDFHEIBLK  WDFHCOMMAREA
                                    L-CODICE-SEDE
                                    L-CODICE-STOP
                                    L-NOME-SEDE
                                    L-NOME-STOP
                                    L-PROCEDURA
                                    PER-CALCOLO
                                    LAREA-D
           end-call
           cancel  RDSIO12 .
      *----------------------------------- x RDSIO13  17/3/2006     *
           call   RDSIO13    USING
                             WDFHEIBLK  WDFHCOMMAREA
                                    L-CODICE-SEDE
                                    L-CODICE-STOP
                                    L-NOME-SEDE
                                    L-NOME-STOP
                                    L-PROCEDURA
                                    PER-CALCOLO
                                    LAREA-D
           end-call.
           cancel  RDSIO13 .
       I41-EX.
           EXIT.
      *                                                              *
       I60-BLOCCO.
           if  L-TIPOCALCOLO  =  'S'
           then
               go  to  I60-EX
           end-if.
201216*------------------------------------ Sblocco FTA              *
201216*-impostazione sblocco solo per FTA                            *
201216*------------------------------------ Sblocco FTA              *
      *    if  W8-ODIERNA > 20161220
      *        if  T1-PRESTAZIONE(1) = 'E'  and
      *            T1-OPZIONE(1)     = 'V'
      *        then
      *            continue
      *        else
      *            perform  T09-TESTO09    thru  T09-EX
      *            perform  W10-MSGERRORE  thru  W10-EX
      *            move  'S'  to  W-ERRORE
      *            go  to  I60-EX
      *        end-if
      *    end-if.
201216*------------------------------------ sblocco FTA              *
      *------------------------------------ Verifica situazione      *
      *
           perform I30-CHK-PAGAMENTO   thru  I30-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  I60-EX
           end-if.
           if  W-PAGAMINCORSO  =  'N'   and
               C-ELABINCORSO   =  'K'
           then
               continue
           else
               perform  T12-TESTO12    thru  T12-EX
               perform  W10-MSGERRORE  thru  W10-EX
               move  'S'  to  W-ERRORE
               go  to  I60-EX
           end-if.
      *-------------------------------------- Attivazione LOCK       *
           perform  I62-INIZIOLOCK  thru  I62-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  I60-EX
           end-if.
      *------------------------------------ Memorizzo esecuzione     *
           move  'N'            to  W-FLAGYNCORSO.
           move  L-CODICE-SEDE  to  C-CODICE-SEDE.
           move  L-CODICE-STOP  to  C-CODICE-STOP.
           move  L-NOME-SEDE    to  C-NOME-SEDE.
           move  L-NOME-STOP    to  C-NOME-STOP.
           move  W-PROCEDURA    to  C-PROCEDURA.
           move  'C'            to  C-RICHIESTA.
           move  zeros          to  C-PROGRESSIVO
                                    C-CONGUAGLIO.
           move  spaces         to  C-DIRIGENTE
                                    C-ELABINCORSO
                                    C-RETCODE.
      *                                                              *
           call  PDSPD16 USING
                        WDFHEIBLK  WDFHCOMMAREA
                        AREALINK-1  AREALINK-2
           end-call.
           cancel  PDSPD16 .
      *-------------------------------------- Elaborazione eseguita? *
           if  C-RETCODE      =  'C'   and
               C-ELABINCORSO  =  'Y'
           then
               move  'S'               to  W-FLAGYNCORSO
               move  C-DIRIGENTE       to  W-NOMEDIR
               move  C-PROGRESSIVO     to  W-PROGRESSIVO
               move  C-CONGUAGLIO      to  W-CONGUAGLIO
           else
               perform  T12-TESTO12    thru  T12-EX
               perform  W10-MSGERRORE  thru  W10-EX
               move  'S'  to  W-ERRORE
      *        go  to  I60-EX                                        *
           end-if.
       I60-EX.
           EXIT.
      *
       I62-INIZIOLOCK.
      *------------------------------------ Memorizzo LOCK           *
           move  '61441000'        to  K-MATRICOLA.
           string  L-CODICE-STOP       delimited by size
                   L-PROCEDURA         delimited by size
                   W8-ODIERNA          delimited by size
                                 into  K-NDOMUS.
           move  'B '              to  K-TIPO-DOMANDA.
           move  'L '              to  K-TIPO-RICHIESTA.
           move  L-CODICE-STOP     to  K-CENTRO-OPERATIVO.
           move  'P'               to  K-TIPO-OPERAZIONE.
           move  'N'               to  K-AUTO-COMMIT.
           move  spaces            to  K-RETURN-CODE
                                       K-RETURN-MESSAGE
                                       K-IS-LOCKED
                                       K-ESITO-LOCK-UNLOCK
                                       K-LOCK-UNLOCK-MESSAGE.
           move L-CODICE-SEDE      TO  K-CODICESEDE.
      *    call  PDSLOCK USING
      *                 WDFHEIBLK
      *                 WDFHCOMMAREA
      *                 L-AREA-LOCK
      *    end-call.
      *    cancel  PDSLOCK .
      *
           EXEC CICS LINK PROGRAM(PDSLOCK)
                          COMMAREA(L-AREA-LOCK)
                          LENGTH(27000)
           END-EXEC.
           if  (K-RETURN-CODE   not  =  'KO')  and
               (K-ESITO-LOCK-UNLOCK  =  'OK')  and
               (K-IS-LOCKED          =  'N' )
           then
               continue
           else
               if  K-RETURN-CODE     =  'KO'
               then
                   move  K-RETURN-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO OUT-STATUS
               end-if
               if  K-ESITO-LOCK-UNLOCK  =  'KO'
               then
                   move  K-LOCK-UNLOCK-MESSAGE
                                       to  OUT-MESSAGGIO
                   MOVE '96'           TO OUT-STATUS
               end-if
               move  'S'  to  W-ERRORE
      *        go  to  I62-EX
           end-if.
       I62-EX.
           EXIT.
      *
      *
       J10-QUADRATURA.
           perform  J12-QUADRAFISCO    thru  J12-EX.
           if  W-ERRORE  =  'S'
           then
               go  to  J10-EX
           end-if.
      *---------------------------------------- Solo per ....        *
           if  OC-FADNETTOPAG  >  zeroes
           then
               continue
           else
               go  to  J10-EX
           end-if.
      *----------------------------------------- Verifica
           move  zeros             to  W-DIFFERENZA.
           compute  W-DIFFERENZA    =  OC-FACIMPONIBILE
                                    -  OC-FACIMPNETTA
                                    +  OC-FACTREDICESIMA
                                    +  OC-FAPTREDICESIMA
                                    +  OC-FAPIMPONIBILE
                                    -  OC-FAPIMPNETTA
                                    +  OC-FADANFPAGATI
      *                             -  OC-FADRECSUIND
      *                             -  OC-FADRECSUANF
                                    -  OC-FADTRATSIND
                                    -  OC-FCONGAC
                                    -  OC-FCONGAP
                                    -  OC-FIMPREGAC
                                    -  OC-FIMPREGAP
                                    -  OC-FIMPCOMAC
                                    -  OC-FIMPCOMAP
                                    -  OC-FADNETTOPAG.
      *
           if  OC-FCODPAGA1  =  'ACC'
           then
               subtract  OC-FIMPPAGA1
                                 from  W-DIFFERENZA
           end-if.
      *    if  OC-FCODPAGA1  =  '730'
           if  OC-CODICE2    =  '730'
           then
      *        subtract  OC-FIMPPAGA1
               subtract  OC-IMPORTO2
                                 from  W-DIFFERENZA
           end-if.
           if  OC-FCODPAGA1  =  'SNI'
           then
               add       OC-FIMPPAGA1
                                  to   W-DIFFERENZA
           end-if.
           move  W-DIFFERENZA      to  W-SQUADRATURA.
           if  W-DIFFERENZA  =  zeros
           then
               continue
           else
               move  'S'  to  W-ERRORE
               go  to  J10-EX
           end-if.
      *-------------------------------------------------------
           if  OC-DCOULESSP   equal  spaces
           then
               move  'Campo OC-DCOULESSP    non impostato             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  J10-EX
           end-if.
           if  OC-FADINIZIO   equal  zeros
           then
               move  'Campo OC-FADINIZIO  non impostato               '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  J10-EX
           end-if.
           if  OC-FADFINE    equal  zeros
           then
               move  'Campo OC-FADFINE    non impostato               '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
               go  to  J10-EX
           end-if.
      *    if  OC-PMEUITRSIE  =  OC-FADTRATSIND
      *    then
      *        continue
      *    else
      *        move  'Valore di OC-PMEUITRSIE  non = OC-FADTRATSIND   '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  (OC-PMEINDUIME     +  OC-PMEINLEPRE)  equal
      *        (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE)
      *    then
      *        continue
      *    else
      *        move  'OC-PME(INDUIME+INLEPRE) not= OC(FAC+FAPIMPONIBIL'
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if  (OC-PMEANFUIME     +  OC-PMEINLEANE)  equal
      *        OC-FADANFPAGATI
      *    then
      *        continue
      *    else
      *        move  'OC-PME(ANFUIME+INLEANE) not= OC-FADANFPAGATI    '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *------------------------------------ Pagamento solo ANF?      *
           if  OC-FACIMPONIBILE  =  zeros   and
               OC-FACTREDICESIMA =  zeros   and
               OC-FAPIMPONIBILE  =  zeros   and
               OC-FAPTREDICESIMA =  zeros
           then
               if  OC-FADANFPAGATI  >  zeroes
               then
                   go  to  J10-EX
               end-if
           end-if.
      *
      *    if  OC-FACGGPREST  >  zeros   or
      *        OC-FAPGGPREST  >  zeros   or
      *        OC-CODICE1     =  'G11'
      *    then
      *        continue
      *    else
      *        if  OC-ASUIMRINU   =  zeros
      *        and OC-FADNETTOPAG =  zeros
      *        then
      *            move
      *              'OC-FACGGPREST and OC-FAPGGPREST = zero          '
      *                                              to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  J10-EX
      *        else
      *            continue
      *        end-if
      *    end-if.
      *    if  OC-FACGGDETRAZ  >  zeros   or
      *        OC-FAPGGDETRAZ  >  zeros   or
      *        OC-CODICE1     =  'G11'
      *    then
      *        continue
      *    else
      *        if   OC-ASUIMRINU   =  zeros
      *        and  OC-SSTIMRINU   =  zeros
      *        and  OC-SSTIMINU    =  zeros
      *        and OC-FADNETTOPAG =  zeros
      *        then
      *            move
      *              'OC-FACGGDETRAZ and OC-FAPGGDETRAZ = zero        '
      *                                              to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *            go  to  J10-EX
      *        else
      *            continue
      *        end-if
      *    end-if.
      *    if  (OC-RECIMUREE-1  +  OC-RECIMUREE-3)  equal
      *         OC-FADRECSUIND
      *    then
      *        continue
      *    else
      *        move  'OC-(RECIMUREE1+/RECIMUREE2) not= OC-FADRECSUIND'
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
      *    if   OC-RECIMUREE-2  equal
      *         OC-FADRECSUANF
      *    then
      *        continue
      *    else
      *        move  'OC-RECIMUREE-2 not= OC-FADRECSUANF             '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *        go  to  J10-EX
      *    end-if.
       J10-EX.
           EXIT.
      *
       J12-QUADRAFISCO.
           move  zeros             to  W-DIF-FISCALE.
      *    if  OC-FCODPAGA1  =  '730'  or
      *    if  OC-CODICE2    =  '730'  or
      *    if  OC-FCODPAGA1  =  'ACC'
      *    then
               compute  W-DIF-FISCALE   =
               ((OC-FACIMPONIBILE  +  OC-FACTREDICESIMA
                                   -  OC-FACIMPNETTA)      +
                (OC-FAPIMPONIBILE  +  OC-FAPTREDICESIMA
                                   -  OC-FAPIMPNETTA)      +
                (OC-FADANFPAGATI)                          -
                (OC-FADTRATSIND)                           -
                (OC-FCONGAC        +  OC-FCONGAP)          -
                (OC-FIMPREGAC      +  OC-FIMPREGAP)        -
                (OC-FIMPCOMAC      +  OC-FIMPCOMAP)        -
                 OC-FIMPPAGA1                              -
                 OC-IMPORTO2)                              -
                 OC-FADNETTOPAG.
      *    end-if.
      *
      *    if  OC-FCODPAGA1  =  '   '  or
           if  OC-FCODPAGA1  =  'SNI'
           then
               compute  W-DIF-FISCALE   =
               ((OC-FACIMPONIBILE  +  OC-FACTREDICESIMA
                                   -  OC-FACIMPNETTA)      +
                (OC-FAPIMPONIBILE  +  OC-FAPTREDICESIMA
                                   -  OC-FAPIMPNETTA)      +
                (OC-FADANFPAGATI)                          -
                (OC-FADTRATSIND)                           -
                (OC-FCONGAC        +  OC-FCONGAP)          -
                (OC-FIMPREGAC      +  OC-FIMPREGAP)        -
                (OC-FIMPCOMAC      +  OC-FIMPCOMAP)        +
                 OC-FIMPPAGA1                              -
                 OC-IMPORTO2)                              -
                 OC-FADNETTOPAG
           end-if.
      *
           if  W-DIF-FISCALE  =  zeros
           then
               continue
           else
               move  'S'  to  W-ERRORE
               move
                 'Errore quadratura fiscale: segnala a  HELP-DSORD'
                                        to  W-CHK-CAMPI
      *        go  to  J12-EX
           end-if.
       J12-EX.
           EXIT.
      *
       J20-MUOVIEURO.
      *----------------------------------------- Tipo prestazione    *
           if  W-CODICEDUE  =  42
           then
               perform  J22-ASUEURO     thru  J22-EX
           end-if.
           if  W-CODICEDUE  =  44
           then
               perform  J24-LPUEURO     thru  J24-EX
           end-if.
           if  W-CODICEDUE  =  45
           then
               perform  J26-SSTEURO     thru  J26-EX
           end-if.
      *----------------------------------------- Squadratura
           if  W-NIK  =  'S'
           then
               if  W-DIFFERENZA     =  zeros
               then
                   move  spaces     to  MBA041  of  VO-DSPFM13B
               else
                   string  'Att. squadra di euro '
                                        delimited   by  size
                      R-SQUADRATURA     delimited   by  size
                                  into  MBA041  of  VO-DSPFM13B
                   go  to  J20-EX
               end-if
               if  W-CHK-CAMPI       =  spaces
               then
                   move  spaces     to  MBA041  of  VO-DSPFM13B
               else
                   string  'ATT: '
                                        delimited   by  size
                      W-CHK-CAMPI       delimited   by  size
                                  into  MBA041  of  VO-DSPFM13B
               end-if
           end-if.
       J20-EX.
           EXIT.
      *
       J22-ASUEURO.
      *----------------------------------------- Data riferim. calcol*
           move  OC-ASUULASS        to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012  of  VO-DSPFM13B.
      *----------------------------------------- Totale indennita'
           move  OC-ASUIMINT         to  MBN014  of  VO-DSPFM13B.
      *     add  OC-ASUIMRIN         to  MBN014  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. indenn.
           move  OC-ASUGGCALC        to  MBN015  of  VO-DSPFM13B.
      *----------------------------------------- Totale ANF
           move  OC-ASUIMANFT        to  MBN017  of  VO-DSPFM13B.
            add  OC-ASUMAGANFT       to  MBN017  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. ANF
      *    move  OC-???ANFTOGG       to  MBN018  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AC
      *    move  OC-???TOIRNCE       to  MBN020  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AP
      *    move  OC-???TOIRNPE       to  MBN030  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. sindac.
      *    move  OC-???TOTRSIE       to  MBN022  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ind. *
           move  OC-ASUIMINU         to  MBN013  of  VO-DSPFM13B.
            add  OC-ASUIMRINU        to  MBN013  of  VO-DSPFM13B.
           if  MBN013  of  VO-DSPFM13B  >  zeros
           then
               if  OC-ASUIMINU   =
                              (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE)
               then
                   continue
               else
                   move
                     'OC-ASUIMINU not= OC-(FAC+FAPIMPONIBILE)         '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
               if  OC-ASUIMRINU  =   OC-FACTREDICESIMA
               then
                   continue
               else
                   move
                     'OC-ASUIMRINU not= OC-FACTREDICESIMA             '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Indebito?           *
           if  MBN013  of  VO-DSPFM13B  =  zeros
           then
               move  OC-ASUINDEB     to  MBN013  of  VO-DSPFM13B
               multiply  -1          by  MBN013  of  VO-DSPFM13B
           end-if.
      *    if  OC-ASUINDEB  >  zeros
      *    then
      *        if  OC-ASUINDEB   =
      *                       (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE)
      *        then
      *            continue
      *        else
      *            move
      *              'OC-ASUINDEB not= OC-(FAC+FAPIMPONIBILE)         '
      *                                              to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *        end-if
      *    end-if.
      *----------------------------------------- Ultimo importo ANF
           move  OC-ASUIMANFU        to  MBN016  of  VO-DSPFM13B.
            add  OC-ASUMAGANF        to  MBN016  of  VO-DSPFM13B.
           if  (OC-ASUIMANFU  +  OC-ASUMAGANF)  =  OC-FADANFPAGATI
           then
               continue
           else
               move  'OC-FADANFPAGATI not=  OC-(ASUIMANFU+ASUMAGANF)  '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. IRPEF AC
           move  OC-FACIMPNETTA      to  MBN019  of  VO-DSPFM13B.
           if  OC-ASUIRPEFU  =  OC-FACIMPNETTA  +  OC-FAPIMPNETTA
           then
               continue
           else
               move  'OC-ASUIRPEFU not= OC-(FAC+FAPIMPNETTA)          '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. IRPEF AP
           move  OC-FAPIMPNETTA      to  MBN029  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-ASUCONGFIS  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               move  OC-ASUCONGFIS  to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-ASUCONGFIS  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               move  OC-ASUCONGFIS  to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-ASUCONGFIS  =  (OC-FCONGAC  +  OC-FCONGAP)
           then
               continue
           else
               move  'OC-ASUCONGFIS not= OC-FCONGAC + OC-FCONGAP      '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Conguaglio Irpef 730
           if  OC-ASUCONG730  not =  zeroes
           then
               move  'Conguaglio da 730    '
                                    to  MBA031  of  VO-DSPFM13B
               move  OC-ASUCONG730  to  MBN032  of  VO-DSPFM13B
      *        if  OC-ASUCONG730  =   OC-FIMPPAGA1   and
      *            OC-FCODPAGA1   =   '730'
               if  OC-ASUCONG730  =   OC-IMPORTO2    and
                   OC-CODICE2     =   '730'
               then
                   continue
               else
      *        move  'OC-ASUCONG730 not= OC-FIMPPAGA1                 '
               move  'OC-ASUCONG730 not= OC-IMPORTO2                  '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Addizionale Regionale
           move  OC-ASUADDIZR       to  MBN033  of  VO-DSPFM13B.
            add  OC-ASUADDIZRR      to  MBN033  of  VO-DSPFM13B.
           if  (OC-ASUADDIZR   +   OC-ASUADDIZRR)  =
                                 (OC-FIMPREGAC  +  OC-FIMPREGAP)
           then
               continue
           else
               move  'OC-ASUADDIZR  not= OC-(FIMPREGAC + FIMPREGAP)   '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Addizionale Comunale
           move  OC-ASUADDIZC       to  MBN034  of  VO-DSPFM13B.
            add  OC-ASUADDIZRC      to  MBN034  of  VO-DSPFM13B.
           if  (OC-ASUADDIZC  +   OC-ASUADDIZRC)
                              =  (OC-FIMPCOMAC  +  OC-FIMPCOMAP)
           then
               continue
           else
               move  'OC-ASUADDIZC  not= OC-(FIMPCOMAC + FIMPCOMAP)   '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. sindac.
           move  OC-ASUTRASIND       to  MBN021  of  VO-DSPFM13B.
           if  OC-ASUTRASIND  =  OC-FADTRATSIND
           then
               continue
           else
               move  'OC-ASUTRASIND  not=  OC-FADTRATSIND             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      * 11.07.2017 RIPRISTINATO PER GESTIONE ACCONTO
      *----------------------------------------- Acconto
           move  OC-RECIMUREE-3      to  MBN023  of  VO-DSPFM13B.
           if  OC-FCODPAGA1    =  'ACC'
               if  OC-RECIMUREE-3  =  OC-FIMPPAGA1
               then
                   continue
               else
                   move  'OC-FIMPPAGA1   not=  OC-RECIMUREE-3        '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Ultimo  recupero ind.
           move   OC-RECIMUREE-1     to  MBN024  of  VO-DSPFM13B.
            add   OC-ASURECRIN       to  MBN024  of  VO-DSPFM13B.
GG         if  OC-FADNETTOPAG > 0
           then
             if  OC-RECIMUREE-1  +  OC-ASURECRIN  =  OC-FADRECSUIND
             then
                continue
             else
                move  'OC-FADRECSUIND not= OC-RECIMUREE-1 + OC-ASURECRI'
                                                     to  W-CHK-CAMPI
                move  'S'  to  W-ERRORE
             end-if
GG         end-if.
      *----------------------------------------- Sommo recuperi      *
           add   OC-RECIMUREE-1      to  MBN013  of  VO-DSPFM13B.
           add   OC-ASURECRIN        to  MBN013  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ANF
           add   OC-RECIMUREE-2      to  MBN024  of  VO-DSPFM13B.
           if  OC-FADRECSUANF  =  OC-RECIMUREE-2
           then
               continue
           else
               move  'OC-FADRECSUANF not=  OC-RECIMUREE-2             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Sommo recuperi      *
           add   OC-RECIMUREE-2      to  MBN016  of  VO-DSPFM13B.
      *----------------------------------------- Interessi indennità
      *    move  zeros               to  MBN025  of  VO-DSPFM13B.
      *    add   OC-***INLEPRE       to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Interessi ANF
      *    add   OC-***INLEANE       to  MBN025  of  VO-DSPFM13B.
      *---------------------------------conta   Pagamenti > 3000 euro
      *    IF    OC-FADNETTOPAG   > 3000
      *          ADD   1   TO  CTR-ATT-PAGME
      *    END-IF.
      *----------------------------------------- Assegno
           move  OC-FADNETTOPAG      to  MBN026  of  VO-DSPFM13B.
       J22-EX.
           EXIT.
      *
       J24-LPUEURO.
      *----------------------------------------- Data riferim. calcol*
           move  OC-LPUULASS        to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012  of  VO-DSPFM13B.
      *----------------------------------------- Totale indennita'
           move  OC-LPUIMINT         to  MBN014  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. indenn.
           move  OC-LPUGGCALC        to  MBN015  of  VO-DSPFM13B.
      *----------------------------------------- Totale ANF
           move  OC-LPUIMANFT        to  MBN017  of  VO-DSPFM13B.
            add  OC-LPUMAGANFT       to  MBN017  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. ANF
      *    move  OC-???ANFTOGG       to  MBN018  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AC
      *    move  OC-???TOIRNCE       to  MBN020  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AP
      *    move  OC-???TOIRNPE       to  MBN030  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. sindac.
      *    move  OC-???TOTRSIE       to  MBN022  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ind.
           move  OC-LPUIMINU         to  MBN013  of  VO-DSPFM13B.
           if  MBN013  of  VO-DSPFM13B  >  zeros
           then
               if  OC-LPUIMINU   =
                                (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE)
               then
                   continue
               else
                   move
                     'OC-LPUIMINU not= OC-(FAC+FAPIMPONIBILE)         '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Indebito?           *
           if  MBN013  of  VO-DSPFM13B  =  zeros
           then
               move  OC-LPUINDEB     to  MBN013  of  VO-DSPFM13B
               multiply  -1          by  MBN013  of  VO-DSPFM13B
           end-if.
      *    if  OC-LPUINDEB  >  zeros
      *    then
      *        if  OC-LPUINDEB   =
      *                       (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE)
      *        then
      *            continue
      *        else
      *            move
      *              'OC-LPUINDEB not= OC-(FAC+FAPIMPONIBILE)         '
      *                                              to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *        end-if
      *    end-if.
      *----------------------------------------- Ultimo importo ANF
           move  OC-LPUIMANFU        to  MBN016  of  VO-DSPFM13B.
            add  OC-LPUMAGANF        to  MBN016  of  VO-DSPFM13B.
           if  (OC-LPUIMANFU  +  OC-LPUMAGANF)  =  OC-FADANFPAGATI
           then
               continue
           else
               move  'OC-FADANFPAGATI not=  OC-(LPUIMANFU+LPUMAGANF)  '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. IRPEF AC
           move  OC-FACIMPNETTA      to  MBN019  of  VO-DSPFM13B.
           if  OC-LPUIRPEFU  =  OC-FACIMPNETTA  +  OC-FAPIMPNETTA
           then
               continue
           else
               move  'OC-LPUIRPEFU not= OC-(FAC+FAPIMPNETTA)          '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. IRPEF AP
           move  OC-FAPIMPNETTA      to  MBN029  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-LPUCONGFIS  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               move  OC-LPUCONGFIS  to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-LPUCONGFIS  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               move  OC-LPUCONGFIS  to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-LPUCONGFIS  =  (OC-FCONGAC  +  OC-FCONGAP)
           then
               continue
           else
               move  'OC-LPUCONGFIS not= OC-FCONGAC + OC-FCONGAP      '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Conguaglio Irpef 730
           if  OC-LPUCONG730  not =  zeroes
           then
               move  'Conguaglio da 730    '
                                    to  MBA031  of  VO-DSPFM13B
               move  OC-LPUCONG730  to  MBN032  of  VO-DSPFM13B
           end-if.
      *    if  OC-FCODPAGA1   =   '730'
           if  OC-CODICE2     =   '730'
           then
      *        if  OC-LPUCONG730  =   OC-FIMPPAGA1
               if  OC-LPUCONG730  =   OC-IMPORTO2
               then
                   continue
               else
                   move
      *              'OC-LPUCONG730 not= OC-FIMPPAGA1                 '
                     'OC-LPUCONG730 not= OC-IMPORTO2                  '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Addizionale Regionale
           move  OC-LPUADDIZR       to  MBN033  of  VO-DSPFM13B.
           if  OC-LPUADDIZR   =  (OC-FIMPREGAC  +  OC-FIMPREGAP)
           then
               continue
           else
               move  'OC-LPUADDIZR  not= OC-(FIMPREGAC + FIMPREGAP)   '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Addizionale Comunale
           move  OC-LPUADDIZC       to  MBN034  of  VO-DSPFM13B.
           if  OC-LPUADDIZC   =  (OC-FIMPCOMAC  +  OC-FIMPCOMAP)
           then
               continue
           else
               move  'OC-LPUADDIZC  not= OC-(FIMPCOMAC + FIMPCOMAP)   '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. sindac.
           move  OC-LPUTRASIND       to  MBN021  of  VO-DSPFM13B.
           if  OC-LPUTRASIND  =  OC-FADTRATSIND
           then
               continue
           else
               move  'OC-LPUTRASIND  not=  OC-FADTRATSIND             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      * 11.07.2017 RIPRISTINATO PER GESTIONE ACCONTO
      *----------------------------------------- Acconto
           move  OC-RECIMUREE-3      to  MBN023  of  VO-DSPFM13B.
           if  OC-FCODPAGA1    =  'ACC'
               if  OC-RECIMUREE-3  =  OC-FIMPPAGA1
               then
                   continue
               else
                   move  'OC-FIMPPAGA1   not=  OC-RECIMUREE-3         '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Ultimo  recupero ind.
           add   OC-RECIMUREE-1      to  MBN024  of  VO-DSPFM13B.
           if  OC-FADRECSUIND  =  OC-RECIMUREE-1
           then
               continue
           else
               move  'OC-FADRECSUIND not=  OC-RECIMUREE-1             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Sommo recuperi      *
           add   OC-RECIMUREE-1      to  MBN013  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ANF
           add   OC-RECIMUREE-2      to  MBN024  of  VO-DSPFM13B.
           if  OC-FADRECSUANF  =  OC-RECIMUREE-2
           then
               continue
           else
               move  'OC-FADRECSUANF not=  OC-RECIMUREE-2             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Sommo recuperi      *
           add   OC-RECIMUREE-2      to  MBN016  of  VO-DSPFM13B.
      *----------------------------------------- Interessi indennità
      *    move  zeros               to  MBN025  of  VO-DSPFM13B.
      *    add   OC-***INLEPRE       to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Interessi ANF
      *    add   OC-***INLEANE       to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Assegno
      *---------------------------------conta   Pagamenti > 3000 euro
      *    IF    OC-FADNETTOPAG   > 3000
      *          ADD   1   TO  CTR-ATT-PAGME
      *    END-IF.
           move  OC-FADNETTOPAG      to  MBN026  of  VO-DSPFM13B.
       J24-EX.
           EXIT.
      *
       J26-SSTEURO.
      *----------------------------------------- Data riferim. calcol*
           move  OC-SSTULASS        to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012  of  VO-DSPFM13B.
      *----------------------------------------- Totale indennita'
           move  OC-SSTIMINT         to  MBN014  of  VO-DSPFM13B.
      *     add  OC-SSTIMRIN         to  MBN014  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. indenn.
           move  OC-SSTGGCALC        to  MBN015  of  VO-DSPFM13B.
      *----------------------------------------- Totale ANF    NO!
      *    move  OC-???IMANFT        to  MBN017  of  VO-DSPFM13B.
      *     add  OC-???MAGANFT       to  MBN017  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. ANF
      *    move  OC-???ANFTOGG       to  MBN018  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AC
      *    move  OC-???TOIRNCE       to  MBN020  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AP
      *    move  OC-???TOIRNPE       to  MBN030  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. sindac.
      *    move  OC-???TOTRSIE       to  MBN022  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ind.
           move  OC-SSTIMINU         to  MBN013  of  VO-DSPFM13B.
            add  OC-SSTIMRINU        to  MBN013  of  VO-DSPFM13B.
           if  (MBN013  of  VO-DSPFM13B  >  zeros)   and
               (OC-FCODPAGA1  =  'SNI')
           then
               if  (OC-SSTIMINU + OC-SSTIMRINU)  =
                            (OC-FACIMPONIBILE  +
                             OC-FAPIMPONIBILE  +
                             OC-FACTREDICESIMA +
                             OC-FIMPPAGA1)
               then
                   continue
               else
                   move
                     'OC-SSTIMINU not= OC-(FAC+FAPIMPONIBILE+FACTREDI)'
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
               if  OC-SSTIMRINU  =   OC-FACTREDICESIMA
               or                =   0
               then
                   continue
               else
                   move
                     'OC-SSTIMRINU not= OC-FACTREDICESIMA             '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
           if  (MBN013  of  VO-DSPFM13B  >  zeros)  and
               (OC-FCODPAGA1  not =  'SNI')
           then
               if  (OC-SSTIMINU + OC-SSTIMRINU)  =
                            (OC-FACIMPONIBILE  +
                             OC-FAPIMPONIBILE  +
                             OC-FACTREDICESIMA)
               then
                   continue
               else
                   move
                     'OC-SSTIMINU not= OC-(FAC+FAPIMPONIBILE+FACTREDI)'
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
               if  OC-SSTIMRINU  =   OC-FACTREDICESIMA
               or                =   0
               then
                   continue
               else
                   move
                     'OC-SSTIMRINU not= OC-FACTREDICESIMA             '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Indebito?           *
           if  MBN013  of  VO-DSPFM13B  =  zeros
           then
               move  OC-SSTINDEB     to  MBN013  of  VO-DSPFM13B
               multiply  -1          by  MBN013  of  VO-DSPFM13B
           end-if.
      *
      *    if  OC-SSTINDEB  >  zeros
      *    then
      *        if  OC-SSTINDEB   =
      *                       (OC-FACIMPONIBILE  +  OC-FAPIMPONIBILE)
      *        then
      *            continue
      *        else
      *            move
      *              'OC-SSTINDEB not= OC-(FAC+FAPIMPONIBILE)         '
      *                                              to  W-CHK-CAMPI
      *            move  'S'  to  W-ERRORE
      *        end-if
      *    end-if.
      *--------------------------- no! --------- Ultimo importo ANF
      *    move  OC-???IMANFU        to  MBN016  of  VO-DSPFM13B.
      *     add  OC-???MAGANF        to  MBN016  of  VO-DSPFM13B.
      *    if  (OC-???IMANFU  +  OC-???MAGANF)  =  OC-FADANFPAGATI
      *    then
      *        continue
      *    else
      *        move  'OC-FADANFPAGATI not=  OC-(???IMANFU+???MAGANF)  '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *    end-if.
      *----------------------------------------- Ultima tratt. IRPEF AC
           move  OC-FACIMPNETTA      to  MBN019  of  VO-DSPFM13B.
           if  OC-SSTIRPEFU  =  OC-FACIMPNETTA  +  OC-FAPIMPNETTA
           then
               continue
           else
               move  'OC-SSTIRPEFU not= OC-(FAC+FAPIMPNETTA)          '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. IRPEF AP
           move  OC-FAPIMPNETTA      to  MBN029  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-SSTCONGFIS  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               move  OC-SSTCONGFIS  to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-SSTCONGFIS  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               move  OC-SSTCONGFIS  to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-SSTCONGFIS  =  (OC-FCONGAC  +  OC-FCONGAP)
           then
               continue
           else
               move  'OC-SSTCONGFIS not= OC-FCONGAC + OC-FCONGAP      '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Conguaglio Irpef 730
           if  OC-SSTCONG730  not =  zeroes
           then
               move  'Conguaglio da 730    '
                                    to  MBA031  of  VO-DSPFM13B
               move  OC-SSTCONG730  to  MBN032  of  VO-DSPFM13B
      *        if  OC-FCODPAGA1   =   '730'   and
      *            OC-SSTCONG730  =   OC-FIMPPAGA1
               if  OC-CODICE2     =   '730'   and
                   OC-SSTCONG730  =   OC-IMPORTO2
               then
                   continue
               else
      *        move  'OC-SSTCONG730 not= OC-FIMPPAGA1                 '
               move  'OC-SSTCONG730 not= OC-IMPORTO2                  '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Addizionale Regionale
           move  OC-SSTADDIZR       to  MBN033  of  VO-DSPFM13B.
            add  OC-SSTADDIZRR      to  MBN033  of  VO-DSPFM13B.
           if  (OC-SSTADDIZR   +   OC-SSTADDIZRR)  =
                                 (OC-FIMPREGAC  +  OC-FIMPREGAP)
           then
               continue
           else
               move  'OC-SSTADDIZR  not= OC-(FIMPREGAC + FIMPREGAP)   '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Addizionale Comunale
           move  OC-SSTADDIZC       to  MBN034  of  VO-DSPFM13B.
            add  OC-SSTADDIZRC      to  MBN034  of  VO-DSPFM13B.
           if  (OC-SSTADDIZC   +   OC-SSTADDIZRC)  =
                                 (OC-FIMPCOMAC  +  OC-FIMPCOMAP)
           then
               continue
           else
               move  'OC-SSTADDIZC  not= OC-(FIMPCOMAC + FIMPCOMAP)   '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      *----------------------------------------- Ultima tratt. sindac.
           move  OC-SSTTRASIND       to  MBN021  of  VO-DSPFM13B.
           if  OC-SSTTRASIND  =  OC-FADTRATSIND
           then
               continue
           else
               move  'OC-SSTTRASIND  not=  OC-FADTRATSIND             '
                                                     to  W-CHK-CAMPI
               move  'S'  to  W-ERRORE
           end-if.
      * 11.07.2017 RIPRISTINATO PER GESTIONE ACCONTO
      *----------------------------------------- Acconto
           move  OC-RECIMUREE-3      to  MBN023  of  VO-DSPFM13B.
           if  OC-FCODPAGA1    =  'ACC'
               if  OC-RECIMUREE-3  =  OC-FIMPPAGA1
               then
                   continue
               else
                   move  'OC-FIMPPAGA1   not=  OC-RECIMUREE-3         '
                                                     to  W-CHK-CAMPI
                   move  'S'  to  W-ERRORE
               end-if
           end-if.
      *----------------------------------------- Ultimo  recupero ind.
           add   OC-RECIMUREE-1      to  MBN024  of  VO-DSPFM13B.
           if H-SSTIMRIN > 0
           and H-SSTCODIND NOT = 'FTCG'
           and H-SSTCODIND NOT = 'FTCD'
           and H-SSTCODIND NOT = 'FTCC'
           and H-SSTCODIND NOT = 'TRAC'
              add   OC-SSTRECRIN        to  MBN024  of  VO-DSPFM13B
              if  OC-FADRECSUIND  =  OC-RECIMUREE-1  +  OC-SSTRECRIN
              then
                continue
              else
                move  'OC-FADRECSUIND not=OC-RECIMUREE-1 + OC-SSTRECRIN'
                                                         to  W-CHK-CAMPI
                move  'S'  to  W-ERRORE
              end-if
           end-if.
      *----------------------------------------- Sommo recuperi      *
           add   OC-RECIMUREE-1      to  MBN013  of  VO-DSPFM13B.
           if H-SSTIMRIN > 0
           and H-SSTCODIND NOT = 'FTCG'
           and H-SSTCODIND NOT = 'FTCD'
           and H-SSTCODIND NOT = 'FTCC'
           and H-SSTCODIND NOT = 'TRAC'
               add   OC-SSTRECRIN        to  MBN013  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Ultimo  recupero ANF
      *    add   OC-RECIMUREE-2      to  MBN024  of  VO-DSPFM13B.
      *    if  OC-FADRECSUANF  =  OC-RECIMUREE-2
      *    then
      *        continue
      *    else
      *        move  'OC-FADRECSUANF not=  OC-RECIMUREE-2             '
      *                                              to  W-CHK-CAMPI
      *        move  'S'  to  W-ERRORE
      *    end-if.
      *----------------------------------------- Sommo recuperi      *
      *    add   OC-RECIMUREE-2      to  MBN016  of  VO-DSPFM13B.
      *----------------------------------------- Interessi indennità
      *    move  zeros               to  MBN025  of  VO-DSPFM13B.
      *    add   OC-***INLEPRE       to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Interessi ANF
      *    add   OC-***INLEANE       to  MBN025  of  VO-DSPFM13B.
      *---------------------------------conta   Pagamenti > 3000 euro
      *    IF    OC-FADNETTOPAG      > 3000
      *          ADD   1   TO  CTR-ATT-PAGME
      *    END-IF.
      *----------------------------------------- Assegno
           move  OC-FADNETTOPAG      to  MBN026  of  VO-DSPFM13B.
       J26-EX.
           EXIT.
      *
       J30-MUOVILIRE.
      *----------------------------------------- Tipo prestazione    *
           if  W-CODICEDUE  =  42
           then
               perform  J32-ASULIRE     thru  J32-EX
           end-if.
           if  W-CODICEDUE  =  44
           then
               perform  J34-LPULIRE     thru  J34-EX
           end-if.
           if  W-CODICEDUE  =  45
           then
               perform  J36-SSTLIRE     thru  J36-EX
           end-if.
      *----------------------------------------- Squadratura
           if  W-NIK  =  'S'
           then
               if  W-DIFFERENZA     =  zeros
               then
                   move  spaces     to  MBA041  of  VO-DSPFM13B
               else
                   move  'Attenzione: squadratura!         '
                                to  MBA041  of  VO-DSPFM13B
                   go  to  J30-EX
               end-if
               if  W-CHK-CAMPI       =  spaces
               then
                   move  spaces     to  MBA041  of  VO-DSPFM13B
               else
                   move  'Attenzione: dati calcolo dubbi!  '
                                to  MBA041  of  VO-DSPFM13B
               end-if
           end-if.
       J30-EX.
           EXIT.
      *
       J32-ASULIRE.
           move  OC-ASUULASS        to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012  of  VO-DSPFM13B.
      *----------------------------------------- Totale indennita'
           compute  W-CALCOLI   rounded  =
                                    OC-ASUIMINT      *  W-EURO.
           move  W-CALCOLI          to  MBN014  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. indenn.
           move  OC-ASUGGCALC        to  MBN015  of  VO-DSPFM13B.
      *----------------------------------------- Totale ANF
           compute  W-CALCOLI   rounded  =
                                    OC-ASUIMANFT     *  W-EURO.
           move  W-CALCOLI          to  MBN017  of  VO-DSPFM13B.
           compute  W-CALCOLI   rounded  =
                                    OC-ASUMAGANFT    *  W-EURO.
            add  W-CALCOLI          to  MBN017  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. ANF
      *    move  OC-???ANFTOGG       to  MBN018  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AC
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOIRNCE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN020  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AP
      *    compute  W-CALCOLI   rounded  =
      *                             OC-PMETOIRNPE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN030  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. sindac.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOTRSIE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN022  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ind.
           compute  W-CALCOLI   rounded  =
                                    OC-ASUIMINU      *  W-EURO.
           move  W-CALCOLI          to  MBN013  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ANF
           compute  W-CALCOLI   rounded  =
                                    OC-ASUIMANFU     *  W-EURO.
           move  W-CALCOLI          to  MBN016  of  VO-DSPFM13B.
           compute  W-CALCOLI   rounded  =
                                    OC-ASUMAGANF     *  W-EURO.
            add  W-CALCOLI          to  MBN016  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. IRPEF AC
           compute  W-CALCOLI   rounded  =
                                    OC-FACIMPNETTA   *  W-EURO.
           move  W-CALCOLI          to  MBN019  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. IRPEF AP
           compute  W-CALCOLI   rounded  =
                                    OC-FAPIMPNETTA   *  W-EURO.
           move  W-CALCOLI          to  MBN029  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AC
      *    if  OC- CONGAC ???  ><  zeroes
      *    then
      *        move  'Conguaglio Irpef A.C.'
      *    o    move  'Rimborso D.L.268/2000'
      *                             to  MBA031  of  VO-DSPFM13B
      *    end-if.
      *    compute  W-CALCOLI   rounded  =
      *                             OC- CONGAC ???  *  W-EURO.
      *    move  W-CALCOLI          to  MBN032  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-ASUCONGFIS  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-ASUCONGFIS    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-ASUCONGFIS  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-ASUCONGFIS    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Conguaglio 730      *
           if  OC-ASUCONG730  not  =  zeroes
           then
               move  'Conguaglio da 730    '
                                    to  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-ASUCONG730    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Addizionale Regionale
           compute  W-CALCOLI   rounded  =
                                    OC-ASUADDIZR    *  W-EURO.
           move  W-CALCOLI          to  MBN033  of  VO-DSPFM13B.
      *----------------------------------------- Addizionale Comunale
           compute  W-CALCOLI   rounded  =
                                    OC-ASUADDIZC    *  W-EURO.
           move  W-CALCOLI          to  MBN034  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. sindac.
           compute  W-CALCOLI   rounded  =
                                    OC-ASUTRASIND    *  W-EURO.
           move  W-CALCOLI          to  MBN021  of  VO-DSPFM13B.
      *----------------------------------------- Acconto
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-3  *  W-EURO.
           move  W-CALCOLI          to  MBN023  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ind.
           move  zeros              to  MBN024  of  VO-DSPFM13B.
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-1  *  W-EURO.
           add   W-CALCOLI          to  MBN024  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ANF
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-2  *  W-EURO.
           add   W-CALCOLI          to  MBN024  of  VO-DSPFM13B.
      *----------------------------------------- Interessi indennità
      *    move  zeros              to  MBN025  of  VO-DSPFM13B.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???INLEPRE    *  W-EURO.
      *    add   W-CALCOLI          to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- interessi ANF
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???INLEANE    *  W-EURO.
      *    add   W-CALCOLI          to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Assegno
           compute  W-CALCOLI   rounded  =
                                    OC-FADNETTOPAG   *  W-EURO.
           move  W-CALCOLI          to  MBN026  of  VO-DSPFM13B.
       J32-EX.
           EXIT.
      *
       J34-LPULIRE.
           move  OC-LPUULASS        to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012  of  VO-DSPFM13B.
      *----------------------------------------- Totale indennita'
           compute  W-CALCOLI   rounded  =
                                    OC-LPUIMINT      *  W-EURO.
           move  W-CALCOLI          to  MBN014  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. indenn.
           move  OC-LPUGGCALC        to  MBN015  of  VO-DSPFM13B.
      *----------------------------------------- Totale ANF
           compute  W-CALCOLI   rounded  =
                                    OC-LPUIMANFT     *  W-EURO.
           move  W-CALCOLI          to  MBN017  of  VO-DSPFM13B.
           compute  W-CALCOLI   rounded  =
                                    OC-LPUMAGANFT    *  W-EURO.
            add  W-CALCOLI          to  MBN017  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. ANF
      *    move  OC-???ANFTOGG       to  MBN018  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AC
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOIRNCE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN020  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AP
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOIRNPE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN030  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. sindac.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOTRSIE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN022  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ind.
           compute  W-CALCOLI   rounded  =
                                    OC-LPUIMINU      *  W-EURO.
           move  W-CALCOLI          to  MBN013  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ANF
           compute  W-CALCOLI   rounded  =
                                    OC-LPUIMANFU     *  W-EURO.
           move  W-CALCOLI          to  MBN016  of  VO-DSPFM13B.
           compute  W-CALCOLI   rounded  =
                                    OC-LPUMAGANF     *  W-EURO.
            add  W-CALCOLI          to  MBN016  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. IRPEF AC
           compute  W-CALCOLI   rounded  =
                                    OC-FAPIMPNETTA   *  W-EURO.
           move  W-CALCOLI          to  MBN019  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. IRPEF AP
           compute  W-CALCOLI   rounded  =
                                    OC-FACIMPNETTA   *  W-EURO.
           move  W-CALCOLI          to  MBN029  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AC
      *    if  OC- CONGAC ???  ><  zeroes
      *    then
      *        move  'Conguaglio Irpef A.C.'
      *    o    move  'Rimborso D.L.268/2000'
      *                             to  MBA031  of  VO-DSPFM13B
      *    end-if.
      *    compute  W-CALCOLI   rounded  =
      *                             OC- CONGAC ???  *  W-EURO.
      *    move  W-CALCOLI          to  MBN032  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-LPUCONGFIS  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-LPUCONGFIS    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-LPUCONGFIS  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-LPUCONGFIS    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Conguaglio 730      *
           if  OC-LPUCONG730  not  =  zeroes
           then
               move  'Conguaglio da 730    '
                                    to  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-LPUCONG730    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Addizionale Regionale
           compute  W-CALCOLI   rounded  =
                                    OC-LPUADDIZR    *  W-EURO.
           move  W-CALCOLI          to  MBN033  of  VO-DSPFM13B.
      *----------------------------------------- Addizionale Comunale
           compute  W-CALCOLI   rounded  =
                                    OC-LPUADDIZC    *  W-EURO.
           move  W-CALCOLI          to  MBN034  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. sindac.
           compute  W-CALCOLI   rounded  =
                                    OC-LPUTRASIND    *  W-EURO.
           move  W-CALCOLI          to  MBN021  of  VO-DSPFM13B.
      *----------------------------------------- Acconto
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-3  *  W-EURO.
           move  W-CALCOLI          to  MBN023  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ind.
           move  zeros              to  MBN024  of  VO-DSPFM13B.
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-1  *  W-EURO.
           add   W-CALCOLI          to  MBN024  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ANF
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-2  *  W-EURO.
           add   W-CALCOLI          to  MBN024  of  VO-DSPFM13B.
      *----------------------------------------- Interessi indennità
      *    move  zeros              to  MBN025  of  VO-DSPFM13B.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???INLEPRE    *  W-EURO.
      *    add   W-CALCOLI          to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- interessi ANF
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???INLEANE    *  W-EURO.
      *    add   W-CALCOLI          to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Assegno
           compute  W-CALCOLI   rounded  =
                                    OC-FADNETTOPAG   *  W-EURO.
           move  W-CALCOLI          to  MBN026  of  VO-DSPFM13B.
       J34-EX.
           EXIT.
      *
       J36-SSTLIRE.
           move  OC-SSTULASS        to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN012  of  VO-DSPFM13B.
      *----------------------------------------- Totale indennita'
           compute  W-CALCOLI   rounded  =
                                    OC-SSTIMINT      *  W-EURO.
           move  W-CALCOLI          to  MBN014  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. indenn.
           move  OC-SSTGGCALC        to  MBN015  of  VO-DSPFM13B.
      *----------------------------------------- Totale ANF
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???IMANFT     *  W-EURO.
      *    move  W-CALCOLI          to  MBN017  of  VO-DSPFM13B.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???MAGANFT    *  W-EURO.
      *     add  W-CALCOLI          to  MBN017  of  VO-DSPFM13B.
      *----------------------------------------- Totale gg. ANF
      *    move  OC-???ANFTOGG       to  MBN018  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AC
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOIRNCE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN020  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. IRPEF AP
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOIRNPE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN030  of  VO-DSPFM13B.
      *----------------------------------------- Totale tratt. sindac.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???TOTRSIE    *  W-EURO.
      *    move  W-CALCOLI          to  MBN022  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ind.
           compute  W-CALCOLI   rounded  =
                    (OC-SSTIMINU  +  OC-SSTIMRINU)   *  W-EURO.
           move  W-CALCOLI          to  MBN013  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo importo ANF
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???IMANFU     *  W-EURO.
      *    move  W-CALCOLI          to  MBN016  of  VO-DSPFM13B.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???MAGANF     *  W-EURO.
      *     add  W-CALCOLI          to  MBN016  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. IRPEF AC
           compute  W-CALCOLI   rounded  =
                                    OC-FACIMPNETTA   *  W-EURO.
           move  W-CALCOLI          to  MBN019  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. IRPEF AP
           compute  W-CALCOLI   rounded  =
                                    OC-FAPIMPNETTA   *  W-EURO.
           move  W-CALCOLI          to  MBN029  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AC
      *    if  OC- CONGAC ???  ><  zeroes
      *    then
      *        move  'Conguaglio Irpef A.C.'
      *    o    move  'Rimborso D.L.268/2000'
      *                             to  MBA031  of  VO-DSPFM13B
      *    end-if.
      *    compute  W-CALCOLI   rounded  =
      *                             OC- CONGAC ???  *  W-EURO.
      *    move  W-CALCOLI          to  MBN032  of  VO-DSPFM13B.
      *----------------------------------------- Conguaglio Irpef AP
           if  OC-SSTCONGFIS  <  zeroes
           then
               string  'Rimborso   Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-SSTCONGFIS    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
           if  OC-SSTCONGFIS  >  zeroes
           then
               string  'Conguaglio Irpef '   delimited  by  size
                       W4-ANNO-1             delimited  by  size
                                  into  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-SSTCONGFIS    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Conguaglio 730      *
           if  OC-SSTCONG730  not  =  zeroes
           then
               move  'Conguaglio da 730    '
                                    to  MBA031  of  VO-DSPFM13B
               compute  W-CALCOLI   rounded  =
                                    OC-SSTCONG730    *  W-EURO
               move  W-CALCOLI      to  MBN032  of  VO-DSPFM13B
           end-if.
      *----------------------------------------- Addizionale Regionale
           compute  W-CALCOLI   rounded  =
                   (OC-SSTADDIZR  +  OC-SSTADDIZRR)  *  W-EURO.
           move  W-CALCOLI          to  MBN033  of  VO-DSPFM13B.
      *----------------------------------------- Addizionale Comunale
           compute  W-CALCOLI   rounded  =
                   (OC-SSTADDIZC  +  OC-SSTADDIZRC)  *  W-EURO.
           move  W-CALCOLI          to  MBN034  of  VO-DSPFM13B.
      *----------------------------------------- Ultima tratt. sindac.
           compute  W-CALCOLI   rounded  =
                                    OC-SSTTRASIND    *  W-EURO.
           move  W-CALCOLI          to  MBN021  of  VO-DSPFM13B.
      *----------------------------------------- Acconto
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-3  *  W-EURO.
           move  W-CALCOLI          to  MBN023  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ind.
           move  zeros              to  MBN024  of  VO-DSPFM13B.
           if H-SSTIMRIN > 0
               compute  W-CALCOLI   rounded  =
                     (OC-RECIMUREE-1  +  OC-SSTRECRIN)  *  W-EURO
           else
               compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-1   *  W-EURO
           end-if.
           add   W-CALCOLI          to  MBN024  of  VO-DSPFM13B.
      *----------------------------------------- Ultimo  recupero ANF
           compute  W-CALCOLI   rounded  =
                                    OC-RECIMUREE-2  *  W-EURO.
           add   W-CALCOLI          to  MBN024  of  VO-DSPFM13B.
      *----------------------------------------- Interessi indennità
      *    move  zeros              to  MBN025  of  VO-DSPFM13B.
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???INLEPRE    *  W-EURO.
      *    add   W-CALCOLI          to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- interessi ANF
      *    compute  W-CALCOLI   rounded  =
      *                             OC-???INLEANE    *  W-EURO.
      *    add   W-CALCOLI          to  MBN025  of  VO-DSPFM13B.
      *----------------------------------------- Assegno
           compute  W-CALCOLI   rounded  =
                                    OC-FADNETTOPAG   *  W-EURO.
           move  W-CALCOLI          to  MBN026  of  VO-DSPFM13B.
       J36-EX.
           EXIT.
      *
      *---------------rivedere
      *J70-DECODIFICA.
      *------------------------------------ Decodifica comune residenza
      *    move  spaces     to  W-COMUNE
      *                         W-PROVINCIA.
      *    initialize PER-RDSUT13.
      *    move  IC-DANCCORE to R13-CODICECOMUNE.
      *    call 'RDSUT13' using R13-CODICECOMUNE
      *                         R13-NOMECOMUNE
      *                         R13-PROVINCIA
      *                         R13-RETCODE
      *                         R13-RTCD-COCO
      *                         R13-DESC-COCO
      *    end-call.
      *    cancel  'RDSUT13'.
      *    if   R13-RETCODE = '00'
      *    then
      *        move  R13-NOMECOMUNE  to  W-COMUNE
      *        move  R13-PROVINCIA   to  W-PROVINCIA
      *    else
      *--------------------------------- ERRORE in decodifica
      *        move '**ERRORE IN DECODIFICA '  to  W-COMUNE
      *        move  spaces                    to  W-PROVINCIA
      *    end-if.
      *J70-EX.
      *    EXIT.
      *
       M39-DSPF-M13B.
           if  W-NIK  =  'S'
           then
               move  '-Nuova DS-'   to  MBA099
           else
               move  spaces         to  MBA099
           end-if.
      *----------------------------------------- Anno e numero       *
           move  WB-DOMANDA               to  MBN002 .
      *----------------------------------------- Codice domus        *
           move  IC-DCOCHIDOM       to  MBA051 .
      *----------------------------------------- Cognome e nome      *
           move  IC-COMPATTO        to  MBA004 .
      *----------------------------------------- Data di nascita     *
           move  WIC-DTNASCITA      to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  MBN005 .
      *----------------------------------------- Codice fiscale      *
      *    move  IC-DCOCODFIS       to  MBA052 .
           move  IC-CODFISARCA      to  MBA052 .
      *----------------------------------------- Indirizzo
           move  WIC-DANIND         to  MBA006 .
      *----------------------------------------- C.A.P.
           move  WIC-DANCAP         to  MBN007 .
      *----------------------------------------- Comune e provincia res
           move  WIC-DANCOCORE      to  MBA008 .
           move  WIC-DANSIPRRE      to  MBA009 .
      *----------------------------------------- Coordinate bancarie
           if  IC-DCOCOOBAN  =  spaces
           then
               move  'Pagamento con ASSEGNO            '
                                    to  MBA010
           else
               string  'Accredito '  delimited  by  size
                  IC-DCOCOOBAN       delimited  by  size
                              into      MBA010
           end-if.
      *--------------------------------- Progressivo elaborazione??
      *    move  zeros              to  MBN011 .
      *----------------------------------------- Data riferim. calcolo
      *----------------------------------------- Importi
           if  W-VALUTA  =  'E'
           then
               perform  J20-MUOVIEURO      thru  J20-EX
           end-if.
           if  W-VALUTA  =  'L'
           then
               perform  J30-MUOVILIRE      thru  J30-EX
           end-if.
      *-----------VO-DSPFM13B------------------- Visualizzo
           move  OC-MESSAGGIO       to  OUT-MESSAGGIO.
           move MBA099              to RBA099   .
           move MBN002              to RBN002   .
           move MBA051              to RBA051   .
           move MBA004              to RBA004   .
           move MBN005              to RBN005   .
           move MBA052              to RBA052   .
           move MBA006              to RBA006   .
           move MBN007              to RBN007   .
           move MBA008              to RBA008   .
           move MBA009              to RBA009   .
           move MBA010              to RBA010   .
           move MBN012              to RBN012   .
           move MBN013              to RBN013   .
           move MBN014              to RBN014   .
           move MBN015              to RBN015   .
           move MBN016              to RBN016   .
           move MBN017              to RBN017   .
           move MBN019              to RBN019   .
           move MBN029              to RBN029   .
           move MBA031              to RBA031   .
           move MBN032              to RBN032   .
           move MBN033              to RBN033   .
           move MBN034              to RBN034   .
           move MBN021              to RBN021   .
           move MBN023              to RBN023   .
           move MBN024              to RBN024   .
           move MBN026              to RBN026   .
           move MBA041              to RBA041   .
      *
           MOVE  RIGA-13B-1  TO TDSREPORT-RIGA-REPORT.
           MOVE  2           TO TDSREPORT-NUM-RPT.
           MOVE  1           TO TDSREPORT-NUM-RIGA.
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
           MOVE  RIGA-13B-2  TO TDSREPORT-RIGA-REPORT.
           MOVE  2           TO TDSREPORT-NUM-RIGA.
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
           MOVE  RIGA-13B-3  TO TDSREPORT-RIGA-REPORT.
           MOVE  3           TO TDSREPORT-NUM-RIGA.
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
      *
      *    if  OC-RETCODE  =  96
           if  OC-RETCODE  NOT = ZERO
           then
               move  '96'           to  OUT-STATUS
               move  OC-MESSAGGIO   to  OUT-MESSAGGIO
           else
      *    STRING '******** ELABORAZIONE TERMINATA *****'
               move  SPACES         to  OUT-MESSAGGIO
               STRING WK-RPT-KEY   W-CHK-CAMPI
                      DELIMITED BY SIZE INTO  OUT-MESSAGGIO
      *        MOVE WK-RPT-KEY   TO  OUT-MESSAGGIO
           end-if.
       M39-EX.
           EXIT.
      *
      *
       M41-ERR-CALCOLO.
           perform  T41-TESTO41    thru  T41-EX.
      *
      *    evaluate  OC-RETCODE
      *      when  1  move
      *         'La domanda non è da calcolare.                    '
      *                   to  M4A013
      *      when  2  move
      *         'Il calcolo ed il pagamento risultano già eseguiti.'
      *                   to  M4A013
      *      when  3  move
      *         'Uno dei periodi presenta anomalie da correggere.  '
      *                   to  M4A013
      *      when  4  move
      *         'Non è presente l'importo giornaliero del pagamento'
      *                   to  M4A013
      *      when  5  move
      *         'La domanda è relativa ad un anno non gestito.     '
      *                   to  M4A013
      *      when  6  move
      *         'Non permane lo stato di disoccupazione.           '
      *                   to  M4A013
      *      when  7  move
      *         'Una o più date non risultano corrette.            '
      *                   to  M4A013
      *      when  8  move
      *         'Il modello DS56 non risulta rientrato.            '
      *                   to  M4A013
      *      when  9  move
      *         'Anomalia non gestibile nel calcolo dell'IRPEF.    '
      *                   to  M4A013
      *      when  other  move
      *         'Errore imprevisto: contattare S.R.Puglia.         '
      *                   to  M4A013
      *    end-evaluate.
      *
           if  OC-RETCODE  =  00   or   01   or   96
           then
               continue
           else
               move  OC-MESSAGGIO  to  M4A013
           end-if.
      *
           if  W-XCALCOLO  =  'Y'
           then
               continue
           else
               evaluate  W-XCALCOLO
                 when  'D'  move
                 'Errore nella tabella dei dati comuni              '
                          to  M4A013
                 when  'E'  move
                 'Errore nella tabella degli esiti.                 '
                          to  M4A013
      *          when  'P'  move
      *          'Errore sul record relativo ai pagamenti.          '
      *                   to  M4A013
                 when  'R'  move
                 'I record relativi ai recuperi non sono gestibili. '
                          to  M4A013
                 when  '?'  move
                 'Il calcolo ed il pagamento risultano ????         '
                          to  M4A013
                 when  other  move
                 'Errore imprevisto: contattare S.R.Puglia.         '
                          to  M4A013
               end-evaluate
           end-if.
      *
           move  'S'   to  W-SCRIVO.
           perform  W10-MSGERRORE  thru  W10-EX.
       M41-EX.
           EXIT.
      *
       M43-READ-ERROR.
           perform  T41-TESTO41    thru  T41-EX.
      *------------------------------------- non usato in simulazione*
      *    if  FST-ADSRPG00  not equal  '00'
      *    then
      *        move
      *        'Errore nella lettura del file Riepilogo Pagamenti.'
      *                      to  M4A013
      *    end-if.
      *------------------------------------- non usato in simulazione*
      *    if  FST-LDSRPG01  not equal  '00'
      *    then
      *        move
      *        'Errore nella lettura del file logico su Riepilogo.'
      *                      to  M4A013
      *    end-if.
      *
           if  FST-LFDATCO2  not equal  '00'
           then
               move
               'Errore nella lettura del file dei Dati Comuni     '
                             to  M4A013
           end-if.
      *
           if  FST-ADSRECUP  not equal  '00'
           then
               move
               'Errore nella lettura del file dei Recuperi.       '
                             to  M4A013
           end-if.
      *
           if  FST-ADSATTSU  not equal  '00'
           then
               move
               'Errore nella lettura degli assegni ASU            '
                             to  M4A013
           end-if.
      *
           if  FST-ADSLAVPU  not equal  '00'
           then
               move
               'Errore nella lettura del file Lavori Pubb.Utilità '
                             to  M4A013
           end-if.
      *
           if  FST-ADSSUSST  not equal  '00'
           then
               move
               'Errore nella lettura del file del Sussidio Straord'
                             to  M4A013
           end-if.
      *
      *    if  FST-LFPEERE1  not equal  '00'
      *    then
      *        move
      *        'Errore nella lettura del file Periodi Erogati     '
      *                      to  M4A013
      *    end-if.
      *
           if  FST-ADSDATAN  not equal  '00'
           then
               move
               'Errore nella lettura del file Dati Anagrafici     '
                             to  M4A013
           end-if.
      *
           if  FST-LFDELSI1  not equal  '00'
           then
               move
               'Errore nella lettura del file Deleghe sindacali   '
                             to  M4A013
           end-if.
      *
           if  FST-LFMODAN1  not equal  '00'
           then
               move
               'Errore nella lettura del file modelli A.N.F.      '
                             to  M4A013
           end-if.
      *------------------------------------- non usato in simulazione*
      *    if  FST-ADSAPIO0  not equal  '00'
      *    then
      *        move
      *        'Errore nella lettura del file Transito Pagamenti. '
      *                      to  M4A013
      *    end-if.
      *
           if  FST-ADSPERIO  not equal  '00'
           then
               move
               'Errore nella lettura del file periodi LSU/LPU/BL  '
                             to  M4A013
           end-if.
      *
           if  FST-LFSOSPE1  not equal  '00'
           then
               move
               'Errore nella lettura del file Sospensioni         '
                             to  M4A013
           end-if.
      *
           if  W-CHK-CAMPI  =  spaces
           then
               continue
           else
               move  W-CHK-CAMPI  to  M4A013
           end-if.
      *
           move  'S'   to  W-SCRIVO.
           perform  W10-MSGERRORE  thru  W10-EX.
       M43-EX.
           EXIT.
      *
       S05-STAMPA-2.
      *------------------------------- Importo assegno
      *    move OC-PMEIMULASE   to  CP-S3ASSEGNO.     ?????
      *------------------------------- Ultimo calcolo: DAL
           move  zeros          to  W8-AAAAMMGG.
           move  OC-FADINIZIO   to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S2D008.
      *------------------------------- Ultimo calcolo: AL
           move  zeros          to  W8-AAAAMMGG.
           move  OC-FADFINE     to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S2D009.
      *------------------------------- Ultimo calcolo: num.GG
      *    move  OC-PMEULPEGG     to  CP-S3ULTGG.     ?????
       S05-EX.
           EXIT.
      *
       S10-STAMPA.
      *----------------------------------------- Domanda
           move  WIC-ANNO           to  S2N001
           move  WIC-NUMERO         to  S2N002
      *----------------------------------------- Cognome/nome
           move  IC-COMPATTO        to  S2A003
      *----------------------------------------- Data di nascita
           move  WIC-DTNASCITA      to  W8-AAAAMMGG.
           move  W8-GG              to  D8-GG.
           move  W8-MM              to  D8-MM.
           move  W8-AAAA            to  D8-AAAA.
           move  D8-GGMMAAAA        to  S2D004.
      *
      *    move  'operazione '      to  S2A005
      *    move  'archivio   '      to  S2A006
      *    move  'file-status'      to  S2A007
      *------------------------------------------ cambio pagina ?
      *-------------------------------------- Riga generica calcolo
           MOVE    W-STAMPAD TO TDSREPORT-RIGA-REPORT.
           if  L-TIPOCALCOLO  =  'S'
           then
               MOVE 1    TO  TDSREPORT-NUM-RPT
           else
               MOVE 5    to  TDSREPORT-NUM-RPT
           end-if.
           add   1           TO TDSREPORT-NUM-RIGA.
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
       S10-EX.
           EXIT.
      *
       S20-ELENCA.
      *-------------------------------- Escludo per lista controllo
           if  L-TIPOCALCOLO  =  'S'
           then
               if  W-NIK  =  'S'
               then
                   continue
               else
                   go  to  S20-EX
               end-if
           end-if.
           move  'CALCOLO    '      to  S2A005
           move  OC-RETCODE         to  S2A007
           move  OC-MESSAGGIO       to  S2A006
           if  (OC-RETCODE  =  98)  or
               (OC-RETCODE  =  96)
           then
               move  'DA PDSIO13'  to  S2A006
           end-if.
      *
           if  O-RETURN-CODE  not  =  spaces
           then
               move  'ANAGRAFICA'        to  S2A006
               move  'KO RICERCA '       to  S2A005
               move  O-RETURN-CODE       to  S2A007
           end-if.
      *
           if  W-CHK-CAMPI  =  spaces
           then
               continue
           else
               move  W-CHK-CAMPI(11:10)  to  S2A005
               move  W-CHK-CAMPI(22:10)  to  S2A006
               move  'KO'                to  S2A007
           end-if.
      *
           perform  S10-STAMPA     thru  S10-EX.
       S20-EX.
           EXIT.
      *
       S30-STAMPA.
      *---------------------------------------- Lista di controllo
           move  zeros      to  S4N005
                                S4N006
                                S4N007
                                S4N008
                                S4N009.
      *---------------------------------------- Domanda
           move  WIC-ANNO            to  S4N001
           move  WIC-NUMERO          to  S4N002.
      *---------------------------------------- Nominativo           *
161115     if V-OK-IBAN  =  'OK'
           then
               move  IC-COMPATTO           to  S4A003
           else
               move  IC-COMPATTO           to  W10-COMPATTO
               move  '/COOR.BANCA ERRATE'  to  W-ERR-COOBAN
               move  W-COMPATTO            to  S4A003
           end-if.
      *---------------------------------------- Dati specifici       *
           if  W-CODICEDUE  =  42
           then
               perform  S32-REPORTASU  thru  S32-EX
           end-if.
           if  W-CODICEDUE  =  44
           then
               perform  S34-REPORTLPU  thru  S34-EX
           end-if.
           if  W-CODICEDUE  =  45
           then
               perform  S36-REPORTSST  thru  S36-EX
           end-if.
      *-------------------------------------------- Trattenute
           move  zeros            to  S4N008.
      *
            add  OC-FADTRATSIND   to  S4N008
                                      S5N008.
      *
            add  OC-FADRECSUIND   to  S4N008
                                      S5N008.
      *
            add  OC-RECIMUREE-2   to  S4N008
                                      S5N008.
      *
            add  OC-RECIMUREE-3   to  S4N008
                                      S5N008.
      *
      *-------------------------------------------- Data Dal
           move  zeros          to  W8-AAAAMMGG.
           move  OC-FADINIZIO   to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S4D011.
      *-------------------------------------------- Data Al
           move  zeros          to  W8-AAAAMMGG.
           move  OC-FADFINE     to  W8-AAAAMMGG.
             move  W8-AAAA      to  D8-AAAA.
             move  W8-MM        to  D8-MM.
             move  W8-GG        to  D8-GG.
           move  D8-GGMMAAAA    to  S4D012.
      *------------------------------------------ Inverto date x indeb.
      *    if  OC-FADINIZIO   <=  OC-FADFINE
      *    then
      *        continue
      *    else
      *        move  S4D011          to  S4D012
      *        move  D8-GGMMAAAA     to  S4D011
      *    end-if.
      *------------------------------------------ oppure azzero      *
      *    if  OC-FADINIZIO   <=  OC-FADFINE
      *    then
      *        continue
      *    else
      *        move  zeros           to  S4D011
      *    end-if.
      *-- 2° rigo dettaglio----------vedi S32/S34/S36----------------*
      *        compute  S4N021  =  (xxxxxxxx  of  R-xxxxxxxx)  /  30
      *        move  xxxxxxxxxx  of  R-xxxxxxxxxxxxx
      *                              to  S4N022
      *------------------------------------------ Giorni indennizzati*
      *        move  OC-FACGGPREST   to  S4N023.
      *         add  OC-FAPGGPREST   to  S4N023.
      *------------------------------- Interessi legali prestazione  *
      *        move  OC-xxxINLEPRE   to  S4N025
      *        add   OC-xxxINLEPRE   to  S5N005.
      *------------------------------- Interessi legali ANF          *
      *        move  OC-xxxINLEANE   to  S4N026
      *        add   OC-xxxINLEANE   to  S5N006.
      *------------------------------------------ Assegno            *
      *    compute  S4N009  =
      *            (S4N005  +  S4N006  -  S4N007  -  S4N008  +
      *             S4N025  +  S4N026)
      *    if  S4N009  >  zeros
      *    then
      *        add  S4N009          to  S5N009
      *    else
      *        move  zeros          to  S4N009
      *    end-if.
           move  OC-FADNETTOPAG     to  S4N009.
           add   OC-FADNETTOPAG     to  S5N009.
      *-------------------------------------------- Totali pagate/indeb
           move  CTR-PAGATE         to  S5N004
                                        S6N071.
      *    move  CTR-INDEBITE       to  S5N011
           move  CTR-DEFINITE       to  S5N011
                                        S6N072.
      *-------------------------------------- Riga generica calcolo
           MOVE S4N001       TO R4ANNDOM         .
           MOVE S4N002       TO R4NUMDOM         .
           MOVE S4A003       TO R4NOMECOGNOME    .
           MOVE S4N005       TO R4IMINU          .
           MOVE S4N006       TO R4PMEANFUIME     .
           MOVE S4N007       TO R4PMEULIRN1E     .
           MOVE S4N008       TO R4PMEUITRSIE     .
           MOVE S4N009       TO R4PMEAIMULASE    .
           MOVE S4A010       TO R4DCODTADEC      .
           MOVE S4D011       TO R4PMEULPEDAL     .
           MOVE S4D012       TO R4PMEULPEAL      .
           MOVE S4N023       TO R4PMEULPEGG      .
           MOVE R-STAMPAE    TO TDSREPORT-RIGA-REPORT.
           add   1           TO TDSREPORT-NUM-RIGA.
      *
           PERFORM S30-INSERT-REPORT THRU S30-EX-INSERT-REPORT.
      *
       S30-EX.
           EXIT.
      *
       S32-REPORTASU.
      *---------------------------------------- Indennità ultima     *
           if  OC-ASUIMINU    >  zeros
           then
               move  OC-ASUIMINU     to  S4N005
                add  OC-ASUIMRINU    to  S4N005
               add   OC-ASUIMINU     to  S5N005
                add  OC-ASUIMRINU    to  S5N005
           else
               move  OC-ASUIMINU     to  S4N005
               add   OC-ASUIMINU     to  S5N012
           end-if.
      *---------------------------------------- ANF       ultima     *
           move  OC-ASUIMANFU     to  S4N006
           add   OC-ASUIMANFU     to  S5N006.
      *---------------------------------------- IRPEF     ultima     *
           move  OC-ASUIRPEFU     to  S4N007
            add  OC-ASUIRPEFU     to  S5N007
      *-------------------------------------------- Conguaglio AC    *
      *            add  OC-FCONGAC     to  S4N007
      *            add  OC-FCONGAC     to  S5N007
      *-------------------------------------------- Conguaglio AP    *
           if  W8-ODIMM    =  01   or   02
           then
               add  OC-ASUCONGFIS  to  S4N007
               add  OC-ASUCONGFIS  to  S5N007
           end-if.
      *-------------------------------------------- Conguaglio 730   *
241023     if  W8-ODIMM  =  08  or  09  or  10  or  11  or  12
           then
               add  OC-ASUCONG730  to  S4N007
               add  OC-ASUCONG730  to  S5N007
           end-if.
      *-------------------------------------------- Addizionale reg. *
            add   OC-ASUADDIZR    to  S4N007
            add   OC-ASUADDIZRR   to  S4N007
            add   OC-ASUADDIZR    to  S5N007.
            add   OC-ASUADDIZRR   to  S5N007
      *-------------------------------------------- Addizionale com. *
            add   OC-ASUADDIZC    to  S4N007
            add   OC-ASUADDIZRC   to  S4N007
            add   OC-ASUADDIZC    to  S5N007.
            add   OC-ASUADDIZRC   to  S5N007
      *-------------------------------------------- Decadenza        *
           move  spaces          to  S4A010.
           if  OC-ASUDADEC   >  zeros
           then
               move  'S'             to  S4A010
           end-if.
      *------------------------------------------ Giorni indennizzati*
           move  OC-ASUGGCALC    to  S4N023.
       S32-EX.
           EXIT.
      *
       S34-REPORTLPU.
      *---------------------------------------- Indennità ultima     *
           if  OC-LPUIMINU    >  zeros
           then
               move  OC-LPUIMINU     to  S4N005
               add   OC-LPUIMINU     to  S5N005
           else
               move  OC-LPUIMINU     to  S4N005
               add   OC-LPUIMINU     to  S5N012
           end-if.
      *---------------------------------------- ANF       ultima     *
           move  OC-LPUIMANFU     to  S4N006
           add   OC-LPUIMANFU     to  S5N006.
      *---------------------------------------- IRPEF     ultima     *
           move  OC-LPUIRPEFU     to  S4N007
            add  OC-LPUIRPEFU     to  S5N007
      *-------------------------------------------- Conguaglio AC    *
      *            add  OC-FCONGAC     to  S4N007
      *            add  OC-FCONGAC     to  S5N007
      *-------------------------------------------- Conguaglio AP    *
           if  W8-ODIMM    =  01   or   02
           then
               add  OC-LPUCONGFIS  to  S4N007
               add  OC-LPUCONGFIS  to  S5N007
           end-if.
      *-------------------------------------------- Conguaglio 730   *
241023     if  W8-ODIMM    =  08  or  09  or  10  or  11  or  12
           then
               add  OC-LPUCONG730  to  S4N007
               add  OC-LPUCONG730  to  S5N007
           end-if.
      *-------------------------------------------- Addizionale reg. *
            add   OC-LPUADDIZR    to  S4N007
            add   OC-LPUADDIZR    to  S5N007.
      *-------------------------------------------- Addizionale com. *
            add   OC-LPUADDIZC    to  S4N007
            add   OC-LPUADDIZC    to  S5N007.
      *-------------------------------------------- Decadenza        *
           move  spaces          to  S4A010.
           if  OC-LPUDADEC   >  zeros
           then
               move  'S'             to  S4A010
           end-if.
      *------------------------------------------ Giorni indennizzati*
           move  OC-LPUGGCALC    to  S4N023.
       S34-EX.
           EXIT.
      *
       S36-REPORTSST.
      *---------------------------------------- Indennità ultima     *
           if  OC-SSTIMINU    >  zeros
           then
               move  OC-SSTIMINU     to  S4N005
               add   OC-SSTIMRINU    to  S4N005
               add   OC-SSTIMINU     to  S5N005
               add   OC-SSTIMRINU    to  S5N005
           else
               move  OC-SSTIMINU     to  S4N005
               add   OC-SSTIMINU     to  S5N012
           end-if.
      *---------------------------------------- ANF       ultima     *
      *    move  OC-___IMANFU     to  S4N006
      *    add   OC-___IMANFU     to  S5N006.
      *---------------------------------------- IRPEF     ultima     *
           move  OC-SSTIRPEFU     to  S4N007
            add  OC-SSTIRPEFU     to  S5N007
      *-------------------------------------------- Conguaglio AC    *
      *            add  OC-FCONGAC     to  S4N007
      *            add  OC-FCONGAC     to  S5N007
      *-------------------------------------------- Conguaglio AP    *
           if  W8-ODIMM    =  01   or   02
           then
               add  OC-SSTCONGFIS  to  S4N007
               add  OC-SSTCONGFIS  to  S5N007
           end-if.
      *-------------------------------------------- Conguaglio 730   *
241023     if  W8-ODIMM  =  08  or  09  or  10  or  11  or  12
           then
               add  OC-SSTCONG730  to  S4N007
               add  OC-SSTCONG730  to  S5N007
           end-if.
      *-------------------------------------------- Addizionale reg. *
            add   OC-SSTADDIZR    to  S4N007
            add   OC-SSTADDIZRR   to  S4N007
            add   OC-SSTADDIZR    to  S5N007.
            add   OC-SSTADDIZRR   to  S5N007
      *-------------------------------------------- Addizionale com. *
            add   OC-SSTADDIZC    to  S4N007
            add   OC-SSTADDIZRC   to  S4N007
            add   OC-SSTADDIZC    to  S5N007.
            add   OC-SSTADDIZRC   to  S5N007
      *-------------------------------------------- Decadenza        *
           move  spaces          to  S4A010.
           if  IC-SSTDADEC   >  zeros
           then
               move  'S'             to  S4A010
           end-if.
      *------------------------------------------ Giorni indennizzati*
           move  OC-SSTGGCALC    to  S4N023.
       S36-EX.
           EXIT.
      *
      *
       S40-IMPOSTAZIONI.
           move  W-CALCOLO-AL     to  W8-AAAAMMGG.
           move  W8-AAAA          to  D8-AAAA.
           move  W8-MM            to  D8-MM.
           move  W8-GG            to  D8-GG.
      *-------------------------------------- Stampa
           MOVE TDSREPORT-MATRICOLA TO WK-RPT-MATRICOLA.
           MOVE TDSREPORT-SEDE      TO WK-RPT-SEDE.
           MOVE TDSREPORT-CEOP      TO WK-RPT-CEOP.
           MOVE TDSREPORT-DTA-PRE   TO WK-RPT-DTA-PRE.
           MOVE TDSREPORT-ORA-PRE   TO WK-RPT-ORA-PRE.
      *
      *     STRING '******** ELABORAZIONE TERMINATA *****'
      *    MOVE WK-RPT-KEY   TO  OUT-MESSAGGIO.
      *
              STRING
                 WK-RPT-KEY
                 CTR-LET-DATCO
                 CTR-ELA-DATCO
                 CTR-SCR-DATCO
                 CTR-LET-DATAN
                 CTR-ELA-DATAN
                 CTR-SCR-DATAN
                 CTR-IMPREVISTI
                 CTR-PAGATE
                 CTR-DEFINITE
                 CTR-INDEBITE
                 CTR-ATT-PAGME
              DELIMITED BY SIZE INTO OUT-MESSAGGIO .
      *
      *
       S40-EX.
           EXIT.
      *-----------------------------------------------Testi msg
      *Txx-TESTOxx.
      *    move spaces  to  M4A011
      *                     M4A012
      *                     M4A013
      *                     M4A014.
      *    move 'ATTENZIONE:  errore generico nella determinazione '
      *         to  M4A011.
      *    move 'dell'importo xxx xxxxxxxxx: verificare anni, tipo '
      *         to  M4A012.
      *    move 'e componenti xxxxxx e se necessita tel.06-59053346'
      *         to  M4A013.
      *    move 'o al n.080-5724591.                   Si termina. '
      *         to  M4A014.
      *Txx-EX.
      *    EXIT.
      *
       T09-TESTO09.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '                                   Dalla data di '
      *    move 'COMUNICAZIONE: Dalla data di sospensione dei paga'
                to  M4A011.
           move 'sospensione di fine anno  fino alla fine  delle'
                to  M4A012.
           move 'elaborazioni contabili  e fiscali, saranno inibite'
                to  M4A013.
           move 'le opzioni relative al pagamento.                 '
                to  M4A014.
       T09-EX.
           EXIT.
      *
       T04-TESTO04.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore generico nella consultazione  '
                to  M4A011.
           move 'dei valori di sistema;                            '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A013.
       T04-EX.
           EXIT.
       T10-TESTO10.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione:  risulta  in corso  altra elaborazione'
                to  M4A011.
           move 'relativa al pagamento della prestazione: riprovare'
                to  M4A012.
           move 'a elaborazione completata.                        '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T10-EX.
           EXIT.
       T12-TESTO12.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione: sono in atto altre elaborazioni  '
                to  M4A011.
           move 'sullo stesso archivio, incompatibili con la fase  '
                to  M4A012.
           move 'richiesta.                                        '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T12-EX.
           EXIT.
       T13-TESTO13.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  non  risulta  disponibile il record  '
                to  M4A011.
           move 'di riepilogo della struttura, indispensabile alla '
                to  M4A012.
           move 'corretta  gestione  dell''applicazione.            '
                to  M4A013.
           move '                        Il programma termina.     '
                to  M4A014.
       T13-EX.
           EXIT.
       T14-TESTO14.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione: risulta gia'' in uso l''archivio di '
                to  M4A011.
           move 'appoggio  per il  pagamento  della disoccupazione '
                to  M4A012.
           move 'ordinaria.                                        '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T14-EX.
           EXIT.
241023 T15-TESTO15.
           MOVE '96'         TO  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione: il giorno 1 del mese le elaborazioni di'
                to  M4A011.
           move 'pagamento sono possibile dalle ore 01:30:00       '
                to  M4A012.
           move '      Il programma termina                        '
                to  M4A013.
           move '                                                  '
                to  M4A014.
       T15-EX.
241023     EXIT.
       T16-TESTO16.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione:  il calcolo per il pagamento nei '
                to  M4A011.
           move 'mesi di Agosto, Settembre, Ottobre e Novembre non '
                to  M4A012.
           move 'può essere attivato dopo il giorno 26 per elabora-'
                to  M4A013.
           move 'zioni collegate al conguaglio fiscale del Mod.730 '
                to  M4A014.
       T16-EX.
           EXIT.
       T17-TESTO17.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move '     Attenzione:  il calcolo per il pagamento nel '
                to  M4A011.
           move 'mesi di Dicembre non puo''essere attivato dopo il '
                to  M4A012.
           move 'giorno 20 per elaborazioni collegate al conguaglio'
                to  M4A013.
           move 'fiscale di fine anno.                             '
                to  M4A014.
       T17-EX.
           EXIT.
       T18-TESTO18.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'Attenzione: e''stata  richiesta l elaborazione da '
                to  M4A011.
           move 'un numero di domanda che risulta maggiore dell''ul'
                to  M4A012.
           move 'tima presente nell''archivio.                      '
                to  M4A013.
           move '                       Il programma termina.      '
                to  M4A014.
       T18-EX.
           EXIT.
       T19-TESTO19.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  non  risulta corretta la versione dei'
                to  M4A011.
           move 'programmi  della Gestione  Fiscale, indispensabili'
                to  M4A012.
           move 'per il funzionamento dell''applicazione.           '
                to  M4A013.
           move '                        Il programma termina.     '
                to  M4A014.
       T19-EX.
           EXIT.
       T40-TESTO40.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore generico nella consultazione  '
                to  M4A011.
           move 'delle tabelle di sede    (archivio ADSSTART) ;    '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A013.
       T40-EX.
           EXIT.
       T41-TESTO41.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  non e'' possibile effettuare il calcolo'
                to  M4A011.
           move 'della domanda per il seguente motivo:             '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A014.
       T41-EX.
           EXIT.
       T50-TESTO50.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE: non essendo presente  nelle domande il'
                to  M4A011.
           move 'codice della  struttura,e''necessario indicare gli'
                to  M4A012.
           move 'intervalli esatti di domande di propria competenza'
                to  M4A013.
           move 'per evitare di elaborare quelle di altre strutture'
                to  M4A014.
       T50-EX.
           EXIT.
       T70-TESTO70.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  Si e'' verificato un errore non gestito'
                to  M4A011.
           move 'nella consultazione dei  dati della struttura e   '
                to  M4A012.
           move 'quindi non e'' possibile continuare l''elaborazione. '
                to  M4A013.
      *    move '                                                  '
      *         to  M4A014.
       T70-EX.
           EXIT.
       T71-TESTO71.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  La  struttura  operativa  in uso  non'
                to  M4A011.
           move 'risulta  abilitata  alla  presenta  procedura  di '
                to  M4A012.
           move 'pagamento delle prestazioni: le relative funzioni '
                to  M4A013.
           move 'vengono inibite.                                  '
                to  M4A014.
       T71-EX.
           EXIT.
       T90-TESTO90.
           move  '96'               to  OUT-STATUS.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  errore, non gestibile, nella fase di '
                to  M4A011.
           move 'chiusura dell''elaborazione;e'' opportuno chiudere  '
                to  M4A012.
           move 'l applicazione e uscire con il SIGNOFF  prima di  '
                to  M4A013.
           move 'avviare altre elaborazioni.                       '
                to  M4A014.
       T90-EX.
           EXIT.
      *---------------------------- Le 3 seguenti sono da togliere
      *    perform  T91-TESTO91    thru  T91-EX.
      *    perform  W10-MSGERRORE  thru  W10-EX.
      *        go  to  I39-EX.
       T91-TESTO91.
           move  '96'               to  OUT-STATUS.
           move spaces  to  M4A011  M4A012  M4A013  M4A014.
           move 'ATTENZIONE:  la presente funzione e'' di prossima   '
                to  M4A011.
           move 'implementazione.   Attualmente NON disponibile.   '
                to  M4A012.
           move '                        Il programma termina.     '
                to  M4A013.
       T91-EX.
           EXIT.
      *
      *
      *W10-MSGERRORE.
      *    MOVE  'MESS'      TO  MTIPO-ERR.
      *    MOVE  'XREADDS'   TO  MCHIAMANTE.
      *    CALL 'RPNPERR'
      *                  USING FOR-RPNPERRE
      *    END-CALL.
      *    CANCEL 'RPNPERR'.
      *W10-EX.
      *    EXIT.
      *
      *W10-MSGERRORE.
      *    MOVE  'MESS'      TO  MTIPO-ERR.
      *    MOVE  'XREADDS'   TO  MCHIAMANTE.
      *    CALL 'RPNPERR'
      *                  USING FOR-RPNPERRE
      *    END-CALL.
      *    CANCEL 'RPNPERR'.
      *W10-EX.
      *    EXIT.

       W10-MSGERRORE.
      *------------------------------ Imposto su mappa anno e numero
      *
           if  OUT-STATUS = '96' OR OUT-STATUS = '99'
           then
               move  SPACES        to  OUT-MESSAGGIO
               STRING WK-RPT-KEY   VO-DSPFM134
               DELIMITED BY SIZE INTO  OUT-MESSAGGIO
           end-if.
      *
           if  OC-RETCODE  not  equal  zeros
           then
               move  OC-MESSAGGIO  to  OUT-MESSAGGIO
           end-if.
       W10-EX.
           EXIT.
      *
      *********************************************************************
      *                                                                   *
      *           SQL DB2                                                 *
      *********************************************************************
      *
      ******************************************************************
      *       CLOSE DEI CURSORI
      ******************************************************************

      *
       DATICOMUNI-DB2-CLSCUR.
      *
           MOVE 'DATICOMUNI-DB2-CLSCUR'   TO WABNDB-LABEL.
           IF WK-CURS = '1'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO1
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO1
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '2'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO2
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO2
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '3'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO3
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO3
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '4'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO4
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO4
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '5'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO5
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO5
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '6'
              IF KLIVAUTO = '5'
                 EXEC SQL
                     CLOSE CURSSCO6
                 END-EXEC
              ELSE
                 EXEC SQL
                     CLOSE CURSDCO6
                 END-EXEC
              END-IF
           END-IF.
      *
      *    move  SQLCODE               to  FST-LFDATCO2.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'DATICOMUNI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       DATICOMUNI-DB2-CLSCUR-EX.
            exit.
      *
       RECUPERI-DB2-CLSCUR.
      *
           MOVE 'RECUPERI-DB2-CLSCUR'   TO WABNDB-LABEL.
      *
           EXEC SQL
                CLOSE CURRECUP
           END-EXEC.
      *    move  SQLCODE               to  FST-ADSRECUP.
           IF SQLCODE NOT = ZERO
               MOVE 'RECUPERI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       RECUPERI-DB2-CLSCUR-EX.
           EXIT.
      *
       REC43-DB2-CLSCUR.
      *
           MOVE 'REC43-DB2-CLSCUR'   TO WABNDB-LABEL.
      *
           EXEC SQL
                CLOSE CURREC43
           END-EXEC.
      *    move  SQLCODE               to  FST-ADSRECUP.
           IF SQLCODE NOT = ZERO
               MOVE 'RECUPERI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       REC43-DB2-CLSCUR-EX.
            exit.
      *
      *
       DATIANF-DB2-CLSCUR.
      *
           MOVE 'DATIANF-DB2-CLSCUR' TO WABNDB-LABEL.
           EXEC SQL
                 CLOSE CURANF
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-LFMODAN1.

           IF SQLCODE NOT = ZERO
               MOVE 'DATIANF '    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *

       DATIANF-DB2-CLSCUR-EX.
           exit.
      *
       DELEGHE-DB2-CLSCUR.
      *
           MOVE 'DELEGHE-DB2-CLSCUR' TO WABNDB-LABEL.
      *    move  SQLCODE               to  FST-LFDELSI1.
           EXEC SQL
                 CLOSE CURDELEG
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSDELSI'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       DELEGHE-DB2-CLSCUR-EX.
           exit.
      *
       SOSPENSIONI-DB2-CLSCUR.
      *
           MOVE 'SOSPENSIONI-DB2-CLSCUR' to  WABNDB-LABEL.
           EXEC SQL
                 CLOSE CURSOSP
           END-EXEC.
      *
      *    move  SQLCODE               to  FST-LFSOSPE1.
           IF SQLCODE NOT = ZERO
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       SOSPENSIONI-DB2-CLSCUR-EX.
           exit.
      *
       TDSPERIO-DB2-CLSCUR.
      *
           MOVE 'tdsperio-DB2-CLSCUR' to  WABNDB-LABEL.
           EXEC SQL
                 CLOSE CURPERI
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSPERIO.

           IF SQLCODE NOT = ZERO
               MOVE 'LFPEERT1'    TO  WABNDB-TABL
               MOVE 'CLOSE'       TO  WABNDB-FUNC
      *        PERFORM ERRORE-SQL
           END-IF.
      *

       TDSPERIO-DB2-CLSCUR-EX.
           exit.
      *
      ******************************************************************
      *       DECLARE/OPEN DEI CURSORI
      ******************************************************************

      *
       B20-DB2-DECL-CURS.
      *--------------------------------  File dati comuni (LFDATCO2) *
           MOVE  L-CODICE-SEDE    TO    H-DCOCOSEGR.
           MOVE 'B20-DB2-DECL-CURS' to  WABNDB-LABEL.
      *
           IF WK-CURS = '1'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO1
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO1
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '2'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO2
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO2
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '3'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO3
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO3
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '4'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO4
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO4
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '5'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO5
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO5
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '6'
              IF KLIVAUTO = '5'
                 EXEC SQL
                      OPEN CURSSCO6
                 END-EXEC
              ELSE
                 EXEC SQL
                      OPEN CURSDCO6
                 END-EXEC
              END-IF
           END-IF.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSDATCO'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
           move  SQLCODE               to  FST-LFDATCO2.
       B20-DB2-DECL-CURS-EX.
           EXIT.
      *
       L16-DB2-DECL-CURS.
      *
           MOVE  L-CODICE-SEDE    TO    H-RECCOSEDE.
           MOVE 'l16-DB2-DECL-CURS' to  WABNDB-LABEL.
      *
           EXEC SQL
                OPEN CURRECUP
           END-EXEC.
           move  SQLCODE               to  FST-ADSRECUP.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSRECUP'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L16-DB2-DECL-CURS-EX.
           EXIT.
      *
       L25-DB2-DECL-CURS.
      *
           MOVE  L-CODICE-SEDE    TO    H-DSICOSEDE.
           MOVE 'L25-DB2-DECL-CURS' to  WABNDB-LABEL.
      *
           EXEC SQL
                 OPEN CURDELEG
           END-EXEC.
           move  SQLCODE               to  FST-LFDELSI1.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSDELSI'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L25-DB2-DECL-CURS-EX.
           EXIT.
      *
       L28-DB2-DECL-CURS.
           MOVE 'L28-DB2-DECL-CURS'  TO WABNDB-LABEL.
      *
           MOVE  L-CODICE-SEDE    TO    H-ANFCOSEDE.
      *
           EXEC SQL
                 OPEN CURANF
           END-EXEC.
           move  SQLCODE               to  FST-LFMODAN1.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSANFDI'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L28-DB2-DECL-CURS-EX.
           EXIT.
      *
       L49-DB2-DECL-CURS.
      *
           MOVE  L-CODICE-SEDE    TO    H-SOSCOSEDE.
           MOVE 'L49-DB2-DECL-CURS' to  WABNDB-LABEL.
      *
           EXEC SQL
                 OPEN CURSOSP
           END-EXEC.
           move  SQLCODE               to  FST-LFSOSPE1.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L49-DB2-DECL-CURS-EX.
           EXIT.
      *
       E43-DB2-DECL-CURS.
      *
           MOVE 'E43-DB2-DECL-CURS'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-RECCOSEDE.
      *
           EXEC SQL
                 OPEN CURREC43
           END-EXEC.
           move  SQLCODE               to  FST-ADSRECUP.
      *
           IF SQLCODE NOT = ZERO
               MOVE 'TDSRECUP'    TO  WABNDB-TABL
               MOVE 'OPEN '       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E43-DB2-DECL-CURS-EX.
           EXIT.
      *
       L70-DB2-DECL-CURS.
      *
           MOVE 'L70-DB2-DECL-CURS' to  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PERCOSEDE.
      *
           EXEC SQL
                 OPEN CURPERI
           END-EXEC.
           move  SQLCODE               to  FST-ADSPERIO.
      *
       L70-DB2-DECL-CURS-EX.
           EXIT.
      *
      ******************************************************************

      *      FETCH
      ******************************************************************

      *
      *--------------------------------  File dati comuni (LFDATCO2) *

       B20-DB2-FETCH.
      *
           IF WK-CURS = '1'
              IF KLIVAUTO = '5'
                EXEC SQL
                 FETCH CURSSCO1
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
                END-EXEC
              ELSE
                EXEC SQL
                 FETCH CURSDCO1
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '2'
              IF KLIVAUTO = '5'
                 EXEC SQL
                 FETCH CURSSCO2
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
                END-EXEC
              ELSE
                EXEC SQL
                 FETCH CURSDCO2
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
                 END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '3'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO3
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO3
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '4'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO4
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO4
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '5'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO5
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO5
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           IF WK-CURS = '6'
              IF KLIVAUTO = '5'
              EXEC SQL
                 FETCH CURSSCO6
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              ELSE
              EXEC SQL
                 FETCH CURSDCO6
                  INTO
                   :H-DCOCODFIS,
                   :H-DCOCENOPE,
                   :H-DCOCOTIDO,
                   :H-DCOCHIDOM,
                   :H-DCOPENS,
                   :H-DCOANFRIC,
                   :H-DCOANVEPR,
                   :H-DCONDVEPR,
                   :H-DCOULESPP,
                   :H-DCODTULPP,
                   :H-DCOULESSP,
                   :H-DCODTULSP,
                   :H-DCODTPRDO,
                   :H-DCODTDECPP,
                   :H-DCODTDECSP,
                   :H-DCOCODPAT,
                   :H-DCOZONPAT,
                   :H-DCOMODARR,
                   :H-DCOCOOBAN,
                   :H-DCOCOREIM,
                   :H-DCOTRDOCE,
                   :H-DCODTCODO,
                   :H-DCODTVIR,
                   :H-DCOINT,
                   :H-DCORECNUO,
                   :H-DCODTADEC,
                   :H-DCOPESTDI,
                   :H-DCOTRDODO,
                   :H-DCOCOERMI,
                   :H-DCODORICO,
                   :H-DCOFLASU,
                   :H-DCONUPRO,
                   :H-DCOIBAN
              END-EXEC
              END-IF
           END-IF.
      *
           move  SQLCODE               to  FST-LFDATCO2.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               MOVE 'TDSDATCO'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       B20-DB2-FETCH-EX.
           EXIT.
      *
       L70-DB2-FETCH.
           EXEC SQL
                 FETCH CURPERI
                  INTO
                 :H-PERCHIDOM,
                 :H-PERCODICE,
                 :H-PERCOSEDE,
                 :H-PERDAAL ,
                 :H-PERDADAL ,
                 :H-PERORELAV,
                 :H-PERTIPOPRE,
                 :H-PERCHIDOM ,
                 :H-PERCODICE ,
                 :H-PERCOSEDE ,
                 :H-PERDAAL ,
                 :H-PERDADAL ,
                 :H-PERORELAV ,
                 :H-PERTIPOPRE
          END-EXEC.
           move  SQLCODE               to  FST-ADSPERIO.
      *
       L70-DB2-FETCH-EX.
           EXIT.
      *
       L16-DB2-FETCH.
           EXEC SQL
                 FETCH CURRECUP
                  INTO
                        :H-RECCHIDOM,
                        :H-RECPROREC,
                        :H-RECTOREEE,
                        :H-RECTORERE,
                        :H-RECCOREAL,
                        :H-RECCORENU,
                        :H-RECIMPRAE,
                        :H-RECCAUREC,
                        :H-RECTIPREC,
                        :H-RECCHDDVI,
                        :H-RECIMUREE,
                        :H-RECDTESRE,
                        :H-RECNUMRAT,
                        :H-RECCODBIL,
                        :H-RECIIRPEF,
                        :H-RECCOSEDE
          END-EXEC.
           move  SQLCODE               to  FST-ADSRECUP.

      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               MOVE 'TDSRECUP'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L16-DB2-FETCH-EX.
           EXIT.
      *
       L25-DB2-FETCH.
      *
           EXEC SQL
                 FETCH CURDELEG
                  INTO
                 :H-DSICHIDOM,
                 :H-DSIDTINIS,
                 :H-DSIDTFIIS,
                 :H-DSICODSIN,
                 :H-DSICATSIN,
                 :H-DSICOSEDE
          END-EXEC.
           move  SQLCODE               to  FST-LFDELSI1.

      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               MOVE 'TDSDELSI'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *

       L25-DB2-FETCH-EX.
           EXIT.
      *
       L28-DB2-FETCH.
      *
           MOVE 'L28-DB2-FETCH'  TO WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CURANF
                  INTO
                     :H-ANFCOSEDE,
                     :H-ANFCODFIS,
                     :H-ANFDTDEVA,
                     :H-ANFCHIDOM,
                     :H-ANFCONUFA,
                     :H-ANFNUMFIG,
                     :H-ANFNUMGEN,
                     :H-ANFPREINV,
                     :H-ANFTIPINV,
                     :H-ANFFIGMIN,
                     :H-ANFTIPNUC,
                     :H-ANFREDFAE,
                     :H-ANFANRIRE,
                     :H-ANFTABELLA,
                     :H-ANFIMPMENS,
                     :H-ANFIMPGIOR
          END-EXEC.
           move  SQLCODE               to  FST-LFMODAN1.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               MOVE 'TDSANFDI'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L28-DB2-FETCH-EX.
           EXIT.
      *
       L49-DB2-FETCH.
      *
           EXEC SQL
                 FETCH CURSOSP
                  INTO
                 :H-SOSCOSEDE,
                 :H-SOSCODFIS,
                 :H-SOSDTINSOS,
                 :H-SOSCHIDOM,
                 :H-SOSDTFISOS,
                 :H-SOSCODSOS,
                 :H-SOSDTCOM
          END-EXEC.
           move  SQLCODE               to  FST-LFSOSPE1.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.

      *
       L49-DB2-FETCH-EX.
           EXIT.
      *
       E43-DB2-FETCH.
      *
            MOVE 'E43-DB2-FETCH'  TO WABNDB-LABEL.
      *
           EXEC SQL
                 FETCH CURREC43
                  INTO
                :H-RECCHIDOM,
                :H-RECPROREC,
                :H-RECTOREEE,
                :H-RECTORERE,
                :H-RECCOREAL,
                :H-RECCORENU,
                :H-RECIMPRAE,
                :H-RECCAUREC,
                :H-RECTIPREC,
                :H-RECCHDDVI,
                :H-RECIMUREE,
                :H-RECDTESRE,
                :H-RECNUMRAT,
                :H-RECCODBIL,
                :H-RECIIRPEF,
                :H-RECCOSEDE
          END-EXEC.
           move  SQLCODE               to  FST-ADSRECUP.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               MOVE 'TDSRECUP'    TO  WABNDB-TABL
               MOVE 'FETCH'       TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E43-DB2-FETCH-EX.
           EXIT.
      *
      *
      ******************************************************************
      *      UPDATE
      ******************************************************************
      *
       E39-DB2-COM-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    H-DCOCOSEGR.
      *
           EXEC SQL
           UPDATE    TDSDATCO
            SET
                    H_DCOULESSP     = :H-DCOULESSP,
                    H_DCODTULSP     = :H-DCODTULSP,
                    H_DCOTRDOCE     = :H-DCOTRDOCE,
                    H_DCODTADEC     = :H-DCODTADEC,
                    H_DCOTRDODO     = :H-DCOTRDODO

              WHERE
                     H_DCOCHIDOM      =  :H-DCOCHIDOM
                AND  H_DCOCOSEGR      =  :H-DCOCOSEGR
           END-EXEC.
      *
           move  SQLCODE               to  FST-LFDATCO2.

           IF  SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'REWRITE   '       to  S2A005
                 move  'LFDATCO2  '       to  S2A006
                 move  SQLCODE            to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
           END-IF.
      *
       E39-DB2-COM-UPD-EX.
           EXIT.
      *
       E44-DB2-REC-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    H-RECCOSEDE.
      *
           EXEC SQL
           UPDATE  TDSRECUP
            SET
                H_RECTORERE     = :H-RECTORERE,
                H_RECIMUREE     = :H-RECIMUREE,
                H_RECDTESRE     = :H-RECDTESRE
             WHERE
                     H_RECCHIDOM      =  :H-RECCHIDOM
                AND  H_RECPROREC      =  :H-RECPROREC
                AND  H_RECCOSEDE      =  :H-RECCOSEDE
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSRECUP.

           IF  SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'REWRITE   '       to  S2A005
                 move  'ADSRECUP  '       to  S2A006
                 move  SQLCODE            to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
           END-IF.
      *
       E44-DB2-REC-UPD-EX.
           EXIT.

      *
       E47-DB2-SIT-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    H-STDCOSEDE.
      *
           EXEC SQL
           UPDATE   TDSSITDO
            SET
                H_STDDTMOPRD     = :H-STDDTMOPRD,
                H_STDESITPRD     = :H-STDESITPRD
             WHERE
                     H_STDCHIDOM      =  :H-STDCHIDOM
                AND  H_STDCOSEDE      =  :H-STDCOSEDE
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSSITDO.

           IF  SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'REWRITE   '       to  S2A005
                 move  'ADSSITDO  '       to  S2A006
                 move  SQLCODE            to  S2A007
                 perform  S10-STAMPA     thru  S10-EX
           END-IF.
      *
       E47-DB2-SIT-UPD-EX.
           EXIT.
      *
       E64-DB2-UPDATE.
      *
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
           MOVE 'E64-DB2-UPDATE'  TO WABNDB-LABEL.
      *
           EXEC SQL
           UPDATE TDSRPG00
           SET
               H_PCALCOLATI        =  :H-PCALCOLATI,
               H_PZEROPAGAM        =  :H-PZEROPAGAM
            WHERE
                     H_PCOSEDE        =  :H-PCOSEDE
                AND  H_PDATAELABO     =  :H-PDATAELABO
                AND  H_PPROCEDURA     =  :H-PPROCEDURA
                AND  H_PPROGRESSI     =  :H-PPROGRESSI
                AND  H_PSTRUTTURA     =  :H-PSTRUTTURA
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSRPG00.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'update '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E64-DB2-UPDATE-EX.
           EXIT.
      *
      ******************************************************************

      *      SELECT
      ******************************************************************
      *
       L61-DB2-SELECT.
      *
           MOVE 'L61-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-ASUCOSEDE.
      *
           EXEC SQL
           SELECT
                   H_ASUADDIZC,
                   H_ASUADDIZR,
                   H_ASUADDIZRC,
                   H_ASUADDIZRR,
                   H_ASUANFASUT,
                   H_ASUANFASUU,
                   H_ASUANNODEL,
                   H_ASUCA,
                   H_ASUCFENTE,
                   H_ASUCHIDOM,
                   H_ASUCODPRES,
                   H_ASUCONG730,
                   H_ASUCONGFIS,
                   H_ASUCOSEDE,
                   H_ASUCSC,
                   H_ASUCSCIMP,
                   H_ASUDACESS,
                   H_ASUDADEC,
                   H_ASUDADISOC,
                   H_ASUDAPE,
                   H_ASUDARIN,
                   H_ASUDECLINO,
                   H_ASUDESTASS,
                   H_ASUDESTCAP,
                   H_ASUDESTCOM,
                   H_ASUDESTPRO,
                   H_ASUDIRITTO,
                   H_ASUEDIL,
                   H_ASUFIN,
                   H_ASUFLUSSO,
                   H_ASUGGCALC,
                   H_ASUGGMAPRE,
                   H_ASUIMANFT,
                   H_ASUIMANFU,
                   H_ASUIMASUT,
                   H_ASUIMASUU,
                   H_ASUIMINT,
                   H_ASUIMINU,
                   H_ASUIMPE,
                   H_ASUIMRIN,
                   H_ASUIMRINU,
                   H_ASUINCENT,
                   H_ASUINDEB,
                   H_ASUIRPEFU,
                   H_ASULPU,
                   H_ASUMAGANF,
                   H_ASUMAGANFT,
                   H_ASUMATASUT,
                   H_ASUMATASUU,
                   H_ASUMATIMP,
                   H_ASUMATRAZ,
                   H_ASUMEZZO,
                   H_ASUMODEC,
                   H_ASUNUMDEL,
                   H_ASUORE,
                   H_ASUQUALIF,
                   H_ASURECRIN,
                   H_ASUREIERIN,
                   H_ASURETRORA,
                   H_ASUTIPCON,
                   H_ASUTIPPROG,
                   H_ASUTRASIND,
                   H_ASUTRASINR,
                   H_ASUTSCAT,
                   H_ASUTSCONF,
                   H_ASUUFFCOL,
                   H_ASUULASS,
                   H_ASUULTRA
           INTO
                   :H-ASUADDIZC,
                   :H-ASUADDIZR,
                   :H-ASUADDIZRC,
                   :H-ASUADDIZRR,
                   :H-ASUANFASUT,
                   :H-ASUANFASUU,
                   :H-ASUANNODEL,
                   :H-ASUCA,
                   :H-ASUCFENTE,
                   :H-ASUCHIDOM,
                   :H-ASUCODPRES,
                   :H-ASUCONG730,
                   :H-ASUCONGFIS,
                   :H-ASUCOSEDE,
                   :H-ASUCSC,
                   :H-ASUCSCIMP,
                   :H-ASUDACESS,
                   :H-ASUDADEC,
                   :H-ASUDADISOC,
                   :H-ASUDAPE,
                   :H-ASUDARIN,
                   :H-ASUDECLINO,
                   :H-ASUDESTASS,
                   :H-ASUDESTCAP,
                   :H-ASUDESTCOM,
                   :H-ASUDESTPRO,
                   :H-ASUDIRITTO,
                   :H-ASUEDIL,
                   :H-ASUFIN,
                   :H-ASUFLUSSO,
                   :H-ASUGGCALC,
                   :H-ASUGGMAPRE,
                   :H-ASUIMANFT,
                   :H-ASUIMANFU,
                   :H-ASUIMASUT,
                   :H-ASUIMASUU,
                   :H-ASUIMINT,
                   :H-ASUIMINU,
                   :H-ASUIMPE,
                   :H-ASUIMRIN,
                   :H-ASUIMRINU,
                   :H-ASUINCENT,
                   :H-ASUINDEB,
                   :H-ASUIRPEFU,
                   :H-ASULPU,
                   :H-ASUMAGANF,
                   :H-ASUMAGANFT,
                   :H-ASUMATASUT,
                   :H-ASUMATASUU,
                   :H-ASUMATIMP,
                   :H-ASUMATRAZ,
                   :H-ASUMEZZO,
                   :H-ASUMODEC,
                   :H-ASUNUMDEL,
                   :H-ASUORE,
                   :H-ASUQUALIF,
                   :H-ASURECRIN,
                   :H-ASUREIERIN,
                   :H-ASURETRORA,
                   :H-ASUTIPCON,
                   :H-ASUTIPPROG,
                   :H-ASUTRASIND,
                   :H-ASUTRASINR,
                   :H-ASUTSCAT,
                   :H-ASUTSCONF,
                   :H-ASUUFFCOL,
                   :H-ASUULASS,
                   :H-ASUULTRA
              FROM TDSATTSU
              WHERE
                     H_ASUCHIDOM      =  :H-ASUCHIDOM
                AND  H_ASUCOSEDE      =  :H-ASUCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-ADSATTSU.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSATTSU=' DCLTDSATTSU
               MOVE 'TDSATTSU'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L61-DB2-SELECT-EX.
           EXIT.
      *
       L62-DB2-SELECT.
      *
           MOVE 'L62-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSASU.
      *
           EXEC SQL
           SELECT
                CFPRINC,
                CODFIS
           INTO
                :DCLTDSASU.CFPRINC,
                :DCLTDSASU.CODFIS
              FROM TDSASU
              WHERE
                     CODFIS           =  :DCLTDSASU.CODFIS
                and  CODSAP           =  :DCLTDSASU.CODSAP
      *         and  CONVDATA         =
      *       ( SELECT  MAX(CONVDATA) FROM TDSASU
      *       WHERE CODFIS           =  :DCLTDSASU.CODFIS )
           END-EXEC.
           move  SQLCODE               to  FST-ADSASU.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSASU  =' DCLTDSASU
               MOVE 'TDSASU  '    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L62-DB2-SELECT-EX.
           EXIT.
      *
       E47A-DB2-SELECT.
      *
           MOVE 'L47A-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE     TO CODSAP OF DCLTDSLIST.
           EXEC SQL
           SELECT
                    ANNODEL,
                    CFLAV,
                    CODFIN,
                    CODFIS,
                    CODSAP,
                    DATRAS,
                    NUMDEL
           INTO
                    :DCLTDSLIST.ANNODEL,
                    :DCLTDSLIST.CFLAV,
                    :DCLTDSLIST.CODFIN,
                    :DCLTDSLIST.CODFIS,
                    :DCLTDSLIST.CODSAP,
                    :DCLTDSLIST.DATRAS,
                    :DCLTDSLIST.NUMDEL
              FROM  TDSLIST
              WHERE
                     ANNODEL          =  :DCLTDSLIST.ANNODEL
                AND  CFLAV            =  :DCLTDSLIST.CFLAV
                AND  CODFIS           =  :DCLTDSLIST.CODFIS
                AND  NUMDEL           =  :DCLTDSLIST.NUMDEL
           END-EXEC.
      *gga      AND  CODSAP           =  :DCLTDSLIST.CODSAP
           move  SQLCODE               to  FST-ADSASU7.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSLIST =' DCLTDSLIST
               MOVE 'TDSLIST '    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E47A-DB2-SELECT-EX.
           EXIT.
      *
       E47S-DB2-SELECT.
      *
           MOVE 'L47s-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE     TO CODSAP OF DCLTDSLIST.
           EXEC SQL
           SELECT
                    ANNODEL,
                    CFLAV,
                    CODFIN,
                    CODFIS,
                    CODSAP,
                    DATRAS,
                    NUMDEL
           INTO
                    :DCLTDSLIST.ANNODEL,
                    :DCLTDSLIST.CFLAV,
                    :DCLTDSLIST.CODFIN,
                    :DCLTDSLIST.CODFIS,
                    :DCLTDSLIST.CODSAP,
                    :DCLTDSLIST.DATRAS,
                    :DCLTDSLIST.NUMDEL
              FROM  TDSLIST
              WHERE
                     ANNODEL          =  :DCLTDSLIST.ANNODEL
                AND  CFLAV            =  :DCLTDSLIST.CFLAV
                AND  CODFIS           =  :DCLTDSLIST.CODFIS
                AND  NUMDEL           =  :DCLTDSLIST.NUMDEL
           END-EXEC.
      * TOLTA DALLA SELECT PERCHE' DAVA -803
      *
      *GGA      AND  CODSAP           =  :DCLTDSLIST.CODSAP
           move  SQLCODE               to  FST-ADSASU7.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSLIST =' DCLTDSLIST
               MOVE 'TDSLIST '    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E47S-DB2-SELECT-EX.
           EXIT.
      *
       E48-DB2-SELECT.
      *
           MOVE 'L48-DB2-SELECT'  TO WABNDB-LABEL.
      * galantino tolta la sede per sqlcode 100
      *
      *    MOVE  L-CODICE-SEDE    TO CODSAP OF DCLTDSLAV.
           EXEC SQL
           SELECT
                    CFLAV,
                    CODPROV,
                    CODSAP,
                    COGNOME,
                    DATNASC,
                    DATRAS,
                    IMPORTO,
                    IMPORTOE,
                    NOME
           INTO
                    :DCLTDSLAV.CFLAV,
                    :DCLTDSLAV.CODPROV,
                    :DCLTDSLAV.CODSAP,
                    :DCLTDSLAV.COGNOME,
                    :DCLTDSLAV.DATNASC,
                    :DCLTDSLAV.DATRAS,
                    :DCLTDSLAV.IMPORTO,
                    :DCLTDSLAV.IMPORTOE,
                    :DCLTDSLAV.NOME
              FROM  TDSLAV
              WHERE
                     CFLAV            =  :DCLTDSLAV.CFLAV
           END-EXEC.
      *gga           CODSAP           =  :DCLTDSLAV.CODSAP
           move  SQLCODE               to  FST-ADSASU8.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSLAV  =' DCLTDSLAV
               MOVE 'TDSLAV  '    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E48-DB2-SELECT-EX.
           EXIT.
      *
       L63-DB2-SELECT.
      *
           MOVE  L-CODICE-SEDE    TO     CODSAP OF DCLTDSASU2.
           MOVE 'L63-DB2-SELECT'  TO WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                   ANNODEL,
                   ASUFIN,
                   ASUINI,
                   CODFIN,
                   CODFIS,
                   CODSAP,
                   DATAREND,
                   FLAGELAB,
                   NUMDEL,
                   PAGFINOA
           INTO
                   :DCLTDSASU2.ANNODEL,
                   :DCLTDSASU2.ASUFIN,
                   :DCLTDSASU2.ASUINI,
                   :DCLTDSASU2.CODFIN,
                   :DCLTDSASU2.CODFIS,
                   :DCLTDSASU2.CODSAP,
                   :DCLTDSASU2.DATAREND,
                   :DCLTDSASU2.FLAGELAB,
                   :DCLTDSASU2.NUMDEL,
                   :DCLTDSASU2.PAGFINOA
              FROM TDSASU2
              WHERE
                     ANNODEL          =  :DCLTDSASU2.ANNODEL
                AND  CODFIS           =  :DCLTDSASU2.CODFIS
                AND  CODSAP           =  :DCLTDSASU2.CODSAP
                AND  NUMDEL           =  :DCLTDSASU2.NUMDEL
           END-EXEC.
           move  SQLCODE               to  FST-ADSASU2.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSASU2 =' DCLTDSASU2
               MOVE 'TDSASU2 '    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L63-DB2-SELECT-EX.
           EXIT.
      *
      *
       L64-DB2-SELECT.
      *
           MOVE  L-CODICE-SEDE    TO    H-LPUCOSEDE.
           MOVE 'L64-DB2-SELECT'  TO WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                    H_LPUADDIZC,
                    H_LPUADDIZR,
                    H_LPUCHIDOM,
                    H_LPUCONG730,
                    H_LPUCONGFIS,
                    H_LPUCOSEDE,
                    H_LPUDADEC,
                    H_LPUGGCALC,
                    H_LPUIMANFT,
                    H_LPUIMANFU,
                    H_LPUIMINT,
                    H_LPUIMINU,
                    H_LPUINDEB,
                    H_LPUIRPEFU,
                    H_LPUMAGANF,
                    H_LPUMAGANFT,
                    H_LPUMESI,
                    H_LPUMODEC,
                    H_LPUTIPPROG,
                    H_LPUTRASIND,
                    H_LPUTSCAT,
                    H_LPUTSCONF,
                    H_LPUUFFCOL,
                    H_LPUULASS
           INTO
                   :H-LPUADDIZC,
                   :H-LPUADDIZR,
                   :H-LPUCHIDOM,
                   :H-LPUCONG730,
                   :H-LPUCONGFIS,
                   :H-LPUCOSEDE,
                   :H-LPUDADEC,
                   :H-LPUGGCALC,
                   :H-LPUIMANFT,
                   :H-LPUIMANFU,
                   :H-LPUIMINT,
                   :H-LPUIMINU,
                   :H-LPUINDEB,
                   :H-LPUIRPEFU,
                   :H-LPUMAGANF,
                   :H-LPUMAGANFT,
                   :H-LPUMESI,
                   :H-LPUMODEC,
                   :H-LPUTIPPROG,
                   :H-LPUTRASIND,
                   :H-LPUTSCAT,
                   :H-LPUTSCONF,
                   :H-LPUUFFCOL,
                   :H-LPUULASS
              FROM  TDSLAVPU
              WHERE
                     H_LPUCHIDOM      =  :H-LPUCHIDOM
                AND  H_LPUCOSEDE      =  :H-LPUCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-ADSLAVPU.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSLAVPU=' DCLTDSLAVPU
               MOVE 'TDSLAVPU'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L64-DB2-SELECT-EX.
           EXIT.
      *
       L67-DB2-SELECT.
      *
           MOVE  L-CODICE-SEDE    TO    H-SSTCOSEDE.
           MOVE 'L67-DB2-SELECT'  TO WABNDB-LABEL.
      *
           EXEC SQL
           SELECT
                    H_SSTADDIZC,
                    H_SSTADDIZR,
                    H_SSTADDIZRC,
                    H_SSTADDIZRR,
                    H_SSTALFL1,
                    H_SSTALFL2,
                    h_SSTRETSET,
                    H_SSTANNIND,
                    H_SSTCA,
                    H_SSTCHIDOM,
                    H_SSTCODIND,
                    H_SSTCONG730,
                    H_SSTCONGFIS,
                    H_SSTCOSEDE,
                    H_SSTCSC,
                    H_SSTDACESS,
                    H_SSTDADEC,
                    H_SSTDADISOC,
                    H_SSTDAINI,
                    H_SSTDAPE,
                    H_SSTDARIN,
                    H_SSTDTA2T,
                    H_SSTDTA3T,
                    H_SSTDTA4T,
                    H_SSTDTAL1,
                    H_SSTDTAL2,
                    H_SSTGGCALC,
                    H_SSTIMANFT,
                    H_SSTIMANFU,
                    H_SSTIMINT,
                    H_SSTIMINU,
                    H_SSTIMRIN,
                    H_SSTIMRINU,
                    H_SSTINDEB,
                    H_SSTIRPEFU,
                    H_SSTMATRAZ,
                    H_SSTMIN,
                    H_SSTMINEF,
                    H_SSTMMCONTR,
                    H_SSTMODEC,
                    H_SSTNUML1,
                    H_SSTNUML2,
                    H_SSTORE,
                    H_SSTOREEF,
                    H_SSTPARTIM,
                    H_SSTQUALIF,
                    H_SSTRECRIN,
                    H_SSTREGIND,
                    H_SSTRETRORA,
                    H_SSTTIPCON,
                    H_SSTTRASIND,
                    H_SSTTRASINR,
                    H_SSTTSCAT,
                    H_SSTTSCONF,
                    H_SSTULASS
           INTO
                   :H-SSTADDIZC,
                   :H-SSTADDIZR,
                   :H-SSTADDIZRC,
                   :H-SSTADDIZRR,
                   :H-SSTALFL1,
                   :H-SSTALFL2,
                   :H-SSTRETSET,
                   :H-SSTANNIND,
                   :H-SSTCA,
                   :H-SSTCHIDOM,
                   :H-SSTCODIND,
                   :H-SSTCONG730,
                   :H-SSTCONGFIS,
                   :H-SSTCOSEDE,
                   :H-SSTCSC,
                   :H-SSTDACESS,
                   :H-SSTDADEC,
                   :H-SSTDADISOC,
                   :H-SSTDAINI,
                   :H-SSTDAPE,
                   :H-SSTDARIN,
                   :H-SSTDTA2T,
                   :H-SSTDTA3T,
                   :H-SSTDTA4T,
                   :H-SSTDTAL1,
                   :H-SSTDTAL2,
                   :H-SSTGGCALC,
                   :H-SSTIMANFT,
                   :H-SSTIMANFU,
                   :H-SSTIMINT,
                   :H-SSTIMINU,
                   :H-SSTIMRIN,
                   :H-SSTIMRINU,
                   :H-SSTINDEB,
                   :H-SSTIRPEFU,
                   :H-SSTMATRAZ,
                   :H-SSTMIN,
                   :H-SSTMINEF,
                   :H-SSTMMCONTR,
                   :H-SSTMODEC,
                   :H-SSTNUML1,
                   :H-SSTNUML2,
                   :H-SSTORE,
                   :H-SSTOREEF,
                   :H-SSTPARTIM,
                   :H-SSTQUALIF,
                   :H-SSTRECRIN,
                   :H-SSTREGIND,
                   :H-SSTRETRORA,
                   :H-SSTTIPCON,
                   :H-SSTTRASIND,
                   :H-SSTTRASINR,
                   :H-SSTTSCAT,
                   :H-SSTTSCONF,
                   :H-SSTULASS
              FROM TDSSUSST
              WHERE
                     H_SSTCHIDOM      =  :H-SSTCHIDOM
                AND  H_SSTCOSEDE      =  :H-SSTCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-ADSSUSST.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSUSST=' DCLTDSSUSST
               MOVE 'TDSSUSST'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L67-DB2-SELECT-EX.
           EXIT.
      *
       L73-DB2-SELECT.
      *
           MOVE 'L73-DB2-SELECT'  TO WABNDB-LABEL.
           EXEC SQL
           SELECT
                    H_ANFSN,
                    H_ANNOCTG,
                    H_CFENTE,
                    H_CODCTG,
                    H_COMPDS,
                    H_CONTO1,
                    H_CONTO2,
                    H_CONTO3,
                    H_CONTO4,
                    H_CONTO5,
                    H_CONTO6,
                    H_DECMAX,
                    H_DECMIN,
                    H_DENENTE,
                    H_DESCTG,
                    H_FIGSN,
                    H_FINANZ,
                    H_GGMINSERV,
                    H_GGSUSS,
                    H_IMPSUSS,
                    H_NUMTRA,
                    H_ORECONTR,
                    H_PERCENTE,
                    H_PERCSUSS,
                    H_PROGCTG,
                    H_REGCTG,
                    H_REGIONE1,
                    H_REGIONE2,
                    H_REGIONE3,
                    H_REGIONE4,
                    H_REGIONE5,
                    H_SLITTA,
                    H_TFISCALE,
                    H_TIPO,
                    H_TRA1,
                    H_TRA2,
                    H_TRA3,
                    H_TRA4,
290725              H_NEWSUSS
           INTO
                    :H-ANFSN,
                    :H-ANNOCTG,
                    :H-CFENTE,
                    :H-CODCTG,
                    :H-COMPDS,
                    :H-CONTO1,
                    :H-CONTO2,
                    :H-CONTO3,
                    :H-CONTO4,
                    :H-CONTO5,
                    :H-CONTO6,
                    :H-DECMAX,
                    :H-DECMIN,
                    :H-DENENTE,
                    :H-DESCTG,
                    :H-FIGSN,
                    :H-FINANZ,
                    :H-GGMINSERV,
                    :H-GGSUSS,
                    :H-IMPSUSS,
                    :H-NUMTRA,
                    :H-ORECONTR,
                    :H-PERCENTE,
                    :H-PERCSUSS,
                    :H-PROGCTG,
                    :H-REGCTG,
                    :H-REGIONE1,
                    :H-REGIONE2,
                    :H-REGIONE3,
                    :H-REGIONE4,
                    :H-REGIONE5,
                    :H-SLITTA,
                    :H-TFISCALE,
                    :H-TIPO,
                    :H-TRA1,
                    :H-TRA2,
                    :H-TRA3,
                    :H-TRA4,
290725              :W-NEWSUSS
              FROM TDSSX00
              WHERE
                     H_ANNOCTG        =  :H-ANNOCTG
                AND  H_CODCTG         =  :H-CODCTG
                AND  H_REGCTG         =  :H-REGCTG
           END-EXEC.
           move  SQLCODE               to  FST-ADSSX00.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSX00 =' DCLTDSSX00
               MOVE 'TDSSX00 '    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L73-DB2-SELECT-EX.
           EXIT.
      *
      *
       L19-DB2-SELECT.
      *
           MOVE 'L19-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-STDCOSEDE.
      *
           EXEC SQL
           SELECT
                H_STDCOTIPRU,
                H_STDCOTIPRD,
                H_STDDTMOPRU,
                H_STDDTMOPRD,
                H_STDESITPRU,
                H_STDESITPRD
           INTO
                  :H-STDCOTIPRU,
                  :H-STDCOTIPRD,
                  :H-STDDTMOPRU,
                  :H-STDDTMOPRD,
                  :H-STDESITPRU,
                  :H-STDESITPRD
              FROM TDSSITDO
              WHERE
                     H_STDCHIDOM      =  :H-STDCHIDOM
                AND  H_STDCOSEDE      =  :H-STDCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-ADSSITDO.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSITDO=' DCLTDSSITDO
               MOVE 'TDSSITDO'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L19-DB2-SELECT-EX.
           EXIT.
      *
       L22-DB2-SELECT.
      *
           MOVE 'L22-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-DANCOSEDE.
      *
           EXEC SQL
           SELECT
              H_DANCODFIS,
              H_DANCHANVP,
              H_DANCCORE ,
              H_DANCOCORE,
              H_DANSIPRRE,
              H_DANIND ,
              H_DANCAP ,
              H_DANPRETEL,
              H_DANNUMTEL,
              H_DANDTINAS,
              H_DANTRSOCE,
              H_DANTRARCE,
              H_DANCOERMI,
              H_DANDTULAG
           INTO
              :H-DANCODFIS,
              :H-DANCHANVP,
              :H-DANCCORE ,
              :H-DANCOCORE,
              :H-DANSIPRRE,
              :H-DANIND ,
              :H-DANCAP ,
              :H-DANPRETEL,
              :H-DANNUMTEL,
              :H-DANDTINAS,
              :H-DANTRSOCE,
              :H-DANTRARCE,
              :H-DANCOERMI,
              :H-DANDTULAG
              FROM TDSDATAN
              WHERE
                     H_DANCODFIS      =  :H-DANCODFIS
                AND  H_DANCOSEDE      =  :H-DANCOSEDE
           END-EXEC.
           move  SQLCODE               to  FST-ADSDATAN.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSDATAN=' DCLTDSDATAN
               MOVE 'TDSDATAN'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       L22-DB2-SELECT-EX.
           EXIT.
      *
       I39-DB2-SELECT.
      *
           MOVE  'I39-DB2-SELECT' TO  WABNDB-LABEL.
      *
           MOVE  L-CODICE-SEDE    TO    H-DCOCOSEGR.
      *
           EXEC SQL
              SELECT
                    H_DCOCODFIS,
                    H_DCOCHIDOM,
                    H_DCOCENOPE,
                    H_DCOCOTIDO,
                    H_DCOPENS,
                    H_DCOANFRIC,
                    H_DCOANVEPR,
                    H_DCONDVEPR,
                    H_DCOULESPP,
                    H_DCODTULPP,
                    H_DCOULESSP,
                    H_DCODTULSP,
                    H_DCODTPRDO,
                    H_DCODTDECPP,
                    H_DCODTDECSP,
                    H_DCOCODPAT,
                    H_DCOZONPAT,
                    H_DCOMODARR,
                    H_DCOCOOBAN,
                    H_DCOCOREIM,
                    H_DCOTRDOCE,
                    H_DCODTCODO,
                    H_DCODTVIR,
                    H_DCOINT,
                    H_DCORECNUO,
                    H_DCODTADEC,
                    H_DCOPESTDI,
                    H_DCOTRDODO,
                    H_DCOCOERMI,
                    H_DCODORICO,
                    H_DCOFLASU,
                    H_DCONUPRO,
                    H_DCOIBAN

           INTO
                    :H-DCOCODFIS,
                    :H-DCOCHIDOM,
                    :H-DCOCENOPE,
                    :H-DCOCOTIDO,
                    :H-DCOPENS,
                    :H-DCOANFRIC,
                    :H-DCOANVEPR,
                    :H-DCONDVEPR,
                    :H-DCOULESPP,
                    :H-DCODTULPP,
                    :H-DCOULESSP,
                    :H-DCODTULSP,
                    :H-DCODTPRDO,
                    :H-DCODTDECPP,
                    :H-DCODTDECSP,
                    :H-DCOCODPAT,
                    :H-DCOZONPAT,
                    :H-DCOMODARR,
                    :H-DCOCOOBAN,
                    :H-DCOCOREIM,
                    :H-DCOTRDOCE,
                    :H-DCODTCODO,
                    :H-DCODTVIR,
                    :H-DCOINT,
                    :H-DCORECNUO,
                    :H-DCODTADEC,
                    :H-DCOPESTDI,
                    :H-DCOTRDODO,
                    :H-DCOCOERMI,
                    :H-DCODORICO,
                    :H-DCOFLASU,
                    :H-DCONUPRO,
                    :H-DCOIBAN
              FROM TDSDATCO
              WHERE
                     H_DCOANVEPR      =  :H-DCOANVEPR
                AND  H_DCONDVEPR      =  :H-DCONDVEPR
                AND  H_DCOCOSEGR      =  :H-DCOCOSEGR
           END-EXEC.
           move  SQLCODE               to  FST-LFDATCO2.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSDATCO=' DCLTDSDATCO
               MOVE 'TDSDATCO'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I39-DB2-SELECT-EX.
           EXIT.
      *
       E62-DB2-SELECT.
      *
           MOVE 'E62-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PBACKUP,
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PBACKUP   ,
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PCOSEDE        =  :H-PCOSEDE
                AND  H_PDATAELABO     =  :H-PDATAELABO
                AND  H_PPROCEDURA     =  :H-PPROCEDURA
                AND  H_PPROGRESSI     =  :H-PPROGRESSI
                AND  H_PSTRUTTURA     =  :H-PSTRUTTURA
           END-EXEC.
           move  SQLCODE               to  FST-ADSRPG00.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E62-DB2-SELECT-EX.
           EXIT.
      *
       E30-DB2-SELECT.
      *
           MOVE  L-CODICE-SEDE    TO    H-O0COSEDE.
      *
           EXEC SQL
           SELECT
                    H_O0AADIMPSPE,
                    H_O0AADRECUP,
                    H_O0AADSTAPAG,
                    H_O0ACQUISITO,
                    H_O0CFISCALE,
                    H_O0CODICE1,
                    H_O0CODICE2,
                    H_O0CODICE3,
                    H_O0CODICE4,
                    H_O0CODICE5,
                    H_O0CODICE6,
                    H_O0COMPATTO,
                    H_O0COSEDE,
                    H_O0DATAELABO,
                    H_O0DCOANFRIC,
                    H_O0DCOCENOPE,
                    H_O0DCOCHIDOM,
                    H_O0DCOCODFIS,
                    H_O0DCOCODPAT,
                    H_O0DCOCOOBAN,
                    H_O0DCOCOTIDO,
                    H_O0DCODTADEC,
                    H_O0DCODTDESP,
                    H_O0DCODTULSP,
                    H_O0DCOPESTDI,
                    H_O0DCOULESSP,
                    H_O0DOMANDA,
                    H_O0FACAL,
                    H_O0FACDAL,
                    H_O0FACDETFAM,
                    H_O0FACDETLAV,
                    H_O0FACGGDETR,
                    H_O0FACGGPRES,
                    H_O0FACIMPDET,
                    H_O0FACIMPLOR,
                    H_O0FACIMPNET,
                    H_O0FACIMPONI,
                    H_O0FACTREDIC,
                    H_O0FADANFPAG,
                    H_O0FADFINE,
                    H_O0FADINIZIO,
                    H_O0FADNETPAG,
                    H_O0FADRECANF,
                    H_O0FADRECIND,
                    H_O0FADTRASIN,
                    H_O0FAPAL,
                    H_O0FAPALIQME,
                    H_O0FAPDAL,
                    H_O0FAPGGDETR,
                    H_O0FAPGGPRES,
                    H_O0FAPIMPDET,
                    H_O0FAPIMPLOR,
                    H_O0FAPIMPNET,
                    H_O0FAPIMPONI,
                    H_O0FAPTREDIC,
                    H_O0FCODCOMUN,
                    H_O0FCODPAGA1,
                    H_O0FCODPAGA2,
                    H_O0FCODPAGA3,
                    H_O0FCONGAC,
                    H_O0FCONGAP,
                    H_O0FIMPCOMAC,
                    H_O0FIMPCOMAP,
                    H_O0FIMPPAGA1,
                    H_O0FIMPPAGA2,
                    H_O0FIMPPAGA3,
                    H_O0FIMPPROAC,
                    H_O0FIMPPROAP,
                    H_O0FIMPREGAC,
                    H_O0FIMPREGAP,
                    H_O0IMPORTO1,
                    H_O0IMPORTO2,
                    H_O0IMPORTO3,
                    H_O0IMPORTO4,
                    H_O0IMPORTO5,
                    H_O0IMPORTO6,
                    H_O0PROCEDURA,
                    H_O0PROGRESSI,
                    H_O0PUADDIZC,
                    H_O0PUADDIZR,
                    H_O0PUCONG730,
                    H_O0PUCONGFIS,
                    H_O0PUGGCALC,
                    H_O0PUIMANFT,
                    H_O0PUIMANFU,
                    H_O0PUIMINT,
                    H_O0PUIMINU,
                    H_O0PUINDEB,
                    H_O0PUIRPEFU,
                    H_O0PUMAGANF,
                    H_O0PUMAGANFT,
                    H_O0PUTIPPROG,
                    H_O0PUTRASIND,
                    H_O0PUTSCAT,
                    H_O0PUTSCONF,
                    H_O0PUULASS,
                    H_O0RECIMURE1,
                    H_O0RECIMURE2,
                    H_O0RECIMURE3,
                    H_O0RECPAGATO,
                    H_O0RECTOREE1,
                    H_O0RECTOREE2,
                    H_O0RECTOREE3,
                    H_O0RECTORER1,
                    H_O0RECTORER2,
                    H_O0RECTORER3,
                    H_O0SUADDIZC,
                    H_O0SUADDIZR,
                    H_O0SUADDIZRC,
                    H_O0SUADDIZRR,
                    H_O0SUANFASUT,
                    H_O0SUANFASUU,
                    H_O0SUANNODEL,
                    H_O0SUCFENTE,
                    H_O0SUCONG730,
                    H_O0SUCONGFIS,
                    H_O0SUEDIL,
                    H_O0SUFIN,
                    H_O0SUGGCALC,
                    H_O0SUIMANFT,
                    H_O0SUIMANFU,
                    H_O0SUIMASUT,
                    H_O0SUIMASUU,
                    H_O0SUIMINT,
                    H_O0SUIMINU,
                    H_O0SUIMRIN,
                    H_O0SUIMRINU,
                    H_O0SUINCENT,
                    H_O0SUINDEB,
                    H_O0SUIRPEFU,
                    H_O0SULPU,
                    H_O0SUMAGANF,
                    H_O0SUMAGANFT,
                    H_O0SUMATASUT,
                    H_O0SUMATASUU,
                    H_O0SUNUMDEL,
                    H_O0SURECRIN,
                    H_O0SUTIPPRO,
                    H_O0SUTRASIND,
                    H_O0SUTRASINR,
                    H_O0SUTSCAT,
                    H_O0SUTSCONF,
                    H_O0SUULASS,
                    H_O0SXADDIZC,
                    H_O0SXADDIZR,
                    H_O0SXADDIZRC,
                    H_O0SXADDIZRR,
                    H_O0SXANNIND,
                    H_O0SXCODIND,
                    H_O0SXCONG730,
                    H_O0SXCONGFIS,
                    H_O0SXDTAL1,
                    H_O0SXDTAL2,
                    H_O0SXGGCALC,
                    H_O0SXIMANFT,
                    H_O0SXIMANFU,
                    H_O0SXIMINT,
                    H_O0SXIMINU,
                    H_O0SXIMRIN,
                    H_O0SXIMRINU,
                    H_O0SXINDEB,
                    H_O0SXIRPEFU,
                    H_O0SXNUML1,
                    H_O0SXNUML2,
                    H_O0SXRECRIN,
                    H_O0SXREGIND,
                    H_O0SXTRASIND,
                    H_O0SXTRASINR,
                    H_O0SXTSCAT,
                    H_O0SXTSCONF,
                    H_O0SXULASS
            INTO
                    :H-O0AADIMPSPE,
                    :H-O0AADRECUP,
                    :H-O0AADSTAPAG,
                    :H-O0ACQUISITO,
                    :H-O0CFISCALE,
                    :H-O0CODICE1,
                    :H-O0CODICE2,
                    :H-O0CODICE3,
                    :H-O0CODICE4,
                    :H-O0CODICE5,
                    :H-O0CODICE6,
                    :H-O0COMPATTO,
                    :H-O0COSEDE,
                    :H-O0DATAELABO,
                    :H-O0DCOANFRIC,
                    :H-O0DCOCENOPE,
                    :H-O0DCOCHIDOM,
                    :H-O0DCOCODFIS,
                    :H-O0DCOCODPAT,
                    :H-O0DCOCOOBAN,
                    :H-O0DCOCOTIDO,
                    :H-O0DCODTADEC,
                    :H-O0DCODTDESP,
                    :H-O0DCODTULSP,
                    :H-O0DCOPESTDI,
                    :H-O0DCOULESSP,
                    :H-O0DOMANDA,
                    :H-O0FACAL,
                    :H-O0FACDAL,
                    :H-O0FACDETFAM,
                    :H-O0FACDETLAV,
                    :H-O0FACGGDETR,
                    :H-O0FACGGPRES,
                    :H-O0FACIMPDET,
                    :H-O0FACIMPLOR,
                    :H-O0FACIMPNET,
                    :H-O0FACIMPONI,
                    :H-O0FACTREDIC,
                    :H-O0FADANFPAG,
                    :H-O0FADFINE,
                    :H-O0FADINIZIO,
                    :H-O0FADNETPAG,
                    :H-O0FADRECANF,
                    :H-O0FADRECIND,
                    :H-O0FADTRASIN,
                    :H-O0FAPAL,
                    :H-O0FAPALIQME,
                    :H-O0FAPDAL,
                    :H-O0FAPGGDETR,
                    :H-O0FAPGGPRES,
                    :H-O0FAPIMPDET,
                    :H-O0FAPIMPLOR,
                    :H-O0FAPIMPNET,
                    :H-O0FAPIMPONI,
                    :H-O0FAPTREDIC,
                    :H-O0FCODCOMUN,
                    :H-O0FCODPAGA1,
                    :H-O0FCODPAGA2,
                    :H-O0FCODPAGA3,
                    :H-O0FCONGAC,
                    :H-O0FCONGAP,
                    :H-O0FIMPCOMAC,
                    :H-O0FIMPCOMAP,
                    :H-O0FIMPPAGA1,
                    :H-O0FIMPPAGA2,
                    :H-O0FIMPPAGA3,
                    :H-O0FIMPPROAC,
                    :H-O0FIMPPROAP,
                    :H-O0FIMPREGAC,
                    :H-O0FIMPREGAP,
                    :H-O0IMPORTO1,
                    :H-O0IMPORTO2,
                    :H-O0IMPORTO3,
                    :H-O0IMPORTO4,
                    :H-O0IMPORTO5,
                    :H-O0IMPORTO6,
                    :H-O0PROCEDURA,
                    :H-O0PROGRESSI,
                    :H-O0PUADDIZC,
                    :H-O0PUADDIZR,
                    :H-O0PUCONG730,
                    :H-O0PUCONGFIS,
                    :H-O0PUGGCALC,
                    :H-O0PUIMANFT,
                    :H-O0PUIMANFU,
                    :H-O0PUIMINT,
                    :H-O0PUIMINU,
                    :H-O0PUINDEB,
                    :H-O0PUIRPEFU,
                    :H-O0PUMAGANF,
                    :H-O0PUMAGANFT,
                    :H-O0PUTIPPROG,
                    :H-O0PUTRASIND,
                    :H-O0PUTSCAT,
                    :H-O0PUTSCONF,
                    :H-O0PUULASS,
                    :H-O0RECIMURE1,
                    :H-O0RECIMURE2,
                    :H-O0RECIMURE3,
                    :H-O0RECPAGATO,
                    :H-O0RECTOREE1,
                    :H-O0RECTOREE2,
                    :H-O0RECTOREE3,
                    :H-O0RECTORER1,
                    :H-O0RECTORER2,
                    :H-O0RECTORER3,
                    :H-O0SUADDIZC,
                    :H-O0SUADDIZR,
                    :H-O0SUADDIZRC,
                    :H-O0SUADDIZRR,
                    :H-O0SUANFASUT,
                    :H-O0SUANFASUU,
                    :H-O0SUANNODEL,
                    :H-O0SUCFENTE,
                    :H-O0SUCONG730,
                    :H-O0SUCONGFIS,
                    :H-O0SUEDIL,
                    :H-O0SUFIN,
                    :H-O0SUGGCALC,
                    :H-O0SUIMANFT,
                    :H-O0SUIMANFU,
                    :H-O0SUIMASUT,
                    :H-O0SUIMASUU,
                    :H-O0SUIMINT,
                    :H-O0SUIMINU,
                    :H-O0SUIMRIN,
                    :H-O0SUIMRINU,
                    :H-O0SUINCENT,
                    :H-O0SUINDEB,
                    :H-O0SUIRPEFU,
                    :H-O0SULPU,
                    :H-O0SUMAGANF,
                    :H-O0SUMAGANFT,
                    :H-O0SUMATASUT,
                    :H-O0SUMATASUU,
                    :H-O0SUNUMDEL,
                    :H-O0SURECRIN,
                    :H-O0SUTIPPRO,
                    :H-O0SUTRASIND,
                    :H-O0SUTRASINR,
                    :H-O0SUTSCAT,
                    :H-O0SUTSCONF,
                    :H-O0SUULASS,
                    :H-O0SXADDIZC,
                    :H-O0SXADDIZR,
                    :H-O0SXADDIZRC,
                    :H-O0SXADDIZRR,
                    :H-O0SXANNIND,
                    :H-O0SXCODIND,
                    :H-O0SXCONG730,
                    :H-O0SXCONGFIS,
                    :H-O0SXDTAL1,
                    :H-O0SXDTAL2,
                    :H-O0SXGGCALC,
                    :H-O0SXIMANFT,
                    :H-O0SXIMANFU,
                    :H-O0SXIMINT,
                    :H-O0SXIMINU,
                    :H-O0SXIMRIN,
                    :H-O0SXIMRINU,
                    :H-O0SXINDEB,
                    :H-O0SXIRPEFU,
                    :H-O0SXNUML1,
                    :H-O0SXNUML2,
                    :H-O0SXRECRIN,
                    :H-O0SXREGIND,
                    :H-O0SXTRASIND,
                    :H-O0SXTRASINR,
                    :H-O0SXTSCAT,
                    :H-O0SXTSCONF,
                    :H-O0SXULASS

              FROM TDSAPIO0
              WHERE
                     H_O0COSEDE       =  :H-O0COSEDE
                AND  H_O0PROCEDURA    =  :H-O0PROCEDURA
                AND  H_O0DCOCENOPE    =  :H-O0DCOCENOPE
                AND  H_O0DOMANDA      =  :H-O0DOMANDA
           END-EXEC.
           move  SQLCODE               to  FST-ADSAPIO0.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSAPIO0=' DCLTDSAPIO0
               MOVE 'TDSAPIO0'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       E30-DB2-SELECT-EX.
           EXIT.
      *
       I30-DB2-SELECT.
      *
           MOVE 'I30-DB2-SELECT'  TO WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
           SELECT
                H_PCALCOLOAL,
                H_PCALCOLATI,
                H_PRECPAGATI,
                H_PFINEPAGAM,
                H_PZEROPAGAM,
                H_PIMPCONTAB,
                H_PIMPTELEMA,
                H_PCODTELEMA,
                H_PDATAEMISS,
                H_PMATRICOLA,
                H_PCODPAGA01,
                H_PIMPPAGA01,
                H_PCHEDOMAND,
                H_PCHEPRESTA,
                H_PCHENUMERA
           INTO
                :H-PCALCOLOAL,
                :H-PCALCOLATI,
                :H-PRECPAGATI,
                :H-PFINEPAGAM,
                :H-PZEROPAGAM,
                :H-PIMPCONTAB,
                :H-PIMPTELEMA,
                :H-PCODTELEMA,
                :H-PDATAEMISS,
                :H-PMATRICOLA,
                :H-PCODPAGA01,
                :H-PIMPPAGA01,
                :H-PCHEDOMAND,
                :H-PCHEPRESTA,
                :H-PCHENUMERA
              FROM TDSRPG00
              WHERE
                     H_PPROCEDURA   =  :H-PPROCEDURA
                AND  H_PSTRUTTURA   =  :H-PSTRUTTURA
                AND  H_PCOSEDE      =  :H-PCOSEDE
                AND  H_PBACKUP      =  :H-PBACKUP
           END-EXEC.
           move  SQLCODE               to  FST-ADSRPG00.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSRPG00=' DCLTDSRPG00
               MOVE 'TDSRPG00'    TO  WABNDB-TABL
               MOVE 'SELECT '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
           END-IF.
      *
       I30-DB2-SELECT-EX.
           EXIT.
      ******************************************************************
      *       DELETE
      ******************************************************************
      *
       E45-DB2-DELETE.
      *
           MOVE  L-CODICE-SEDE    TO    H-PEECOSEDE.
      *
            EXEC SQL
            DELETE  FROM TDSPEERE
               WHERE
                H_PEECHIDOM =  :H-PEECHIDOM
            AND H_PEECOSEDE =  :H-PEECOSEDE
           END-EXEC .
           move  SQLCODE               to  FST-LFPEERE1.

           IF  SQLCODE  =  ZERO or = 100
               NEXT SENTENCE
           ELSE
               move  'N'              to  FLG-COMMIT
               move  'DELETE    '     to  S2A005
               move  'LFPEERE1  '     to  S2A006
               move  SQLCODE          to  S2A007
               perform  S10-STAMPA   thru  S10-EX
               move  111  to  NDC3
           END-IF.
      *
       E45-DB2-DELETE-EX.
           exit.
      *
      ******************************************************************
      *       INSERT
      ******************************************************************
      *
      * INSERIMENTO RIGA DI STAMPA
      *
       S30-INSERT-REPORT.
      *
           MOVE  'S30-INSERT-REPORT     '  TO  WABNDB-LABEL.
      *
           EXEC SQL
                   INSERT  INTO TDSREPOR
                   VALUES  (:DCLTDSREPOR)
           END-EXEC.
      *
           IF    SQLCODE NOT = ZERO
                   DISPLAY 'DCLTDSREPOR=' DCLTDSREPOR
                   MOVE 'TDSREPOR' TO WABNDB-TABL
                   MOVE 'INSERT  ' TO WABNDB-FUNC
                   PERFORM ERRORE-SQL
110523     ELSE
110523       IF LMATRICOLA = 'E0000419' or '50000419'
110523         DISPLAY 'ELENA-PDSIO13-TDSREPOR: ' DCLTDSREPOR
110523         DISPLAY 'ELENA-PDSIO13-OCMESSAGGIO: ' OC-MESSAGGIO
110523       END-IF
           END-IF.
      *
       S30-EX-INSERT-REPORT.
      *
           EXIT.
      *
       E46-DB2-EFFE-INS.
      *
           MOVE  L-CODICE-SEDE    TO    H-PEECOSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSPEERE
                   VALUES  ( :DCLTDSPEERE)
           END-EXEC.
      *
           move  SQLCODE               to  FST-LFPEERE1.

           IF    SQLCODE not = ZERO
                   move  'N'                to  FLG-COMMIT
                   move  'WRITE     '       to  S2A005
                   move  'LFPEERE1  '       to  S2A006
                   move  SQLCODE            to  S2A007
                   perform  S10-STAMPA     thru  S10-EX
           END-IF.
      *
       E46-DB2-EFFE-INS-EX.
              EXIT.
      *
       E30-DB2-INSERT.
      *
           MOVE  'E30-DB2-INSERT '  TO  WABNDB-LABEL.
           MOVE  L-CODICE-SEDE    TO    H-O0COSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSAPIO0
                   VALUES  ( :DCLTDSAPIO0)
           END-EXEC.
      *
           IF    SQLCODE NOT = ZERO
                   DISPLAY 'DCLTDSAPIO0=' DCLTDSAPIO0
                   MOVE 'TDSAPIO0' TO WABNDB-TABL
                   MOVE 'INSERT  ' TO WABNDB-FUNC
                   PERFORM ERRORE-SQL
           END-IF.
           move  SQLCODE               to  FST-ADSAPIO0.
      *
       E30-DB2-INSERT-EX.
              EXIT.
      *
       E40-DB2-FI40-INS.
      *
           MOVE  'E40-DB2-FI40-INS' TO  WABNDB-LABEL.
      *
           if IC-DCOCOTIDO = 'E'
           then
              MOVE  '0000'           TO    CODSAP OF DCLTDSASU
           else
              move  L-CODICE-SEDE    TO    CODSAP OF DCLTDSASU
           end-if.
      *
           EXEC SQL
                   INSERT  INTO TDSASU
                   VALUES  ( :DCLTDSASU )
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU.

      *    IF    SQLCODE not = ZERO
      *            move  'N'                to  FLG-COMMIT
      *            move  'WRITE     '       to  S2A005
      *            move  'TDSPAG   '        to  S2A006
      *            move  SQLCODE            to  S2A007
      *            PERFORM S10-STAMPA      thru  S10-EX
      *    END-IF.
      *
       E40-DB2-FI40-INS-EX.
              EXIT.
      *
       E47A-DB2-FI47-INS.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSLIST.
      *
           EXEC SQL
                   INSERT  INTO        TDSLIST
                   VALUES  ( :DCLTDSLIST )
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU7.

           IF    SQLCODE not = ZERO
                   move  'N'                to  FLG-COMMIT
                   move  'WRITE     '       to  S2A005
                   move  'TDSLIST   '       to  S2A006
                   move  SQLCODE            to  S2A007
                                                FST-ADSLIST
                   DISPLAY 'TDSLIST SQLCODE= '  FST-ADSLIST
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E47A-DB2-FI47-INS-EX.
              EXIT.
      *
       E47A-DB2-FI47-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSLIST.
      *
           EXEC SQL
           UPDATE         TDSLIST
            SET
                    CODFIN              = :DCLTDSLIST.CODFIN
              WHERE
                    ANNODEL           =  :DCLTDSLIST.ANNODEL
                AND CFLAV             =  :DCLTDSLIST.CFLAV
                AND CODFIS            =  :DCLTDSLIST.CODFIS
                AND NUMDEL            =  :DCLTDSLIST.NUMDEL
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU7.

           IF  SQLCODE NOT = 0
                   move  'REWRITE   '       to  S2A005
                   move  'TDSLIST   '       to  S2A006
                   move  SQLCODE            to  S2A007
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E47A-DB2-FI47-UPD-EX.
           EXIT.
      *
       E47S-DB2-FI47-INS.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSLIST.
      *
           EXEC SQL
                   INSERT  INTO        TDSLIST
                   VALUES  ( :DCLTDSLIST )
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU7.

           IF    SQLCODE not = ZERO
                   move  'N'                to  FLG-COMMIT
                   move  'WRITE     '       to  S2A005
                   move  'TDSLIST   '       to  S2A006
                   move  SQLCODE            to  S2A007
                                                FST-ADSLIST
                   DISPLAY 'TDSLIST SQLCODE= '  FST-ADSLIST
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E47S-DB2-FI47-INS-EX.
              EXIT.
      *
       E47S-DB2-FI47-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSLIST.
      *
           EXEC SQL
           UPDATE         TDSLIST
            SET
                    CODFIN              = :DCLTDSLIST.CODFIN
              WHERE
                    ANNODEL           =  :DCLTDSLIST.ANNODEL
                AND CFLAV             =  :DCLTDSLIST.CFLAV
                AND CODFIS            =  :DCLTDSLIST.CODFIS
                AND NUMDEL            =  :DCLTDSLIST.NUMDEL
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU7.

           IF  SQLCODE NOT = 0
                   move  'REWRITE   '       to  S2A005
                   move  'TDSLIST   '       to  S2A006
                   move  SQLCODE            to  S2A007
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E47S-DB2-FI47-UPD-EX.
           EXIT.
      *
      *
       E48-DB2-FI48-INS.
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSLAV.
      *
           EXEC SQL
                   INSERT  INTO  TDSLAV
                   VALUES  ( :DCLTDSLAV )
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU8.

           IF    SQLCODE not = ZERO
                   move  'N'                to  FLG-COMMIT
                   move  'WRITE     '       to  S2A005
                   move  'TDSLAV   '        to  S2A006
                   move  SQLCODE            to  S2A007
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E48-DB2-FI48-INS-EX.
              EXIT.
      *
       E48-DB2-FI48-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSLAV.
      *
           EXEC SQL
           UPDATE          TDSLAV
            SET
                    IMPORTOE            = :DCLTDSLAV.IMPORTOE
              WHERE
                     CFLAV            =  :DCLTDSLAV.CFLAV
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU8.

           IF  SQLCODE NOT = 0
                   move  'REWRITE   '       to  S2A005
                   move  'LFDATCO2  '       to  S2A006
                   move  SQLCODE            to  S2A007
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E48-DB2-FI48-UPD-EX.
           EXIT.
      *
       E42-DB2-FI42-INS.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSASU2.
      *
      *BA2T01.
           EXEC SQL
                   INSERT  INTO TDSASU2
                   VALUES  ( :DCLTDSASU2 )
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU2.

      *    IF    SQLCODE not = ZERO
      *            move  'N'                to  FLG-COMMIT
      *            move  'WRITE     '       to  S2A005
      *            move  'TDSASU2   '       to  S2A006
      *            move  SQLCODE            to  S2A007
      *            PERFORM S10-STAMPA      thru  S10-EX
      *    END-IF.
      *
       E42-DB2-FI42-INS-EX.
              EXIT.
      *
      *
       E49-DB2-FI49-INS.
      *
           MOVE  L-CODICE-SEDE    TO    CODSAP OF DCLTDSPAG.
      *
      * BA2T01
           EXEC SQL
                   INSERT  INTO  TDSPAG
                   VALUES  ( :DCLTDSPAG )
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSASU9.

           IF    SQLCODE not = ZERO
                   move  'N'                to  FLG-COMMIT
                   move  'WRITE     '       to  S2A005
                   move  'TDSPAG   '        to  S2A006
                   move  SQLCODE            to  S2A007
                   PERFORM S10-STAMPA      thru  S10-EX
           END-IF.
      *
       E49-DB2-FI49-INS-EX.
              EXIT.
      *
       E51-DB2-FI51-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    H-ASUCOSEDE.
      *
           EXEC SQL
           UPDATE  TDSATTSU
            SET
                     H_ASUDADEC         = :H-ASUDADEC  ,
                     H_ASUIMRIN         = :H-ASUIMRIN  ,
                     H_ASUIMRINU        = :H-ASUIMRINU ,
                     H_ASURECRIN        = :H-ASURECRIN ,
                     H_ASUINCENT        = :H-ASUINCENT ,
                     H_ASUIMINT         = :H-ASUIMINT  ,
                     H_ASUINDEB         = :H-ASUINDEB  ,
                     H_ASUIMANFT        = :H-ASUIMANFT ,
                     H_ASUGGCALC        = :H-ASUGGCALC ,
                     H_ASUMAGANFT       = :H-ASUMAGANFT,
                     H_ASUULASS         = :H-ASUULASS  ,
                     H_ASUIMASUT        = :H-ASUIMASUT ,
                     H_ASUANFASUT       = :H-ASUANFASUT,
                     H_ASUMATASUT       = :H-ASUMATASUT,
                     H_ASUIMINU         = :H-ASUIMINU  ,
                     H_ASUIMANFU        = :H-ASUIMANFU ,
                     H_ASUIRPEFU        = :H-ASUIRPEFU ,
                     H_ASUCONGFIS       = :H-ASUCONGFIS,
                     H_ASUADDIZR        = :H-ASUADDIZR ,
                     H_ASUADDIZC        = :H-ASUADDIZC ,
                     H_ASUMAGANF        = :H-ASUMAGANF ,
                     H_ASUCONG730       = :H-ASUCONG730,
                     H_ASUTRASIND       = :H-ASUTRASIND,
                     H_ASUTSCONF        = :H-ASUTSCONF ,
                     H_ASUTSCAT         = :H-ASUTSCAT  ,
                     H_ASUADDIZRR       = :H-ASUADDIZRR,
                     H_ASUADDIZRC       = :H-ASUADDIZRC,
                     H_ASUTRASINR       = :H-ASUTRASINR,
                     H_ASUIMASUU        = :H-ASUIMASUU ,
                     H_ASUANFASUU       = :H-ASUANFASUU,
                     H_ASUMATASUU       = :H-ASUMATASUU
              WHERE
                     H_ASUCHIDOM      =  :H-ASUCHIDOM
                AND  H_ASUCOSEDE      =  :H-ASUCOSEDE
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSATTSU.
           IF  SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'REWRITE   '       to  S2A005
                 move  'ADSATTSU  '       to  S2A006
                 move  FST-ADSATTSU       to  S2A007
                 PERFORM S10-STAMPA      thru  S10-EX
           end-IF.
      *
       E51-DB2-FI51-UPD-EX.
              EXIT.
      *
       E52-DB2-FI52-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    H-LPUCOSEDE.
      *
           EXEC SQL
           UPDATE  TDSLAVPU
            SET
                    H_LPUDADEC          = :H-LPUDADEC  ,
                    H_LPUIMINT          = :H-LPUIMINT  ,
                    H_LPUINDEB          = :H-LPUINDEB  ,
                    H_LPUIMANFT         = :H-LPUIMANFT ,
                    H_LPUGGCALC         = :H-LPUGGCALC ,
                    H_LPUMAGANFT        = :H-LPUMAGANFT,
                    H_LPUULASS          = :H-LPUULASS  ,
                    H_LPUIMINU          = :H-LPUIMINU  ,
                    H_LPUIMANFU         = :H-LPUIMANFU ,
                    H_LPUIRPEFU         = :H-LPUIRPEFU ,
                    H_LPUCONGFIS        = :H-LPUCONGFIS,
                    H_LPUADDIZR         = :H-LPUADDIZR ,
                    H_LPUADDIZC         = :H-LPUADDIZC ,
                    H_LPUMAGANF         = :H-LPUMAGANF ,
                    H_LPUCONG730        = :H-LPUCONG730,
                    H_LPUTRASIND        = :H-LPUTRASIND,
                    H_LPUTSCONF         = :H-LPUTSCONF ,
                    H_LPUTSCAT          = :H-LPUTSCAT
              WHERE
                     H_LPUCHIDOM      =  :H-LPUCHIDOM
                AND  H_LPUCOSEDE      =  :H-LPUCOSEDE
           END-EXEC.
      *
           IF  SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'REWRITE   '       to  S2A005
                 move  'ADSLAVPU  '       to  S2A006
                 move  FST-ADSLAVPU       to  S2A007
                 PERFORM S10-STAMPA      thru  S10-EX
           end-IF.
           move  SQLCODE               to  FST-ADSLAVPU.
      *
       E52-DB2-FI52-UPD-EX.
              EXIT.
      *
       E53-DB2-FI53-UPD.
      *
           MOVE  L-CODICE-SEDE    TO    H-SSTCOSEDE.
      *
           EXEC SQL
           UPDATE  TDSSUSST
            SET
                    H_SSTIMINT          = :H-SSTIMINT ,
                    H_SSTINDEB          = :H-SSTINDEB ,
                    H_SSTGGCALC         = :H-SSTGGCALC ,
                    H_SSTULASS          = :H-SSTULASS ,
                    H_SSTIMINU          = :H-SSTIMINU ,
                    H_SSTIRPEFU         = :H-SSTIRPEFU ,
                    H_SSTCONGFIS        = :H-SSTCONGFIS,
                    H_SSTADDIZR         = :H-SSTADDIZR ,
                    H_SSTADDIZC         = :H-SSTADDIZC ,
                    H_SSTCONG730        = :H-SSTCONG730,
                    H_SSTTRASIND        = :H-SSTTRASIND,
                    H_SSTTSCONF         = :H-SSTTSCONF ,
                    H_SSTTSCAT          = :H-SSTTSCAT ,
                    H_SSTIMRIN          = :H-SSTIMRIN ,
                    H_SSTIMRINU         = :H-SSTIMRINU ,
                    H_SSTRECRIN         = :H-SSTRECRIN ,
                    H_SSTIMANFT         = :H-SSTIMANFT ,
                    H_SSTIMANFU         = :H-SSTIMANFU ,
                    H_SSTADDIZRR        = :H-SSTADDIZRR,
                    H_SSTADDIZRC        = :H-SSTADDIZRC,
                    H_SSTTRASINR        = :H-SSTTRASINR,
                    H_SSTNUML1          = :H-SSTNUML1 ,
                    H_SSTNUML2          = :H-SSTNUML2 ,
                    H_SSTRETSET         = :H-SSTRETSET
              WHERE
                     H_SSTCHIDOM      =  :H-SSTCHIDOM
                AND  H_SSTCOSEDE      =  :H-SSTCOSEDE
           END-EXEC.
      *
           IF  SQLCODE NOT = 0
                 move  'N'                to  FLG-COMMIT
                 move  'REWRITE   '       to  S2A005
                 move  'ADSSUSST  '       to  S2A006
                 move  FST-ADSSUSST       to  S2A007
                 PERFORM S10-STAMPA      thru  S10-EX
           end-IF.
           move  SQLCODE               to  FST-ADSSUSST.

      *
       E53-DB2-FI53-UPD-EX.
              EXIT.
      *
      *
       E62-DB2-INSERT.
      *
           MOVE  L-CODICE-SEDE    TO    H-PCOSEDE.
      *
           EXEC SQL
                   INSERT  INTO TDSRPG00
                   VALUES  ( :DCLTDSRPG00)
           END-EXEC.
      *
           move  SQLCODE               to  FST-ADSRPG00.
      *
       E62-DB2-INSERT-EX.
           EXIT.
      *
       IMPOSTA-RPT.
      *
           MOVE  'IMPOSTA-RPT'  TO  WABNDB-LABEL.
      *
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-TIMESTAMP-DATA-ORA.
           MOVE WK-GG      TO  WW-DB2-GG.
           MOVE WK-MM      TO  WW-DB2-MM.
           MOVE WK-AA      TO  WW-DB2-AA.
           MOVE WK-H       TO  WW-DB2-HH
241023                         W-T-HH.
           MOVE WK-M       TO  WW-DB2-T-MM
241023                         W-T-MM.
           MOVE WK-S       TO  WW-DB2-SS.
           MOVE WK-DB2-DATA   TO TDSREPORT-DTA-PRE.
           MOVE WK-DB2-TIME   TO TDSREPORT-ORA-PRE.
           MOVE 0             TO TDSREPORT-NUM-RIGA.
           MOVE SPACES        TO TDSREPORT-RIGA-REPORT.
           MOVE L-CODICE-SEDE TO TDSREPORT-SEDE.
           MOVE L-CODICE-STOP TO TDSREPORT-CEOP.
           MOVE L-PROCEDURA   TO TDSREPORT-PROCEDURA.
           MOVE KMATRICOLA    TO TDSREPORT-MATRICOLA.
      *
           MOVE TDSREPORT-SEDE      TO WK-RPT-SEDE.
           MOVE TDSREPORT-CEOP      TO WK-RPT-CEOP.
           MOVE TDSREPORT-MATRICOLA TO WK-RPT-MATRICOLA.
           MOVE TDSREPORT-DTA-PRE   TO WK-RPT-DTA-PRE.
           MOVE TDSREPORT-ORA-PRE   TO WK-RPT-ORA-PRE.
      *
       EX-IMPOSTA-RPT.
           EXIT.
      *
       CAMBIADATA-DA10-A8.
      *
           MOVE WK-DATA-AAAA                  TO W8-AAAA.
           MOVE WK-DATA-MM                    TO W8-MM  .
           MOVE WK-DATA-GG                    TO W8-GG  .
      *
       CAMBIADATA-DA10-A8-EX.
           EXIT.
      *
       CAMBIADATA-DA8-A10.
      *
           MOVE '.'                           TO WK-DATA-PUNTO1.
           MOVE '.'                           TO WK-DATA-PUNTO2.
           MOVE W8-AAAA                       TO WK-DATA-AAAA.
           MOVE W8-MM                         TO WK-DATA-MM.
           MOVE W8-GG                         TO WK-DATA-GG.
      *
       CAMBIADATA-DA8-A10-EX.
           EXIT.
      *
      *
      *----------------------------------------- COPY PER GESTIONE
      *
           EXEC SQL INCLUDE CDSABNDB END-EXEC.
