       IDENTIFICATION DIVISION.
       PROGRAM-ID. PIOSX41.
       AUTHOR.    MONGELLI.
      *----------- --------------------------------------------------*
      *  ANNOTAZIONE CAMPI AGGIUNTI:                                 *
      *
      *  SSTNUML1         | FTA        | IMPORTO ANTIC. AZIENDA
      *  SSTNUML1         | FTAI       | IMPORTO GIORN. RETRIBUZ.
      *  SSTNUML1         | TYGM/TIPO  | IMPORTO DA PAGARE
      *                   | /DL76/TYAD |
      *                   | /TYRG/TYBL |
      *                   | /TYCR      |
      *  SSTNUML2         | FTA        | GG PRESTAZIONE
      *  SSTNUML2         | CRED       | IMPORTO GIORN. RETRIBUZ.
      *  SSTNUML2         | FTAI       | zero
      *  SSTNUML1         | SX (ISOLA) | UNA TANTUM 2007 € 500
      *  SSTNUML1         | SX (WTW)   | ULTIMA MENS. DISOCC/INOCC
      *  SSTALFL1  2°     | SX         | PAGAMENTO SOSP S/N
      *  SSTALFL1  1°     | FTA        | DETRAZ S/N
      *  SSTALFL1  3°-15° | CRED       | CHIAVE DOMUS DS COLLEGATA
      *
      *--------------------------------------------------------------*
      *  ULTIME MODIFICHE:
      *
      *  Data  15.04.2026
      *      Autore: Elena
      *            inserita gestione TIRA - INSERIMENTO-REINSERIMENTO
      *            ABRUZZO 2026, 23/02/2026 - 31/12/2028
      *            inserita gestione PIAC - INVECCHIAMENTO ATTIVO CAN-
      *            TIERI ABRUZZO 2026, 23/02/2026 - 31/12/2028
      *
      *  -     26.03.2026
      *      Autore: Elena
      *            Inserita la gestione delle naspi con anticipo pagato
      *            in due tranches (70% e 30%).
      *
      *  -     24.10.2025
      *      Autore: Elena
      *            inserita gestione TGOP - Tirocinio politiche attive
      *            Piemonte, 16/07/2025 - 31/12/2026.
      *
      *  -     30.07.2025
      *      Autore: Elena
      *            inserita gestione TGOS - Tirocinio politiche attive
      *            Sicilia, 02/07/2025 - 31/12/2026.
      *
      *  -     19.06.2025
      *      Autore: Elena
      *            eliminati i calcoli delle detrazioni familiari e da
      *            lavoro perchè, come concordato con la gestione fisca-
      *            le, leggiamo direttamente i valori trasmessi in area
      *            di colloquio con GF - per tutte le prestazioni.
      *
      *  -     06.06.2025
      *      Autore: Elena
      *            eliminati i calcoli delle detrazioni familiari e da
      *            lavoro perchè, come concordato con la gestione fisca-
      *            le, leggiamo direttamente i valori trasmessi in area
      *            di colloquio con GF - solo per TGOC
      *
      *  -     14.03.2025
      *      Autore: Elena
      *            inserita gestione TYGP - Tirocinio PON Puglia, 2023
      *
      *  -     13.03.2025
      *      Autore: Elena
      *            inserita gestione TGOV - Tirocinio politiche attive
      *            Veneto, 2021-2027.
      *
      *  -     10.03.2025
      *      Autore: Elena
      *            corretta la gestione del recupero di tipo acconto:
      *            il recupero veniva detratto dall'importo lordo invece
      *            che dal netto, ma solo nel caso in cui il recupero
      *            era >= dell'indennità lorda.
      *
      *  Data  30.01.2025
      *      Autore: Elena
      *            per FTCG e FTCD va gestita l'eventuale presenza di
      *            interessi legali presenti nella colonna
      *            TDSSUSST.H_SSTIMANFT. La tassazione è la stessa
      *            della prestazione.
      *            (messa in linea 18/03/2025)
      *
      *  -     28.01.2025
      *      Autore: Elena
      *            inserita gestione APA6 - AZIONE POLITICA ATTIVA VAL
      *            D AOSTA OVER58, Periodo: Gen-Dic 2024.
      *
      *  -     22.10.2024
      *      Autore: Elena
      *            se FTAI/FSAI arrivano senza decadenza sia su TDSDATCO
      *            che su TDSSUSST viene bloccato il pagamento con op-
      *            portuno messaggio.
      * Modif del 18/11/2024: Nella FTAI, se manca SSTDADEC,
      * la Naspi è in stato D ma i gg effettivi naspi sono
      * pari ai ggteorici, il pagamento può andare avanti
      * senza mostrare il messaggio  Manca sstdadec.
      * Modif del 24/03/2025: Il blocco non va fatto se è presente
      * un'anticipazione Naspi in stato D completamente pagata, cioè con
      * decadenza > decorrenza.
      *
      *  -     24.06.2024
      *      Autore: Elena
      *            inserita gestione TGOC - Tirocinio PAR GOL Calabria e
      *            gennaio 2024 - dicembre 2025.
      *
      *  -     21.06.2024
      *      Autore: Elena
      *            inserita gestione TISM - Sussidio Lavori ad Utilità e
      *            Diffusa - LUD - Regione Molise,  gennaio-dicembre
      *            2024.
      *
      *  -     06.05.2024
      *      Autore: Elena
      *            inserita gestione TISC - Sussidio Tirocini Inclusione
      *            Sociale Calabria, per il periodo gennaio-dicembre
      *            2024.
      *
      *  -     10.04.2024
      *      Autore: Elena
      *           inserita gestione FTCI - Fondo Trasporto aereo Cig ad
      *           Integrazione per i lavoratori di Alitalia Sai e
      *           Alitalia Cityliner, per il periodo gennaio-ottobre
      *           2024 (gestito come FTCG).
      *
      *  -     27.03.2024
      *      Autore: Elena
      *            inserita gestione FSAD - Fondo ServiziAmbientali
      *            Aspi/Naspi integrazione di durata  (come FTAD),
      *            18 mesi.
      *
      *  -     26.03.2024
      *      Autore: Elena
      *            inserita gestione FSAI - Fondo ServiziAmbientali
      *            Aspi/Naspi integrazione di importo (come FTAI).
      *
      *  -     12.03.2024
      *      Autore: Elena
      *            inserita gestione differenziale del 73%: le domande
      *            hanno h_sstpartim = 7 e il differenziale viene sempre
      *            pagato a tassazione separata.
      *  -     27.11.2023
      *      Autore: Elena
      *            inserita gestione sussidio DLI2 -
      *            DOTE LAVORO INCLUS. ATTIVA CALABRIA
      *  -     25.10.2023
      *      Autore: Elena
      *            inserita gestione sussidi:
      *                POR3 Borse ricerca POR Marche 2021-2027
      *                POR4 Borse lavoro POR Marche 2021-2027
      *                POR5 Borse tematiche POR Marche 2021-2027
      *                POR6 Tirocini extra-curriculari POR Marche
      *                2021-2027
      *
      *  -     24.10.2023
      *      Autore: Nicola
      *            aggiunto mese dicembre per conguaglio 730       )
      *            ....................................................
      *  -     19.05.2023
      *      Autore: Elena
      *            inserito il controllo su tdssx00.h_regione5: se = 30
      *            viene mostrato un messaggio e chiusa l'elaborazione.
      *  -     20.04.2023
      *      Autore: Elena
      *            gestita la tassazione per E092 in base alla categoria
      *            lavorativa (giolav).
      *  -     14.03.2023
      *      Autore: Elena
      *            inserita gestione sussidio APA5.
      *  -     03.03.2023
      *      Autore: Elena
      *            inserito controllo preliminare che blocca l'elabora-
      *            zione di una domanda se la prima lettera del cf è un
      *            numero.
      *            inserito controllo preliminare che blocca l'elabora-
      *            zione di una domanda se il cap non è presente su
      *            vcapsedi
      *  -     14.02.2023
      *      Autore: Elena
      *            inserita gestione sussidio TGOL.
      *  -     06.02.2023
      *      Autore: Elena
      *            inserito controllo preliminare che blocca l'elabora-
      *            zione di un bonus 200/150 se già presente un bonus
      *            della stessa categoria (200 o 150) già pagato per lo
      *            stesso cf. (per gestire casi di soggetti con più do-
      *            mande acquisite su chiavi gest diverse).
      *
      *  -     16.01.2023
      *      Autore: Elena
      *            fatta correzione su FTAI indebita con naspi parzial-
      *            mente indebita
      *  -     13.01.2023
      *      Autore: Elena
      *            inserita gestione bonus 1, E159/E160/E162/E157
      *            bonus 150 euro.
      *  -     24.11.2022
      *      Autore: Elena
      *            inserita gestione sussidio APA4.
      *  -     23.11.2022
      *      Autore: Elena
      *            inserita gestione bonus 1, E107
      *  -     15.11.2022
      *      Autore: Elena
      *            fatta correzione su FTAI da pagare su naspi parzial-
      *            mente indebita.
      *  -     03.11.2022
      *      Autore: Elena
      *            fatta piccola correzione su FTAI con anticipo naspi:
      *            errata impostazione data DAL
      *  -     08.07.2022
      *      Autore: Elena
      *            inserita gestione bonus 1, E109/E110/E112 bonus
      *            200 euro.
      *  -     27.05.2022
      *      Autore: Elena
      *            per EX89 sono cambiate le date di competenza della
      *            prestazione, dal 01012022 al 31032022, invece che
      *            dal 01042022 al 30062022.
      *  --    10.05.2022
      *      Autore: Elena
      *            inserita gestione sussidio POR2.
      *            Convenzione Reg. Marche Politiche attive - POR -
      *            Borse lavoro, valido dal 01/01/22 al 30/06/23.
      *  -     26.04.2022
      *      Autore: Elena
      *            gestito blocco anf 2022.
      *  -     11.04.2022
      *      Autore: Elena
      *            inserita gestione sussidio APA3.
      *  -     29.03.2022
      *      Autore: Elena
      *            inserita gestione bonus 0, E092, navi Venezia per
      *            marzo 2022.
      *  -     22.02.2022
      *      Autore: Elena
      *            fatta correzione per non pagare arretrati a
      *            tassazione corrente se l'intero periodo va pagato a
      *            tassazione separata.
      *            (Correzione errore 108 giornate errate fiscale)
      *  -     21.02.2022
      *      Autore: Elena
      *            corretta l'impostazione di FAPDAL e FAPAL per FT*
      *  -     02.02.2022
      *      Autore: Elena
      *            corretta scrittura gg ap e ac per FT*
      *  -     25.11.2021
      *      Autore: Elena
      *            inserita gestione variabile per differenziale positi-
      *            vo per FSTA.
      *  -     05.01.2021
      *      Autore: Massimo
      *            correttivo per ricerca sospensioni bonus
      *  - 27.12.2020
      *      Autore: Massimo
      *            tentativo di gestione decadenza per FTAI CRED
      *  - 06.12.2020
      *      Autore: Massimo
      *            aggiunta routine T21-COVID-SOSPE per nn pagare maggio
      *            per codice EE29 in caso di sospensione 01.05 - 31.05
      *  - 12.11.2020
      *            aggiunto controllo che il periodo della domanda non
      *            sovrapponga con il periodo di altr domanda
      *            e che la domanda non sia da definire a zero giornate
      *  - 24.10.2020
      *            solo per BONUS leggo tdsdatco per vedere se ci sono
      *            altre domande in A,L,D per lo stesso CF
      *            aggiunta anche INCLUDE per tdssusst
      *  - 10.08.2020
      *               memorizzazione conguaglio 730 in WK-CONGUAGLIO-730
      *               gestione solo per G10 e per conguagli a debito
      *  - 20.07.2020 eliminata chiamata POPWMAIN per conguaglio 730
      *  - 27.05.2020 inserito se h-conto5 contiene data pago solo se
      *               data presentazione < h-conto5
      *               la data di presentazione deve essere in IC-SSTDTAL
      *  - 27.05.2020 inserito se h-regione5 = 31 non pagaerrore 19
      *  - 15.05.2020 pagamento aprile COVID
      *  - 25032020 gestione EELA - EMERG. EPIDE. LAV. AUTONOMI
      *  - 25032020 correttivo per squadratura sussidi senza
      *               tassazione per errato calcolo tratt. sindacali
      *  - 20.01.2020 calcolo h_sstretAUTONOMI  buzione settimanale) per
      *               FTMD FTAD
      *  - 16.01.2020 tentativo per errato calcolo dcodtadec
      *  - 25.10.2019 gestione PORM - POR FSE MARCHE
      *  - 01.08.2019 gestione BRIO - bonus rioccupazione
      *  - 07.05.2019 gestione codice DLIA
      *  - 07.05.2019 gestione ARRETRATI FTCG
      *  - 26032019 TRAC-FTCG corretto errore calcolo 30 gg invece di 31
      *  - 26032019 FTCG possibile pagare arretrati come per TRAC
      *  - 13.03.2019 COIP correttivo per numero giornate = importo:30
      *    19.03.2019 aggiunta forzatura decadenza 20180101
      *  - xx.02.2019 COIP correttivo per importi > 1000 senza iban
      *  - 11.02.2019 APAF CAMPANIA eccezione per pagamento una tantum
      *  - 11.02.2019 COIP convenzione indennità pesca
      *  - 03.01.2019 correttivo per pagamenti una tantum
      *               resosi necessario a causa dei campi tra1, 2,3,4
      *               limitati a 4 cifre intere
      *  - 11.12.2018 inserimento calcolo detrazioni
      *  - 22.05.2018 per CRED (come per FTAI) se presente antic. naspi
      *    dopo termine naspi calcolo detraendo imp. giorn. antic.
      *  - 10.05.2018 inserito conguaglio fiscale anche per SSEP
      *  - correzione 19.02.2018 impostazione FADINIZIO = decorrenza
      *    se presente periodo tassazione separata
      *  - 29.11.2017 correzione per integrazioni di durata FTA
      *               inserimento record in TDSPEERE
      *  - 11.07.2017 inserita gestione ACCONTO in codpaga1-imppaga1
      *               spostato conguaglio 730 in codice2-importo2
      *  - 15.03.2017
      *    correttivo per TRAC . se elaborata con indebito e riaperta
      *    non viene reimpostato h_dcodtadec
      *  - 25.01.2017 correttivo per FTMD h_sstrecrin contiene
      *    contribuzione correlata
      *  - 06.12.2016 inserita gestione codice FTMD
      *  - inserita modifica per eliminare gg in più detrazioni
      *  - 01.12.2015 inserita gestione sussidio TYAD (addendum Lazio)
      *  - 24.09.2015 inserita gestione sussidio SEIM
      *  - 16.06.2015 inserita gestione sussidio DL76
      *  - 12.05.2015 inserita gestione conguaglio fiscale a.c.(elena) *
      *  - 18.09.2014 gestione sussidi 'SELA','SEGS'(provvisori)
      *  - 18.09.2014 aggiunto cod. tassaz. RA x Ritenuta d'accconto 20%
      *  - 06.08.2014 gestione sussidi 'TYGM','RATA','RATM'(provvisori)
      *  - 27.06.2012 Modificata copy POPCSIN
      *  - 23.02.2011 allineato pgm as400
      *  - 01.12.2010 modifica per arretrati FTA Alitalia
      *  - 20.07.2010 nuovo codice CRED per Assegno emerg. Credito
      *  - OTTOB.2010 WELFARE TO WORK
      *  - 22.06.2010 tassaz. TRAC non applicazione detrazioni
      *  - 05.02.2010 eliminata richiesta riepilogo 05.02.2010
      *  - 14.07.2009 regime fiscale art. 13 T.U.I.R.
      *    (detrazioni non legate a gg. prestazione)
      *  - 04.10.2007 aggiunto Codice Struttura in area per 730
      *  - calcolo fondo trasporto aereo           12.03.2007
      *--------------------------------------------------------------*
      *                    DESCRIZIONE FUNZIONALE                    *
      *--------------------------------------------------------------*
      *       CALCOLO   -  SUSSIDIO STRAORDINARIO                    *
      * CHIAMANTE      : PDSIO13                                     *
      * CHIAMATI       :                                             *
      * DATI RICEVUTI  :  CDSIO13                                    *
      * DATI RESTITUITI:  ...                                        *
      * ARCHIVI        :                                             *
      *--------------------------------------------------------------*
       ENVIRONMENT DIVISION.
      *
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      **************************************************************
       DATA DIVISION.
      **************************************************************
       FILE SECTION.
      *-------------------------------------------------------------*
      ***************************************************************
       WORKING-STORAGE SECTION.
      *
      * PER CHIAMATA CICS
      *
       01  WDFHCOMMAREA                PIC X(1).
       01  WDFHEIBLK                   PIC X(85).
      *
      * COMODO PER CHIAMATA CALL
      *
       01  RDSSX41                    PIC X(08) VALUE 'RDSSX41 '.
       01  RDSUT29                    PIC X(08) VALUE 'RDSUT29 '.
       01  PDSPD06                    PIC X(08) VALUE 'PDSPD06 '.
       01  PDSPD13                    PIC X(08) VALUE 'PDSPD13 '.
      *------------------------------ Per programma PCOCO
       01 L-AREA-COMUNE.
           05 L-CODICECOMUNE                  pic 9(6).
      *               : Parametro di input/output.                   *
      *                  Codice comune INPS (di 6 caratteri, cioe'   *
      *                  0 seguito dai cinque caratteri della normale*
      *                  codifica).                                  *
           05 L-COMUNE-FISCO                  pic X(4).
      *               : Parametro di       output.                   *
           05 L-NOMECOMUNE                    pic x(23).
      *               : Parametro di input/output.                   *
      *                  Denominazione del comune.                   *
           05 L-PROVINCIA                     pic xx.
      *               : Parametro di input/output.                   *
      *                  Sigla automobilistica della provincia.      *
           05 L-CAP                           pic x(5).
      *               : Parametro di input/output.                   *
      *                  Codice Avviamento Postale.                  *
           05 L-RETCODE                       pic xx.
      *               : Parametro di output.                         *
      *                  Codice di ritorno. Assume i valori:         *
      *         a)-----> Per la decodifica (ricerca denominazione):  *
      *                  - "00" : Comune trovato                     *
      *                  - "47" : Comune non trovato                 *
      *         b)-----> Per la codifica (ricerca codice):           *
      *                  - "00" : Comune OK                          *
      *                  - "47" : Comune non trovato                 *
      *                  - "60" : Trovati piu' di un comune          *
      *                  - "61" : Trovati piu' di 40 sinonimi        *
      *                  - "70" : Comune OK                          *
      *                           Controllo CAP non eseguito         *
      *                  - "71" : Comune OK                          *
      *                           CAP errato                         *
      *                  - "97" : Comune-provincia discordanti       *
      *                  - "98" : Errore nei parametri               *
      *                  - "99" : Errori vari                        *
      *                                                              *
           05 L-RTCD-COCO                     pic x(4).
           05 L-DESC-COCO                     pic x(50).
      *
       01  RDSUT17                   PIC X(8) VALUE "RDSUT17 ".
      *
      *----------------------------------------------------------------*
      *    A R E A   D I   C O M U N I C A Z I O N E    S  Q  L        *
      *----------------------------------------------------------------*
      *
           EXEC SQL INCLUDE SQLCA  END-EXEC.
      *
      *---------------------------- COPY PER GESTIONE ABEND -----------*
      *
           COPY             DSWABNDB.
      *
      *---------------------------- TRACCIATI TABELLE DB2 DI PROGRAMMA *
      *
      *--2--------------------- dati comuni                          *
      *
            EXEC SQL INCLUDE TDSDATCO END-EXEC.
      *
      *--2--------------------- dati TDSSUSST                        *
      *
            EXEC SQL INCLUDE TDSSUSST END-EXEC.
      *
      *--2--------------------- naspi                                *
      *
            EXEC SQL INCLUDE TDSNASPI END-EXEC.
      *
      *--2--------------------- aspi                                 *
      *
            EXEC SQL INCLUDE TDSASPI  END-EXEC.
      *
      *--2--------------------- mobilità                             *
      *
            EXEC SQL INCLUDE TDSINDIM END-EXEC.
      *
      *--2--------------------- massimali ds/aspi/naspi              *
      *
            EXEC SQL INCLUDE TDSTAMAO END-EXEC.
      *
      *--2--------------------- sospensioni                          *
      *
            EXEC SQL INCLUDE TDSSOSPE END-EXEC.
      *
      *--2--------------------- categorie                            *
      *
            EXEC SQL INCLUDE TDSSX00  END-EXEC.
      *
060223      EXEC SQL INCLUDE TDSSPIO0 END-EXEC.
      *
      *
030323      EXEC SQL INCLUDE TDSDATAN END-EXEC.
      *
      *
200423      EXEC SQL INCLUDE TDSWSCRR END-EXEC.
      *
181124      EXEC SQL INCLUDE TDSPEERT END-EXEC.
181124      EXEC SQL INCLUDE TDSPEERE END-EXEC.
      *
240325      EXEC SQL INCLUDE TDSANTAS END-EXEC.
      *
            EXEC SQL
             DECLARE CURSOS   CURSOR   WITH HOLD FOR
             SELECT
                   H_SOSCOSEDE,
                   H_SOSCODFIS,
                   H_SOSDTINSOS,
                   H_SOSCHIDOM,
                   H_SOSDTFISOS,
                   H_SOSCODSOS,
                   H_SOSDTCOM
             FROM TDSSOSPE
             WHERE
                    H_SOSCOSEDE       =  :H-SOSCOSEDE
               AND  H_SOSCHIDOM       =  :H-SOSCHIDOM
               ORDER BY H_SOSDTINSOS
           END-EXEC.
      *
           EXEC SQL
             DECLARE CURBONUS CURSOR   WITH HOLD FOR
             SELECT
                H_DCONDVEPR,
                H_DCODTADEC,
                H_DCODTDECSP,
                H_DCOULESSP,
                H_SSTDADEC
             FROM TDSDATCO, TDSSUSST
             WHERE
                    H_DCOCODFIS          =  :H-DCOCODFIS
                AND H_DCOCHIDOM          <>  :H-DCOCHIDOM
                AND H_DCOCHIDOM > '8000000000000'
                AND H_SSTCHIDOM = H_DCOCHIDOM
                AND H_SSTCODIND <> 'EEZR'
                AND (   H_DCOULESSP = 'A'
                     OR H_DCOULESSP = 'L'
                     OR (    H_DCOULESSP = 'D'
                         AND H_DCODTDECSP <> H_SSTDADEC )  )
           END-EXEC.
      * aggiunte da Datamanagement
       01  DATA-1  PIC 9(8).
       01  FILLER  REDEFINES  DATA-1.
           02  DATA-1-AA    PIC  S9(4).
           02  DATA-1-MM    PIC  S9(2).
           02  DATA-1-GG    PIC  S9(2).
       01  DATA-2  PIC 9(8).
       01  FILLER  REDEFINES  DATA-2.
           02  DATA-2-AA    PIC  9(4).
           02  DATA-2-MM    PIC  9(2).
           02  DATA-2-GG    PIC  9(2).
      *
      *-------------------------------------------------------------*
      *             F I L E   -   S T A T U S                       *
      *-------------------------------------------------------------*
       01  STATUS-CATEGORIE             PIC S9(9)  VALUE ZEROES.
      *-------------------------------------------------------------*
      *       CAMPI PER DATA SISTEMA                                *
      *-------------------------------------------------------------*
       01  DATA-SISTEMA-6.
           02  AA-SIS-6              PIC 99.
           02  MM-SIS-6              PIC 99.
           02  GG-SIS-6              PIC 99.
       01  DATA-SISTEMA-AMG.
           02  AA-SIS-AMG            PIC 9(4).
           02  MM-SIS-AMG            PIC 99.
           02  GG-SIS-AMG            PIC 99.
       01  DATA-SISTEMA-GMA.
           02  GG-SIS-GMA            PIC 99.
           02  MM-SIS-GMA            PIC 99.
           02  AA-SIS-GMA            PIC 9(4).
      *-------------------------------------------------------------*
      *             C A M P I   D I   C O M O D O                   *
      *-------------------------------------------------------------*
      * 05.01.2021
      * campo per verifica presenza sospensini per bonus covid
       01  SOSP-MAGGIO        PIC X(2)       VALUE SPACES.
       01  SOSP-GIUGNO        PIC X(2)       VALUE SPACES.
       01  SOSP-LUGLIO        PIC X(2)       VALUE SPACES.
      * campi per lettura TDSASPI TDSNASPI TDSINDIM TDSDATCO TDSTAMAO
       01  MASSIMALE-DAL      PIC S9(8)V USAGE COMP-3.
       01  WK-IDMCHIDOM       PIC X(13)      VALUE SPACES.
       01  WK-ALTRA-COVID     PIC S9(6)      VALUE ZEROES.
      *
      *01  H-IDMORTECO        PIC 9(4)V9(2)  VALUE ZEROES.
      *01  H-IDMREORE         PIC 9(7)V9(4)  VALUE ZEROES.
      *01  H-DCOANVEPR        PIC 9(4)       VALUE ZEROES.
      *01  H-NASTREU4A        PIC 9(11)V9(2) VALUE ZEROES.
      *01  H-NASNSELA4        PIC 9(3)       VALUE ZEROES.
      *01  H-TMODTADAL        PIC 9(8)       VALUE ZEROES.
      *01  H-TMOIMPMASE       PIC 9(7)V9(4)  VALUE ZEROES.
      *01  H-ASPIMPMSTE       PIC 9(9)V9(2)  VALUE ZEROES.
      *
       01  IND-SOS            PIC 999 VALUE ZEROES.
       01  IND-PEE            PIC 999  VALUE ZEROES.
       01  IND-ANF            PIC 99  VALUE ZEROES.
       01 WK-IMP-MENSILE      PIC 9(6)V9(6) VALUE ZEROES.
      *  CAMPI PER CALCOLO
       01  ULTIMO-CALCOLATO   PIC 9(8)  VALUE 0.
       01  MESE-PREC          PIC 9(8)  VALUE 0.
       01  WK-CONTO5          PIC 9(8)  VALUE 0.
       01  WK-CONTO6          PIC 9(8)  VALUE 0.
       01  WK-REGIND          PIC 99    VALUE 0.
       01  REDEF-REGIND REDEFINES WK-REGIND  PIC XX.
       01  WK-ANNIND          PIC 99    VALUE 0.
       01  REDEF-ANNIND REDEFINES WK-ANNIND  PIC XX.
       01  GG-PAGATE          PIC 9(4)  VALUE 0.
       01  PER-SPET           PIC S9(4)  VALUE 0.
       01  WK-PER-SPET        PIC S9(4)  VALUE 0.
       01  GGPREST-SU-30      PIC S9(4)  VALUE 0.
       01  IMP-SPET           PIC S9(7)V99 VALUE 0.
       01  TRA-SIND           PIC 9(3)V99 VALUE 0.
       01  TOT-TRA-SIND       PIC 9(3)V99 VALUE 0.
       01  TOT-IMPORTI        PIC 9(7)V99 VALUE 0.
      * 11.07.2017 gestione acconto
       01  WK-ACCONTOUL-E     PIC 9(5)V99.
       01  WK-RESIDUOACC-E         PIC 9(5)V99.
      *
       01  WK-RECUPEROUL-E    PIC 9(5)V99.
       01  WK-RESIDUO-E         PIC 9(5)V99.
       01  WFACGGPREST        PIC S9(3) VALUE 0.
       01  WFAPGGPREST        PIC S9(3) VALUE 0.
       01  WIMPGIOR           PIC S9(7)V99 VALUE 0.
       01  NUMERO             PIC 9999  VALUE 0.
       01  RESTO              PIC 9999V99  VALUE 0.
       01  GG-CRED-AC         PIC S9(4)  VALUE 0.
       01  GG-CRED-AP         PIC S9(4)  VALUE 0.
      *  CAMPI PER CALCOLO ANF
       01 FLAG-ANF            PIC X VALUE SPACES.
       01 PERIODO-ANF         PIC 9(4) VALUE 0.
       01 PERIODO-ANF-DEC     PIC 9(4)V99 VALUE 0.
       01 WK-PER-SPET-ANF     PIC 9(4)V99 VALUE 0.
       01 IMPORTO-ANF         PIC 9(5)V99 VALUE 0.
       01 IMPORTO-ANF-U       PIC 9(5)V99 VALUE 0.
       01 ULTIMO-RECU-ANF     PIC 9(5)V99 VALUE 0.
      *
       01 TAB-MESI.
           02  GENNAIO        PIC 99 VALUE 31.
           02  FEBBRAIO       PIC 99 VALUE 28.
           02  MARZO          PIC 99 VALUE 31.
           02  APRILE         PIC 99 VALUE 30.
           02  MAGGIO         PIC 99 VALUE 31.
           02  GIUGNO         PIC 99 VALUE 30.
           02  LUGLIO         PIC 99 VALUE 31.
           02  AGOSTO         PIC 99 VALUE 31.
           02  SETTEMBRE      PIC 99 VALUE 30.
           02  OTTOBRE        PIC 99 VALUE 31.
           02  NOVEMBRE       PIC 99 VALUE 30.
           02  DICEMBRE       PIC 99 VALUE 31.
       01 TAB-MESI-R REDEFINES TAB-MESI.
           02  EL-GG OCCURS 12 PIC 99.
      *
       01 APP-ANTICIPO                     PIC 9(10) VALUE 0.
       01 IMPORTO-ASSEGNO                  PIC 9(7)V99 VALUE 0.
       01 IMPORTO-TOTALE                   PIC 9(7)V99 VALUE 0.
       01 WIMPORTO                         PIC 9(7)V99 VALUE 0.
       01 IMPTASSATO                       PIC 9(7)V99 VALUE 0.
100325 01 IMPNETTO                         PIC 9(7)V99 VALUE 0.
       01 RIEPILOGO-GG-DETRAZ              PIC 9(4) VALUE 0.
       01 IMPORTO-T-AC                     PIC S9(7)V99 VALUE 0.
       01 IMPORTO-SPETTANTE                PIC S9(7)V99 VALUE 0.
       01 WK-IMPORTO-SPETTANTE             PIC S9(7)V99 VALUE 0.
       01 WK-NETTO                         PIC S9(7)V99 VALUE 0.
       01 TOT-PAGAMENTI                    PIC 9(7)V99 VALUE 0.
       01 COMODO-IMPORTO                   PIC 9(7)V99 VALUE 0.
       01 PERIODO-TOTALE                   PIC 9(4)  VALUE 0.
       01 WPERIODO                         PIC 9(4)  VALUE 0.
      ********
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
       01 RIMB-ISOLA                       PIC S9(7)V99 VALUE 0.
      ********
      * CAMPI PER GESTIONE ANTICIPAZIONE
       01 IMPORTO-R                        PIC 9(7)V99 VALUE 0.
       01 ULTIMO-IMP-R                     PIC S9(7)V99 VALUE 0.
       01 PERIODO-R                        PIC 9(4)  VALUE 0.
       01 RECUPERO-R                       PIC 9(5)V99  VALUE 0.
       01 IRPEF-R                          PIC 9(7)V99 VALUE 0.
       01 TRA-SIND-R                       PIC 9(3)V99  VALUE 0.
       01 DECORRENZA-R                     PIC 9(8) VALUE ZEROES.
       01 TERMINE-R                        PIC 9(8) VALUE ZEROES.

150523 01 W-CODIND0                        PIC X(4)  VALUE SPACES.
060223 01 W-CODIND1                        PIC X(4)  VALUE SPACES.
060223 01 W-CODIND2                        PIC X(4)  VALUE SPACES.
060223 01 W-CODIND3                        PIC X(4)  VALUE SPACES.
060223 01 W-CODIND4                        PIC X(4)  VALUE SPACES.
060223 01 W-O0DCOCODFIS                    PIC X(16) VALUE SPACES.
030323 01 W-CAP                            PIC X(9)  VALUE SPACES.
221024 01 W-CHIDOMAPP                      PIC X(13) VALUE SPACES.
260326 01 W-ESITOANT                       PIC X(2)  VALUE SPACES.
      *
      *  CAMPI PER PART TIME
       01 ORARIO-CONTR                     PIC 9(3)V99 VALUE 0.
       01 ORARIO-PART                      PIC 9(3)V99 VALUE 0.
      *  CAMPI PER IMPOSTARE VOCI RECUPERO SU ASSEGNO
      * 11.07.2017 gestione acconto
       01 REC-ACC-X-ASS                    PIC 9(5)V99 VALUE 0.
      *
       01 REC-IND-X-ASS                    PIC 9(5)V99 VALUE 0.
       01 REC-ANF-X-ASS                    PIC 9(5)V99 VALUE 0.
      *
       01 IMP-GIO-ANF                      PIC 9(8)V999 VALUE 0.
       01 WK-COVID-DECADENZA               PIC  9(8) VALUE 0.
       01 WK-DATADAL                       PIC  9(8) VALUE 0.
       01 R-DATADAL   REDEFINES WK-DATADAL.
           05 WK-ANNODAL                   PIC  9(4).
           05 WK-MESEDAL                   PIC  9(2).
           05 WK-GIORNODAL                 PIC  9(2).
       01 WK-FAPAL                         PIC 9(8) VALUE 0.
       01 R-FAPAL     REDEFINES WK-FAPAL.
           05 WK-ANNOPAL                   PIC 9(4).
           05 WK-MESEPAL                   PIC 9(2).
           05 WK-GIORNOPAL                 PIC 9(2).
      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSUT21 PER CALCOLO PERIODO IN GIORNI  *
      *-------------------------------------------------------------*
       01  RDSUT21                   PIC X(7) VALUE "RDSUT21".
       01  PIU-GIORNI                PIC 9(5).
       01  WK-GIORNI                 PIC 9(5).
       01  LK-DATA1                  PIC 9(8).
       01  LK-DATA1-R REDEFINES LK-DATA1.
           05  LK-AA1                      PIC 9999.
           05  LK-MM1                      PIC 99.
           05  LK-GG1                      PIC 99.
       01  LK-DATA2                  PIC 9(8).
       01  LK-DATA2-R REDEFINES LK-DATA2.
           05  LK-AA2                      PIC 9999.
           05  LK-MM2                      PIC 99.
           05  LK-GG2                      PIC 99.
       01  WK-DATA1                  PIC 9(8).
       01  WK-DATA1-R REDEFINES WK-DATA1.
           05  WK-AA1                      PIC 9999.
           05  WK-MM1                      PIC 99.
           05  WK-GG1                      PIC 99.
       01  WK-DATA2                  PIC 9(8).
       01  WK-DATA2-R REDEFINES WK-DATA2.
           05  WK-AA2                      PIC 9999.
           05  WK-MM2                      PIC 99.
           05  WK-GG2                      PIC 99.
      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSUT20 PER CALCOLO GG INDENNIZZABILI  *
      *-------------------------------------------------------------*
       01  RDSUT20                   PIC X(7) VALUE "RDSUT50".
      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSUT55 PER AGG. GIORNI A DATA INIZIALE*
      *-------------------------------------------------------------*
       01  RDSUT55                   PIC X(7) VALUE "RDSUT55".
       01 LK-AGGIUNGI.
           05 DATA-IN                PIC 9(8).
           05 DATA-OUT               PIC 9(8).
           05 GIORNI-IN              PIC 9(5).
      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSUT27 PER ALIQUOTE TRATT. SIND.
      *-------------------------------------------------------------*
       01  RDSUT27                   PIC X(7) VALUE "RDSUT27".
           COPY CDSUT27.
      *-------------------------------------------------------------*
      *       CAMPI PER CALL RDSSX41 PER DATI DS ORD (FONDO CREDITO)*
      *-------------------------------------------------------------*
           COPY CDSSX41.
      *-------------------------------------------------------------*
      *       CAMPI PER CALL PNPGF8E PER APPLICAZ. RITENUTE IRPEF   *
      *                      PNPGF00 PER WRITE RECORD PAGAMENTO     *
      *-------------------------------------------------------------*
       01  APPANNODOM                PIC 99.
       01  APPNUMDOM                 PIC 9(5).
       01  APPKEY.
           02 APPKEY1                PIC X(16).
           02 APPKEY2                PIC X(8).
       01  PNPGF8E                   PIC X(8) VALUE "PNPGF110".
       01  PNPGF00                   PIC X(8) VALUE "PNPGF00 ".
       01  DATA-GF.
           02 AA-GF                  PIC 9(4).
           02 MM-GF                  PIC 99.
           02 GG-GF                  PIC 99.
       01  VECCHIA-AREA-IRPEF.
           COPY  CDSGFOLD.
           COPY  DSGFCOPY.
      *
      * area per chiamata Fiscale CC
      *
      * 10.08.2020
       01  WK-CONGUAGLIO-730               PIC S9(7)V9(2) VALUE ZEROES.
      *
       01  LINK-CONGUAGLIO.
           03  LK-PROCED                   PIC X(03).
           03  LK-C-MESERIF                PIC 99.
           03  LK-MMELAB                   PIC 99.
           03  LK-DTELAB                   PIC 9(08).
           03  LK-AREA-CONGUAGLI.
               04 IMPIRPEF-LK              PIC S9(7)V9(2).              00010047
               04 IMPREGIO-LK              PIC S9(7)V9(2).              00010049
               04 IMPCOMUN-LK              PIC S9(7)V9(2).              00010051
               04 IMPACCCOM-LK             PIC S9(7)V9(2).              00010051
      *
       01  WRK-APPOGGIO                    PIC X(4000).
      *
      *-------------------------------------------------------------*
      *-----    AREA PER CHIAMATA AL CONGUAGLIO 730        --------*
      *-------------------------------------------------------------*
      * 20072020
      *    COPY POPCSIN.
      *-------------------------------------------------------------*
      *       CAMPI PER TRASFORMAZIONE DATA DA GGMMAA A AAMMGG      *
      *-------------------------------------------------------------*
       01  DATA-GMA                  PIC 9(8).
       01  DATA-GMA-X REDEFINES DATA-GMA.
           02  GG-GMA                PIC 99.
           02  MM-GMA                PIC 99.
           02  AA-GMA                PIC 9(4).
       01  DATA-GMA-6                PIC 9(6).
       01  DATA-GMA-6-X REDEFINES DATA-GMA-6.
           02  GG-GMA-6              PIC 99.
           02  MM-GMA-6              PIC 99.
           02  AA-GMA-6              PIC 99.
       01  AMG.
           02  AA-AMG                PIC 9(4).
           02  MM-AMG                PIC 99.
           02  GG-AMG                PIC 99.
       01  DATA-AMG REDEFINES AMG    PIC 9(8).
      *
       01  DAL1                             PIC 9(8).
       01  DAL2                             PIC 9(8).
       01  AL1                              PIC 9(8).
       01  AL2                              PIC 9(8).
      *
       01  DEFINIZ                          PIC 9(8) VALUE ZEROES.
      *
       01  DATA-TERMINE                     PIC 9(8).
       01  DATA-TER-R  REDEFINES DATA-TERMINE.
           02  AA-TERMINE                   PIC 9(4).
           02  MM-TERMINE                   PIC 99.
           02  GG-TERMINE                   PIC 99.
      *
       01  DATA-TER-CAL                     PIC 9(8).
       01  DATA-TER-CAL-R  REDEFINES DATA-TER-CAL.
           02  AA-TER-CAL                   PIC 9(4).
           02  MM-TER-CAL                   PIC 99.
           02  GG-TER-CAL                   PIC 99.
      *
       01  DATA-INIZIO                      PIC 9(8).
       01  DATA-INI-R  REDEFINES DATA-INIZIO.
           02  AA-INIZIO                    PIC 9(4).
           02  MM-INIZIO                    PIC 99.
           02  GG-INIZIO                    PIC 99.
      *
       01  DATA-INI-AC                      PIC 9(8).
       01  DATA-INI-AC-R  REDEFINES DATA-INI-AC.
           02  AA-INI-AC                    PIC 9(4).
           02  MM-INI-AC                    PIC 99.
           02  GG-INI-AC                    PIC 99.
      *
       01  DATA-TER-AC                      PIC 9(8).
       01  DATA-TER-AC-R  REDEFINES DATA-TER-AC.
           02  AA-TER-AC                    PIC 9(4).
           02  MM-TER-AC                    PIC 99.
           02  GG-TER-AC                    PIC 99.
      *
       01  WK-INIZIO                        PIC 9(8).
       01  WK-INI-R  REDEFINES WK-INIZIO.
           02  WK-AA-INIZIO                 PIC 9(4).
           02  WK-MM-INIZIO                 PIC 99.
           02  WK-GG-INIZIO                 PIC 99.
      *
       01  DATA-INI-PAG                     PIC 9(8).
      *--------------------------------------------------------------*
      *CONSTANT SECTION.
      *77  WK_VERSION           pic s9(9) COMP-5 VALUE IS 20081030.
      *--------------------------------------------------------------*
      ***************************************************************
       LINKAGE SECTION.
      ***************************************************************
       01  COMMAREADS.
           COPY CDSIO13.
      ***************************************************************
       PROCEDURE DIVISION USING  COMMAREADS.
      ***************************************************************
      *-------------------------------------------------------------*
       MAIN-CALCOLO.
      *-------------------------------------------------------------*
           PERFORM A00-APRI.
           PERFORM B00-CONTROLLA.
      * 11.02.2019 APAF CAMPANIA eccezione per pagamento una tantum
      *    IF IC-SSTCODIND = "APAF"
      *    AND IC-SSTREGIND = 15
      *        MOVE "T" TO H-TIPO
      *        MOVE 1 TO H-NUMTRA
      *        MOVE IC-SSTNUML1 TO H-TRA1
      *    END-IF.
      ****

           IF OC-RETCODE = 0
               IF H-TIPO = "M"
                   IF IC-SSTCODIND = "TRAC"
                   OR IC-SSTCODIND = "TRAF"
                   OR IC-SSTCODIND = "TRAS"
                   OR IC-SSTCODIND = "TRAP"
                   OR IC-SSTCODIND = "CRED"
                   OR IC-SSTCODIND = "TYGM"
                   OR IC-SSTCODIND = "TIPO"
                   OR IC-SSTCODIND = "DL76"
                   OR IC-SSTCODIND = "TYRG"
                   OR IC-SSTCODIND = "TYBL"
                   OR IC-SSTCODIND = "TYCR"
                   OR IC-SSTCODIND = "RATA"
                   OR IC-SSTCODIND = "RATM"
                   OR IC-SSTCODIND = "TEIG"
                   OR IC-SSTCODIND = "APAF"
                   OR IC-SSTCODIND = "APAR"
                   OR IC-SSTCODIND = "APA2"
110422             OR IC-SSTCODIND = "APA3"
241122             OR IC-SSTCODIND = "APA4"
140323             OR IC-SSTCODIND = "APA5"
                   OR IC-SSTCODIND = "DLIA"
                   OR IC-SSTCODIND = "COIP"
                   OR IC-SSTCODIND = "TYAD"
                   OR IC-SSTCODIND = "FTMD"
                   OR IC-SSTCODIND = "FTSO"
                   OR IC-SSTCODIND = "FTCG"
                   OR IC-SSTCODIND = "FTCD"
                   OR IC-SSTCODIND = "FTCC"
                   OR IC-SSTCODIND = "FTPL"
                   OR IC-SSTCODIND = "FTAI"
                   OR IC-SSTCODIND = "FTAD"
                   OR IC-SSTCODIND = "BRIO"
                   OR IC-SSTCODIND = "PORM"
100522             OR IC-SSTCODIND = "POR2"
                   OR IC-SSTCODIND = "EELA"
140223             OR IC-SSTCODIND = "TGOL"
251023             OR IC-SSTCODIND = "POR3"
251023             OR IC-SSTCODIND = "POR4"
251023             OR IC-SSTCODIND = "POR5"
251023             OR IC-SSTCODIND = "POR6"
271123             OR IC-SSTCODIND = "DLI2"
260324             OR IC-SSTCODIND = "FSAI"
270324             OR IC-SSTCODIND = "FSAD"
100424             OR IC-SSTCODIND = "FTCI"
060524             OR IC-SSTCODIND = "TISC"
210624             OR IC-SSTCODIND = "TISM"
240624             OR IC-SSTCODIND = "TGOC"
280125             OR IC-SSTCODIND = "APA6"
130325             OR IC-SSTCODIND = "TGOV"
140325             OR IC-SSTCODIND = "TYGP"
300725             OR IC-SSTCODIND = "TGOS"
241025             OR IC-SSTCODIND = "TGOP"
150426             OR IC-SSTCODIND = "TIRA"
150426             OR IC-SSTCODIND = "PIAC"
                       PERFORM F00-CALCOLA-MENSILE-FONDI
                   ELSE
                       IF IC-SSTCODIND = "TRAD"
                           PERFORM F10-CALCOLA-FTA-DEL22
                       ELSE
                           PERFORM M00-CALCOLA-MENSILE
                       END-IF
                   END-IF
               ELSE
                   PERFORM T00-CALCOLA-TRANCHES
               END-IF
               PERFORM B30-RISPONDI
           END-IF.
           GOBACK.
      *-------------------------------------------------------------*
060223 CNTR-PAGDUPLI.
      *-------------------------------------------------------------*

050723*modificati i controlli su pag duplicati: sono considerati tali
      *solo quelli che hanno recpagato = S o (recpagato = a e recupero
      * > 0) e con un domus diverso da quello in input.

150523     MOVE IC-SSTCODIND    TO W-CODIND0.

           IF IC-SSTCODIND = 'E107'
             MOVE 'E109'    TO W-CODIND1
             MOVE 'E110'    TO W-CODIND2
             MOVE 'E112'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E109'
             MOVE 'E107'    TO W-CODIND1
             MOVE 'E110'    TO W-CODIND2
             MOVE 'E112'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E110'
             MOVE 'E107'    TO W-CODIND1
             MOVE 'E109'    TO W-CODIND2
             MOVE 'E112'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E112'
             MOVE 'E107'    TO W-CODIND1
             MOVE 'E109'    TO W-CODIND2
             MOVE 'E110'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E157'
             MOVE 'E159'    TO W-CODIND1
             MOVE 'E160'    TO W-CODIND2
             MOVE 'E162'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E159'
             MOVE 'E157'    TO W-CODIND1
             MOVE 'E160'    TO W-CODIND2
             MOVE 'E162'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E160'
             MOVE 'E157'    TO W-CODIND1
             MOVE 'E159'    TO W-CODIND2
             MOVE 'E162'    TO W-CODIND3
           END-IF.
           IF IC-SSTCODIND = 'E162'
             MOVE 'E157'    TO W-CODIND1
             MOVE 'E159'    TO W-CODIND2
             MOVE 'E160'    TO W-CODIND3
           END-IF.

           EXEC SQL
                 SELECT  H_O0DCOCODFIS
                   INTO :W-O0DCOCODFIS
                   FROM TDSAPIO0
                  WHERE  H_O0CFISCALE  =:IC-CODFISARCA
                    AND  H_O0DCOCHIDOM !=:IC-DCOCHIDOM
                    AND ((H_O0RECPAGATO = 'S')
                           OR
                         (H_O0RECPAGATO = 'A' AND
050723                    H_O0RECIMURE1  > 0)
050723*                   H_O0SXINDEB    < H_O0SXIMINT)
                        )
                    AND  H_O0SXCODIND IN(:W-CODIND1, :W-CODIND2,
                                         :W-CODIND3, :W-CODIND0)
           END-EXEC.

           IF SQLCODE NOT = ZERO AND NOT = 100 AND NOT = -811
                  DISPLAY 'DCLTDSSPIO0 =' DCLTDSSPIO0
                  MOVE 'TDSAPIO0'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
           END-IF.
           IF SQLCODE = zero or -811
                  MOVE 18 TO OC-RETCODE
                  MOVE "ERRORE PAG DUPLICATO PER STESSO CF"
                       TO OC-MESSAGGIO
                  DISPLAY "PAG DUPLI" SQLCODE
                  GOBACK
           END-IF.

           EXEC SQL
                 SELECT  H_O0DCOCODFIS
                   INTO :W-O0DCOCODFIS
                   FROM TDSSPIO0
                  WHERE  H_O0CFISCALE  =:IC-CODFISARCA
                    AND  H_O0DCOCHIDOM !=:IC-DCOCHIDOM
                    AND ((H_O0RECPAGATO = 'S')
                           OR
                         (H_O0RECPAGATO = 'A' AND
050723                    H_O0RECIMURE1  > 0)
050723*                   H_O0SXINDEB    < H_O0SXIMINT)
                        )
                    AND  H_O0SXCODIND IN(:W-CODIND1, :W-CODIND2,
                                         :W-CODIND3, :W-CODIND0)
           END-EXEC.

           IF SQLCODE NOT = ZERO AND NOT = 100 AND NOT = -811
                  DISPLAY 'DCLTDSSPIO0 =' DCLTDSSPIO0
                  MOVE 'TDSSPIO0'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
           END-IF.
           IF SQLCODE = zero or -811
                  MOVE 18 TO OC-RETCODE
                  MOVE "ERRORE PAG DUPLICATO PER STESSO CF"
                       TO OC-MESSAGGIO
                  DISPLAY "PAG DUPLI" SQLCODE
                  GOBACK
           END-IF.

       EX-CNTR-PAGDUPLI.
      *-------------------------------------------------------------*
030323 CONTROLLI.
      *-------------------------------------------------------------*
      * inserito controllo su primo carattere del cf: se è un numero
      * blocco l'elaborazione.
      * inserito controllo su cap: se assente su vcapsedi blocco l'ela-
      * borazione.

           MOVE IC-CODSEDE     TO H-DCOCOSEGR.
           MOVE IC-DCOCODFIS   TO H-DCOCODFIS.
           IF H-DCOCODFIS(1:1) = '0' or '1' or '2' or '3' or '4' or
                                 '5' or '6' or '7' or '8' or '9'
             MOVE 18 TO OC-RETCODE
             MOVE "ERRORE CODICE FISCALE NUMERICO"
                  TO OC-MESSAGGIO
             DISPLAY "CF NUMERI" SQLCODE
             GOBACK
           END-IF.

           EXEC SQL
                 SELECT  CAP
                   INTO :W-CAP
                   FROM VCAPSEDI
                  WHERE  INT(CAP)  = (SELECT H_DANCAP
                                        FROM TDSDATAN
                                       WHERE H_DANCODFIS =:H-DCOCODFIS
                                         AND H_DANCOSEDE =:H-DCOCOSEGR
                                     )
           END-EXEC.

           IF SQLCODE NOT = ZERO AND NOT = 100 AND NOT = -811
                  DISPLAY 'DCLTDSDATAN =' DCLTDSDATAN
                  MOVE 'TDSDATAN'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
           END-IF.
           IF SQLCODE = +100
             MOVE 18 TO OC-RETCODE
             MOVE "ERRORE CAP NON VALIDO"
                  TO OC-MESSAGGIO
             DISPLAY "CAP INVAL" SQLCODE
             GOBACK
           END-IF.

190523* inserito controllo su regione5 = 30
           MOVE IC-SSTCODIND TO H-CODCTG.
           MOVE IC-SSTREGIND TO H-REGCTG.
           MOVE IC-SSTANNIND TO H-ANNOCTG.

           EXEC SQL
                 SELECT  H_REGIONE5
                   INTO :H-REGIONE5
                   FROM TDSSX00
                  WHERE  H_CODCTG         =  :H-CODCTG
                    AND  H_REGCTG         =  :H-REGCTG
                    AND  H_ANNOCTG        =  :H-ANNOCTG
           END-EXEC.

           IF SQLCODE NOT = ZERO AND NOT = 100 AND NOT = -811
                  DISPLAY 'DCLTDSSX00  =' DCLTDSSX00
                  MOVE 'TDSSX00 '      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
           END-IF.
           IF SQLCODE = ZERO OR -811
             IF H-REGIONE5 = 30
               MOVE 18 TO OC-RETCODE
               MOVE "PAGAMENTO TERMINATO PER LA CATEGORIA"
                    TO OC-MESSAGGIO
               DISPLAY "PAG TERMI" SQLCODE
               GOBACK
             END-IF
           END-IF.

221024*correttivo per FTAI entrata senza decadenza
           IF IC-SSTCODIND = "FTAI" or "FSAI"
             IF IC-SSTDADEC = ZEROES

      *leggo lo stato della naspi associata alla ftai
               MOVE IC-SSTALFL1(3:13)   TO W-CHIDOMAPP
               initialize h-petnugite h-peenugiee
               EXEC SQL
                 SELECT  H_DCOULESPP
                   INTO :H-DCOULESPP
                   FROM TDSDATCO
                  WHERE  H_DCOCHIDOM =:W-CHIDOMAPP
                    AND  H_DCOCOTIDO = 'U'
               END-EXEC

               IF SQLCODE NOT = ZERO
                  DISPLAY 'DCLTDSDATCO =' DCLTDSDATCO
                  MOVE 'TDSDATCO'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
               END-IF
181124*elena inizio
               EXEC SQL
                 SELECT  SUM(H_PETNUGITE)
                   INTO :H-PETNUGITE
                   FROM TDSPEERT
                  WHERE  H_PETCHIDOM =:W-CHIDOMAPP
               END-EXEC

               IF SQLCODE NOT = ZERO and not = -305
                  DISPLAY 'DCLTDSPEERT =' DCLTDSPEERT
                  MOVE 'TDSPEERT'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
               END-IF

               EXEC SQL
                 SELECT  SUM(H_PEENUGIEE)
                   INTO :H-PEENUGIEE
                   FROM TDSPEERE
                  WHERE  H_PEECHIDOM =:W-CHIDOMAPP
               END-EXEC

               IF SQLCODE NOT = ZERO and not = -305
                  DISPLAY 'DCLTDSPEERE =' DCLTDSPEERE
                  MOVE 'TDSPEERE'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
               END-IF

240325*elena: inserita lettura anticipazione legata alla naspi
260326*elena: implementata la gestione dell'anticipo pagato a tranche
260326*       (solo per data pres anticipo > 2025)
               initialize h-aaschidom h-dcodtprdo h-aasimp1 h-aasflag1
               EXEC SQL
                 SELECT  H_AASCHIDOM,
260326                   H_DCODTPRDO,
260326                   H_AASIMP1,
260326                   H_AASFLAG1,
260326                   H_DCOULESPP
                   INTO :H-AASCHIDOM,
260326                  :H-DCODTPRDO,
260326                  :H-AASIMP1,
260326                  :H-AASFLAG1,
260326                  :W-ESITOANT
                   FROM TDSANTAS, TDSDATCO
                  WHERE  H_AASCHIDOM = H_DCOCHIDOM
                    AND  H_AASASPI   =:W-CHIDOMAPP
                    AND  H_DCOCOTIDO = 'T'
                    AND  H_DCODTADEC = 0
               END-EXEC

               IF SQLCODE NOT = ZERO and not = +100
                  DISPLAY 'DCLTDSANTAS =' DCLTDSANTAS
                  MOVE 'TDSANTAS'      TO  WABNDB-TABL
                  MOVE 'SELECT'        TO  WABNDB-FUNC
                  PERFORM ERRORE-SQL
               END-IF

240325* elena fine

181124*elena inizio
               IF H-DCOULESPP = 'D'
240325           IF H-AASCHIDOM = ' '
181124             IF H-PETNUGITE not = H-PEENUGIEE
                     MOVE 18 TO OC-RETCODE
                     MOVE "PAG BLOCCATO:ACQUISIRE DECAD=DEC NASPI"
                        TO OC-MESSAGGIO
                     DISPLAY "PAG DADEC" SQLCODE
                     GOBACK
                   END-IF
                 END-IF
               END-IF
260326       ELSE
260326         initialize h-aaschidom h-dcodtprdo h-aasimp1 h-aasflag1
             END-IF
           END-IF.

       EX-CONTROLLI.
      *-------------------------------------------------------------*
       A00-APRI.
      *-------------------------------------------------------------*
           INITIALIZE RICHIESTA.
           MOVE ZEROES TO
               ULTIMO-CALCOLATO
               MESE-PREC
               GG-PAGATE
               PER-SPET
               WK-PER-SPET
               IMP-SPET
               TRA-SIND
               TOT-TRA-SIND
               TOT-IMPORTI
               NUMERO
               RESTO
               IMPORTO-ASSEGNO
               IMPORTO-TOTALE
               IMPORTO-SPETTANTE
               WK-IMPORTO-SPETTANTE
               IMPORTO-ANF
               IMPORTO-ANF-U
               IMP-GIO-ANF
               TOT-PAGAMENTI
               COMODO-IMPORTO
               PERIODO-TOTALE
               ULTIMO-RECU-ANF
      * 11.07.2017 gestione acconto
               REC-ACC-X-ASS
      *
               REC-IND-X-ASS
               REC-ANF-X-ASS.
           MOVE ZEROES TO IMPORTO-R
                          ULTIMO-IMP-R
                          RECUPERO-R
                          IRPEF-R
                          TRA-SIND-R
                          DECORRENZA-R
                          TERMINE-R.
           ACCEPT DATA-SISTEMA-6 FROM DATE.
           MOVE AA-SIS-6 TO AA-GMA-6.
           MOVE MM-SIS-6 TO MM-GMA-6.
           MOVE GG-SIS-6 TO GG-GMA-6.
      *
           MOVE GG-SIS-6 TO GG-SIS-GMA
                            GG-SIS-AMG
           MOVE MM-SIS-6 TO MM-SIS-GMA
                            MM-SIS-AMG
           MOVE AA-SIS-6 TO AA-SIS-GMA
                            AA-SIS-AMG
           IF AA-SIS-6 < 80
               ADD 2000 TO AA-SIS-GMA
                           AA-SIS-AMG
           ELSE
               ADD 1900 TO AA-SIS-GMA
                           AA-SIS-AMG
           END-IF.
      * IMPOSTO DATA PERIODO FISCALE 01/12 DELL'ANNO PRECEDENTE
      *    COMPUTE WK-ANNODAL = AA-SIS-AMG - 1.
      *    MOVE 12           TO WK-MESEDAL.
      *    MOVE 01           TO WK-GIORNODAL.
      *
      *    COMPUTE WK-ANNOPAL = AA-SIS-AMG - 1.
      *    MOVE 11           TO WK-MESEPAL.
      *    MOVE 30           TO WK-GIORNOPAL.
      *
      *    IF  IC-SSTCODIND = "CRED"
      *        MOVE 12       TO WK-MESEDAL
      *        COMPUTE WK-ANNOPAL = AA-SIS-AMG - 1
      *        MOVE 11           TO WK-MESEPAL
      *        MOVE 30           TO WK-GIORNOPAL
      *    END-IF.
      * IMPOSTO DATA PERIODO FISCALE 01/01 DELL'ANNO PRECEDENTE
           COMPUTE WK-ANNODAL = AA-SIS-AMG - 1.
           MOVE 01           TO WK-MESEDAL.
           MOVE 01           TO WK-GIORNODAL.
      *
           COMPUTE WK-ANNOPAL = AA-SIS-AMG - 2.
           MOVE 12           TO WK-MESEPAL.
           MOVE 31           TO WK-GIORNOPAL.
      *
           IF  IC-SSTCODIND = "CRED"
           OR  IC-SSTCODIND = "FTAI"
260324     OR  IC-SSTCODIND = "FSAI"
               MOVE 12       TO WK-MESEDAL
               COMPUTE WK-ANNOPAL = AA-SIS-AMG - 1
               MOVE 11           TO WK-MESEPAL
               MOVE 30           TO WK-GIORNOPAL
           END-IF.
      *
           IF  IC-SSTCODIND = 'SARB'
               COMPUTE WK-ANNODAL = AA-SIS-AMG
               MOVE 01           TO WK-MESEDAL
               MOVE 01           TO WK-GIORNODAL
               COMPUTE WK-ANNOPAL = AA-SIS-AMG - 1
               MOVE 12           TO WK-MESEPAL
               MOVE 31           TO WK-GIORNOPAL
           END-IF.
      *
           IF  IC-SSTCODIND = 'TYAD'
               MOVE 2018 TO WK-ANNODAL
               MOVE 01           TO WK-MESEDAL
               MOVE 01           TO WK-GIORNODAL
               MOVE 2017 TO WK-ANNOPAL
               MOVE 12           TO WK-MESEPAL
               MOVE 31           TO WK-GIORNOPAL
           END-IF.
      *
           INITIALIZE OC-AREA.
      *
           MOVE 00 TO OC-RETCODE.
           MOVE SPACES TO OC-MESSAGGIO.
      *-------------------------------------- Tabella ADSDATCO       *
           MOVE IC-DCOULESSP   TO OC-DCOULESSP.
           MOVE IC-DCODTULSP   TO OC-DCODTULSP.
           MOVE IC-DCODTADEC   TO OC-DCODTADEC.
      *-------------------------------------- Tabella ADSSUSST       *
      *             SEZIONE PAGAMENTI COMPLESSIVI  -***********
           MOVE IC-SSTIMINT    TO OC-SSTIMINT.
           MOVE IC-SSTINDEB    TO OC-SSTINDEB.
           MOVE IC-SSTGGCALC   TO OC-SSTGGCALC.
           MOVE IC-SSTULASS    TO OC-SSTULASS.
      *               SEZIONE ULTIMO PAGAMENTO     -**********
           MOVE ZEROES         TO OC-SSTIMINU
                                  OC-SSTIRPEFU
                                  OC-SSTCONGFIS
                                  OC-SSTADDIZR
                                  OC-SSTADDIZC
                                  OC-SSTCONG730
                                  OC-SSTTRASIND
                                  OC-SSTTSCONF
                                  OC-SSTTSCAT.
      *               SEZIONE nuova  9/02/2006     -**********
           MOVE IC-SSTIMRIN    TO OC-SSTIMRIN.
           MOVE IC-SSTIMRINU   TO OC-SSTIMRINU.
           MOVE IC-SSTRECRIN   TO OC-SSTRECRIN.
           MOVE IC-SSTIMANFT   TO OC-SSTIMANFT.
           MOVE ZEROES         TO OC-SSTIMANFU
                                  OC-SSTADDIZRR
                                  OC-SSTADDIZRC
                                  OC-SSTTRASINR.
           MOVE IC-SSTDTAL1    TO OC-SSTDTAL1.
           MOVE IC-SSTDTAL2    TO OC-SSTDTAL2.
           MOVE IC-SSTNUML1    TO OC-SSTNUML1.
           MOVE IC-SSTNUML2    TO OC-SSTNUML2.
           MOVE IC-SSTRETSET   TO OC-SSTRETSET.
      *-------------------------------------- Tabella ADSRECUP       *
      *------- Recupero indennità (tassata)
           MOVE IC-RECTORERE-1 TO OC-RECTORERE-1.
           MOVE IC-RECIMUREE-1 TO OC-RECIMUREE-1.
      *------- Recupero ANF  (non tassata)                           *
           MOVE IC-RECTORERE-2 TO OC-RECTORERE-2.
           MOVE IC-RECIMUREE-2 TO OC-RECIMUREE-2.
      *------- Acconto       (non tassata)                           *
           MOVE IC-RECTORERE-3 TO OC-RECTORERE-3.
           MOVE IC-RECIMUREE-3 TO OC-RECIMUREE-3.
      *-------------------------------------- Tabella ADSPEERE       *
           MOVE 1 TO IND-PEE.
           PERFORM UNTIL IND-PEE > 400
               MOVE ZEROES TO OC-PEEPEERED(IND-PEE)
               MOVE ZEROES TO OC-PEEPEEREA(IND-PEE)
               MOVE ZEROES TO OC-PEENUGIEE(IND-PEE)
               ADD 1 TO IND-PEE
           END-PERFORM.
      *-------------------------------------- Tabella ADSASU7        *
           MOVE ZEROES TO  OC-CFENTEL.
           MOVE ZEROES TO  OC-ANNODELIBL.
           MOVE ZEROES TO  OC-NUMDELIBL.
           MOVE ZEROES TO  OC-CODFINL.
      *-------------------------------------- Tabella ADSASU8        *
      *-------------------------------------- Tabella ADSASU9        *
           MOVE ZEROES TO  OC-CFENTEP.
           MOVE ZEROES TO  OC-ANNODELIBP.
           MOVE ZEROES TO  OC-NUMDELIBP.
           MOVE ZEROES TO  OC-DATAULPAG.
           MOVE ZEROES TO  OC-DATAPAGP.
           MOVE ZEROES TO  OC-IMPASUF.
           MOVE ZEROES TO  OC-IMPANFF.
           MOVE ZEROES TO  OC-IMPMATF.
           MOVE ZEROES TO  OC-IMPASUE.
           MOVE ZEROES TO  OC-IMPANFE.
           MOVE ZEROES TO  OC-IMPMATE.
           MOVE ZEROES TO  OC-COD1.
           MOVE ZEROES TO  OC-DATADAL1.
           MOVE ZEROES TO  OC-DATAAL1.
           MOVE ZEROES TO  OC-COD2.
           MOVE ZEROES TO  OC-DATADAL2.
           MOVE ZEROES TO  OC-DATAAL2.
           MOVE ZEROES TO  OC-COD3.
           MOVE ZEROES TO  OC-DATADAL3.
           MOVE ZEROES TO  OC-DATAAL3.
           MOVE ZEROES TO  OC-COD4.
           MOVE ZEROES TO  OC-DATADAL4.
           MOVE ZEROES TO  OC-DATAAL4.
           MOVE ZEROES TO  OC-COD5.
           MOVE ZEROES TO  OC-DATADAL5.
           MOVE ZEROES TO  OC-DATAAL5.
           MOVE ZEROES TO  OC-COD6.
           MOVE ZEROES TO  OC-DATADAL6.
           MOVE ZEROES TO  OC-DATAAL6.
           MOVE ZEROES TO  OC-COD7.
           MOVE ZEROES TO  OC-DATADAL7.
           MOVE ZEROES TO  OC-DATAAL7.
           MOVE ZEROES TO  OC-COD8.
           MOVE ZEROES TO  OC-DATADAL8.
           MOVE ZEROES TO  OC-DATAAL8.
           MOVE ZEROES TO  OC-COD9.
           MOVE ZEROES TO  OC-DATADAL9.
           MOVE ZEROES TO  OC-DATAAL9.
           MOVE ZEROES TO  OC-COD10.
           MOVE ZEROES TO  OC-DATADAL10.
           MOVE ZEROES TO  OC-DATAAL10.
      *13.03.2019 CORRETTIVO COIP.
      * per COIP calcolo gg (importo / 30 €) e impost sstnuml2
           IF  IC-SSTCODIND = "COIP"
               COMPUTE IC-SSTNUML2 = IC-SSTNUML1 / 30
               MOVE IC-SSTNUML2 TO OC-SSTNUML2
               MOVE 20180101 TO IC-DCODTADEC
                                OC-DCODTADEC
                                IC-SSTDADEC
           END-IF.
      *xx.02.2019 CORRETTIVO COIP
      * per COIP se non vi è iban e gg > 33 pago solo 33 gg
           IF  IC-SSTCODIND = "COIP"
           AND (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
           AND (IC-SSTNUML1 - IC-SSTIMINT) > 990
           AND (IC-SSTNUML1 NOT = IC-RECTORERE-1)
               COMPUTE IC-SSTNUML1 = IC-SSTIMINT + 990
               COMPUTE IC-SSTNUML2 = IC-SSTGGCALC + 33
           END-IF.
      *-------------------------------------------------------------*
      *-------------------------------------------------------------*
       B00-CONTROLLA.
      *-------------------------------------------------------------*
      * provvisoriamente imposto calcoloal per covid
      * 24.10.2020
      * inoltre leggo tdsdatco per vedere se ci sono altre domande in
      * A,L,D per lo stesso CF
           IF  IC-SSTCODIND = "EE27"
           OR  IC-SSTCODIND = "EE28"
           OR  IC-SSTCODIND = "EE29"
           OR  IC-SSTCODIND = "EE30"
           OR  IC-SSTCODIND = "EE38"
           OR  IC-SSTCODIND = "EE05"
           OR  IC-SSTCODIND = "EE10"
           OR  IC-SSTCODIND = "EE2A"
           OR  IC-SSTCODIND = "EE2B"
           OR  IC-SSTCODIND = "EE2C"
           OR  IC-SSTCODIND = "EE2D"
           OR  IC-SSTCODIND = "EE13"
           OR  IC-SSTCODIND = "EE22"
           OR  IC-SSTCODIND = "EEMA"
           OR  IC-SSTCODIND = "EEZR"
           OR  IC-SSTCODIND = "EJ29"
           OR  IC-SSTCODIND = "EJ38"
           OR  IC-SSTCODIND = "EJ2A"
           OR  IC-SSTCODIND = "EJ2B"
           OR  IC-SSTCODIND = "EJ2C"
           OR  IC-SSTCODIND = "EJ2D"
           OR  IC-SSTCODIND = "EJ05"
           OR  IC-SSTCODIND = "EJ10"
           OR  IC-SSTCODIND = "EJ13"
           OR  IC-SSTCODIND = "EK29"
           OR  IC-SSTCODIND = "EK38"
           OR  IC-SSTCODIND = "EK2A"
           OR  IC-SSTCODIND = "EK2B"
           OR  IC-SSTCODIND = "EK2C"
           OR  IC-SSTCODIND = "EK2D"
           OR  IC-SSTCODIND = "EK05"
           OR  IC-SSTCODIND = "EK10"
           OR  IC-SSTCODIND = "EK13"
           OR  IC-SSTCODIND = "EW29"
           OR  IC-SSTCODIND = "EW38"
           OR  IC-SSTCODIND = "EW2A"
           OR  IC-SSTCODIND = "EW2B"
           OR  IC-SSTCODIND = "EW2C"
           OR  IC-SSTCODIND = "EW2D"
           OR  IC-SSTCODIND = "EW05"
           OR  IC-SSTCODIND = "EW10"
           OR  IC-SSTCODIND = "EW13"
           OR  IC-SSTCODIND = "EY29"
           OR  IC-SSTCODIND = "EY38"
           OR  IC-SSTCODIND = "EY2A"
           OR  IC-SSTCODIND = "EY2B"
           OR  IC-SSTCODIND = "EY2C"
           OR  IC-SSTCODIND = "EY2D"
           OR  IC-SSTCODIND = "EY05"
           OR  IC-SSTCODIND = "EY10"
           OR  IC-SSTCODIND = "EY13"
           OR  IC-SSTCODIND = "EY3A"
           OR  IC-SSTCODIND = "EX29"
           OR  IC-SSTCODIND = "EX38"
           OR  IC-SSTCODIND = "EX2A"
           OR  IC-SSTCODIND = "EX2B"
           OR  IC-SSTCODIND = "EX2C"
           OR  IC-SSTCODIND = "EX2D"
           OR  IC-SSTCODIND = "EX05"
           OR  IC-SSTCODIND = "EX10"
           OR  IC-SSTCODIND = "EX13"
           OR  IC-SSTCODIND = "EX3A"
           OR  IC-SSTCODIND = "EX87"
           OR  IC-SSTCODIND = "EX88"
211021     OR  IC-SSTCODIND = "EX89"
290322     OR  IC-SSTCODIND = "E092"
080722     OR  IC-SSTCODIND = "E109"
080722     OR  IC-SSTCODIND = "E110"
080722     OR  IC-SSTCODIND = "E112"
231122     OR  IC-SSTCODIND = "E107"
130123     OR  IC-SSTCODIND = "E159"
130123     OR  IC-SSTCODIND = "E160"
130123     OR  IC-SSTCODIND = "E162"
130123     OR  IC-SSTCODIND = "E157"
               MOVE 20221231 TO IC-CALCOLOAL
      * 12.11.2020 aggiunto controllo che il periodo della domanda non
      *            sovrapponga con il periodo di altr domanda
      *            e che la domanda non sia da definire a zero giornate
             IF IC-SSTCODIND NOT = "EEZR"
             AND IC-DCODTDECSP NOT = IC-SSTDADEC
                MOVE IC-DCOCHIDOM TO H-DCOCHIDOM
                MOVE IC-DCOCODFIS TO H-DCOCODFIS
                EXEC SQL
                   OPEN CURBONUS
                END-EXEC
                IF SQLCODE NOT = ZERO
                   MOVE 18 TO OC-RETCODE
                   MOVE "ERRORE RICERCA PERIODI SOVRAPPOSTI"
                        TO OC-MESSAGGIO
                   DISPLAY "ERROREMAX" SQLCODE
                   GOBACK
                END-IF
                EXEC SQL
                   FETCH CURBONUS INTO
                        :H-DCONDVEPR,
                        :H-DCODTADEC,
                        :H-DCODTDECSP,
                        :H-DCOULESSP,
                        :H-SSTDADEC
                END-EXEC
                PERFORM UNTIL SQLCODE NOT = ZERO
      *            IF  H-DCOULESSP = "D"
                   IF  H-SSTDADEC NOT = ZERO
                       MOVE H-SSTDADEC TO H-DCODTADEC
                   END-IF
                   IF      IC-DCODTDECSP = H-DCODTDECSP
                   OR (    IC-DCODTADEC  = H-DCODTADEC
                       AND IC-SSTDADEC = 0            )
                   OR      IC-SSTDADEC = H-DCODTADEC
                   OR (    IC-DCODTDECSP > H-DCODTDECSP
                       AND H-DCODTADEC > IC-DCODTDECSP )
                   OR (    IC-DCODTDECSP < H-DCODTDECSP
                       AND (    IC-SSTDADEC  > H-DCODTDECSP
                            OR  (   IC-DCODTADEC > H-DCODTDECSP
                                 AND IC-SSTDADEC = ZEROES      )   )   )
                      MOVE 18 TO OC-RETCODE
                      MOVE "ALTRA DOMANDA IN PAG. PER LO STESSO PERIODO"
                           TO OC-MESSAGGIO
                      EXEC SQL
                         CLOSE CURBONUS
                      END-EXEC
                      GOBACK
                   END-IF
                   EXEC SQL
                      FETCH CURBONUS INTO
                           :H-DCONDVEPR,
                           :H-DCODTADEC,
                           :H-DCODTDECSP,
                           :H-DCOULESSP,
                           :H-SSTDADEC
                   END-EXEC
               END-PERFORM
               EXEC SQL
                  CLOSE CURBONUS
               END-EXEC
           END-IF.

060223* elena - per bonus200 e 150 -->
      * inserito controllo presenza altro pag della stessa cate-
      * goria per lo stesso cf ma con diversa chiave gestionale
           IF OC-RETCODE = 0
             IF IC-SSTCODIND = 'E107' or 'E109' or 'E110' or 'E112' or
                               'E157' or 'E159' or 'E160' or 'E162'
210323* il controllo sul pagamento duplicato non va fatto se la domanda
      * in input ha decadenza=decorrenza
      * se DCODTADEC e SSTDADEC sono valorizzati, la decadenza è il
      * minimo tra le 2 date
      * viceversa la decadenza è DCODTADEC
               IF IC-SSTDADEC > 0
                 IF IC-SSTDADEC = IC-DCODTADEC
                   IF IC-DCODTADEC not = IC-DCODTDECSP
                     PERFORM CNTR-PAGDUPLI  THRU  EX-CNTR-PAGDUPLI
                   END-IF
                 ELSE
                   IF IC-SSTDADEC < IC-DCODTADEC
                     IF IC-SSTDADEC not = IC-DCODTDECSP
                       PERFORM CNTR-PAGDUPLI  THRU  EX-CNTR-PAGDUPLI
                     END-IF
                   ELSE
                     IF IC-DCODTADEC not = IC-DCODTDECSP
                       PERFORM CNTR-PAGDUPLI  THRU  EX-CNTR-PAGDUPLI
                     END-IF
                   END-IF
                 END-IF
               ELSE
                 IF IC-DCODTADEC not = IC-DCODTDECSP
                   PERFORM CNTR-PAGDUPLI  THRU  EX-CNTR-PAGDUPLI
                 END-IF
               END-IF
             END-IF
           END-IF.

030323* elena - controlli per tutti i sussidi-->
      * inserito controllo su primo carattere del cf: se è un numero
      * blocco l'elaborazione.
      * inserito controllo su cap: se assente su vcapsedi blocco l'ela-
      * borazione.
           IF OC-RETCODE = 0
             PERFORM CONTROLLI  THRU  EX-CONTROLLI
           END-IF.

           MOVE IC-CALCOLOAL TO DATA-TER-CAL.
           IF  IC-SSTCODIND = "SSTA"
           OR  IC-SSTCODIND = "CRED"
           OR  IC-SSTCODIND = "TYGM"
           OR  IC-SSTCODIND = "TIPO"
           OR  IC-SSTCODIND = "DL76"
           OR  IC-SSTCODIND = "TYRG"
           OR  IC-SSTCODIND = "TYBL"
           OR  IC-SSTCODIND = "TYCR"
           OR  IC-SSTCODIND = "RATA"
           OR  IC-SSTCODIND = "RATM"
           OR  IC-SSTCODIND = "TEIG"
      *    OR  IC-SSTCODIND = "APAF"
      *    OR  IC-SSTCODIND = "APAR"
      *    OR  IC-SSTCODIND = "APA2"
      *    OR  IC-SSTCODIND = "DLIA"
      *    OR  IC-SSTCODIND = "COIP"
           OR  IC-SSTCODIND = "PORM"
100522     OR  IC-SSTCODIND = "POR2"
           OR  IC-SSTCODIND = "WTW5"
           OR  IC-SSTCODIND = "TYAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
      *    OR  IC-SSTCODIND = "BRIO"
           OR  IC-SSTCODIND = "EELA"
251023     OR IC-SSTCODIND  = "POR3"
251023     OR IC-SSTCODIND  = "POR4"
251023     OR IC-SSTCODIND  = "POR5"
251023     OR IC-SSTCODIND  = "POR6"
260324     OR IC-SSTCODIND  = "FSAI"
270324     OR IC-SSTCODIND  = "FSAD"
100424     OR IC-SSTCODIND  = "FTCI"
140325     OR IC-SSTCODIND  = "TYGP"
               PERFORM B99-ECCEZIONE-CALCOLOAL
           END-IF.
           IF  IC-SSTCODIND = "WTWM"
           AND IC-SSTREGIND = 06
               PERFORM B98-ECCEZIONE-CALCOLOAL
           END-IF.
      * MOTIVI DI ESCLUSIONE:
      * - pagamento sospeso
           IF IC-DCOPESTDI = "N"
               MOVE 11 TO OC-RETCODE
030423*        MOVE "PRATICA SOSPESA"
030423         MOVE "PRATICA NON ATTIVA"
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      * - già elaborata nella stessa data
           IF  OC-DCODTULSP = DATA-SISTEMA-AMG
           AND OC-DCOULESSP NOT = "A"
               MOVE 13 TO OC-RETCODE
               MOVE "DOMANDA ELABORABILE DA DOMANI  "
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      * - già elaborata nella stessa data per fondo volo
      ******* quando possibile gestire per sussidi con SOSUNI ='S'
           IF  (     IC-SSTCODIND = "FTMD"
      *          OR  IC-SSTCODIND = "FTSO"
      *          OR  IC-SSTCODIND = "FTCG"
      *          OR  IC-SSTCODIND = "FTCD"
      *          OR  IC-SSTCODIND = "FTCC"
      *          OR  IC-SSTCODIND = "FTPL"
      *          OR  IC-SSTCODIND = "FTAI"
                 OR  IC-SSTCODIND = "FTAD"
260324           OR  IC-SSTCODIND = "FSAI"
270324           OR  IC-SSTCODIND = "FSAD" )
               IF  OC-DCODTULSP = DATA-SISTEMA-AMG
      *        AND OC-DCOULESSP NOT = "A"
                   MOVE 13 TO OC-RETCODE
                   MOVE "DOMANDA ELABORABILE DA DOMANI  "
                     TO OC-MESSAGGIO
                   GOBACK
               END-IF
           END-IF.
      * inibizione del calcolo dal 21.12.2016 al 31.12.2016 eccetto FTMD
      *    IF IC-SSTCODIND NOT = "FTMD"
      *        IF  DATA-SISTEMA-AMG > 20161220
      *        AND DATA-SISTEMA-AMG < 20170101
      *        AND OC-DCOULESSP NOT = "A"
      *            MOVE 18 TO OC-RETCODE
      *            MOVE "PAGAMENTI CHIUSI PER IL 2016   "
      *              TO OC-MESSAGGIO
      *            GOBACK
      *        END-IF
      *    END-IF.
      * - Integr. di importo: CRED, FTAI
      *   call routine di prel. dati da domanda PSR collegata
           IF IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "FTAI"
           OR IC-SSTCODIND = "FTAD"
260324     OR IC-SSTCODIND = "FSAI"
270324     OR IC-SSTCODIND = "FSAD"
               INITIALIZE I-SX41-AREA
                          O-SX41-AREA
               MOVE IC-SSTALFL1(3:13) TO I-DCOCHIDOM
               MOVE IC-CODSEDE        TO I-DCOCOSEGR
               CALL RDSSX41
               using  WDFHEIBLK  WDFHCOMMAREA
                                I-SX41-AREA
                                O-SX41-AREA
               CANCEL  RDSSX41
               EVALUATE O-SX41-RTCD
               WHEN "01"
                   MOVE 16 TO OC-RETCODE
                   MOVE "INTEGRAZ. NON COLLEGATA A PSR  "
                     TO OC-MESSAGGIO
                   GOBACK
               WHEN "02"
                   MOVE 16 TO OC-RETCODE
                   MOVE "ERRORE PERIODI TEORICI PSR     "
                     TO OC-MESSAGGIO
                   GOBACK
               WHEN "03"
                   MOVE 16 TO OC-RETCODE
                   MOVE "ERRORE TABELLA PAGAMENTI PSR   "
                     TO OC-MESSAGGIO
                   GOBACK
               WHEN "04"
                   MOVE 16 TO OC-RETCODE
                   MOVE "ERRORE STORICO PAGAMENTI PSR   "
                     TO OC-MESSAGGIO
                   GOBACK
               END-EVALUATE
               IF O-DCOULESPP NOT = "L" AND NOT = "D"
                   MOVE 17 TO OC-RETCODE
                   MOVE "STATO DOMANDA PSR NON CONTABILE"
                     TO OC-MESSAGGIO
                   GOBACK
               END-IF
               IF O-DCODTDECPP NOT = IC-DCODTDECSP
               AND IC-SSTALFL1(16:1) NOT = "R"
280921         AND IC-SSTCODIND NOT = "FTAD"
270324         AND IC-SSTCODIND NOT = "FSAD"
                   MOVE 18 TO OC-RETCODE
                   MOVE "DECORRENZA PSR NON = DOM.INTEGR"
                     TO OC-MESSAGGIO
                   GOBACK
               END-IF

260326* verifico se l'anticipazione è stata pagata in tranches.
      * data presentazione anticipo deve essere successiva al 31122025
      **%      IF H-DCODTPRDO > 20251231
      **%        IF H-AASIMP1 > 0 AND H-AASFLAG1 = 'P'
      **%          IF W-ESITOANT = 'L'
      * sommo il residuo 30% di anticipo al pagato effettivo di anticip
      * se l'anticipo è in L. Altrimenti il calcolo verrà fatto solo su
      * quanto pagato
      **%            ADD H-AASIMP1    TO O-AASIMPORTO
      **%          END-IF
      **%        END-IF
      **%      END-IF
260326* elena fine
           END-IF.


      * 05.01.2021 controllo presenza sospensione
           IF IC-SSTCODIND = "EE27"
           OR IC-SSTCODIND = "EE28"
           OR IC-SSTCODIND = "EE29"
           OR IC-SSTCODIND = "EE30"
           OR IC-SSTCODIND = "EE38"
           OR IC-SSTCODIND = "EE05"
           OR IC-SSTCODIND = "EE10"
           OR IC-SSTCODIND = "EE2A"
           OR IC-SSTCODIND = "EE2B"
           OR IC-SSTCODIND = "EE2C"
           OR IC-SSTCODIND = "EE2D"
           OR IC-SSTCODIND = "EE13"
           OR IC-SSTCODIND = "EE22"
           OR IC-SSTCODIND = "EEMA"
           OR IC-SSTCODIND = "EEZR"
           OR IC-SSTCODIND = "EJ29"
           OR IC-SSTCODIND = "EJ38"
           OR IC-SSTCODIND = "EJ2A"
           OR IC-SSTCODIND = "EJ2B"
           OR IC-SSTCODIND = "EJ2C"
           OR IC-SSTCODIND = "EJ2D"
           OR IC-SSTCODIND = "EJ05"
           OR IC-SSTCODIND = "EJ10"
           OR IC-SSTCODIND = "EJ13"
           OR IC-SSTCODIND = "EK29"
           OR IC-SSTCODIND = "EK38"
           OR IC-SSTCODIND = "EK2A"
           OR IC-SSTCODIND = "EK2B"
           OR IC-SSTCODIND = "EK2C"
           OR IC-SSTCODIND = "EK2D"
           OR IC-SSTCODIND = "EK05"
           OR IC-SSTCODIND = "EK10"
           OR IC-SSTCODIND = "EK13"
               PERFORM T21-COVID-SOSPE
           END-IF.
      * - data pensione < decorrenza
           IF IC-SSTDAPE NOT = 0
           AND IC-SSTDAPE < IC-DCODTDECSP
               MOVE 14 TO OC-RETCODE
               MOVE "DATA PENSIONE < DECORRENZA"
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      * codice FTMD CALCOLO TERMINE in funzione delle gg da pagare
      * e delle sospensioni presenti
           IF  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTAD"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "CRED"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
               PERFORM F01-CALCOLA-TERMINE
           END-IF.
      *  20.01.2020 calcolo h_sstretset per FTMD FTAD
           IF  IC-SSTCODIND = "FTMD"
               PERFORM F02-CALCOLA-RET-SET-MOB
           END-IF.
      *
           IF  IC-SSTCODIND = "FTAD"
           OR  IC-SSTCODIND = "FSAD"
               IF O-DCOCOTIDO = "U"
                   PERFORM F03-CALCOLA-RET-SET-NASPI
               ELSE
                   PERFORM F04-CALCOLA-RET-SET-ASPI
               END-IF
           END-IF.
      *
           IF  IC-SSTCODIND NOT = "CRED"
           AND IC-SSTCODIND NOT = "FTAI"
260324     AND IC-SSTCODIND NOT = "FSAI"
               IF IC-DCODTADEC NOT = 0
                   MOVE IC-DCODTADEC TO DATA-AMG
                   PERFORM R00-TOGLI-UNO
                   MOVE DATA-AMG TO DEFINIZ
               END-IF
           END-IF.
           IF IC-SSTDADEC NOT = ZEROES
               MOVE IC-SSTDADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               MOVE DATA-AMG TO DEFINIZ
           END-IF.
           MOVE DATA-TER-CAL TO MESE-PREC.
      *    DISPLAY 'ELENA18 DEFINIZ: ' DEFINIZ
      *    DISPLAY 'ELENA18 DATA-TER-CAL: ' DATA-TER-CAL
      *    DISPLAY 'ELENA18 MESE-PREC: ' MESE-PREC
      * - data fine calcolo < ultimo giorno calcolato
           IF DATA-TER-CAL < OC-SSTULASS
           AND (IC-SSTDADEC = 0 OR DEFINIZ > DATA-TER-CAL)
               MOVE 15 TO OC-RETCODE
               MOVE "DATA FINE CALCOLO < ULTIMO GIORNO CALCOLATO"
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      *
           IF DEFINIZ NOT = 0
               IF DEFINIZ < DATA-TER-CAL
                   MOVE DEFINIZ TO DATA-TER-CAL
               END-IF
               IF DEFINIZ < DATA-TERMINE
                   MOVE DEFINIZ TO DATA-TERMINE
               END-IF
           END-IF.
      *    DISPLAY 'ELENA18 DATA-TERMINE: ' DATA-TERMINE
           IF OC-RETCODE = 0
               MOVE IC-SSTCODIND TO H-CODCTG
               MOVE IC-SSTREGIND TO H-REGCTG
               MOVE IC-SSTANNIND TO H-ANNOCTG
      *        READ CATEGORIE
               PERFORM B00-DB2-SELECT THRU B00-DB2-SELECT-EX
               IF SQLCODE NOT = 0
                   MOVE 12 TO OC-RETCODE
                   MOVE "CATEGORIA INESISTENTE"
                     TO OC-MESSAGGIO
                   GOBACK
               END-IF
      * 27.05.2020
               IF H-REGIONE5 = 31
                   MOVE 19 TO OC-RETCODE
                   MOVE "PAG SOSPESO PER LA CATEGORIA"
                     TO OC-MESSAGGIO
                   GOBACK
               END-IF
200423* inizio
               initialize h-webgiolav
               IF IC-SSTCODIND = 'E092'
                 EXEC SQL
                      SELECT  H_WEBGIOLAV
                        INTO :H-WEBGIOLAV
                        FROM TDSWSCRR
                       WHERE H_WEBCODFIS = :IC-DCOCODFIS
                         AND H_WEBTIPDOM = '0'
                         AND H_WEBFLAG   =  1
                 END-EXEC
                 IF SQLCODE NOT = ZERO
                      DISPLAY 'DCLTDSWSCRR =' DCLTDSWSCRR
                      MOVE 'TDSWSCRR'      TO  WABNDB-TABL
                      MOVE 'SELECT'        TO  WABNDB-FUNC
                      PERFORM ERRORE-SQL
                 ELSE
                   IF H-WEBGIOLAV = 95
                     MOVE "RA"  TO H-TFISCALE
                   ELSE
                     MOVE "SS"  TO H-TFISCALE
                   END-IF
                 END-IF
               END-IF
200423* fine
           END-IF.
      * 27.05.2020
      * il campo H-CONTO5 contiene massima data di presentazione domanda
           IF IC-SSTCODIND = "EE27"
           OR IC-SSTCODIND = "EE28"
           OR IC-SSTCODIND = "EE29"
           OR IC-SSTCODIND = "EE30"
           OR IC-SSTCODIND = "EE38"
           OR IC-SSTCODIND = "EE05"
           OR IC-SSTCODIND = "EE10"
           OR IC-SSTCODIND = "EE2A"
           OR IC-SSTCODIND = "EE2B"
           OR IC-SSTCODIND = "EE2C"
           OR IC-SSTCODIND = "EE2D"
           OR IC-SSTCODIND = "EE13"
           OR IC-SSTCODIND = "EE22"
           OR IC-SSTCODIND = "EEMA"
           OR IC-SSTCODIND = "EEZR"
           OR IC-SSTCODIND = "EJ29"
           OR IC-SSTCODIND = "EJ38"
           OR IC-SSTCODIND = "EJ2A"
           OR IC-SSTCODIND = "EJ2B"
           OR IC-SSTCODIND = "EJ2C"
           OR IC-SSTCODIND = "EJ2D"
           OR IC-SSTCODIND = "EJ05"
           OR IC-SSTCODIND = "EJ10"
           OR IC-SSTCODIND = "EJ13"
           OR IC-SSTCODIND = "EK29"
           OR IC-SSTCODIND = "EK38"
           OR IC-SSTCODIND = "EK2A"
           OR IC-SSTCODIND = "EK2B"
           OR IC-SSTCODIND = "EK2C"
           OR IC-SSTCODIND = "EK2D"
           OR IC-SSTCODIND = "EK05"
           OR IC-SSTCODIND = "EK10"
           OR IC-SSTCODIND = "EK13"
           OR IC-SSTCODIND = "EW29"
           OR IC-SSTCODIND = "EW38"
           OR IC-SSTCODIND = "EW2A"
           OR IC-SSTCODIND = "EW2B"
           OR IC-SSTCODIND = "EW2C"
           OR IC-SSTCODIND = "EW2D"
           OR IC-SSTCODIND = "EW05"
           OR IC-SSTCODIND = "EW10"
           OR IC-SSTCODIND = "EW13"
           OR IC-SSTCODIND = "EY29"
           OR IC-SSTCODIND = "EY38"
           OR IC-SSTCODIND = "EY2A"
           OR IC-SSTCODIND = "EY2B"
           OR IC-SSTCODIND = "EY2C"
           OR IC-SSTCODIND = "EY2D"
           OR IC-SSTCODIND = "EY05"
           OR IC-SSTCODIND = "EY10"
           OR IC-SSTCODIND = "EY13"
           OR IC-SSTCODIND = "EY3A"
           OR  IC-SSTCODIND = "EX29"
           OR  IC-SSTCODIND = "EX38"
           OR  IC-SSTCODIND = "EX2A"
           OR  IC-SSTCODIND = "EX2B"
           OR  IC-SSTCODIND = "EX2C"
           OR  IC-SSTCODIND = "EX2D"
           OR  IC-SSTCODIND = "EX05"
           OR  IC-SSTCODIND = "EX10"
           OR  IC-SSTCODIND = "EX13"
           OR  IC-SSTCODIND = "EX3A"
           OR  IC-SSTCODIND = "EX87"
           OR  IC-SSTCODIND = "EX88"
211021     OR  IC-SSTCODIND = "EX89"
290322     OR  IC-SSTCODIND = "E092"
080722     OR  IC-SSTCODIND = "E109"
080722     OR  IC-SSTCODIND = "E110"
080722     OR  IC-SSTCODIND = "E112"
231122     OR  IC-SSTCODIND = "E107"
130123     OR  IC-SSTCODIND = "E159"
130123     OR  IC-SSTCODIND = "E160"
130123     OR  IC-SSTCODIND = "E162"
130123     OR  IC-SSTCODIND = "E157"
               IF  H-CONTO5 NOT = SPACES
               AND H-CONTO5 NOT = LOW-VALUE
                   IF H-CONTO5 NUMERIC
                       MOVE H-CONTO5 TO WK-CONTO5
                       IF IC-SSTDTAL1 = 0
                       OR IC-SSTDTAL1 > WK-CONTO5
                           MOVE 20 TO OC-RETCODE
                           MOVE "SUPERATO STANZIAMENTO "
                             TO OC-MESSAGGIO
                           GOBACK
                       END-IF
                   END-IF
               END-IF
           END-IF.
           IF IC-SSTCODIND = SPACES
           OR IC-PROGCTG = ZEROES
               MOVE 12 TO OC-RETCODE
               MOVE "CATEGORIA INESISTENTE"
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      * - sindacato
           INITIALIZE PER-RDSUT27.
           IF (    IC-DSICODSIN NUMERIC
               AND IC-DSICODSIN NOT = ZEROES)
           OR (    IC-DSICATSIN NUMERIC
               AND IC-DSICATSIN NOT = ZEROES)
              MOVE SPACES TO       LK-RETCODE
              MOVE IC-DSICODSIN TO LK-CODSIN
              MOVE IC-DSICATSIN TO LK-CATSIN
              CALL  RDSUT27  USING
                                   WDFHEIBLK  WDFHCOMMAREA
                                   PER-RDSUT27
              CANCEL  RDSUT27
              IF LK-RETCODE NOT =  "OK"
                  MOVE ZEROES TO LK-SINALIASU
                                 LK-SPERIS
              END-IF
           END-IF.
      *-------------------------------------------------------------*
       B98-ECCEZIONE-CALCOLOAL.
      *-------------------------------------------------------------*
      * solo per WTW Veneto consente il pagamento del mese precedente
      * soltanto dal 16
      * imposto mese precedente
           MOVE DATA-SISTEMA-AMG TO DATA-TER-CAL.
           COMPUTE MM-TER-CAL = MM-SIS-AMG - 1.
           IF MM-TER-CAL = 0
               MOVE 12 TO MM-TER-CAL
               COMPUTE AA-TER-CAL = AA-TER-CAL - 1
           END-IF.
      *fino al 15 del mese imposto mese ancora precedente
           IF GG-SIS-AMG <= 15
               COMPUTE MM-TER-CAL = MM-TER-CAL - 1
               IF MM-TER-CAL = 0
                   MOVE 12 TO MM-TER-CAL
                   COMPUTE AA-TER-CAL = AA-TER-CAL - 1
               END-IF
           END-IF.
           MOVE EL-GG(MM-TER-CAL) TO GG-TER-CAL
           IF MM-TER-CAL = 2
               DIVIDE 4 INTO AA-TER-CAL GIVING NUMERO
                                     REMAINDER RESTO
               IF RESTO = 0
                   MOVE 29 TO GG-TER-CAL
               END-IF
           END-IF.
      *-------------------------------------------------------------*
      *-------------------------------------------------------------*
       B99-ECCEZIONE-CALCOLOAL.
      *-------------------------------------------------------------*
      * calcola fino a mese precedente anzichè mese in corso
           IF MM-SIS-AMG <= MM-TER-CAL
               MOVE DATA-SISTEMA-AMG TO DATA-TER-CAL
               COMPUTE MM-TER-CAL = MM-SIS-AMG - 1
               IF MM-TER-CAL = 0
                   MOVE 12 TO MM-TER-CAL
                   COMPUTE AA-TER-CAL = AA-TER-CAL - 1
               END-IF
               MOVE EL-GG(MM-TER-CAL) TO GG-TER-CAL
               IF MM-TER-CAL = 2
                   DIVIDE 4 INTO AA-TER-CAL GIVING NUMERO
                                         REMAINDER RESTO
                   IF RESTO = 0
                       MOVE 29 TO GG-TER-CAL
                   END-IF
               END-IF
           END-IF.
      *-------------------------------------------------------------*
      *-------------------------------------------------------------*
       M00-CALCOLA-MENSILE.
      *-------------------------------------------------------------*
           INITIALIZE AREA2A.
           INITIALIZE AREA2B.
           INITIALIZE AREA2C.
      *  DETERMINO IMPORTO MENSILE:
      *  - IMPORTO DETERMINATO / PERCENTUALE SU RETRIBUZIONE
      *  - RIDIMENSIONATO EVENTUALMENTE IN CASO DI PART-TIME
           MOVE IC-IMPSUSS TO WK-IMP-MENSILE.
      * per prog. Welfare to Work limite massimo nel campo SSTNUML1
           IF IC-SSTCODIND = "WTWM"
               IF IC-SSTNUML1 > 0
               AND WK-IMP-MENSILE > IC-SSTNUML1
                   MOVE IC-SSTNUML1 TO WK-IMP-MENSILE
               END-IF
           END-IF.
           IF IC-SSTPARTIM = "S"
           AND H-ORECONTR  NOT = 0
               COMPUTE ORARIO-CONTR = IC-SSTMIN / 60
               ADD IC-SSTORE TO ORARIO-CONTR
               COMPUTE ORARIO-PART = IC-SSTMINEF / 60
               ADD IC-SSTOREEF TO ORARIO-PART
               COMPUTE WK-IMP-MENSILE = WK-IMP-MENSILE *
                                        ORARIO-PART    /
                                        ORARIO-CONTR
           END-IF.
      *   INIZIO PRESTAZIONE (AAMMGG)
           MOVE IC-DCODTDECSP TO DATA-INIZIO.
      * IMPOSTO DATA INIZIO PERIODO IN PAGAMENTO PER ASSEGNO
           IF OC-SSTULASS NOT = ZEROES
               MOVE OC-SSTULASS TO DATA-AMG
               PERFORM R10-AGGIUNGI-UNO
               MOVE DATA-AMG TO DATA-INI-PAG
           ELSE
               MOVE DATA-INIZIO TO DATA-INI-PAG
           END-IF.
      * TERMINE
           MOVE IC-DCODTADEC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE DATA-AMG TO DATA-TERMINE
                            DEFINIZ
                            TERMINE-R.
      * TERMINE = DECADENZA SE PRESENTE
           IF IC-SSTDARIN NOT = ZEROES
               MOVE IC-SSTDARIN TO IC-SSTDADEC
           END-IF.
           IF IC-SSTDADEC NOT = ZEROES
               MOVE IC-SSTDADEC TO DECORRENZA-R
               MOVE IC-SSTDADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DEFINIZ
               OR DEFINIZ = 0
                   MOVE DATA-AMG TO DEFINIZ
               END-IF
               IF DEFINIZ < DATA-TERMINE
                   MOVE DEFINIZ TO DATA-TERMINE
               END-IF
           END-IF.
      * TERMINE = DATA PENS. SE PRESENTE
           IF IC-SSTDAPE NOT = ZEROES
               MOVE IC-SSTDAPE TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DATA-TERMINE
                   MOVE DATA-AMG TO DATA-TERMINE
                                    DEFINIZ
               END-IF
           END-IF.
      *    IMPOSTO TERM. CALCOLATO
           MOVE IC-CALCOLOAL TO DATA-TER-CAL.
           IF  IC-SSTCODIND = "SSTA"
           OR  IC-SSTCODIND = "CRED"
           OR  IC-SSTCODIND = "TYGM"
           OR  IC-SSTCODIND = "TIPO"
           OR  IC-SSTCODIND = "DL76"
           OR  IC-SSTCODIND = "TYRG"
           OR  IC-SSTCODIND = "TYBL"
           OR  IC-SSTCODIND = "TYCR"
           OR  IC-SSTCODIND = "RATA"
           OR  IC-SSTCODIND = "RATM"
           OR  IC-SSTCODIND = "TEIG"
      *    OR  IC-SSTCODIND = "APAF"
      *    OR  IC-SSTCODIND = "APAR"
      *    OR  IC-SSTCODIND = "APA2"
      *    OR  IC-SSTCODIND = "DLIA"
      *    OR  IC-SSTCODIND = "COIP"
           OR  IC-SSTCODIND = "PORM"
100522     OR  IC-SSTCODIND = "POR2"
           OR  IC-SSTCODIND = "WTW5"
           OR  IC-SSTCODIND = "TYAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
      *    OR  IC-SSTCODIND = "BRIO"
           OR  IC-SSTCODIND = "EELA"
251023     OR  IC-SSTCODIND = "POR3"
251023     OR  IC-SSTCODIND = "POR4"
251023     OR  IC-SSTCODIND = "POR5"
251023     OR  IC-SSTCODIND = "POR6"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
140325     OR  IC-SSTCODIND = "TYGP"
               PERFORM B99-ECCEZIONE-CALCOLOAL
           END-IF.
           IF  IC-SSTCODIND = "WTWM"
           AND IC-SSTREGIND = 06
               PERFORM B98-ECCEZIONE-CALCOLOAL
           END-IF.
      * il campo CONTO6 contiene eventuale data di blocco calcolo
           IF  H-CONTO6 NOT = SPACES
           AND H-CONTO6 NOT = LOW-VALUE
               IF H-CONTO6 NUMERIC
                   MOVE H-CONTO6 TO WK-CONTO6
                   IF WK-CONTO6 < DATA-TER-CAL
                       MOVE WK-CONTO6 TO DATA-TER-CAL
                   END-IF
               END-IF
           END-IF.
      *
           MOVE DATA-TER-CAL TO MESE-PREC.
           IF DATA-TERMINE < DATA-TER-CAL
               MOVE DATA-TERMINE TO DATA-TER-CAL
           END-IF.

211024*correttivo per FTAI entrata senza decadenza
      *    IF IC-SSTCODIND = "FTAI" or "FSAI"
      *      IF IC-SSTDADEC = ZEROES
      *          IF O-PETPEERTA-MAX < DATA-TER-CAL
      *            MOVE O-PETPEERTA-MAX   TO DATA-TER-CAL
      *          END-IF
      *      END-IF
      *    END-IF.
      *
           PERFORM M10-CALCOLA-ANNO-IN-CORSO.
      * CALCOLA I PERIODI SPETTANTI
           IF DATA-INIZIO > DATA-TER-CAL
               MOVE 0 TO PERIODO-TOTALE
                         IMPORTO-TOTALE
           ELSE
               PERFORM M20-CALCOLA-PERIODO
           END-IF.
      ********
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
      ********
           MOVE 0 TO RIMB-ISOLA.
      *1o gruppo
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 07
               IF  IC-DCODTDECSP > 20070400
               AND IC-DCODTDECSP < 20071002
                   IF DATA-TER-CAL > 20071231
                       MOVE 500 TO RIMB-ISOLA
                       ADD RIMB-ISOLA TO IMPORTO-TOTALE
                   END-IF
                   IF DATA-TER-CAL > 20091129
                       ADD 480 TO IMPORTO-TOTALE
                   END-IF
               ELSE
                   IF IC-DCODTDECSP < 20091201
                       IF DATA-TER-CAL > 20091129
                           ADD 480 TO IMPORTO-TOTALE
                       END-IF
                   END-IF
               END-IF
      * il seguente controllo si può eliminare dopo aver
      * verificato che siano stati pagati tutti fino al 30 nov.2009
      *        IF OC-SSTULASS < 20091130
      *            MOVE 20090701 TO DATA-INI-PAG
      *        END-IF
           END-IF.
      *2o gruppo
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 08
           AND IC-DCODTDECSP > 20071200
           AND IC-DCODTDECSP < 20090000
           AND DATA-TER-CAL > 20090330
           AND IC-DCOCHIDOM NOT = "1112417800020"
           AND IC-DCOCODFIS NOT = "GRMCRI65H28F839S"
           AND IC-DCOCODFIS NOT = "FRNVCN83L07F839Y"
           AND IC-DCOCODFIS NOT = "DMNGPP53H09F839J"
           AND IC-DCOCODFIS NOT = "BRCGNR71T20A024I"
           AND IC-DCOCODFIS NOT = "VSCNNZ84M55F839Q"
           AND IC-DCOCODFIS NOT = "LCRCRI48A05F839H"
               MOVE 500 TO RIMB-ISOLA
               ADD RIMB-ISOLA TO IMPORTO-TOTALE
           END-IF.
      ********
      * PER PRESTAZIONE:
      *         DETRAGGO IMPORTO GIA' PAGATO (OC-SSTIMINT)
           COMPUTE IMPORTO-SPETTANTE = IMPORTO-TOTALE -
                                       OC-SSTIMINT.
      ********
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
      ********
      *1o gruppo
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 07
           AND IC-DCODTDECSP > 20070400
           AND IC-DCODTDECSP < 20071002
           AND IC-SSTNUML1 = 0
               SUBTRACT RIMB-ISOLA FROM IMPORTO-SPETTANTE
           END-IF.
      *2o gruppo
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 08
           AND IC-DCODTDECSP > 20071200
           AND IC-DCODTDECSP < 20090000
           AND IC-SSTNUML1 = 0
           AND IC-DCOCHIDOM NOT = "1112417800020"
           AND IC-DCOCODFIS NOT = "GRMCRI65H28F839S"
           AND IC-DCOCODFIS NOT = "FRNVCN83L07F839Y"
           AND IC-DCOCODFIS NOT = "DMNGPP53H09F839J"
           AND IC-DCOCODFIS NOT = "BRCGNR71T20A024I"
           AND IC-DCOCODFIS NOT = "VSCNNZ84M55F839Q"
           AND IC-DCOCODFIS NOT = "LCRCRI48A05F839H"
               SUBTRACT RIMB-ISOLA FROM IMPORTO-SPETTANTE
           END-IF.
      ********
      * CORRETTIVO NEL CASO DI RIELABORAZIONE RINUNCIA
      *    IF OC-SSTIMRIN > 0
      *        ADD OC-SSTIMRIN TO IMPORTO-SPETTANTE
      *    END-IF.
      * DETRAGGO RECUPERO
           PERFORM D00-DETRAGGO-RECUPERO.
      * APPLICO RITENUTE IRPEF
      *25032020
           IF H-TFISCALE = "NO"
               PERFORM T40-NO-IRPEF
           ELSE
               PERFORM I10-IMPOSTA-IRPEF
           END-IF.
      * CALCOLO ANTICIPAZIONE
           MOVE ZEROES TO ULTIMO-IMP-R
                          TRA-SIND-R.
           IF IC-SSTDARIN NOT = ZEROES
           AND H-TIPO = "M"
           AND DEFINIZ NOT > DATA-TER-CAL
               PERFORM M22-CALCOLA-ANTICIPO
           END-IF.
           IF ULTIMO-IMP-R > 0
               PERFORM I20-IMPOSTA-IRPEF-R
           END-IF.
      * APPLICO TRATTENUTA SINDACALE.
           MOVE 0 TO TRA-SIND.
           IF IMPORTO-SPETTANTE > 0
           AND IC-SSTCODIND NOT = "EE27"
           AND IC-SSTCODIND NOT = "EE28"
           AND IC-SSTCODIND NOT = "EE29"
           AND IC-SSTCODIND NOT = "EE30"
           AND IC-SSTCODIND NOT = "EE38"
           AND IC-SSTCODIND NOT = "EE05"
           AND IC-SSTCODIND NOT = "EE10"
           AND IC-SSTCODIND NOT = "EE2A"
           AND IC-SSTCODIND NOT = "EE2B"
           AND IC-SSTCODIND NOT = "EE2C"
           AND IC-SSTCODIND NOT = "EE2D"
           AND IC-SSTCODIND NOT = "EE13"
           AND IC-SSTCODIND NOT = "EE22"
           AND IC-SSTCODIND NOT = "EEMA"
           AND IC-SSTCODIND NOT = "EEZR"
           AND IC-SSTCODIND NOT = "EJ29"
           AND IC-SSTCODIND NOT = "EJ38"
           AND IC-SSTCODIND NOT = "EJ2A"
           AND IC-SSTCODIND NOT = "EJ2B"
           AND IC-SSTCODIND NOT = "EJ2C"
           AND IC-SSTCODIND NOT = "EJ2D"
           AND IC-SSTCODIND NOT = "EJ05"
           AND IC-SSTCODIND NOT = "EJ10"
           AND IC-SSTCODIND NOT = "EJ13"
           AND IC-SSTCODIND NOT = "EK29"
           AND IC-SSTCODIND NOT = "EK38"
           AND IC-SSTCODIND NOT = "EK2A"
           AND IC-SSTCODIND NOT = "EK2B"
           AND IC-SSTCODIND NOT = "EK2C"
           AND IC-SSTCODIND NOT = "EK2D"
           AND IC-SSTCODIND NOT = "EK05"
           AND IC-SSTCODIND NOT = "EK10"
           AND IC-SSTCODIND NOT = "EK13"
           AND IC-SSTCODIND NOT = "EW29"
           AND IC-SSTCODIND NOT = "EW38"
           AND IC-SSTCODIND NOT = "EW2A"
           AND IC-SSTCODIND NOT = "EW2B"
           AND IC-SSTCODIND NOT = "EW2C"
           AND IC-SSTCODIND NOT = "EW2D"
           AND IC-SSTCODIND NOT = "EW05"
           AND IC-SSTCODIND NOT = "EW10"
           AND IC-SSTCODIND NOT = "EW13"
           AND IC-SSTCODIND NOT = "EY29"
           AND IC-SSTCODIND NOT = "EY38"
           AND IC-SSTCODIND NOT = "EY2A"
           AND IC-SSTCODIND NOT = "EY2B"
           AND IC-SSTCODIND NOT = "EY2C"
           AND IC-SSTCODIND NOT = "EY2D"
           AND IC-SSTCODIND NOT = "EY05"
           AND IC-SSTCODIND NOT = "EY10"
           AND IC-SSTCODIND NOT = "EY13"
           AND IC-SSTCODIND NOT = "EY3A"
           AND IC-SSTCODIND NOT = "EX29"
           AND IC-SSTCODIND NOT = "EX38"
           AND IC-SSTCODIND NOT = "EX2A"
           AND IC-SSTCODIND NOT = "EX2B"
           AND IC-SSTCODIND NOT = "EX2C"
           AND IC-SSTCODIND NOT = "EX2D"
           AND IC-SSTCODIND NOT = "EX05"
           AND IC-SSTCODIND NOT = "EX10"
           AND IC-SSTCODIND NOT = "EX13"
           AND IC-SSTCODIND NOT = "EX3A"
           AND IC-SSTCODIND NOT = "EX87"
           AND IC-SSTCODIND NOT = "EX88"
211021     AND IC-SSTCODIND NOT = "EX89"
290322     AND IC-SSTCODIND NOT = "E092"
080722     AND IC-SSTCODIND NOT = "E109"
080722     AND IC-SSTCODIND NOT = "E110"
080722     AND IC-SSTCODIND NOT = "E112"
231122     AND IC-SSTCODIND NOT = "E107"
130123     AND IC-SSTCODIND NOT = "E159"
130123     AND IC-SSTCODIND NOT = "E160"
130123     AND IC-SSTCODIND NOT = "E162"
130123     AND IC-SSTCODIND NOT = "E157"
               IF IC-SSTCODIND = "SOMM"
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SPERIS
               ELSE
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SINALIASU
               END-IF
               IF TRA-SIND NOT > 0.72
                   MOVE 0 TO TRA-SIND
               END-IF
           END-IF.
           PERFORM I00-IRPEF.
      * DETRAGGO TRATTENUTE SINDACALI
           COMPUTE IMPORTO-SPETTANTE =
                  IMPORTO-SPETTANTE - TRA-SIND.
           COMPUTE ULTIMO-IMP-R =
                  ULTIMO-IMP-R - TRA-SIND-R.
      * 11.07.2017 gestione acconto
      * DETRAGGO ACCONTO
           PERFORM D10-DETRAGGO-ACCONTO.
      *
      ********
      * A.N.F.
      * calcolo ANF a conguaglio
           IF IMPORTO-ANF > OC-SSTIMANFT
               COMPUTE IMPORTO-ANF-U = IMPORTO-ANF -
                                       OC-SSTIMANFT
               MOVE IMPORTO-ANF TO OC-SSTIMANFT
           ELSE
               MOVE ZEROES TO IMPORTO-ANF-U
           END-IF.
      * DETRAGGO RECUPERO ANF
           IF OC-RECTORERE-2 > IMPORTO-ANF-U
               COMPUTE OC-RECTORERE-2 = OC-RECTORERE-2 -
                                        IMPORTO-ANF-U
               MOVE IMPORTO-ANF-U TO ULTIMO-RECU-ANF
               MOVE ULTIMO-RECU-ANF TO REC-ANF-X-ASS
               MOVE 0 TO IMPORTO-ANF-U
           ELSE
               COMPUTE IMPORTO-ANF-U = IMPORTO-ANF-U -
                                       OC-RECTORERE-2
               MOVE OC-RECTORERE-2 TO  ULTIMO-RECU-ANF
                                       REC-ANF-X-ASS
               MOVE 0 TO OC-RECTORERE-2
           END-IF.
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
      ********
      *1o gruppo
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 07
           AND IC-DCODTDECSP > 20070400
           AND IC-DCODTDECSP < 20071002
           AND IC-SSTNUML1 = 0
               MOVE RIMB-ISOLA TO OC-SSTNUML1
               ADD RIMB-ISOLA TO IMPORTO-SPETTANTE
           END-IF.
      *2o gruppo
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 08
           AND IC-DCODTDECSP > 20071200
           AND IC-DCODTDECSP < 20090000
           AND IC-SSTNUML1 = 0
           AND IC-DCOCHIDOM NOT = "1112417800020"
           AND IC-DCOCODFIS NOT = "GRMCRI65H28F839S"
           AND IC-DCOCODFIS NOT = "FRNVCN83L07F839Y"
           AND IC-DCOCODFIS NOT = "DMNGPP53H09F839J"
           AND IC-DCOCODFIS NOT = "BRCGNR71T20A024I"
           AND IC-DCOCODFIS NOT = "VSCNNZ84M55F839Q"
           AND IC-DCOCODFIS NOT = "LCRCRI48A05F839H"
               MOVE RIMB-ISOLA TO OC-SSTNUML1
               ADD RIMB-ISOLA TO IMPORTO-SPETTANTE
           END-IF.
      *-------------------------------------------------------------*
       F01-CALCOLA-TERMINE.
      *-------------------------------------------------------------*
      * codice FTMD CALCOLO TERMINE in funzione delle gg da pagare
      * e delle sospensioni presenti
      * se c'è una sospensione aperta imposta inizio sospensione
      * + gg da pagare (differenza totale - pagate)
           IF  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTAD"
               MOVE IC-SSTNUML2 TO WK-GIORNI
      * controlla max 24 mesi
               IF WK-GIORNI > 720
                   MOVE 720 TO WK-GIORNI
               END-IF
           END-IF.
270324     IF  IC-SSTCODIND = "FSAD"
270324         MOVE IC-SSTNUML2 TO WK-GIORNI
270324* controlla max 18 mesi
270324         IF WK-GIORNI > 540
270324             MOVE 540 TO WK-GIORNI
270324         END-IF
270324     END-IF.
           IF  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "CRED"
260324     OR  IC-SSTCODIND = "FSAI"
               IF O-DCOCOTIDO = "U"
                   MOVE 728 TO WK-GIORNI
               ELSE
                   MOVE 720 TO WK-GIORNI
               END-IF
           END-IF.
           MOVE ZEROES TO LK-DATA1.
           MOVE ZEROES TO LK-DATA2.
           MOVE IC-DCODTDECSP TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE DATA-AMG TO DATA-TERMINE
                            LK-DATA1.
           MOVE 1 TO IND-SOS.
           PERFORM UNTIL IND-SOS > 400
                      OR IC-SOSDTINSOS(IND-SOS) = 0
               IF IC-SOSDTINSOS(IND-SOS) > LK-DATA1
                   MOVE IC-SOSDTINSOS(IND-SOS) TO DATA-AMG
                   PERFORM R00-TOGLI-UNO
                   IF LK-DATA1 < DATA-AMG
                       MOVE DATA-AMG     TO LK-DATA2
                       CALL RDSUT20 USING
                                          WDFHEIBLK  WDFHCOMMAREA
                                          LK-DATA1
                                          LK-DATA2
                                          WK-PER-SPET
                       COMPUTE WK-PER-SPET = WK-PER-SPET - 1
                       IF WK-PER-SPET > WK-GIORNI
                           MOVE LK-DATA1 TO DATA-AMG
                           PERFORM R10-AGGIUNGI-UNO
                           MOVE DATA-AMG TO DATA-IN
                           MOVE ZEROES TO DATA-OUT
                           MOVE WK-GIORNI TO GIORNI-IN
                           CALL RDSUT55 USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  LK-AGGIUNGI
      *                    EXEC CICS LINK PROGRAM('RDSUT55')
      *                            COMMAREA(LK-AGGIUNGI)
      *                    END-EXEC
                           MOVE DATA-OUT TO LK-DATA1
                           MOVE 0 TO WK-GIORNI
                       ELSE
                           MOVE LK-DATA1 TO DATA-AMG
                           PERFORM R10-AGGIUNGI-UNO
                           MOVE DATA-AMG TO DATA-IN
                           MOVE ZEROES TO DATA-OUT
                           MOVE WK-PER-SPET TO GIORNI-IN
                           CALL RDSUT55 USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  LK-AGGIUNGI
      *                    EXEC CICS LINK PROGRAM('RDSUT55')
      *                            COMMAREA(LK-AGGIUNGI)
      *                    END-EXEC
                           MOVE DATA-OUT TO LK-DATA1
                           SUBTRACT WK-PER-SPET FROM WK-GIORNI
                       END-IF
                   END-IF
               END-IF
               IF IC-SOSDTFISOS(IND-SOS) > 0
                   IF WK-GIORNI > 0
                       MOVE IC-SOSDTFISOS(IND-SOS) TO LK-DATA1
                   END-IF
               ELSE
                   IF WK-GIORNI > 0
                       MOVE LK-DATA1 TO DATA-AMG
                       PERFORM R10-AGGIUNGI-UNO
                       MOVE DATA-AMG TO DATA-IN
                       MOVE ZEROES TO DATA-OUT
                       MOVE WK-GIORNI TO GIORNI-IN
                       CALL RDSUT55 USING
                              WDFHEIBLK  WDFHCOMMAREA
                              LK-AGGIUNGI
      *                EXEC CICS LINK PROGRAM('RDSUT55')
      *                        COMMAREA(LK-AGGIUNGI)
      *                END-EXEC
                       MOVE DATA-OUT TO LK-DATA1
                       MOVE 0 TO WK-GIORNI
                   END-IF
               END-IF
               ADD 1 TO IND-SOS
           END-PERFORM.
           IF WK-GIORNI > 0
               MOVE LK-DATA1 TO DATA-AMG
               PERFORM R10-AGGIUNGI-UNO
               MOVE DATA-AMG TO DATA-IN
               MOVE ZEROES TO DATA-OUT
               MOVE WK-GIORNI TO GIORNI-IN
               CALL RDSUT55 USING
                      WDFHEIBLK  WDFHCOMMAREA
                      LK-AGGIUNGI
      *        EXEC CICS LINK PROGRAM('RDSUT55')
      *                 COMMAREA(LK-AGGIUNGI)
      *        END-EXEC
               MOVE DATA-OUT TO LK-DATA1
               MOVE 0 TO WK-GIORNI
           END-IF.
           MOVE LK-DATA1 TO DATA-TERMINE
                            DEFINIZ.
           MOVE DATA-TERMINE TO DATA-AMG.
           PERFORM R10-AGGIUNGI-UNO.
           MOVE DATA-AMG TO IC-DCODTADEC
                            OC-DCODTADEC.
      * correttivo per CRED integrazione NASPI
      * 16.01.2020 tentativo per errato calcolo dcodtadec
           IF  IC-SSTCODIND = "CRED"
           OR  IC-SSTCODIND = "FTAI"
260324     OR  IC-SSTCODIND = "FSAI"
               IF O-DCODTADEC NOT = 0
                   IF IC-DCODTADEC < O-DCODTADEC
                       MOVE O-DCODTADEC TO IC-DCODTADEC
                   END-IF
      *            DISPLAY 'ELENA18 IC-DCODTADEC: ' IC-DCODTADEC
      *            DISPLAY 'ELENA18 O-DCODTADEC: ' O-DCODTADEC
               ELSE
      * 27.12.20120
      *            DISPLAY 'ELENA18 IC-DCODTADEC: ' IC-DCODTADEC
      *            DISPLAY 'ELENA18 O-PMEDTRICA : ' O-PMEDTRICA
                   IF IC-DCODTADEC <= O-PMEDTRICA
                       MOVE O-PMEDTRICA TO DATA-AMG
                       PERFORM R10-AGGIUNGI-UNO
                       MOVE DATA-AMG TO IC-DCODTADEC
                       MOVE DATA-AMG TO DATA-IN
                       MOVE ZEROES TO DATA-OUT
                       COMPUTE GIORNI-IN = IC-GGSUSS - IC-SSTGGCALC
                       CALL RDSUT55 USING
                           WDFHEIBLK  WDFHCOMMAREA
                           LK-AGGIUNGI
      *        EXEC CICS LINK PROGRAM('RDSUT55')
      *                 COMMAREA(LK-AGGIUNGI)
      *        END-EXEC
                       MOVE DATA-OUT TO IC-DCODTADEC
                       MOVE 0 TO WK-GIORNI
                   END-IF
               END-IF
               MOVE IC-DCODTADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               MOVE DATA-AMG TO DATA-TERMINE
                                DEFINIZ
               MOVE IC-DCODTADEC TO OC-DCODTADEC
           END-IF.
      * controlla max 48 mesi dalla decorrenza
           IF  IC-SSTCODIND NOT = "FTAI"
260324     AND IC-SSTCODIND NOT = "FSAI"
           AND IC-DCODTADEC > (IC-DCODTDECSP + 40000)
               COMPUTE IC-DCODTADEC = (IC-DCODTDECSP + 40000)
               MOVE IC-DCODTADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               MOVE DATA-AMG TO DATA-TERMINE
                                DEFINIZ
               MOVE IC-DCODTADEC TO OC-DCODTADEC
           END-IF.
      *-------------------------------------------------------------*
       F02-CALCOLA-RET-SET-MOB.
      *-------------------------------------------------------------*
      *
           MOVE  'F02-CALCOLA-RET-SET-MOB' TO  WABNDB-LABEL.
           MOVE IC-SSTALFL1(3:13) TO WK-IDMCHIDOM.
      *
           EXEC SQL
                 SELECT
                    H_IDMORTECO,
                    H_IDMREORE
                 INTO
                    :H-IDMORTECO,
                    :H-IDMREORE
                 FROM TDSINDIM
                 WHERE
                    H_IDMCHIDOM      =  :WK-IDMCHIDOM
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
                DISPLAY 'DCLTDSINDIM =' DCLTDSINDIM
                MOVE 'TDSINDIM'      TO  WABNDB-TABL
                MOVE 'SELECT'        TO  WABNDB-FUNC
                PERFORM ERRORE-SQL
           END-IF.
      *
           COMPUTE OC-SSTRETSET = H-IDMORTECO * H-IDMREORE.
           COMPUTE OC-SSTRECRIN = OC-SSTRETSET * 4.33 / 30 * 0.33.
      *-------------------------------------------------------------*
       F03-CALCOLA-RET-SET-NASPI.
      *-------------------------------------------------------------*
      *
           MOVE  'F03-CALCOLA-RET-SET-NASPI' TO  WABNDB-LABEL.
      *
           EXEC SQL
                 SELECT
                    H_DCOANVEPR
                 INTO
                    :H-DCOANVEPR
                 FROM TDSDATCO
                 WHERE
                    H_DCOCHIDOM      =  :I-DCOCHIDOM
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
                DISPLAY 'DCLTDSDATCO =' DCLTDSDATCO
                MOVE 'TDSDATCO'      TO  WABNDB-TABL
                MOVE 'SELECT'        TO  WABNDB-FUNC
                PERFORM ERRORE-SQL
           END-IF.
      *
           IF H-DCOANVEPR < 2016
               MOVE 20150501 TO MASSIMALE-DAL
           ELSE
               COMPUTE MASSIMALE-DAL = H-DCOANVEPR * 10000
               ADD 0101 TO MASSIMALE-DAL
           END-IF.
      *
           EXEC SQL
                 SELECT
                    H_NASTREU4A,
                    H_NASNSELA4
                 INTO
                    :H-NASTREU4A,
                    :H-NASNSELA4
                 FROM TDSNASPI
                 WHERE
                    H_NASCHIDOM      =  :I-DCOCHIDOM
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
                DISPLAY 'DCLTDSNASPI =' DCLTDSNASPI
                MOVE 'TDSNASPI'      TO  WABNDB-TABL
                MOVE 'SELECT'        TO  WABNDB-FUNC
                PERFORM ERRORE-SQL
           END-IF.
      *
           EXEC SQL
                 SELECT
                    H_TMODTADAL,
                    H_TMOIMPMASE
                 INTO
                    :H-TMODTADAL,
                    :H-TMOIMPMASE
                 FROM TDSTAMAO
                 WHERE
                    H_TMODTADAL      =  :MASSIMALE-DAL
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
                DISPLAY 'DCLTDSTAMAO =' DCLTDSTAMAO
                MOVE 'TDSTAMAO'      TO  WABNDB-TABL
                MOVE 'SELECT'        TO  WABNDB-FUNC
                PERFORM ERRORE-SQL
           END-IF.
      *
           IF ((H-NASTREU4A / H-NASNSELA4) * 4.33) <=
              1.4 * (H-TMOIMPMASE * 30)
               COMPUTE OC-SSTRETSET = H-NASTREU4A / H-NASNSELA4
           ELSE
               COMPUTE OC-SSTRETSET = 1.4 * (H-TMOIMPMASE * 30) / 4.33
           END-IF.
           COMPUTE OC-SSTRECRIN = OC-SSTRETSET * 4.33 / 30 * 0.33.
      *-------------------------------------------------------------*
       F04-CALCOLA-RET-SET-ASPI.
      *-------------------------------------------------------------*
      *
           MOVE  'F04-CALCOLA-RET-SET-ASPI' TO  WABNDB-LABEL.
      *
           EXEC SQL
                 SELECT
                    H_ASPIMPMSTE
                 INTO
                    :H-ASPIMPMSTE
                 FROM TDSASPI
                 WHERE
                    H_ASPCHIDOM      =  :I-DCOCHIDOM
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
                DISPLAY 'DCLTDSASPI =' DCLTDSASPI
                MOVE 'TDSASPI'       TO  WABNDB-TABL
                MOVE 'SELECT'        TO  WABNDB-FUNC
                PERFORM ERRORE-SQL
           END-IF.
      *
           COMPUTE OC-SSTRETSET = H-ASPIMPMSTE / 4.33.
           COMPUTE OC-SSTRECRIN = OC-SSTRETSET * 4.33 / 30 * 0.33.
      *-------------------------------------------------------------*
       F00-CALCOLA-MENSILE-FONDI.
      *-------------------------------------------------------------*
           INITIALIZE AREA2A.
           INITIALIZE AREA2B.
           INITIALIZE AREA2C.
      *  DETERMINO IMPORTO MENSILE:
      *  - 30 VOLTE L'IMPORTO GIORNALIERO CHE, SOLO PER IL FONDO
      *    TRASP. AEREO, È CONTENUTO NEL CAMPO SSTRETRORA
           IF IC-SSTCODIND = "TRAP"
             COMPUTE WK-IMP-MENSILE = IC-SSTRETRORA *
                                                730 /
                                                720 *
                                                30
           ELSE
             IF IC-SSTCODIND = "TIPO"
             OR IC-SSTCODIND = "TYGM"
             OR IC-SSTCODIND = "DL76"
             OR IC-SSTCODIND = "TYAD"
             OR IC-SSTCODIND = "TYRG"
             OR IC-SSTCODIND = "TYBL"
             OR IC-SSTCODIND = "TYCR"
             OR IC-SSTCODIND = "APAF"
             OR IC-SSTCODIND = "COIP"
             OR IC-SSTCODIND = "APAR"
             OR IC-SSTCODIND = "APA2"
110422       OR IC-SSTCODIND = "APA3"
241122       OR IC-SSTCODIND = "APA4"
140323       OR IC-SSTCODIND = "APA5"
             OR IC-SSTCODIND = "DLIA"
             OR IC-SSTCODIND = "BRIO"
             OR IC-SSTCODIND = "PORM"
100522       OR IC-SSTCODIND = "POR2"
             OR IC-SSTCODIND = "EELA"
140223       OR IC-SSTCODIND = "TGOL"
251023       OR IC-SSTCODIND = "POR3"
251023       OR IC-SSTCODIND = "POR4"
251023       OR IC-SSTCODIND = "POR5"
251023       OR IC-SSTCODIND = "POR6"
271123       OR IC-SSTCODIND = "DLI2"
060524       OR IC-SSTCODIND = "TISC"
210624       OR IC-SSTCODIND = "TISM"
240624       OR IC-SSTCODIND = "TGOC"
280125       OR IC-SSTCODIND = "APA6"
130325       OR IC-SSTCODIND = "TGOV"
140325       OR IC-SSTCODIND = "TYGP"
300725       OR IC-SSTCODIND = "TGOS"
241025       OR IC-SSTCODIND = "TGOP"
150426       OR IC-SSTCODIND = "TIRA"
150426       OR IC-SSTCODIND = "PIAC"
               IF IC-SSTNUML2 > 0
                 COMPUTE IC-SSTRETRORA  = IC-SSTNUML1 / IC-SSTNUML2
                 COMPUTE WK-IMP-MENSILE = IC-SSTRETRORA * 30
               ELSE
                 COMPUTE IC-SSTRETRORA  = IC-SSTNUML1
                 COMPUTE WK-IMP-MENSILE = IC-SSTRETRORA
               END-IF
             ELSE
               COMPUTE WK-IMP-MENSILE = IC-SSTRETRORA * 30
             END-IF
           END-IF.
      *   INIZIO PRESTAZIONE (AAMMGG)
           MOVE IC-DCODTDECSP TO DATA-INIZIO.
      * IMPOSTO DATA INIZIO PERIODO IN PAGAMENTO PER ASSEGNO
           IF OC-SSTULASS NOT = ZEROES
               MOVE OC-SSTULASS TO DATA-AMG
               PERFORM R10-AGGIUNGI-UNO
               MOVE DATA-AMG TO DATA-INI-PAG
           ELSE
               MOVE DATA-INIZIO TO DATA-INI-PAG
           END-IF.
      * TERMINE
      * 15.03.2017
      * correttivo per TRAC . se elaborata con indebito e riaperta non
      * viene reimpostato h_dcodtadec
           IF (   IC-SSTCODIND = "TRAC"
               OR IC-SSTCODIND = "FTCG"
               OR IC-SSTCODIND = "FTCD"
               OR IC-SSTCODIND = "FTCC"
100424         OR IC-SSTCODIND = "FTCI"   )
           AND IC-DCODTADEC = IC-DCODTDECSP
           AND IC-SSTDADEC > IC-DCODTADEC
               MOVE IC-SSTDADEC TO IC-DCODTADEC
           END-IF.
      *
           MOVE IC-DCODTADEC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE DATA-AMG TO DATA-TERMINE
                            DEFINIZ
                            TERMINE-R.
      * TERMINE = DECADENZA SE PRESENTE
           IF IC-SSTDADEC NOT = ZEROES
               MOVE IC-SSTDADEC TO DECORRENZA-R
               MOVE IC-SSTDADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DEFINIZ
               OR DEFINIZ = 0
                   MOVE DATA-AMG TO DEFINIZ
               END-IF
               IF DEFINIZ < DATA-TERMINE
                   MOVE DEFINIZ TO DATA-TERMINE
               END-IF
           END-IF.
      * TERMINE = DATA PENS. SE PRESENTE
           IF IC-SSTDAPE NOT = ZEROES
               MOVE IC-SSTDAPE TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DATA-TERMINE
                   MOVE DATA-AMG TO DATA-TERMINE
                                    DEFINIZ
               END-IF
           END-IF.
      *    IMPOSTO TERM. CALCOLATO
      *    MOVE IC-CALCOLOAL TO DATA-TER-CAL.
      *
      * imposto dati per CRED, FTAI e altre integrazioni di importo
           IF IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "FTAI"
260324     OR IC-SSTCODIND = "FSAI"
               PERFORM C10-CREDITO
           END-IF.
      * il campo CONTO6 contiene eventuale data di blocco calcolo
           IF  H-CONTO6 NOT = SPACES
           AND H-CONTO6 NOT = LOW-VALUE
               IF H-CONTO6 NUMERIC
                   MOVE H-CONTO6 TO WK-CONTO6
                   IF WK-CONTO6 < DATA-TER-CAL
                       MOVE WK-CONTO6 TO DATA-TER-CAL
                   END-IF
               END-IF
           END-IF.
      *
           MOVE DATA-TER-CAL TO MESE-PREC.
           IF DATA-TERMINE < DATA-TER-CAL
               MOVE DATA-TERMINE TO DATA-TER-CAL
           END-IF.
      *
211024*correttivo per FTAI entrata senza decadenza
      *    IF IC-SSTCODIND = "FTAI" or "FSAI"
      *      IF IC-SSTDADEC = ZEROES
      *          IF O-PETPEERTA-MAX < DATA-TER-CAL
      *            MOVE O-PETPEERTA-MAX   TO DATA-TER-CAL
      *          END-IF
      *      END-IF
      *    END-IF.
      *
           EVALUATE IC-SSTCODIND
             WHEN "CRED"
               IF IC-SSTALFL1(16:1) NOT = 'R'
                   PERFORM C20-CALCOLA-ANNO-IN-CORSO
               ELSE
                   PERFORM C21-CALCOLA-ANNO-IN-CORSO-RIP
               END-IF
             WHEN "FTAI"
260324       WHEN "FSAI"
               PERFORM F20-CALCOLA-ANNO-IN-CORSO
             WHEN OTHER
               PERFORM M10-CALCOLA-ANNO-IN-CORSO
           END-EVALUATE.
      *
      * CALCOLA I PERIODI SPETTANTI
           IF DATA-INIZIO > DATA-TER-CAL
               MOVE 0 TO PERIODO-TOTALE
                         IMPORTO-TOTALE
           ELSE
               EVALUATE IC-SSTCODIND
                 WHEN "CRED"
                   IF IC-SSTALFL1(16:1) NOT = 'R'
                       PERFORM C30-CALCOLA-PERIODO
                   ELSE
                       PERFORM C31-CALCOLA-PERIODO-RIP
                   END-IF
                 WHEN "FTAI"
260324           WHEN "FSAI"
                   PERFORM F30-CALCOLA-PERIODO
                 WHEN OTHER
                   PERFORM M20-CALCOLA-PERIODO
               END-EVALUATE
           END-IF.
      * PER PRESTAZIONE:
      *  -  DETRAGGO IMPORTO GIA' PAGATO (OC-SSTIMINT)
      *  -  DETRAGGO IMPORTO PAGATO DALL'AZIENDA A
      *     TITOLO DI ANTICIPAZIONE (OC-SSTNUML1)
      *********** PAG. ARRETRATI TASSAZ. CORRENTE ***************
           IF ( IC-SSTCODIND = "FTCG"
                OR IC-SSTCODIND = "FTCD"
                OR IC-SSTCODIND = "FTCC"
100424          OR IC-SSTCODIND = "FTCI" )
           AND IC-SSTIMRIN NOT = 0
120324     AND IC-SSTPARTIM NOT = 7
               ADD IC-SSTIMRIN TO IMPORTO-TOTALE

251121*        ADD IC-SSTIMRIN TO IMPORTO-T-AC
251121         IF IC-SSTDTAL2 = 0
220222           AND IMPORTO-T-AC > 0
                 ADD IC-SSTIMRIN TO IMPORTO-T-AC
               END-IF
           END-IF.
      *********** PAG. ARRETRATI TASSAZ. SEPARATA ***************
120324*Elena inizio
           IF ( IC-SSTCODIND = "FTCG"
                OR IC-SSTCODIND = "FTCD"
                OR IC-SSTCODIND = "FTCC"
100424          OR IC-SSTCODIND = "FTCI" )
           AND IC-SSTIMRIN NOT = 0
           AND IC-SSTPARTIM    = 7
               MOVE IC-SSTIMRIN TO OC-SSTIMRIN
               ADD IC-SSTIMRIN TO IMPORTO-TOTALE
           END-IF.
120324*Elena fine
      *********** PAG. ARRETRATI TASSAZ. SEPARATA ***************
           IF (   IC-SSTCODIND = "TRAC"   )
      *        OR IC-SSTCODIND = "FTCG"
      *        OR IC-SSTCODIND = "FTCD"
      *        OR IC-SSTCODIND = "FTCC"   )
           AND IC-SSTIMRIN NOT = 0
               IF ( ( IC-SSTNUML2 * IC-SSTRETRORA ) -
                      IC-SSTIMINT - IC-SSTNUML1 )   > 0
                   SUBTRACT IC-SSTRETRORA FROM IC-SSTIMRIN
                   MOVE IC-SSTIMRIN TO OC-SSTIMRIN
               END-IF
               ADD IC-SSTIMRIN TO IMPORTO-TOTALE
           END-IF.
      *********** PAG. INTERESSI SU SENTENZA ********************
300125*Elena inizio
           IF ( IC-SSTCODIND = "FTCG" or
                IC-SSTCODIND = "FTCD")
               MOVE IC-SSTIMANFT   TO OC-SSTIMANFT
               ADD  IC-SSTIMANFT   TO IMPORTO-TOTALE
           END-IF.
300125*Elena fine
      **********************************************************
      *  per i tirocini (TYGM,TIPO,DL76) il campo ic-sstnuml1 contiene
      *  importo da pagare, per FTA contiene importo anticipato
      *  dall'azienda
           IF IC-SSTCODIND = "TIPO"
           OR IC-SSTCODIND = "TYGM"
           OR IC-SSTCODIND = "DL76"
           OR IC-SSTCODIND = "TYAD"
           OR IC-SSTCODIND = "TYRG"
           OR IC-SSTCODIND = "TYBL"
           OR IC-SSTCODIND = "TYCR"
           OR IC-SSTCODIND = "APAF"
           OR IC-SSTCODIND = "APAR"
           OR IC-SSTCODIND = "APA2"
110422     OR IC-SSTCODIND = "APA3"
241122     OR IC-SSTCODIND = "APA4"
140323     OR IC-SSTCODIND = "APA5"
           OR IC-SSTCODIND = "DLIA"
           OR IC-SSTCODIND = "COIP"
           OR IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "FTAI"
           OR IC-SSTCODIND = "FTAD"
           OR IC-SSTCODIND = "FTMD"
           OR IC-SSTCODIND = "FTMD"
           OR IC-SSTCODIND = "BRIO"
           OR IC-SSTCODIND = "PORM"
100522     OR IC-SSTCODIND = "POR2"
           OR IC-SSTCODIND = "EELA"
140223     OR IC-SSTCODIND = "TGOL"
251023     OR IC-SSTCODIND = "POR3"
251023     OR IC-SSTCODIND = "POR4"
251023     OR IC-SSTCODIND = "POR5"
251023     OR IC-SSTCODIND = "POR6"
271123     OR IC-SSTCODIND = "DLI2"
260324     OR IC-SSTCODIND = "FSAI"
270324     OR IC-SSTCODIND = "FSAD"
060524     OR IC-SSTCODIND = "TISC"
210624     OR IC-SSTCODIND = "TISM"
240624     OR IC-SSTCODIND = "TGOC"
280125     OR IC-SSTCODIND = "APA6"
130325     OR IC-SSTCODIND = "TGOV"
140325     OR IC-SSTCODIND = "TYGP"
300725     OR IC-SSTCODIND = "TGOS"
241025     OR IC-SSTCODIND = "TGOP"
150426     OR IC-SSTCODIND = "TIRA"
150426     OR IC-SSTCODIND = "PIAC"
      *    DISPLAY 'ELENA18 IMPORTO-TOTALE: ' IMPORTO-TOTALE
      *    DISPLAY 'ELENA18 OC-SSTIMINT   : ' OC-SSTIMINT
               COMPUTE IMPORTO-SPETTANTE = IMPORTO-TOTALE -
                                           OC-SSTIMINT
           ELSE
               COMPUTE IMPORTO-SPETTANTE = IMPORTO-TOTALE -
                                           OC-SSTIMINT    -
                                           OC-SSTNUML1
           END-IF.
      * DETRAGGO RECUPERO
           PERFORM D00-DETRAGGO-RECUPERO.
      * APPLICO RITENUTE IRPEF
      *25032020
           IF H-TFISCALE = "NO"
               PERFORM T40-NO-IRPEF
           ELSE
               PERFORM I10-IMPOSTA-IRPEF
           END-IF.
      *    PERFORM I10-IMPOSTA-IRPEF.
      * CALCOLO ANTICIPAZIONE
           MOVE ZEROES TO ULTIMO-IMP-R
                          TRA-SIND-R.
      * APPLICO TRATTENUTA SINDACALE.
           MOVE 0 TO TRA-SIND.
           IF IMPORTO-SPETTANTE > 0
           AND IC-SSTCODIND NOT = "EE27"
           AND IC-SSTCODIND NOT = "EE28"
           AND IC-SSTCODIND NOT = "EE29"
           AND IC-SSTCODIND NOT = "EE30"
           AND IC-SSTCODIND NOT = "EE38"
           AND IC-SSTCODIND NOT = "EE05"
           AND IC-SSTCODIND NOT = "EE10"
           AND IC-SSTCODIND NOT = "EE2A"
           AND IC-SSTCODIND NOT = "EE2B"
           AND IC-SSTCODIND NOT = "EE2C"
           AND IC-SSTCODIND NOT = "EE2D"
           AND IC-SSTCODIND NOT = "EE13"
           AND IC-SSTCODIND NOT = "EE22"
           AND IC-SSTCODIND NOT = "EEMA"
           AND IC-SSTCODIND NOT = "EEZR"
           AND IC-SSTCODIND NOT = "EJ29"
           AND IC-SSTCODIND NOT = "EJ38"
           AND IC-SSTCODIND NOT = "EJ2A"
           AND IC-SSTCODIND NOT = "EJ2B"
           AND IC-SSTCODIND NOT = "EJ2C"
           AND IC-SSTCODIND NOT = "EJ2D"
           AND IC-SSTCODIND NOT = "EJ05"
           AND IC-SSTCODIND NOT = "EJ10"
           AND IC-SSTCODIND NOT = "EJ13"
           AND IC-SSTCODIND NOT = "EK29"
           AND IC-SSTCODIND NOT = "EK38"
           AND IC-SSTCODIND NOT = "EK2A"
           AND IC-SSTCODIND NOT = "EK2B"
           AND IC-SSTCODIND NOT = "EK2C"
           AND IC-SSTCODIND NOT = "EK2D"
           AND IC-SSTCODIND NOT = "EK05"
           AND IC-SSTCODIND NOT = "EK10"
           AND IC-SSTCODIND NOT = "EK13"
           AND IC-SSTCODIND NOT = "EW29"
           AND IC-SSTCODIND NOT = "EW38"
           AND IC-SSTCODIND NOT = "EW2A"
           AND IC-SSTCODIND NOT = "EW2B"
           AND IC-SSTCODIND NOT = "EW2C"
           AND IC-SSTCODIND NOT = "EW2D"
           AND IC-SSTCODIND NOT = "EW05"
           AND IC-SSTCODIND NOT = "EW10"
           AND IC-SSTCODIND NOT = "EW13"
           AND IC-SSTCODIND NOT = "EY29"
           AND IC-SSTCODIND NOT = "EY38"
           AND IC-SSTCODIND NOT = "EY2A"
           AND IC-SSTCODIND NOT = "EY2B"
           AND IC-SSTCODIND NOT = "EY2C"
           AND IC-SSTCODIND NOT = "EY2D"
           AND IC-SSTCODIND NOT = "EY05"
           AND IC-SSTCODIND NOT = "EY10"
           AND IC-SSTCODIND NOT = "EY13"
           AND IC-SSTCODIND NOT = "EY3A"
           AND IC-SSTCODIND NOT = "EX29"
           AND IC-SSTCODIND NOT = "EX38"
           AND IC-SSTCODIND NOT = "EX2A"
           AND IC-SSTCODIND NOT = "EX2B"
           AND IC-SSTCODIND NOT = "EX2C"
           AND IC-SSTCODIND NOT = "EX2D"
           AND IC-SSTCODIND NOT = "EX05"
           AND IC-SSTCODIND NOT = "EX10"
           AND IC-SSTCODIND NOT = "EX13"
           AND IC-SSTCODIND NOT = "EX3A"
           AND IC-SSTCODIND NOT = "EX87"
           AND IC-SSTCODIND NOT = "EX88"
211021     AND IC-SSTCODIND NOT = "EX89"
290322     AND IC-SSTCODIND NOT = "E092"
080722     AND IC-SSTCODIND NOT = "E109"
080722     AND IC-SSTCODIND NOT = "E110"
080722     AND IC-SSTCODIND NOT = "E112"
231122     AND IC-SSTCODIND NOT = "E107"
130123     AND IC-SSTCODIND NOT = "E159"
130123     AND IC-SSTCODIND NOT = "E160"
130123     AND IC-SSTCODIND NOT = "E162"
130123     AND IC-SSTCODIND NOT = "E157"
               IF IC-SSTCODIND = "SOMM"
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SPERIS
               ELSE
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SINALIASU
               END-IF
               IF TRA-SIND NOT > 0.72
                   MOVE 0 TO TRA-SIND
               END-IF
           END-IF.
           PERFORM I00-IRPEF.
      * DETRAGGO TRATTENUTE SINDACALI
           COMPUTE IMPORTO-SPETTANTE =
                  IMPORTO-SPETTANTE - TRA-SIND.
      * 11.07.2017 gestione acconto
      * DETRAGGO ACCONTO
           PERFORM D10-DETRAGGO-ACCONTO.
      *
      *-------------------------------------------------------------*
       F10-CALCOLA-FTA-DEL22.
      *-------------------------------------------------------------*
           INITIALIZE AREA2A.
           INITIALIZE AREA2B.
           INITIALIZE AREA2C.
      *   INIZIO PRESTAZIONE (AAMMGG)
           MOVE IC-DCODTDECSP TO DATA-INIZIO
                                 DATA-INI-PAG.
      * TERMINE
           MOVE IC-DCODTADEC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE DATA-AMG TO DATA-TERMINE
                            DEFINIZ
                            TERMINE-R.
      * TERMINE = DECADENZA SE PRESENTE
           IF IC-SSTDADEC NOT = ZEROES
               MOVE IC-SSTDADEC TO DECORRENZA-R
               MOVE IC-SSTDADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DEFINIZ
               OR DEFINIZ = 0
                   MOVE DATA-AMG TO DEFINIZ
               END-IF
               IF DEFINIZ < DATA-TERMINE
                   MOVE DEFINIZ TO DATA-TERMINE
               END-IF
           END-IF.
      * TERMINE = DATA PENS. SE PRESENTE
           IF IC-SSTDAPE NOT = ZEROES
               MOVE IC-SSTDAPE TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DATA-TERMINE
                   MOVE DATA-AMG TO DATA-TERMINE
                                    DEFINIZ
               END-IF
           END-IF.
      *    IMPOSTO TERM. CALCOLATO
      *    MOVE IC-CALCOLOAL TO DATA-TER-CAL.
      *
           MOVE DATA-TER-CAL TO MESE-PREC.
           IF DATA-TERMINE < DATA-TER-CAL
               MOVE DATA-TERMINE TO DATA-TER-CAL
           END-IF.

211024*correttivo per FTAI entrata senza decadenza
      *    IF IC-SSTCODIND = "FTAI" or "FSAI"
      *      IF IC-SSTDADEC = ZEROES
      *          IF O-PETPEERTA-MAX < DATA-TER-CAL
      *            MOVE O-PETPEERTA-MAX   TO DATA-TER-CAL
      *          END-IF
      *      END-IF
      *    END-IF.

      * CALCOLA I PERIODI SPETTANTI
           IF DATA-INIZIO > DATA-TER-CAL
               MOVE 0 TO PERIODO-TOTALE
                         IMPORTO-TOTALE
           ELSE
               MOVE DATA-INIZIO  TO LK-DATA1
               MOVE DATA-TERMINE TO LK-DATA2
               MOVE ZEROES       TO WK-PER-SPET
               CALL RDSUT20 USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  LK-DATA1
                                  LK-DATA2
                                  WK-PER-SPET
               MOVE WK-PER-SPET TO PERIODO-TOTALE
               MOVE IC-SSTNUML1 TO IMPORTO-TOTALE
               IF  AA-INIZIO = AA-SIS-AMG
               OR (AA-INIZIO = AA-SIS-AMG - 1
                   AND MM-INIZIO = 12        )
                    MOVE IC-SSTNUML1 TO IMPORTO-T-AC
               ELSE
                    MOVE ZEROES      TO IMPORTO-T-AC
               END-IF
           END-IF.
      * PER PRESTAZIONE:
      *  -  DETRAGGO IMPORTO GIA' PAGATO (OC-SSTIMINT)
      *  -  DETRAGGO IMPORTO PAGATO DALL'AZIENDA A
      *     TITOLO DI ANTICIPAZIONE (OC-SSTNUML1)
      **********************************************************
           COMPUTE IMPORTO-SPETTANTE = IMPORTO-TOTALE -
                                       OC-SSTIMINT.
      * DETRAGGO RECUPERO
           PERFORM D00-DETRAGGO-RECUPERO.
      * APPLICO RITENUTE IRPEF
      *25032020
           IF H-TFISCALE = "NO"
               PERFORM T40-NO-IRPEF
           ELSE
               PERFORM I10-IMPOSTA-IRPEF
           END-IF.
      *    PERFORM I10-IMPOSTA-IRPEF.
      * CALCOLO ANTICIPAZIONE
           MOVE ZEROES TO ULTIMO-IMP-R
                          TRA-SIND-R.
      * APPLICO TRATTENUTA SINDACALE.
           MOVE 0 TO TRA-SIND.
           IF IMPORTO-SPETTANTE > 0
           AND IC-SSTCODIND NOT = "EE27"
           AND IC-SSTCODIND NOT = "EE28"
           AND IC-SSTCODIND NOT = "EE29"
           AND IC-SSTCODIND NOT = "EE30"
           AND IC-SSTCODIND NOT = "EE38"
           AND IC-SSTCODIND NOT = "EE05"
           AND IC-SSTCODIND NOT = "EE10"
           AND IC-SSTCODIND NOT = "EE2A"
           AND IC-SSTCODIND NOT = "EE2B"
           AND IC-SSTCODIND NOT = "EE2C"
           AND IC-SSTCODIND NOT = "EE2D"
           AND IC-SSTCODIND NOT = "EE13"
           AND IC-SSTCODIND NOT = "EE22"
           AND IC-SSTCODIND NOT = "EEMA"
           AND IC-SSTCODIND NOT = "EEZR"
           AND IC-SSTCODIND NOT = "EJ29"
           AND IC-SSTCODIND NOT = "EJ38"
           AND IC-SSTCODIND NOT = "EJ2A"
           AND IC-SSTCODIND NOT = "EJ2B"
           AND IC-SSTCODIND NOT = "EJ2C"
           AND IC-SSTCODIND NOT = "EJ2D"
           AND IC-SSTCODIND NOT = "EJ05"
           AND IC-SSTCODIND NOT = "EJ10"
           AND IC-SSTCODIND NOT = "EJ13"
           AND IC-SSTCODIND NOT = "EK29"
           AND IC-SSTCODIND NOT = "EK38"
           AND IC-SSTCODIND NOT = "EK2A"
           AND IC-SSTCODIND NOT = "EK2B"
           AND IC-SSTCODIND NOT = "EK2C"
           AND IC-SSTCODIND NOT = "EK2D"
           AND IC-SSTCODIND NOT = "EK05"
           AND IC-SSTCODIND NOT = "EK10"
           AND IC-SSTCODIND NOT = "EK13"
           AND IC-SSTCODIND NOT = "EW29"
           AND IC-SSTCODIND NOT = "EW38"
           AND IC-SSTCODIND NOT = "EW2A"
           AND IC-SSTCODIND NOT = "EW2B"
           AND IC-SSTCODIND NOT = "EW2C"
           AND IC-SSTCODIND NOT = "EW2D"
           AND IC-SSTCODIND NOT = "EW05"
           AND IC-SSTCODIND NOT = "EW10"
           AND IC-SSTCODIND NOT = "EW13"
           AND IC-SSTCODIND NOT = "EY29"
           AND IC-SSTCODIND NOT = "EY38"
           AND IC-SSTCODIND NOT = "EY2A"
           AND IC-SSTCODIND NOT = "EY2B"
           AND IC-SSTCODIND NOT = "EY2C"
           AND IC-SSTCODIND NOT = "EY2D"
           AND IC-SSTCODIND NOT = "EY05"
           AND IC-SSTCODIND NOT = "EY10"
           AND IC-SSTCODIND NOT = "EY13"
           AND IC-SSTCODIND NOT = "EY3A"
           AND IC-SSTCODIND NOT = "EX29"
           AND IC-SSTCODIND NOT = "EX38"
           AND IC-SSTCODIND NOT = "EX2A"
           AND IC-SSTCODIND NOT = "EX2B"
           AND IC-SSTCODIND NOT = "EX2C"
           AND IC-SSTCODIND NOT = "EX2D"
           AND IC-SSTCODIND NOT = "EX05"
           AND IC-SSTCODIND NOT = "EX10"
           AND IC-SSTCODIND NOT = "EX13"
           AND IC-SSTCODIND NOT = "EX3A"
           AND IC-SSTCODIND NOT = "EX87"
           AND IC-SSTCODIND NOT = "EX88"
211021     AND IC-SSTCODIND NOT = "EX89"
290322     AND IC-SSTCODIND NOT = "E092"
080722     AND IC-SSTCODIND NOT = "E109"
080722     AND IC-SSTCODIND NOT = "E110"
080722     AND IC-SSTCODIND NOT = "E112"
231122     AND IC-SSTCODIND NOT = "E107"
130123     AND IC-SSTCODIND NOT = "E159"
130123     AND IC-SSTCODIND NOT = "E160"
130123     AND IC-SSTCODIND NOT = "E162"
130123     AND IC-SSTCODIND NOT = "E157"
               IF IC-SSTCODIND = "SOMM"
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SPERIS
               ELSE
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SINALIASU
               END-IF
               IF TRA-SIND NOT > 0.72
                   MOVE 0 TO TRA-SIND
               END-IF
           END-IF.
           PERFORM I00-IRPEF.
      * DETRAGGO TRATTENUTE SINDACALI
           COMPUTE IMPORTO-SPETTANTE =
                  IMPORTO-SPETTANTE - TRA-SIND.
      * 11.07.2017 gestione acconto
      * DETRAGGO ACCONTO
           PERFORM D10-DETRAGGO-ACCONTO.
      *
      *-------------------------------------------------------------*
       C10-CREDITO.
      *-------------------------------------------------------------*
      * se DS definita controllo che sia termine naturale
           IF O-DCOULESPP = "D"
      * se CRED definisco se naspi cessata prima del termine
               IF IC-SSTCODIND = "CRED"
               AND O-PMEINDTOGG < O-PETNUGITE-SUM
               AND O-AASIMPORTO = 0
                   MOVE O-PMEDTRICA TO DATA-TERMINE
                                       DEFINIZ
               END-IF
      * se FTAI definisco se naspi cessata prima del termine
      * e non c'è anticipazione naspi
      *        DISPLAY 'ELENA18 O-PMEINDTOGG: ' O-PMEINDTOGG
      *        DISPLAY 'ELENA18 O-PETNUGITE-SUM: ' O-PETNUGITE-SUM
      *        DISPLAY 'ELENA18 O-AASIMPORTO: ' O-AASIMPORTO
      *        DISPLAY 'ELENA18 O-PMEDTRICA : ' O-PMEDTRICA
               IF (IC-SSTCODIND = "FTAI"
260324             OR IC-SSTCODIND = "FSAI")
               AND O-PMEINDTOGG < O-PETNUGITE-SUM
               AND O-AASIMPORTO = 0
                   MOVE O-PMEDTRICA TO DATA-TERMINE
                                       DEFINIZ
               END-IF
           END-IF.
      *        IF (    O-PETNUGITE-SUM     = 360
      *                'lav. ultracinquantenne'
      *                AND O-PMEINDTOGG    < 360       )
      *        OR (    O-PETNUGITE-SUM NOT = 360
      *                'lav. non ultracinquantenne'
      *                AND O-PMEINDTOGG    < 240       )
      *            MOVE O-PMEDTRICA TO DATA-TERMINE
      *                                DEFINIZ
      *        ELSE
      *            PERFORM C15-CALCOLA-TERMINE-CREDITO
      *        END-IF
      *    END-IF.
      * se DS in pagamento
           IF O-DCOULESPP = "L"
               IF IC-SSTALFL1(16:1) NOT = "R"
      * prelevo l'ultimo giorno pagato DS e imposto DATA-TER-CAL
                   IF O-PMEDTRICA < DATA-TER-CAL
                       MOVE O-PMEDTRICA TO DATA-TER-CAL
                   END-IF
      *
                   IF  O-DCODTADEC > 0
                       MOVE O-DCODTADEC TO DATA-AMG
                       PERFORM R00-TOGLI-UNO
                       MOVE DATA-AMG TO DATA-TERMINE
      *            ELSE
      *                PERFORM C15-CALCOLA-TERMINE-CREDITO
                   END-IF
               ELSE
      * se AE ripristinato
      *    controllo che non sia da pagare prima la DS
                   IF  DATA-TER-CAL >  O-PMEDTRICA
                   AND DATA-TER-CAL >= O-PRIMO-DS-DAPAGARE
                   AND O-PRIMO-DS-DAPAGARE NOT = ZEROES
                       MOVE O-PMEDTRICA TO DATA-TER-CAL
                   ELSE
                       IF  O-DCODTADEC > 0
                           MOVE O-DCODTADEC TO DATA-AMG
                           PERFORM R00-TOGLI-UNO
                           MOVE DATA-AMG TO DATA-TERMINE
                       END-IF
                   END-IF
               END-IF
           END-IF.
           IF IC-SSTDADEC NOT = ZEROES
               MOVE IC-SSTDADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               MOVE DATA-AMG TO DEFINIZ
                                DATA-TERMINE
           END-IF.
      *-------------------------------------------------------------*
      *C15-CALCOLA-TERMINE-CREDITO.
      *-------------------------------------------------------------*
      *-------------------------------------------------------------*
       M10-CALCOLA-ANNO-IN-CORSO.
      *-------------------------------------------------------------*
           MOVE "N" TO FLAG-ANF.
           MOVE ZEROES TO IMPORTO-T-AC.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAD"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "WTWM"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
           OR  IC-SSTCODIND = "PORM"
100522     OR  IC-SSTCODIND = "POR2"
251023     OR  IC-SSTCODIND = "POR3"
251023     OR  IC-SSTCODIND = "POR4"
251023     OR  IC-SSTCODIND = "POR5"
251023     OR  IC-SSTCODIND = "POR6"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
      **   OR IC-SSTCODIND = "TYGM"
      **   OR IC-SSTCODIND = "TIPO"
      **   OR IC-SSTCODIND = "DL76"
      **   OR IC-SSTCODIND = "RATA"
      **   OR IC-SSTCODIND = "RATM"
      **   OR IC-SSTCODIND = "TEIG"
      **   OR IC-SSTCODIND = "APAF"
      **   OR IC-SSTCODIND = "APAR"
      **   OR IC-SSTCODIND = "APA2"
      **   OR IC-SSTCODIND = "DLIA"
      **   OR IC-SSTCODIND = "COIP"
      **   OR IC-SSTCODIND = "TYAD"
      **   OR IC-SSTCODIND = "TYRG"
      **   OR IC-SSTCODIND = "TYBL"
      **   OR IC-SSTCODIND = "TYCR"
      **   OR IC-SSTCODIND = "BRIO"
      **   OR IC-SSTCODIND = "EELA"
               MOVE 00001201  TO DATA-INI-AC
           ELSE
               MOVE 00000101  TO DATA-INI-AC
           END-IF.
           IF IC-SSTCODIND = "SARB"
               COMPUTE DATA-INI-AC = DATA-INI-AC +
                                     ((AA-SIS-AMG) * 10000)
           ELSE
               COMPUTE DATA-INI-AC = DATA-INI-AC +
                                     ((AA-SIS-AMG - 1) * 10000)
           END-IF.
      * Il campo SSTDTAL1 contiene la data della delibera del comitato
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
      * per le integrazioni di importo tassaz. corrente dal 01 dicembre
      * e non dalla data delibera
      *    OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               IF IC-SSTDTAL1 < DATA-INI-AC
                   MOVE IC-SSTDTAL1 TO DATA-INI-AC
               END-IF
           END-IF.
      *
           IF  IC-SSTCODIND = "PORM"
               IF IC-SSTDTAL1 = ZEROES
                   MOVE 20140501 TO DATA-INI-AC
               ELSE
                   IF IC-SSTDTAL1 < DATA-INI-AC
                       MOVE IC-SSTDTAL1 TO DATA-INI-AC
                   END-IF
               END-IF
           END-IF.
      *
100522     IF  IC-SSTCODIND = "POR2"
100522         IF IC-SSTDTAL1 = ZEROES
100522             MOVE 20220101 TO DATA-INI-AC
100522         ELSE
100522             IF IC-SSTDTAL1 < DATA-INI-AC
100522                 MOVE IC-SSTDTAL1 TO DATA-INI-AC
100522             END-IF
100522         END-IF
100522     END-IF.
      *
251023     IF  IC-SSTCODIND = "POR3" or "POR4" or "POR5" or "POR6"
251023         IF IC-SSTDTAL1 = ZEROES
251023             MOVE 20210101 TO DATA-INI-AC
251023         ELSE
251023             IF IC-SSTDTAL1 < DATA-INI-AC
251023                 MOVE IC-SSTDTAL1 TO DATA-INI-AC
251023             END-IF
251023         END-IF
251023     END-IF.
      *
           IF IC-SSTCODIND = "TYGM"
           OR IC-SSTCODIND = "TIPO"
           OR IC-SSTCODIND = "DL76"
           OR IC-SSTCODIND = "RATA"
           OR IC-SSTCODIND = "RATM"
           OR IC-SSTCODIND = "TEIG"
           OR IC-SSTCODIND = "APAF"
           OR IC-SSTCODIND = "APAR"
           OR IC-SSTCODIND = "APA2"
110422     OR IC-SSTCODIND = "APA3"
241122     OR IC-SSTCODIND = "APA4"
140323     OR IC-SSTCODIND = "APA5"
           OR IC-SSTCODIND = "DLIA"
           OR IC-SSTCODIND = "TYRG"
           OR IC-SSTCODIND = "TYBL"
           OR IC-SSTCODIND = "TYCR"
           OR IC-SSTCODIND = "BRIO"
           OR IC-SSTCODIND = "EELA"
140223     OR IC-SSTCODIND = "TGOL"
271123     OR IC-SSTCODIND = "DLI2"
060524     OR IC-SSTCODIND = "TISC"
210624     OR IC-SSTCODIND = "TISM"
240624     OR IC-SSTCODIND = "TGOC"
280125     OR IC-SSTCODIND = "APA6"
130325     OR IC-SSTCODIND = "TGOV"
140325     OR IC-SSTCODIND = "TYGP"
300725     OR IC-SSTCODIND = "TGOS"
241025     OR IC-SSTCODIND = "TGOP"
150426     OR IC-SSTCODIND = "TIRA"
150426     OR IC-SSTCODIND = "PIAC"
               MOVE 20140501 TO DATA-INI-AC
           END-IF.
      *
           IF IC-SSTCODIND = "TYAD"
               MOVE 20180101 TO DATA-INI-AC
           END-IF.
      *
           IF IC-SSTCODIND = "COIP"
               MOVE 20190101 TO DATA-INI-AC
           END-IF.
      *
      *  ripristinata tassazione corrente anche per arretrati
      *    IF IC-SSTCODIND = "APAF"
      *    AND IC-SSTREGIND = 09
      *    AND IC-SSTANNIND = 18
      *        MOVE 20180101 TO DATA-INI-AC
      *    END-IF.
      *
           IF DATA-INIZIO > DATA-INI-AC
               MOVE DATA-INIZIO TO DATA-INI-AC
           END-IF.
      *
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "TRAD"
           OR IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "WTWM"
      *    OR IC-SSTCODIND = "TYGM"
      *    OR IC-SSTCODIND = "TIPO"
      *    OR IC-SSTCODIND = "DL76"
           OR IC-SSTCODIND = "RATA"
           OR IC-SSTCODIND = "RATM"
      *    OR IC-SSTCODIND = "TEIG"
      *    OR IC-SSTCODIND = "APAF"
      *    OR IC-SSTCODIND = "APAR"
      *    OR IC-SSTCODIND = "APA2"
      *    OR IC-SSTCODIND = "DLIA"
      *    OR IC-SSTCODIND = "COIP"
      *    OR IC-SSTCODIND = "TYRG"
      *    OR IC-SSTCODIND = "TYBL"
      *    OR IC-SSTCODIND = "TYCR"
      *    OR IC-SSTCODIND = "TYAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
           OR  IC-SSTCODIND = "BRIO"
           OR  IC-SSTCODIND = "PORM"
100522     OR  IC-SSTCODIND = "POR2"
251023     OR  IC-SSTCODIND = "POR3"
251023     OR  IC-SSTCODIND = "POR4"
251023     OR  IC-SSTCODIND = "POR5"
251023     OR  IC-SSTCODIND = "POR6"
           OR  IC-SSTCODIND = "EELA"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               MOVE DATA-INI-AC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               MOVE AA-AMG TO WK-ANNOPAL
               MOVE MM-AMG TO WK-MESEPAL
               MOVE GG-AMG TO WK-GIORNOPAL
           END-IF.
      *
           IF  IC-SSTCODIND = 'TYGM'
           OR  IC-SSTCODIND = "TIPO"
           OR  IC-SSTCODIND = "DL76"
           OR  IC-SSTCODIND = "RATA"
           OR  IC-SSTCODIND = "RATM"
           OR  IC-SSTCODIND = "TEIG"
           OR  IC-SSTCODIND = "APAF"
           OR  IC-SSTCODIND = "APAR"
           OR  IC-SSTCODIND = "APA2"
110422     OR  IC-SSTCODIND = "APA3"
241122     OR  IC-SSTCODIND = "APA4"
140323     OR IC-SSTCODIND  = "APA5"
           OR  IC-SSTCODIND = "DLIA"
      *    OR  IC-SSTCODIND = "COIP"
           OR  IC-SSTCODIND = "TYRG"
           OR  IC-SSTCODIND = "TYBL"
           OR  IC-SSTCODIND = "TYCR"
           OR  IC-SSTCODIND = "BRIO"
140223     OR  IC-SSTCODIND = "TGOL"
271123     OR  IC-SSTCODIND = "DLI2"
060524     OR  IC-SSTCODIND = "TISC"
210624     OR  IC-SSTCODIND = "TISM"
240624     OR  IC-SSTCODIND = "TGOC"
280125     OR  IC-SSTCODIND = "APA6"
130325     OR  IC-SSTCODIND = "TGOV"
140325     OR  IC-SSTCODIND = "TYGP"
300725     OR  IC-SSTCODIND = "TGOS"
241025     OR IC-SSTCODIND = "TGOP"
150426     OR IC-SSTCODIND = "TIRA"
150426     OR IC-SSTCODIND = "PIAC"
               MOVE 2014 TO WK-ANNODAL
               MOVE 05           TO WK-MESEDAL
               MOVE 01           TO WK-GIORNODAL
               MOVE 2014 TO WK-ANNOPAL
               MOVE 04           TO WK-MESEPAL
               MOVE 30           TO WK-GIORNOPAL
           END-IF.
      *
           IF  IC-SSTCODIND = 'TYAD'
               MOVE 2018 TO WK-ANNODAL
               MOVE 01           TO WK-MESEDAL
               MOVE 01           TO WK-GIORNODAL
               MOVE 2017 TO WK-ANNOPAL
               MOVE 12           TO WK-MESEPAL
               MOVE 31           TO WK-GIORNOPAL
           END-IF.
      *
           IF IC-SSTCODIND = "COIP"
               MOVE 2019 TO WK-ANNODAL
               MOVE 01           TO WK-MESEDAL
               MOVE 01           TO WK-GIORNODAL
               MOVE 2018 TO WK-ANNOPAL
               MOVE 12           TO WK-MESEPAL
               MOVE 31           TO WK-GIORNOPAL
           END-IF.
      *  ripristinata tassazione corrente anche per arretrati
      *    IF IC-SSTCODIND = "APAF"
      *    AND IC-SSTREGIND = 09
      *    AND IC-SSTANNIND = 18
      *        MOVE 2018 TO WK-ANNODAL
      *        MOVE 01           TO WK-MESEDAL
      *        MOVE 01           TO WK-GIORNODAL
      *        MOVE 2017 TO WK-ANNOPAL
      *        MOVE 12           TO WK-MESEPAL
      *        MOVE 31           TO WK-GIORNOPAL
      *    END-IF.
      *
           MOVE DATA-TER-CAL TO LK-DATA2.
           IF LK-DATA2 NOT < DATA-INI-AC
               MOVE DATA-INI-AC TO LK-DATA1
      *
               IF (IC-SSTCODIND = "PARM"
                   OR IC-SSTCODIND = "SARV"
                   OR IC-SSTCODIND = "WTWM")
               AND IC-SSTALFL1(2:1) = "S"
                   PERFORM M31-NON-SCORRERE
               ELSE
                   PERFORM M30-SCORRI-SOSPENSIONI
               END-IF
      *
               MOVE WIMPORTO TO IMPORTO-T-AC
               IF IC-SSTCODIND = "SSIS"
               AND IC-SSTREGIND = 15
               AND IC-SSTANNIND = 07
               AND IC-DCODTDECSP > 20070400
      *        AND IC-DCODTDECSP < 20071002
      *        AND DATA-TER-CAL > 20071231
               AND DATA-TER-CAL > 20091129
                   ADD 480 TO IMPORTO-T-AC
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       C20-CALCOLA-ANNO-IN-CORSO.
      *-------------------------------------------------------------*
           MOVE "N" TO FLAG-ANF.
           MOVE ZEROES TO IMPORTO-T-AC.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE 00001201  TO DATA-INI-AC.
           COMPUTE DATA-INI-AC = DATA-INI-AC +
                                 ((AA-SIS-AMG - 1) * 10000).
      *
           IF DATA-INIZIO > DATA-INI-AC
               MOVE DATA-INIZIO TO DATA-INI-AC
           END-IF.
      *
           MOVE DATA-INI-AC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE AA-AMG TO WK-ANNOPAL.
           MOVE MM-AMG TO WK-MESEPAL.
           MOVE GG-AMG TO WK-GIORNOPAL.
      *
           MOVE DATA-TER-CAL TO LK-DATA2.
           IF LK-DATA2 NOT < DATA-INI-AC
               MOVE DATA-INI-AC TO LK-DATA1
      *
               IF O-DCOULESPP = "L"
      *    periodo corrispondente a DS
                   MOVE O-PMEINDTOGG TO WPERIODO
      * per o-apggpres si intende il campo passato da Masi con
      * le gg pagate di ds fino a novembre
      * per o-apimponi si intende il campo con l'importo fino a nov.
                   COMPUTE GG-CRED-AC = O-PMEINDTOGG -
                                        O-APGGPRES
                   COMPUTE IMPORTO-T-AC ROUNDED  =
                         ( GG-CRED-AC     *
                           WK-IMP-MENSILE /
                           30               ) -
                         ( O-PMEINDTOTE   -
                           O-APIMPONI       )
               ELSE
                   MOVE O-PMEDTRICA  TO DATA-AMG
                   PERFORM R10-AGGIUNGI-UNO
      * data-amg = inizio periodo post DS
                   IF DATA-AMG NOT > LK-DATA1
                       PERFORM M30-SCORRI-SOSPENSIONI
                       MOVE WIMPORTO TO IMPORTO-T-AC
                       MOVE WPERIODO TO GG-CRED-AC
                   ELSE
                       MOVE DATA-AMG TO LK-DATA1
                       PERFORM M30-SCORRI-SOSPENSIONI
                       COMPUTE GG-CRED-AC = WPERIODO     +
                                            O-PMEINDTOGG -
                                            O-APGGPRES
                       COMPUTE IMPORTO-T-AC ROUNDED  =
      *                  WIMPORTO             +
                         ( GG-CRED-AC     *
                           WK-IMP-MENSILE /
                           30               ) -
                         ( O-PMEINDTOTE   -
                           O-APIMPONI       )
                   END-IF
               END-IF
      * 10.01.2018
               IF IMPORTO-T-AC < 0
                   MOVE 0 TO IMPORTO-T-AC
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       C21-CALCOLA-ANNO-IN-CORSO-RIP.
      *-------------------------------------------------------------*
           MOVE "N" TO FLAG-ANF.
           MOVE ZEROES TO IMPORTO-T-AC.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE 00001201  TO DATA-INI-AC.
           COMPUTE DATA-INI-AC = DATA-INI-AC +
                                 ((AA-SIS-AMG - 1) * 10000).
      *
           IF DATA-INIZIO > DATA-INI-AC
               MOVE DATA-INIZIO TO DATA-INI-AC
           END-IF.
      *
           MOVE DATA-INI-AC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE AA-AMG TO WK-ANNOPAL.
           MOVE MM-AMG TO WK-MESEPAL.
           MOVE GG-AMG TO WK-GIORNOPAL.
      *
           MOVE DATA-TER-CAL TO LK-DATA2.
           IF LK-DATA2 NOT < DATA-INI-AC
               MOVE DATA-INI-AC TO LK-DATA1
      *
               PERFORM M35-SCORRI-SOSPENSIONI-DS
               PERFORM M30-SCORRI-SOSPENSIONI
                   COMPUTE GG-CRED-AC = WPERIODO
                   COMPUTE IMPORTO-T-AC ROUNDED      =
      *                      WIMPORTO             +
                     ( GG-CRED-AC         *
                       WK-IMP-MENSILE /
                       30                   ) -
                     ( O-PMEINDTOTE       -
                       O-APIMPONI           )
      * 10.01.2018
               IF IMPORTO-T-AC < 0
                   MOVE 0 TO IMPORTO-T-AC
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       F20-CALCOLA-ANNO-IN-CORSO.
      *-------------------------------------------------------------*
           MOVE "N" TO FLAG-ANF.
           MOVE ZEROES TO IMPORTO-T-AC.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE 00001201  TO DATA-INI-AC.
           COMPUTE DATA-INI-AC = DATA-INI-AC +
                                 ((AA-SIS-AMG - 1) * 10000).
      *
           IF DATA-INIZIO > DATA-INI-AC
               MOVE DATA-INIZIO TO DATA-INI-AC
           END-IF.
      *
           MOVE DATA-INI-AC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE AA-AMG TO WK-ANNOPAL.
           MOVE MM-AMG TO WK-MESEPAL.
           MOVE GG-AMG TO WK-GIORNOPAL.
      *
           MOVE DATA-TER-CAL TO LK-DATA2.
           IF LK-DATA2 NOT < DATA-INI-AC
               MOVE DATA-INI-AC TO LK-DATA1
      *
      *    periodo corrispondente a PSR
               MOVE O-PMEINDTOGG TO WPERIODO
      * per o-apggpres si intende il campo passato da Masi con
      * le gg pagate di psr fino a novembre
      * per o-apimponi si intende il campo con l'importo fino a nov.
      *    DISPLAY 'ELENA18 O-PMEINDTOTE: ' O-PMEINDTOTE
      *    DISPLAY 'ELENA18 O-PMEINDTOGG: ' O-PMEINDTOGG
      *    DISPLAY 'ELENA18 O-APGGPRES  : ' O-APGGPRES
      *    DISPLAY 'ELENA18 O-APIMPONI  : ' O-APIMPONI
      *    DISPLAY 'ELENA18 WK-IMP-MENSILE: ' WK-IMP-MENSILE
               COMPUTE GG-CRED-AC = O-PMEINDTOGG -
                                    O-APGGPRES
               COMPUTE IMPORTO-T-AC ROUNDED  =
                     ( GG-CRED-AC     *
                       WK-IMP-MENSILE /
                       30               ) -
                     ( O-PMEINDTOTE   -
                       O-APIMPONI       )
      *    DISPLAY 'ELENA18 GG-CRED-AC    : ' GG-CRED-AC
      *    DISPLAY 'ELENA18 IMPORTO-T-AC  : ' IMPORTO-T-AC
      * 10.01.2018
               IF IMPORTO-T-AC < 0
                   MOVE 0 TO IMPORTO-T-AC
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       T00-CALCOLA-TRANCHES.
      *-------------------------------------------------------------*
           INITIALIZE AREA2A.
           INITIALIZE AREA2B.
           INITIALIZE AREA2C.
           MOVE ZEROES TO WK-IMP-MENSILE.
      *   INIZIO PRESTAZIONE (AAMMGG)
           MOVE IC-DCODTDECSP TO DATA-INIZIO.
      * IMPOSTO DATA INIZIO PERIODO IN PAGAMENTO PER ASSEGNO
           IF OC-SSTULASS NOT = ZEROES
               MOVE OC-SSTULASS TO DATA-AMG
               PERFORM R10-AGGIUNGI-UNO
               MOVE DATA-AMG TO DATA-INI-PAG
           ELSE
               MOVE DATA-INIZIO TO DATA-INI-PAG
           END-IF.
      * TERMINE
           MOVE IC-DCODTADEC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE DATA-AMG TO DATA-TERMINE
                            DEFINIZ.
           MOVE ZEROES TO TERMINE-R.
      * TERMINE = DECADENZA SE PRESENTE
           IF  IC-SSTDADEC NOT = ZEROES
      *    AND IC-SSTDADEC = IC-DCODTDECSP
               MOVE IC-SSTDADEC TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               IF DATA-AMG < DEFINIZ
               OR DEFINIZ = 0
                   MOVE DATA-AMG TO DEFINIZ
               END-IF
               IF DEFINIZ < DATA-TERMINE
                   MOVE DEFINIZ TO DATA-TERMINE
               END-IF
           END-IF.
      *    IMPOSTO TERM. CALCOLATO
           MOVE IC-CALCOLOAL TO DATA-TER-CAL.
           IF  IC-SSTCODIND = "SSTA"
           OR  IC-SSTCODIND = "CRED"
           OR  IC-SSTCODIND = "TYGM"
           OR  IC-SSTCODIND = "TIPO"
           OR  IC-SSTCODIND = "DL76"
           OR  IC-SSTCODIND = "RATA"
           OR  IC-SSTCODIND = "RATM"
           OR  IC-SSTCODIND = "TEIG"
      *    OR  IC-SSTCODIND = "APAF"
      *    OR  IC-SSTCODIND = "APAR"
      *    OR  IC-SSTCODIND = "APA2"
      *    OR  IC-SSTCODIND = "DLIA"
      *    OR  IC-SSTCODIND = "COIP"
           OR  IC-SSTCODIND = "PORM"
100522     OR  IC-SSTCODIND = "POR2"
251023     OR  IC-SSTCODIND = "POR3"
251023     OR  IC-SSTCODIND = "POR4"
251023     OR  IC-SSTCODIND = "POR5"
251023     OR  IC-SSTCODIND = "POR6"
           OR  IC-SSTCODIND = "WTW5"
           OR  IC-SSTCODIND = "TYAD"
           OR  IC-SSTCODIND = "TYRG"
           OR  IC-SSTCODIND = "TYBL"
           OR  IC-SSTCODIND = "TYCR"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
      *    OR  IC-SSTCODIND = "BRIO"
           OR  IC-SSTCODIND = "EELA"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
140325     OR  IC-SSTCODIND = "TYGP"
               PERFORM B99-ECCEZIONE-CALCOLOAL
           END-IF.
           IF  IC-SSTCODIND = "WTWM"
           AND IC-SSTREGIND = 06
               PERFORM B98-ECCEZIONE-CALCOLOAL
           END-IF.
      *
           MOVE DATA-TER-CAL TO MESE-PREC.
           IF DATA-TERMINE < DATA-TER-CAL
               MOVE DATA-TERMINE TO DATA-TER-CAL
           END-IF.
      * CALCOLA I PERIODI SPETTANTI
           IF DATA-INIZIO > DATA-TER-CAL
               MOVE 0 TO PERIODO-TOTALE
                         IMPORTO-TOTALE
           ELSE
               PERFORM T20-CALCOLA-PERIODO
           END-IF.
      * PER PRESTAZIONE:
      *         DETRAGGO IMPORTO GIA' PAGATO (OC-SSTIMINT)
           COMPUTE IMPORTO-SPETTANTE = IMPORTO-TOTALE -
                                       OC-SSTIMINT.
      * DETRAGGO RECUPERO
           PERFORM D00-DETRAGGO-RECUPERO.
      * APPLICO RITENUTE IRPEF
           EVALUATE H-TFISCALE
           WHEN  "NO"
               PERFORM T40-NO-IRPEF
           WHEN  "13"
               PERFORM T50-13-IRPEF
      * codice RA indica Ritenuta d'accconto 20%
           WHEN  "RA"
               PERFORM T60-RA-IRPEF
           WHEN  "SS"
               PERFORM T70-SS-IRPEF
           WHEN OTHER
               PERFORM T30-IRPEF
           END-EVALUATE.
      * APPLICO TRATTENUTA SINDACALE.
           MOVE 0 TO TRA-SIND.
           IF IMPORTO-SPETTANTE > 0
           AND IC-SSTCODIND NOT = "EE27"
           AND IC-SSTCODIND NOT = "EE28"
           AND IC-SSTCODIND NOT = "EE29"
           AND IC-SSTCODIND NOT = "EE30"
           AND IC-SSTCODIND NOT = "EE38"
           AND IC-SSTCODIND NOT = "EE05"
           AND IC-SSTCODIND NOT = "EE10"
           AND IC-SSTCODIND NOT = "EE2A"
           AND IC-SSTCODIND NOT = "EE2B"
           AND IC-SSTCODIND NOT = "EE2C"
           AND IC-SSTCODIND NOT = "EE2D"
           AND IC-SSTCODIND NOT = "EE13"
           AND IC-SSTCODIND NOT = "EE22"
           AND IC-SSTCODIND NOT = "EEMA"
           AND IC-SSTCODIND NOT = "EEZR"
           AND IC-SSTCODIND NOT = "EJ29"
           AND IC-SSTCODIND NOT = "EJ38"
           AND IC-SSTCODIND NOT = "EJ2A"
           AND IC-SSTCODIND NOT = "EJ2B"
           AND IC-SSTCODIND NOT = "EJ2C"
           AND IC-SSTCODIND NOT = "EJ2D"
           AND IC-SSTCODIND NOT = "EJ05"
           AND IC-SSTCODIND NOT = "EJ10"
           AND IC-SSTCODIND NOT = "EJ13"
           AND IC-SSTCODIND NOT = "EK29"
           AND IC-SSTCODIND NOT = "EK38"
           AND IC-SSTCODIND NOT = "EK2A"
           AND IC-SSTCODIND NOT = "EK2B"
           AND IC-SSTCODIND NOT = "EK2C"
           AND IC-SSTCODIND NOT = "EK2D"
           AND IC-SSTCODIND NOT = "EK05"
           AND IC-SSTCODIND NOT = "EK10"
           AND IC-SSTCODIND NOT = "EK13"
           AND IC-SSTCODIND NOT = "EW29"
           AND IC-SSTCODIND NOT = "EW38"
           AND IC-SSTCODIND NOT = "EW2A"
           AND IC-SSTCODIND NOT = "EW2B"
           AND IC-SSTCODIND NOT = "EW2C"
           AND IC-SSTCODIND NOT = "EW2D"
           AND IC-SSTCODIND NOT = "EW05"
           AND IC-SSTCODIND NOT = "EW10"
           AND IC-SSTCODIND NOT = "EW13"
           AND IC-SSTCODIND NOT = "EY29"
           AND IC-SSTCODIND NOT = "EY38"
           AND IC-SSTCODIND NOT = "EY2A"
           AND IC-SSTCODIND NOT = "EY2B"
           AND IC-SSTCODIND NOT = "EY2C"
           AND IC-SSTCODIND NOT = "EY2D"
           AND IC-SSTCODIND NOT = "EY05"
           AND IC-SSTCODIND NOT = "EY10"
           AND IC-SSTCODIND NOT = "EY13"
           AND IC-SSTCODIND NOT = "EY3A"
           AND IC-SSTCODIND NOT = "EX29"
           AND IC-SSTCODIND NOT = "EX38"
           AND IC-SSTCODIND NOT = "EX2A"
           AND IC-SSTCODIND NOT = "EX2B"
           AND IC-SSTCODIND NOT = "EX2C"
           AND IC-SSTCODIND NOT = "EX2D"
           AND IC-SSTCODIND NOT = "EX05"
           AND IC-SSTCODIND NOT = "EX10"
           AND IC-SSTCODIND NOT = "EX13"
           AND IC-SSTCODIND NOT = "EX3A"
           AND IC-SSTCODIND NOT = "EX87"
           AND IC-SSTCODIND NOT = "EX88"
211021     AND IC-SSTCODIND NOT = "EX89"
290322     AND IC-SSTCODIND NOT = "E092"
080722     AND IC-SSTCODIND NOT = "E109"
080722     AND IC-SSTCODIND NOT = "E110"
080722     AND IC-SSTCODIND NOT = "E112"
231122     AND IC-SSTCODIND NOT = "E107"
130123     AND IC-SSTCODIND NOT = "E159"
130123     AND IC-SSTCODIND NOT = "E160"
130123     AND IC-SSTCODIND NOT = "E162"
130123     AND IC-SSTCODIND NOT = "E157"
               IF IC-SSTCODIND = "SOMM"
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SPERIS
               ELSE
                   COMPUTE TRA-SIND = IMPORTO-SPETTANTE *
                                      LK-SINALIASU
               END-IF
               IF TRA-SIND NOT > 0.72
                   MOVE 0 TO TRA-SIND
               END-IF
           END-IF.
           PERFORM I00-IRPEF.
      * DETRAGGO TRATTENUTE SINDACALI
           COMPUTE IMPORTO-SPETTANTE =
                  IMPORTO-SPETTANTE - TRA-SIND.
      * 11.07.2017 gestione acconto
      * DETRAGGO ACCONTO
           PERFORM D10-DETRAGGO-ACCONTO.
      *
      *-------------------------------------------------------------*
       D00-DETRAGGO-RECUPERO.
      *-------------------------------------------------------------*
           IF IMPORTO-SPETTANTE > 0
               MOVE IMPORTO-SPETTANTE TO WK-IMPORTO-SPETTANTE
               IF OC-RECTORERE-1 > IMPORTO-SPETTANTE
                   MOVE IMPORTO-SPETTANTE TO WK-RECUPEROUL-E
                                             REC-IND-X-ASS
                   COMPUTE WK-RESIDUO-E = OC-RECTORERE-1 -
                                          IMPORTO-SPETTANTE
                   MOVE 0 TO IMPORTO-SPETTANTE
               ELSE
                   COMPUTE IMPORTO-SPETTANTE = IMPORTO-SPETTANTE -
                                               OC-RECTORERE-1
                   MOVE OC-RECTORERE-1 TO WK-RECUPEROUL-E
                                          REC-IND-X-ASS
                   MOVE 0 TO WK-RESIDUO-E
               END-IF
           ELSE
               IF IMPORTO-SPETTANTE < 0
                   IF OC-RECTORERE-1 > 0
                       COMPUTE IMPORTO-SPETTANTE =
                               IMPORTO-SPETTANTE -
                                  OC-RECTORERE-1
                       MOVE 0 TO WK-RESIDUO-E
                                 WK-RECUPEROUL-E
                   END-IF
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       D10-DETRAGGO-ACCONTO.
      *-------------------------------------------------------------*
100325*riscritta la perform sostituendo la variabile IMPORTO-SPETTANTE
      * (che contiene il lordo della prestazione) con la variabile
      *IMPNETTO (che contiene lordo - irpef = netto).

           initialize impnetto.
           COMPUTE IMPNETTO = IMPORTO-SPETTANTE -
                              FACIMPNETTA       -
                              FAPIMPNETTA

           IF IMPNETTO > 0
               IF OC-RECTORERE-3 > IMPNETTO
                   MOVE IMPNETTO TO WK-ACCONTOUL-E
                                             REC-ACC-X-ASS
                   COMPUTE WK-RESIDUOACC-E = OC-RECTORERE-3 -
                                          IMPNETTO
                   MOVE 0 TO IMPNETTO
               ELSE
                   COMPUTE IMPNETTO = IMPNETTO -
                                               OC-RECTORERE-3
                   MOVE OC-RECTORERE-3 TO WK-ACCONTOUL-E
                                          REC-ACC-X-ASS
                   MOVE 0 TO WK-RESIDUOACC-E
               END-IF
           ELSE
               IF IMPNETTO < 0
                   IF OC-RECTORERE-3 > 0
                       COMPUTE IMPNETTO =
                               IMPNETTO -
                                  OC-RECTORERE-3
                       MOVE 0 TO WK-RESIDUOACC-E
                                 WK-ACCONTOUL-E
                   END-IF
               END-IF
           END-IF.
      *    IF IMPORTO-SPETTANTE > 0
      *        MOVE IMPORTO-SPETTANTE TO WK-IMPORTO-SPETTANTE
      *        IF OC-RECTORERE-3 > IMPORTO-SPETTANTE
      *            MOVE IMPORTO-SPETTANTE TO WK-ACCONTOUL-E
      *                                      REC-ACC-X-ASS
      *            COMPUTE WK-RESIDUOACC-E = OC-RECTORERE-3 -
      *                                   IMPORTO-SPETTANTE
      *            MOVE 0 TO IMPORTO-SPETTANTE
      *        ELSE
      *            COMPUTE IMPORTO-SPETTANTE = IMPORTO-SPETTANTE -
      *                                        OC-RECTORERE-3
      *            MOVE OC-RECTORERE-3 TO WK-ACCONTOUL-E
      *                                   REC-ACC-X-ASS
      *            MOVE 0 TO WK-RESIDUOACC-E
      *        END-IF
      *    ELSE
      *        IF IMPORTO-SPETTANTE < 0
      *            IF OC-RECTORERE-3 > 0
      *                COMPUTE IMPORTO-SPETTANTE =
      *                        IMPORTO-SPETTANTE -
      *                           OC-RECTORERE-3
      *                MOVE 0 TO WK-RESIDUOACC-E
      *                          WK-ACCONTOUL-E
      *            END-IF
      *        END-IF
      *    END-IF.
      *-------------------------------------------------------------*
       I10-IMPOSTA-IRPEF.
      *-------------------------------------------------------------*
      *  CHIAMO GEST. FISC PER RIEPILOGO ED IMPOSTO IMPTASSATO
      *    INITIALIZE AREA-IRPEF.
           MOVE "RP"   TO FCODRICH.
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "TRAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               MOVE "G10"  TO FCODPROCED
                              OC-CODICE1
           ELSE
               IF IC-SSTCODIND = "CRED"
                   MOVE "G12"  TO FCODPROCED
                                  OC-CODICE1
               ELSE
                   IF H-TFISCALE = "13"
                       MOVE "G11"  TO FCODPROCED
                                      OC-CODICE1
                   ELSE
                       MOVE "G09"  TO FCODPROCED
                                      OC-CODICE1
                   END-IF
               END-IF
           END-IF.
           IF DATA-SISTEMA-AMG > 20161231
           AND (   IC-SSTCODIND = "DL76"
                OR IC-SSTCODIND = "TIPO"
                OR IC-SSTCODIND = "TYAD"
                OR IC-SSTCODIND = "TYGM"
                OR IC-SSTCODIND = "TYRG"
                OR IC-SSTCODIND = "TYBL"
                OR IC-SSTCODIND = "TYCR"
                OR IC-SSTCODIND = "APAF"
                OR IC-SSTCODIND = "APAR"
                OR IC-SSTCODIND = "APA2"
110422          OR IC-SSTCODIND = "APA3"
241122          OR IC-SSTCODIND = "APA4"
140323          OR IC-SSTCODIND = "APA5"
                OR IC-SSTCODIND = "DLIA"
                OR IC-SSTCODIND = "COIP"
                OR IC-SSTCODIND = "PORM"
100522          OR IC-SSTCODIND = "POR2"
251023          OR IC-SSTCODIND = "POR3"
251023          OR IC-SSTCODIND = "POR4"
251023          OR IC-SSTCODIND = "POR5"
251023          OR IC-SSTCODIND = "POR6"
                OR IC-SSTCODIND = "EELA"
140223          OR IC-SSTCODIND = "TGOL"
271123          OR IC-SSTCODIND = "DLI2"
060524          OR IC-SSTCODIND = "TISC"
210624          OR IC-SSTCODIND = "TISM"
240624          OR IC-SSTCODIND = "TGOC"
280125          OR IC-SSTCODIND = "APA6"
130325          OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               MOVE "G22"  TO FCODPROCED
                              OC-CODICE1
           END-IF.
201022     if (IC-SSTCODIND  = "E109"  or
               IC-SSTCODIND  = "E110"  or
               IC-SSTCODIND  = "E112"  or
               IC-SSTCODIND  = "E107"  or
130123         IC-SSTCODIND  = "E159"  or
               IC-SSTCODIND  = "E160"  or
               IC-SSTCODIND  = "E162"  or
               IC-SSTCODIND  = "E157")
               move  "G24"   to  FCODPROCED
                                 OC-CODICE1
           end-if
200423* inizio
           IF IC-SSTCODIND = "E092"
             IF H-WEBGIOLAV = 95
               MOVE "V02"    to  FCODPROCED OC-CODICE1
             ELSE
               MOVE "V01"    to  FCODPROCED OC-CODICE1
             END-IF
           END-IF.
200423* fine
           MOVE "N" TO FCOMMIT.
      *    MOVE ZEROES TO APPKEY.
      *    MOVE IC-DANCHANVP TO APPKEY2.
      *    MOVE APPKEY TO FKEYPROCED.
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED
                                FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
           MOVE "00"       TO FNUMPRATICA(1:2).
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
      *    MOVE IC-DCODTDECSP  TO FDATADAL.
           MOVE 00000101 TO FDATADAL.
           COMPUTE FDATADAL = FDATADAL + (AA-SIS-AMG * 10000)
      *    MOVE AA-SIS-AMG TO FDATADAL(1:4)
      *
           MOVE DATA-TER-CAL TO FDATAAL.
           MOVE IC-CODSEDE TO FCODSEDE.
           MOVE IC-DCOCENOPE TO FCODCENTRO.
      * ripristinata richiesta riepilogo 15.03.2011
           MOVE 0 TO IMPTASSATO.
           MOVE 0 TO RIEPILOGO-GG-DETRAZ.
      * 16.12.2016 correttivo per errore 105 riepilogo
      *    IF DATA-TER-CAL > 0
           IF FDATAAL > FDATAAL
      *
               PERFORM PNPGF-RP-NUOVO  THRU PNPGF-RP-NUOVO-EX
      *
               IF RET-CODE = SPACES
                   MOVE RACIMPONIBILE TO IMPTASSATO
                   MOVE RACGGDETRAZ   TO RIEPILOGO-GG-DETRAZ
               ELSE
                   MOVE 24 TO OC-RETCODE
                   STRING "ERRORE  " DELIMITED BY SIZE
                           RET-CODE  DELIMITED BY SIZE
                          "  PROGRAMMA RIEPILOGO IRPEF"
                                   DELIMITED BY SIZE
                     INTO OC-MESSAGGIO
                   GOBACK
               END-IF
           ELSE
               MOVE 0 TO IMPTASSATO
               MOVE 0 TO RIEPILOGO-GG-DETRAZ
           END-IF.
      *    INITIALIZE AREA-IRPEF.
           MOVE ZEROES TO FACIMPNETTA
                          FAPIMPNETTA
                          FAPDAL
                          FAPAL.
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
      *  valide per operazioni di conguaglio fiscale
           MOVE ZEROES TO FCONGAC
                          FCONGAP
                          FIMPREGAP
                          FIMPREGAC
                          FIMPCOMAP
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
      *-------------------------------------------------------*
      * CHIAMATA PCOCO                                        *
      *-------------------------------------------------------*
      **   if  IC-DANCCORE   > zeros
      *        MOVE IC-DANCCORE TO    L-CODICECOMUNE
      *        MOVE SPACES      TO    L-NOMECOMUNE
      *        CALL RDSUT17 USING
      *             WDFHEIBLK  WDFHCOMMAREA
      *             L-AREA-COMUNE
      *        IF  L-RETCODE = "00"
      *            MOVE L-COMUNE-FISCO TO COMUNE-FISCO
      *        ELSE
      *            MOVE SPACES         TO COMUNE-FISCO
      *        END-IF
      *    else
      *        move  SPACES          to COMUNE-FISCO
      **   end-if.
      *
           IF DATA-TERMINE NOT > DATA-TER-CAL
               MOVE 99 TO C-MESERIF
           ELSE
               IF AA-TERMINE = AA-SIS-AMG
               AND MM-TERMINE = MM-SIS-AMG
               AND GG-TERMINE < 16
                   MOVE 99 TO C-MESERIF
               ELSE
                   MOVE MM-SIS-AMG TO C-MESERIF
               END-IF
           END-IF.
      *  fine
           IF IC-SSTCODIND = "TRAC"
      *    OR IC-SSTCODIND = "FTCG"
      *    OR IC-SSTCODIND = "FTCD"
      *    OR IC-SSTCODIND = "FTCC"
               IF IC-SSTIMRIN NOT = 0
                   MOVE IC-SSTIMINT TO IMPTASSATO
               END-IF
           END-IF.
      *
120324* elena inizio
           IF IC-SSTCODIND = "FTCG"
           OR IC-SSTCODIND = "FTCD"
           OR IC-SSTCODIND = "FTCC"
100424     OR IC-SSTCODIND = "FTCI"
             IF IC-SSTPARTIM = 7
               IF IC-SSTIMRIN NOT = 0
                   MOVE IC-SSTIMINT TO IMPTASSATO
               END-IF
             END-IF
           END-IF.
120324* elena fine
      *
           IF IMPORTO-SPETTANTE + IMPTASSATO NOT > IMPORTO-T-AC
               MOVE IMPORTO-SPETTANTE TO FACIMPONIBILE
               MOVE ZEROES            TO FAPIMPONIBILE
           ELSE
               COMPUTE FAPIMPONIBILE = IMPORTO-SPETTANTE +
                                              IMPTASSATO -
                                            IMPORTO-T-AC
               IF FAPIMPONIBILE > IMPORTO-SPETTANTE
                   MOVE IMPORTO-SPETTANTE TO FAPIMPONIBILE
               END-IF
               COMPUTE FACIMPONIBILE = IMPORTO-SPETTANTE -
                                           FAPIMPONIBILE
           END-IF.
      *
      *    IF IC-SSTCODIND = "TRAC"
      *    OR IC-SSTCODIND = "TRAF"
      *    OR IC-SSTCODIND = "TRAS"
      *    OR IC-SSTCODIND = "TRAP"
      *  asteriscate perchè Gest Fisc applica aliquota minima
      *    IF IC-SSTCODIND = "TRAS"
      *    OR IC-SSTCODIND = "TRAP"
      *        IF IC-SSTALFL1(1:1) = "N"
      *            MOVE FACIMPONIBILE TO FACTREDICESIMA
      *            MOVE ZEROES TO FACIMPONIBILE
      *        END-IF
      *    END-IF.
      *
      *    IF H-TFISCALE = "CS"
      *        MOVE FACIMPONIBILE TO FACTREDICESIMA
      *        MOVE ZEROES TO FACIMPONIBILE
      *    END-IF.
      *
           IF FACIMPONIBILE < 0
               MOVE 0 TO FACIMPONIBILE
           END-IF.
           IF FACTREDICESIMA < 0
               MOVE 0 TO FACTREDICESIMA
           END-IF.
           IF FAPIMPONIBILE < 0
               MOVE 0 TO FAPIMPONIBILE
           END-IF.
      *
           MOVE "  "   TO FCODRICH.
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "TRAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               MOVE "G10"  TO FCODPROCED
                              OC-CODICE1
           ELSE
               IF IC-SSTCODIND = "CRED"
                   MOVE "G12"  TO FCODPROCED
                                  OC-CODICE1
               ELSE
                   IF H-TFISCALE = "13"
                       MOVE "G11"  TO FCODPROCED
                                      OC-CODICE1
                   ELSE
                       MOVE "G09"  TO FCODPROCED
                                      OC-CODICE1
                   END-IF
               END-IF
           END-IF.
           IF DATA-SISTEMA-AMG > 20161231
           AND (   IC-SSTCODIND = "DL76"
                OR IC-SSTCODIND = "TIPO"
                OR IC-SSTCODIND = "TYAD"
                OR IC-SSTCODIND = "TYGM"
                OR IC-SSTCODIND = "TYRG"
                OR IC-SSTCODIND = "TYBL"
                OR IC-SSTCODIND = "TYCR"
                OR IC-SSTCODIND = "APAF"
                OR IC-SSTCODIND = "APAR"
                OR IC-SSTCODIND = "APA2"
110422          OR IC-SSTCODIND = "APA3"
241122          OR IC-SSTCODIND = "APA4"
140323          OR IC-SSTCODIND = "APA5"
                OR IC-SSTCODIND = "DLIA"
                OR IC-SSTCODIND = "COIP"
                OR IC-SSTCODIND = "PORM"
100522          OR IC-SSTCODIND = "POR2"
251023          OR IC-SSTCODIND = "POR3"
251023          OR IC-SSTCODIND = "POR4"
251023          OR IC-SSTCODIND = "POR5"
251023          OR IC-SSTCODIND = "POR6"
                OR IC-SSTCODIND = "EELA"
140223          OR IC-SSTCODIND = "TGOL"
271123          OR IC-SSTCODIND = "DLI2"
060524          OR IC-SSTCODIND = "TISC"
210624          OR IC-SSTCODIND = "TISM"
240624          OR IC-SSTCODIND = "TGOC"
280125          OR IC-SSTCODIND = "APA6"
130325          OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               MOVE "G22"  TO FCODPROCED
                              OC-CODICE1
           END-IF.
201022     if (IC-SSTCODIND  = "E109"  or
               IC-SSTCODIND  = "E110"  or
               IC-SSTCODIND  = "E112"  or
               IC-SSTCODIND  = "E107"  or
130123         IC-SSTCODIND  = "E159"  or
               IC-SSTCODIND  = "E160"  or
               IC-SSTCODIND  = "E162"  or
               IC-SSTCODIND  = "E157")
               move  "G24"   to  FCODPROCED
                                 OC-CODICE1
           end-if
200423* inizio
           IF IC-SSTCODIND = "E092"
             IF H-WEBGIOLAV = 95
               MOVE "V02"    to  FCODPROCED OC-CODICE1
             ELSE
               MOVE "V01"    to  FCODPROCED OC-CODICE1
             END-IF
           END-IF.
200423* fine
      *
      *    MOVE ZEROES TO APPKEY.
      *    MOVE IC-DANCHANVP TO APPKEY2.
      *    MOVE APPKEY TO FKEYPROCED.
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED.
      *
           MOVE IC-CODFISARCA    TO FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    FDATAVALUTA
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
      *
      *    STRING IC-COGNARCA DELIMITED BY "   "
      *           "/"         DELIMITED BY SIZE
      *           IC-NOMEARCA DELIMITED BY "   "
      *        INTO FCOGNNOME.
      *
           IF FAPIMPONIBILE > 0
              MOVE "S" TO FCODCALCOLO
           ELSE
              MOVE SPACES TO FCODCALCOLO
           END-IF.
      *
           IF FACIMPONIBILE  > 0
           OR FACTREDICESIMA > 0
               IF FAPIMPONIBILE > 0
                  MOVE "M" TO FCODCALCOLO
               ELSE
                  MOVE "G" TO FCODCALCOLO
               END-IF
           END-IF.
      *
      *    IF FACIMPONIBILE  > 0
      *    OR FACTREDICESIMA > 0
      *        MOVE "G" TO FCODCALCOLO
      *    ELSE
      *        IF FAPIMPONIBILE > 0
      *            MOVE "S" TO FCODCALCOLO
      *        ELSE
      *            MOVE SPACES TO FCODCALCOLO
      *        END-IF
      *    END-IF.
      *
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
           MOVE DATA-INI-AC  TO FDATADAL
                                FACDAL.
      *
           MOVE DATA-TER-CAL TO FDATAAL
                                FACAL.
      *
           MOVE 365 TO FGGPERANNO.
      *
           PERFORM I30-CALCOLA-GG-PREST.
      *
           MOVE ZEROES TO FAPGGPREST.
           IF FAPIMPONIBILE > 0
               IF PERIODO-TOTALE > GGPREST-SU-30 + OC-SSTGGCALC
                   COMPUTE FAPGGPREST =
                       PERIODO-TOTALE -
                           OC-SSTGGCALC -
                       GGPREST-SU-30
               END-IF
           END-IF.
      *
      * inserita modifica 17.05.2016 per eliminare gg in più detrazioni
           IF WK-IMP-MENSILE > 0
               COMPUTE WIMPGIOR ROUNDED = WK-IMP-MENSILE / 30
               IF FACIMPONIBILE = 0
                 COMPUTE WFACGGPREST ROUNDED =
      *                 FACTREDICESIMA / WIMPGIOR + 1
                        FACTREDICESIMA / WIMPGIOR
               ELSE
                 COMPUTE WFACGGPREST ROUNDED =
      *                 FACIMPONIBILE / WIMPGIOR + 1
                        FACIMPONIBILE / WIMPGIOR
      *          IF WFACGGPREST = 0
      *            MOVE 1 TO WFACGGPREST
      *          END-IF
               END-IF
               IF WFACGGPREST > (FACGGPREST + 1)
               OR             <  FACGGPREST
      * correttivo per FTCG FTCD in caso di ricalcolo
      *            IF (   IC-SSTCODIND = "FTCG"
      *                OR IC-SSTCODIND = "FTCD"
      *                OR IC-SSTCODIND = "FTCC" )
      *            AND IC-SSTIMRIN  > 0
      *                NEXT SENTENCE
      *            ELSE
      *
                       MOVE WFACGGPREST TO FACGGPREST
      *            END-IF
      *
               END-IF
      * correttivo per FTCG FTCD in caso di ricalcolo
               IF (   IC-SSTCODIND = "FTCG"
                   OR IC-SSTCODIND = "FTCD"
                   OR IC-SSTCODIND = "FTCC"
100424             OR IC-SSTCODIND = "FTCI" )
220222             AND IMPORTO-T-AC > 0
                   MOVE IC-SSTNUML2 TO WFACGGPREST
                                      FACGGPREST
               END-IF
      *
      *        COMPUTE WFAPGGPREST = FAPIMPONIBILE / WIMPGIOR + 1
               COMPUTE WFAPGGPREST ROUNDED =
                      FAPIMPONIBILE / WIMPGIOR
               IF WFAPGGPREST > (FAPGGPREST + 1)
               OR             <  FAPGGPREST
                   MOVE WFAPGGPREST TO FAPGGPREST

220222             IF (   IC-SSTCODIND = "FTCG"
220222                 OR IC-SSTCODIND = "FTCD"
220222                 OR IC-SSTCODIND = "FTCC"
100424                 OR IC-SSTCODIND = "FTCI" )
220222                 AND FAPGGPREST > IC-SSTNUML2
120324                 AND IC-SSTPARTIM NOT = 7
220222                   MOVE IC-SSTNUML2 TO WFAPGGPREST
220222                                       FAPGGPREST
220222             END-IF
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "TRAC"
      *    OR IC-SSTCODIND = "FTCG"
      *    OR IC-SSTCODIND = "FTCD"
      *    OR IC-SSTCODIND = "FTCC"
               IF IC-SSTIMRIN NOT = 0
      *            IF IC-CODSEDE NOT = 7001
                   IF FAPGGPREST = 0
                       MOVE 1 TO FAPGGPREST
                   END-IF
               END-IF
           END-IF.
      *
      * correttivo per FT* COn differenziale del 73%
120324*Elena inizio
           IF ( IC-SSTCODIND = "FTCG"
                OR IC-SSTCODIND = "FTCD"
                OR IC-SSTCODIND = "FTCC"
100424          OR IC-SSTCODIND = "FTCI" )
           AND IC-SSTIMRIN NOT = 0
           AND IC-SSTPARTIM    = 7
                MOVE 1 TO FAPGGPREST
           END-IF.
120324*Elena fine
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAS"
      *    OR  IC-SSTCODIND = "FTMD"
      *    OR  IC-SSTCODIND = "FTSO"
020222     OR  IC-SSTCODIND = "FTCG"
020222     OR  IC-SSTCODIND = "FTCD"
020222     OR  IC-SSTCODIND = "FTCC"
100424     OR  IC-SSTCODIND = "FTCI"
      *    OR  IC-SSTCODIND = "FTPL"
      *    OR  IC-SSTCODIND = "FTAI"
      *    OR  IC-SSTCODIND = "FTAD"
               IF IC-SSTNUML2 > FAPGGPREST
                   COMPUTE FACGGPREST = IC-SSTNUML2 - FAPGGPREST
               ELSE
                   MOVE 0 TO FACGGPREST
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "FTAI"
260324     OR IC-SSTCODIND = "FSAI"
               IF FAPIMPONIBILE > 0
                   IF PERIODO-TOTALE > GG-CRED-AC + OC-SSTGGCALC
                       COMPUTE FAPGGPREST =
                           PERIODO-TOTALE -
                             OC-SSTGGCALC -
                               GG-CRED-AC
                       COMPUTE FACGGPREST = PERIODO-TOTALE -
                                              OC-SSTGGCALC -
                                                FAPGGPREST
                   END-IF
               ELSE
                   MOVE ZEROES TO FAPGGPREST
                   COMPUTE FACGGPREST = PERIODO-TOTALE -
                                        OC-SSTGGCALC
      *        MOVE GG-CRED-AC TO FACGGPREST
      *        IF FAPIMPONIBILE > 0
      *            IF PERIODO-TOTALE > GG-CRED-AC + OC-SSTGGCALC
      *                COMPUTE FAPGGPREST = PERIODO-TOTALE -
      *                                       OC-SSTGGCALC -
      *                                       GG-CRED-AC
      *            END-IF
               END-IF
           END-IF.
      *        DISPLAY 'ELENA18 FACGGPREST: ' FACGGPREST
      *        DISPLAY 'ELENA18 FAPGGPREST: ' FAPGGPREST.
      *
           IF FACIMPONIBILE  > 0
           OR FACTREDICESIMA > 0
               IF FDATADAL < WK-DATADAL
                   MOVE WK-DATADAL TO FACDAL
               ELSE
                   MOVE FDATADAL TO FACDAL
               END-IF
               MOVE FDATAAL   TO FACAL
               IF FACDAL > FACAL
                   MOVE WK-DATADAL TO FACDAL
               END-IF
           END-IF.
           IF FAPIMPONIBILE > 0
               MOVE DATA-INIZIO TO FAPDAL
               IF IC-SSTCODIND NOT = "TRAD"
               AND H-TFISCALE NOT = "SS"
                   MOVE WK-FAPAL   TO FAPAL
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "TRAC"
           AND IC-SSTIMRIN NOT = 0
      *        IF IC-CODSEDE NOT = 7001
                   MOVE 20180101   TO FAPDAL
                   MOVE 20181130   TO FAPAL
      *        END-IF
           END-IF.
      *
      *    IF (    IC-SSTCODIND = "FTCG"
      *         OR IC-SSTCODIND = "FTCD"
      *         OR IC-SSTCODIND = "FTCC" )
      *    AND IC-SSTIMRIN NOT = 0
      *        IF IC-CODSEDE NOT = 7001
      *            MOVE 20180101   TO FAPDAL
      *            MOVE 20181130   TO FAPAL
      *        END-IF
      *    END-IF.
      *
           MOVE FAPGGPREST TO FAPGGDETRAZ.
           IF FACGGPREST > FACGGDETRAZ
           OR IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "FTAI"
260324     OR IC-SSTCODIND = "FSAI"
               MOVE IC-DCODTDECSP  TO FDATADAL
                                      FACDAL
               IF DATA-INI-AC > IC-DCODTDECSP
                   MOVE DATA-INI-AC    TO FACDAL
                                          FDATADAL
               END-IF
           END-IF.
      *    DISPLAY 'ELENA18 FDATADAL: ' FDATADAL
      *    DISPLAY 'ELENA18 FACDAL  : ' FACDAL
           IF H-TFISCALE = "CS"
           OR IC-SSTALFL1(1:1) = "N"
      *    OR IC-SSTCODIND = "CRED"
      *        MOVE FACGGPREST TO FACGGDETRAZ
               MOVE ZEROES     TO FACGGDETRAZ
      * aggiunto fapggdetraz per addendum alazio TYAD
                                  FAPGGDETRAZ
           ELSE
      *        IF FACGGPREST > FACGGDETRAZ
      *        OR IC-SSTCODIND = "CRED"
      *            MOVE IC-DCODTDECSP  TO FDATADAL
      *                                   FACDAL
      *            IF DATA-INI-AC > IC-DCODTDECSP
      *                MOVE DATA-INI-AC    TO FACDAL
      *                                       FDATADAL
      *            END-IF
      *        END-IF
               MOVE FACGGPREST TO FACGGDETRAZ
           END-IF.
      *    IF IC-SSTCODIND = "CRED"
      *        IF (PERIODO-TOTALE - O-PMEINDTOGG) < FACGGDETRAZ
      *            COMPUTE
      *            FACGGDETRAZ = (PERIODO-TOTALE - O-PMEINDTOGG)
      *        END-IF
      *    END-IF.
           IF (   IC-SSTCODIND = "CRED"
               OR IC-SSTCODIND = "FTAI"
260324         OR IC-SSTCODIND = "FSAI")
           AND PERIODO-TOTALE > (O-PMEINDTOGG + FAPGGDETRAZ)
           AND (FACIMPONIBILE > 0 OR FACTREDICESIMA > 0)
           AND FACGGDETRAZ > ( PERIODO-TOTALE -
                               O-PMEINDTOGG -
                               FAPGGDETRAZ )
               COMPUTE FACGGDETRAZ = PERIODO-TOTALE -
                                     O-PMEINDTOGG -
                                     FAPGGDETRAZ
           END-IF.
           IF (   IC-SSTCODIND = "CRED"
               OR IC-SSTCODIND = "FTAI"
260324         OR IC-SSTCODIND = "FSAI")
           AND PERIODO-TOTALE NOT > O-PMEINDTOGG
               MOVE ZEROES TO FACGGDETRAZ
           END-IF.
           MOVE 1 TO FCODDET01(1).
      *    IF IC-SSTCODIND = "CRED"
      *        MOVE ZEROES TO FACGGDETRAZ
      *    END-IF.
      *
           IF IC-SSTCODIND = "TRAD"
               IF IMPORTO-T-AC > 0
                   MOVE DATA-INIZIO  TO FDATADAL
                                        FACDAL
                   MOVE DATA-TER-CAL TO FDATAAL
                                        FACAL
                   MOVE PERIODO-TOTALE TO FACGGPREST
                   MOVE ZEROES         TO FACGGDETRAZ
               ELSE
                   MOVE DATA-INIZIO  TO FDATADAL
                                        FACDAL
                                        FAPDAL
                   MOVE DATA-TER-CAL TO FDATAAL
                                        FACAL
                                        FAPAL
                   MOVE PERIODO-TOTALE TO FAPGGPREST
                   MOVE ZEROES         TO FAPGGDETRAZ
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       I20-IMPOSTA-IRPEF-R.
      *-------------------------------------------------------------*
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
           MOVE ZEROES TO FIMPREGAC
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
           IF ULTIMO-IMP-R > 0
               MOVE TERMINE-R TO FADFINE
                                 FACAL
               MOVE ULTIMO-IMP-R TO FACTREDICESIMA
               MOVE PERIODO-R TO FACGGPREST
               MOVE "A" TO FCODCALCOLO
           END-IF.
      *-------------------------------------------------------------*
       I00-IRPEF.
      *-------------------------------------------------------------*
           IF FCODCALCOLO NOT = SPACES
               MOVE "N" TO FCOMMIT
               MOVE 0 TO FCODRITORNO
               MOVE "PDSSU41 " TO FCHIAMANTE
      * CORRETTIVI PER DATE
               IF FACDAL > FACAL
      *            MOVE FACAL TO FACDAL
      *            MOVE "0101" TO FACDAL(5:4)
                   MOVE FACAL TO DATA-AMG
                   MOVE 01    TO GG-AMG
                   MOVE 01    TO MM-AMG
                   MOVE DATA-AMG TO FACDAL
               END-IF
               IF FAPDAL > FAPAL
      *            MOVE FAPAL TO FAPDAL
      *            MOVE "0101" TO FAPDAL(5:4)
                   MOVE FAPAL TO DATA-AMG
                   MOVE 01    TO GG-AMG
                   MOVE 01    TO MM-AMG
                   MOVE DATA-AMG TO FAPDAL
               END-IF
               IF FDATADAL > FDATAAL
      *            MOVE FDATAAL TO FDATADAL
      *            MOVE "0101" TO FDATADAL(5:4)
                   MOVE FDATAAL TO DATA-AMG
                   MOVE 01    TO GG-AMG
                   MOVE 01    TO MM-AMG
                   MOVE DATA-AMG TO FDATADAL
               END-IF
      *
               IF  IC-SSTCODIND NOT = "SBFC"
      *        AND IC-SSTCODIND NOT = "SSPV"
      * aggiunte da Datamanagement
                   MOVE  FACDAL  TO  DATA-1
                   MOVE  DATA-1-AA  TO  DATA-2-AA
                   MOVE  DATA-1-MM  TO  DATA-2-MM
                   MOVE  DATA-1-GG  TO  DATA-2-GG
                   MOVE  DATA-2  TO  FACDAL
                   MOVE  FDATADAL  TO  DATA-1
                   MOVE  DATA-1-AA  TO  DATA-2-AA
                   MOVE  DATA-1-MM  TO  DATA-2-MM
                   MOVE  DATA-1-GG  TO  DATA-2-GG
                   MOVE  DATA-2  TO  FDATADAL
                   MOVE  FDATAAL  TO  DATA-1
                   MOVE  DATA-1-AA  TO  DATA-2-AA
                   MOVE  DATA-1-MM  TO  DATA-2-MM
                   MOVE  DATA-1-GG  TO  DATA-2-GG
                   MOVE  DATA-2  TO  FDATAAL
                   MOVE  FAPDAL  TO  DATA-1
                   MOVE  DATA-1-AA  TO  DATA-2-AA
                   MOVE  DATA-1-MM  TO  DATA-2-MM
                   MOVE  DATA-1-GG  TO  DATA-2-GG
                   MOVE  DATA-2  TO  FAPDAL
                   MOVE  FAPAL  TO  DATA-1
                   MOVE  DATA-1-AA  TO  DATA-2-AA
                   MOVE  DATA-1-MM  TO  DATA-2-MM
                   MOVE  DATA-1-GG  TO  DATA-2-GG
                   MOVE  DATA-2  TO  FAPAL
                   MOVE  FACAL  TO  DATA-1
                   MOVE  DATA-1-AA  TO  DATA-2-AA
                   MOVE  DATA-1-MM  TO  DATA-2-MM
                   MOVE  DATA-1-GG  TO  DATA-2-GG
                   MOVE  DATA-2  TO  FACAL
      * serve per non far applicare conguaglio fiscale
                   IF H-TFISCALE = "13"
      *            OR IC-SSTCODIND = "CRED"
                       MOVE "PIOSX41 " TO FCHIAMANTE
                   END-IF
      * serve per rateizzare sempre il conguaglio per FTA
                   IF IC-SSTCODIND = "TRAC"
                   OR IC-SSTCODIND = "TRAF"
                   OR IC-SSTCODIND = "TRAS"
                   OR IC-SSTCODIND = "TRAD"
                   OR  IC-SSTCODIND = "FTMD"
                   OR  IC-SSTCODIND = "FTSO"
                   OR  IC-SSTCODIND = "FTCG"
                   OR  IC-SSTCODIND = "FTCD"
                   OR  IC-SSTCODIND = "FTCC"
                   OR  IC-SSTCODIND = "FTPL"
                   OR  IC-SSTCODIND = "FTAI"
                   OR  IC-SSTCODIND = "FTAD"
260324             OR  IC-SSTCODIND = "FSAI"
270324             OR  IC-SSTCODIND = "FSAD"
100424             OR  IC-SSTCODIND = "FTCI"
                       MOVE MM-SIS-AMG TO C-MESERIF
                   END-IF
      *
                   PERFORM PNPGF-AL-NUOVO THRU
                           PNPGF-AL-NUOVO-EX
                   call    PNPGF8E  using
                           WDFHEIBLK
                           RICHIESTA
                   cancel  PNPGF8E
      *
                   IF RET-CODE = SPACES
                       PERFORM PNPGF-DAL-NUOVO THRU
                               PNPGF-DAL-NUOVO-EX
                       ADD FACIMPONIBILE  TO IMPTASSATO
                       ADD FACTREDICESIMA TO IMPTASSATO
                   ELSE
                       MOVE 22 TO OC-RETCODE
                       STRING "ERRORE FISCALE:"     DELIMITED BY SIZE
      *                     " IN PROCEDURA FISCALE" DELIMITED BY SIZE
                            RET-CODE                DELIMITED BY SIZE
                            "-"                     DELIMITED BY SIZE
                            RET-CODE-CHIARO         DELIMITED BY SIZE
                         INTO OC-MESSAGGIO
                       GOBACK
                   END-IF
               ELSE
                   MOVE ZEROES TO FACTREDICESIMA
                                  FACIMPLORDA
                                  FACIMPNETTA
                                  FACGGDETRAZ
                                  FACIMPDETRAZ
                                  FAPTREDICESIMA
                                  FAPALIQMEDIA
                                  FAPIMPLORDA
                                  FAPIMPNETTA
                                  FAPGGDETRAZ
                                  FAPIMPDETRAZ
               END-IF
           ELSE
               MOVE ZEROES TO FACIMPNETTA
                              FAPIMPNETTA
           END-IF.
           IF H-TFISCALE = "13"
               MOVE FACIMPLORDA TO FACIMPDETRAZ
                                   FACIMPDETRLAV
               MOVE ZEROES TO FACIMPNETTA
                              FIMPREGAP
                              FIMPREGAC
                              FIMPCOMAP
                              FIMPCOMAC
                              FACIMPDETRFAM
           END-IF.
190625* con *** sono referenziate le righe asteriscate per fare in modo
      * nessuna prestazione faccia un calcolo delle detrazioni diverso
      * da quanto trasmesso da GF.
060625* escluso dal calcolo delle detrazioni TGOC
      * 11.12.2018 INSERITO CALCOLO DETRAZIONI FISCALI PER IMPORTI
      *            DA 668 A 2334 MENSILI
190625***  IF H-TFISCALE = "CD"
      ***  AND FACIMPLORDA > 0
      ***  AND FACIMPNETTA > 0
      ***  AND IC-SSTCODIND NOT = "CRED"
      ***  AND IC-SSTCODIND NOT = "FTAI"
260324***  AND IC-SSTCODIND NOT = "FSAI"
060625***  AND IC-SSTCODIND NOT = "TGOC"
      **   AND IC-SSTCODIND NOT = "SSEP"
      **   AND H-IMPSUSS < 668.00
      ***  AND FACGGDETRAZ > 0
      * forzatura detr. per lav. dip. per redditi sotto la soglia esenz.
      * 11.12.2018 eliminata forzatura APAF APAR APA2 anche se oltre
      * soglia
      ***  IF  (
      ***           ((FACIMPONIBILE / FACGGDETRAZ) * 30) < 668.00
      **         OR IC-SSTCODIND = "APAF"
      **         OR IC-SSTCODIND = "APAR"
      **         OR IC-SSTCODIND = "APA2"
      **         OR IC-SSTCODIND = "DLIA"
      **         OR IC-SSTCODIND = "COIP"
      **         OR IC-SSTCODIND = "TYBL"
      **         OR IC-SSTCODIND = "TYCR"
      ***      )
      ***      MOVE FACIMPLORDA TO FACIMPDETRAZ
      ***                          FACIMPDETRLAV
      ***      MOVE ZEROES TO FACIMPNETTA
      ***                     FIMPREGAP
      ***                     FIMPREGAC
      ***                     FIMPCOMAP
      ***                     FIMPCOMAC
      ***                     FACIMPDETRFAM
      ***  ELSE
      ***      IF ((FACIMPONIBILE / FACGGDETRAZ) * 30) < 2334.00
      ***          COMPUTE FACIMPDETRLAV =
      ***                  FACGGDETRAZ *
      ***                  ((978 +
      ***                    (902 *
      ***                     (28000 -
      ***                      FACIMPONIBILE / FACGGDETRAZ * 365) /
      ***                     20000)) /
      ***                   365)
      ***          COMPUTE FACIMPDETRAZ =
      ***                  FACIMPDETRLAV + FACIMPDETRFAM
      ***          IF FACIMPDETRAZ <= FACIMPLORDA
      ***              COMPUTE FACIMPNETTA = FACIMPLORDA - FACIMPDETRAZ
      ***          ELSE
      ***              MOVE FACIMPLORDA TO FACIMPDETRAZ
      ***              COMPUTE FACIMPDETRLAV = FACIMPDETRAZ -
      ***                                      FACIMPDETRFAM
      ***          END-IF
      ***      END-IF
060525***  END-IF
      ***  END-IF.

           IF (   H-TFISCALE = "CS"
               OR IC-SSTALFL1(1:1) = "N" )
           AND FACIMPLORDA > 0
               MOVE FACIMPLORDA TO FACIMPNETTA
               MOVE ZEROES TO FACIMPDETRAZ
                              FACIMPDETRLAV
                              FACIMPDETRFAM
               IF IC-SSTCODIND = "TYAD"
                   MOVE ZEROES TO FACIMPLORDA
                                  FACIMPNETTA
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "SSIS"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 07
           AND IC-DCODTDECSP > 20070400
      *    AND IC-DCODTDECSP < 20071002
           AND DATA-TER-CAL > 20091129
      *        ADD FACIMPNETTA TO FADNETTOPAG
               MOVE FACIMPLORDA TO FACIMPDETRAZ
                                   FACIMPDETRLAV
               MOVE ZEROES TO FACIMPNETTA
                              FIMPREGAP
                              FIMPREGAC
                              FIMPCOMAP
                              FIMPCOMAC
                              FACIMPDETRFAM
           END-IF.
      *
           IF (   IC-SSTCODIND = "CRED"
               OR IC-SSTCODIND = "FTAI"
260324         OR IC-SSTCODIND = "FSAI")
           AND FACIMPLORDA > 0
           AND PERIODO-TOTALE NOT > O-PMEINDTOGG
               MOVE ZEROES TO FACGGDETRAZ
               MOVE FACIMPLORDA TO FACIMPNETTA
               MOVE ZEROES TO FACIMPDETRAZ
                              FACIMPDETRLAV
                              FACIMPDETRFAM
           END-IF.
      *
           IF IC-SSTCODIND = "SEIM"
               MOVE ZEROES TO FACGGDETRAZ
                              FACIMPLORDA
                              FACIMPNETTA
                              FAPGGDETRAZ
                              FAPIMPLORDA
                              FAPIMPNETTA
               MOVE ZEROES TO FACIMPDETRAZ
                              FACIMPDETRLAV
                              FACIMPDETRFAM
           END-IF.
      *
           IF FACIMPONIBILE < 0
               MOVE ZEROES TO FACIMPONIBILE
           END-IF.
           IF FACTREDICESIMA < 0
               MOVE ZEROES TO FACTREDICESIMA
           END-IF.
      ************************
      * rimborso trattenute eseguite applicando la gestione separata
      ************************
      *    IF IC-SSTCODIND = "TYGM"
      *    AND IC-SSTIRPEFU > 0
      *        SUBTRACT IC-SSTIRPEFU FROM FACIMPNETTA
      *        MOVE 0 TO IC-SSTIRPEFU
      *                  OC-SSTIRPEFU
      *    END-IF.
      ************************
      ************************
      *-------------------------------------------------------------*
       I30-CALCOLA-GG-PREST.
      *-------------------------------------------------------------*
           MOVE ZEROES TO FACGGPREST
                          GGPREST-SU-30.
           MOVE WK-DATADAL TO DATA-INI-AC.
           MOVE DATA-TER-CAL TO DATA-TER-AC.
      *
           MOVE DATA-TER-CAL TO LK-DATA2.
           IF LK-DATA2 NOT < DATA-INI-AC
               MOVE DATA-INI-AC TO LK-DATA1
               CALL RDSUT21 USING WDFHEIBLK  WDFHCOMMAREA
                                  PIU-GIORNI
                                  LK-DATA1
                                  LK-DATA2
               MOVE PIU-GIORNI TO FACGGPREST
               MOVE ZEROES TO WK-PER-SPET
               CALL RDSUT20 USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  LK-DATA1
                                  LK-DATA2
                                  WK-PER-SPET
               MOVE WK-PER-SPET TO GGPREST-SU-30
           END-IF.
      *
           IF FAPIMPONIBILE = 0
               IF PERIODO-TOTALE > FACGGPREST + OC-SSTGGCALC
                   COMPUTE FACGGPREST = PERIODO-TOTALE - OC-SSTGGCALC
                   MOVE 360 TO FGGPERANNO
               END-IF
           END-IF.
           IF (IC-SSTCODIND = "PARM"
               OR IC-SSTCODIND = "SARV"
               OR IC-SSTCODIND = "WTWM")
           AND IC-SSTALFL1(2:1) = "S"
               MOVE DATA-TER-CAL TO LK-DATA2
               MOVE WK-DATADAL   TO LK-DATA1
               CALL RDSUT21 USING WDFHEIBLK  WDFHCOMMAREA
                                  PIU-GIORNI
                                  LK-DATA1
                                  LK-DATA2
               MOVE PIU-GIORNI TO FACGGPREST
               MOVE ZEROES TO WK-PER-SPET
               CALL RDSUT20 USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  LK-DATA1
                                  LK-DATA2
                                  WK-PER-SPET
               MOVE WK-PER-SPET TO GGPREST-SU-30
           END-IF.
      *-------------------------------------------------------------*
       M22-CALCOLA-ANTICIPO.
      *-------------------------------------------------------------*
           MOVE ZEROES TO IMPORTO-R
                          ULTIMO-IMP-R
                          RECUPERO-R
                          IRPEF-R
                          TRA-SIND-R.
           IF H-GGSUSS > PERIODO-TOTALE
               COMPUTE PERIODO-R = H-GGSUSS - PERIODO-TOTALE
           ELSE
               MOVE ZEROES TO PERIODO-R
           END-IF.
           COMPUTE IMPORTO-R ROUNDED = PERIODO-R      *
                                       WK-IMP-MENSILE /
                                       30             .
      *    AGGIUNGO IMPORTO ANTICIPAZIONE A IMPORTO-TOTALE
           ADD IMPORTO-R TO IMPORTO-TOTALE.
      *    IMPOSTO IMPORTO SPETTANTE (PER ANTICIPAZIONE)
           COMPUTE ULTIMO-IMP-R = IMPORTO-R   -
                                  OC-SSTIMRIN.
           IF IMPORTO-SPETTANTE < 0
               IF ULTIMO-IMP-R + IMPORTO-SPETTANTE > 0
                   COMPUTE ULTIMO-IMP-R = ULTIMO-IMP-R      +
                                          IMPORTO-SPETTANTE
                   COMPUTE RECUPERO-R = - IMPORTO-SPETTANTE
                   MOVE ZEROES TO IMPORTO-SPETTANTE
               ELSE
                   ADD ULTIMO-IMP-R TO IMPORTO-SPETTANTE
                   IF ULTIMO-IMP-R > 0
                       MOVE ULTIMO-IMP-R TO RECUPERO-R
                   ELSE
                       MOVE ZEROES TO RECUPERO-R
                   END-IF
                   MOVE ZEROES TO ULTIMO-IMP-R
               END-IF
           ELSE
               IF IMPORTO-SPETTANTE = 0
                   IF OC-RECTORERE-1 > ULTIMO-IMP-R
                       MOVE ULTIMO-IMP-R TO RECUPERO-R
                       COMPUTE WK-RESIDUO-E = OC-RECTORERE-1 -
                                              ULTIMO-IMP-R
                       MOVE 0 TO ULTIMO-IMP-R
                   ELSE
                       COMPUTE ULTIMO-IMP-R = ULTIMO-IMP-R -
                                            OC-RECTORERE-1
                       MOVE OC-RECTORERE-1 TO RECUPERO-R
                       MOVE 0 TO WK-RESIDUO-E
                   END-IF
               ELSE
                   IF ULTIMO-IMP-R < 0
                       ADD ULTIMO-IMP-R TO IMPORTO-SPETTANTE
                       MOVE ZEROES TO ULTIMO-IMP-R
                   END-IF
               END-IF
           END-IF.
      * APPLICO TRATTENUTA SINDACALE.
           MOVE 0 TO TRA-SIND-R.
           IF ULTIMO-IMP-R > 0
               COMPUTE TRA-SIND-R = ULTIMO-IMP-R *
                                    LK-SINALIASU
               IF TRA-SIND-R NOT > 0.72
                   MOVE 0 TO TRA-SIND-R
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       T30-IRPEF.
      *-------------------------------------------------------------*
           MOVE ZEROES TO FACIMPNETTA
                          FAPIMPNETTA
                          FAPDAL
                          FAPAL.
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
           MOVE ZEROES TO FCONGAC
                          FCONGAP
                          FIMPREGAP
                          FIMPREGAC
                          FIMPCOMAP
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
           IF DATA-TERMINE NOT > DATA-TER-CAL
               MOVE 99 TO C-MESERIF
           ELSE
               IF AA-TERMINE = AA-SIS-AMG
               AND MM-TERMINE = MM-SIS-AMG
               AND GG-TERMINE < 16
                   MOVE 99 TO C-MESERIF
               ELSE
                   MOVE MM-SIS-AMG TO C-MESERIF
               END-IF
           END-IF.
           IF IMPORTO-SPETTANTE > 0
               MOVE DATA-TERMINE TO FADFINE
                                    FACAL
               MOVE IMPORTO-SPETTANTE TO FACIMPONIBILE
               MOVE "A" TO FCODCALCOLO
           END-IF.
      *
           MOVE "  "   TO FCODRICH.
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "TRAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               MOVE "G10"  TO FCODPROCED
                              OC-CODICE1
           ELSE
               IF IC-SSTCODIND = "CRED"
                   MOVE "G12"  TO FCODPROCED
                                  OC-CODICE1
               ELSE
                   IF H-TFISCALE = "13"
                       MOVE "G11"  TO FCODPROCED
                                      OC-CODICE1
                   ELSE
                       MOVE "G09"  TO FCODPROCED
                                      OC-CODICE1
                   END-IF
               END-IF
           END-IF.
           IF DATA-SISTEMA-AMG > 20161231
           AND (   IC-SSTCODIND = "DL76"
                OR IC-SSTCODIND = "TIPO"
                OR IC-SSTCODIND = "TYAD"
                OR IC-SSTCODIND = "TYGM"
                OR IC-SSTCODIND = "TYRG"
                OR IC-SSTCODIND = "TYBL"
                OR IC-SSTCODIND = "TYCR"
                OR IC-SSTCODIND = "APAF"
                OR IC-SSTCODIND = "APAR"
                OR IC-SSTCODIND = "APA2"
110422          OR IC-SSTCODIND = "APA3"
241122          OR IC-SSTCODIND = "APA4"
140323          OR IC-SSTCODIND = "APA5"
                OR IC-SSTCODIND = "DLIA"
                OR IC-SSTCODIND = "COIP"
                OR IC-SSTCODIND = "PORM"
100522          OR IC-SSTCODIND = "POR2"
251023          OR IC-SSTCODIND = "POR3"
251023          OR IC-SSTCODIND = "POR4"
251023          OR IC-SSTCODIND = "POR5"
251023          OR IC-SSTCODIND = "POR6"
                OR IC-SSTCODIND = "EELA"
140223          OR IC-SSTCODIND = "TGOL"
271123          OR IC-SSTCODIND = "DLI2"
060524          OR IC-SSTCODIND = "TISC"
210624          OR IC-SSTCODIND = "TISM"
240624          OR IC-SSTCODIND = "TGOC"
280125          OR IC-SSTCODIND = "APA6"
130325          OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               MOVE "G22"  TO FCODPROCED
                              OC-CODICE1
           END-IF.
201022     if (IC-SSTCODIND  = "E109"  or
               IC-SSTCODIND  = "E110"  or
               IC-SSTCODIND  = "E112"  or
               IC-SSTCODIND  = "E107"  or
130123         IC-SSTCODIND  = "E159"  or
               IC-SSTCODIND  = "E160"  or
               IC-SSTCODIND  = "E162"  or
               IC-SSTCODIND  = "E157")
               move  "G24"   to  FCODPROCED
                                 OC-CODICE1
           end-if
200423* inizio
           IF IC-SSTCODIND = "E092"
             IF H-WEBGIOLAV = 95
               MOVE "V02"    to  FCODPROCED OC-CODICE1
             ELSE
               MOVE "V01"    to  FCODPROCED OC-CODICE1
             END-IF
           END-IF.
200423* fine
      *
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED.
      *
           MOVE IC-CODFISARCA    TO FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    FDATAVALUTA
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
      *
           IF FACTREDICESIMA NOT > 0
               MOVE SPACES TO FCODCALCOLO
           END-IF.
      *
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
           MOVE DATA-INI-PAG TO FDATADAL
                                FACDAL.
      *
           MOVE DATA-TER-CAL TO FDATAAL
                                FACAL.
      *
           MOVE 365 TO FGGPERANNO.
      *
           MOVE ZEROES TO FAPGGPREST.
           MOVE PERIODO-TOTALE TO FACGGPREST.
      *
           MOVE ZEROES     TO FAPGGDETRAZ
                              FACGGDETRAZ.
           IF IC-SSTCODIND = "SRPT"
               MOVE PERIODO-TOTALE TO FACGGDETRAZ
               IF FACIMPONIBILE  > 0
               OR FACTREDICESIMA > 0
                   IF FAPIMPONIBILE > 0
                      MOVE "M" TO FCODCALCOLO
                   ELSE
                      MOVE "G" TO FCODCALCOLO
                   END-IF
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       T40-NO-IRPEF.
      *-------------------------------------------------------------*
           MOVE ZEROES TO FACIMPNETTA
                          FAPIMPNETTA
                          FACDAL
                          FACAL
                          FAPDAL
                          FAPAL.
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
           MOVE ZEROES TO FCONGAC
                          FCONGAP
                          FIMPREGAP
                          FIMPREGAC
                          FIMPCOMAP
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
           IF DATA-TERMINE NOT > DATA-TER-CAL
               MOVE 99 TO C-MESERIF
           ELSE
               IF AA-TERMINE = AA-SIS-AMG
               AND MM-TERMINE = MM-SIS-AMG
               AND GG-TERMINE < 16
                   MOVE 99 TO C-MESERIF
               ELSE
                   MOVE MM-SIS-AMG TO C-MESERIF
               END-IF
           END-IF.
           IF IMPORTO-SPETTANTE > 0
               MOVE DATA-TERMINE TO FADFINE
      *                             FACAL
               MOVE SPACES TO FCODCALCOLO
           END-IF.
      *
           MOVE "  "   TO FCODRICH.
           MOVE "G09"  TO FCODPROCED.
      *
           IF DATA-SISTEMA-AMG > 20161231
           AND (   IC-SSTCODIND = "DL76"
                OR IC-SSTCODIND = "TIPO"
                OR IC-SSTCODIND = "TYAD"
                OR IC-SSTCODIND = "TYGM"
                OR IC-SSTCODIND = "TYRG"
                OR IC-SSTCODIND = "TYBL"
                OR IC-SSTCODIND = "TYCR"
                OR IC-SSTCODIND = "APAF"
                OR IC-SSTCODIND = "APAR"
                OR IC-SSTCODIND = "APA2"
110422          OR IC-SSTCODIND = "APA3"
241122          OR IC-SSTCODIND = "APA4"
140323          OR IC-SSTCODIND = "APA5"
                OR IC-SSTCODIND = "DLIA"
                OR IC-SSTCODIND = "COIP"
                OR IC-SSTCODIND = "PORM"
100522          OR IC-SSTCODIND = "POR2"
251023          OR IC-SSTCODIND = "POR3"
251023          OR IC-SSTCODIND = "POR4"
251023          OR IC-SSTCODIND = "POR5"
251023          OR IC-SSTCODIND = "POR6"
                OR IC-SSTCODIND = "EELA"
140223          OR IC-SSTCODIND = "TGOL"
271123          OR IC-SSTCODIND = "DLI2"
060524          OR IC-SSTCODIND = "TISC"
210624          OR IC-SSTCODIND = "TISM"
240624          OR IC-SSTCODIND = "TGOC"
280125          OR IC-SSTCODIND = "APA6"
130325          OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               MOVE "G22"  TO FCODPROCED
                              OC-CODICE1
           END-IF.
201022     if (IC-SSTCODIND  = "E109"  or
               IC-SSTCODIND  = "E110"  or
               IC-SSTCODIND  = "E112"  or
               IC-SSTCODIND  = "E107"  or
130123         IC-SSTCODIND  = "E159"  or
               IC-SSTCODIND  = "E160"  or
               IC-SSTCODIND  = "E162"  or
               IC-SSTCODIND  = "E157")
               move  "G24"   to  FCODPROCED
                                 OC-CODICE1
           end-if
200423* inizio
           IF IC-SSTCODIND = "E092"
             IF H-WEBGIOLAV = 95
               MOVE "V02"    to  FCODPROCED OC-CODICE1
             ELSE
               MOVE "V01"    to  FCODPROCED OC-CODICE1
             END-IF
           END-IF.
200423* fine
      *
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED.
      *
           MOVE IC-CODFISARCA    TO FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    FDATAVALUTA
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
      *
           IF FACTREDICESIMA NOT > 0
               MOVE SPACES TO FCODCALCOLO
           END-IF.
      *
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
           MOVE DATA-INI-PAG TO FDATADAL.
      *                         FACDAL.
      *
           MOVE DATA-TER-CAL TO FDATAAL.
      *                         FACAL.
      *
           MOVE 365 TO FGGPERANNO.
      *
           MOVE ZEROES TO FAPGGPREST.
           MOVE ZEROES TO FACGGPREST.
      *
           MOVE ZEROES     TO FAPGGDETRAZ
                              FACGGDETRAZ.
      *-------------------------------------------------------------*
       T50-13-IRPEF.
      *-------------------------------------------------------------*
           MOVE ZEROES TO FACIMPNETTA
                          FAPIMPNETTA
                          FAPDAL
                          FAPAL.
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
           MOVE ZEROES TO FCONGAC
                          FCONGAP
                          FIMPREGAP
                          FIMPREGAC
                          FIMPCOMAP
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
           IF DATA-TERMINE NOT > DATA-TER-CAL
               MOVE 99 TO C-MESERIF
           ELSE
               IF AA-TERMINE = AA-SIS-AMG
               AND MM-TERMINE = MM-SIS-AMG
               AND GG-TERMINE < 16
                   MOVE 99 TO C-MESERIF
               ELSE
                   MOVE MM-SIS-AMG TO C-MESERIF
               END-IF
           END-IF.
           IF IMPORTO-SPETTANTE > 0
               MOVE DATA-TERMINE TO FADFINE
                                    FACAL
               MOVE IMPORTO-SPETTANTE TO FACIMPONIBILE
               MOVE ZEROES TO FAPIMPONIBILE
               MOVE "A" TO FCODCALCOLO
           END-IF.
      *
           MOVE "  "   TO FCODRICH.
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "TRAD"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               MOVE "G10"  TO FCODPROCED
                              OC-CODICE1
           ELSE
               IF IC-SSTCODIND = "CRED"
                   MOVE "G12"  TO FCODPROCED
                                  OC-CODICE1
               ELSE
                   IF H-TFISCALE = "13"
                       MOVE "G11"  TO FCODPROCED
                                      OC-CODICE1
                   ELSE
                       MOVE "G09"  TO FCODPROCED
                                      OC-CODICE1
                   END-IF
               END-IF
           END-IF.
           IF DATA-SISTEMA-AMG > 20161231
           AND (   IC-SSTCODIND = "DL76"
                OR IC-SSTCODIND = "TIPO"
                OR IC-SSTCODIND = "TYAD"
                OR IC-SSTCODIND = "TYGM"
                OR IC-SSTCODIND = "TYRG"
                OR IC-SSTCODIND = "TYBL"
                OR IC-SSTCODIND = "TYCR"
                OR IC-SSTCODIND = "APAF"
                OR IC-SSTCODIND = "APAR"
                OR IC-SSTCODIND = "APA2"
110422          OR IC-SSTCODIND = "APA3"
241122          OR IC-SSTCODIND = "APA4"
140323          OR IC-SSTCODIND = "APA5"
                OR IC-SSTCODIND = "DLIA"
                OR IC-SSTCODIND = "COIP"
                OR IC-SSTCODIND = "PORM"
100522          OR IC-SSTCODIND = "POR2"
251023          OR IC-SSTCODIND = "POR3"
251023          OR IC-SSTCODIND = "POR4"
251023          OR IC-SSTCODIND = "POR5"
251023          OR IC-SSTCODIND = "POR6"
                OR IC-SSTCODIND = "EELA"
140223          OR IC-SSTCODIND = "TGOL"
271123          OR IC-SSTCODIND = "DLI2"
060524          OR IC-SSTCODIND = "TISC"
210624          OR IC-SSTCODIND = "TISM"
240624          OR IC-SSTCODIND = "TGOC"
280125          OR IC-SSTCODIND = "APA6"
130325          OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               MOVE "G22"  TO FCODPROCED
                              OC-CODICE1
           END-IF.
201022     if (IC-SSTCODIND  = "E109"  or
               IC-SSTCODIND  = "E110"  or
               IC-SSTCODIND  = "E112"  or
               IC-SSTCODIND  = "E107"  or
130123         IC-SSTCODIND  = "E159"  or
               IC-SSTCODIND  = "E160"  or
               IC-SSTCODIND  = "E162"  or
               IC-SSTCODIND  = "E157")
               move  "G24"   to  FCODPROCED
                                 OC-CODICE1
           end-if
200423* inizio
           IF IC-SSTCODIND = "E092"
             IF H-WEBGIOLAV = 95
               MOVE "V02"    to  FCODPROCED OC-CODICE1
             ELSE
               MOVE "V01"    to  FCODPROCED OC-CODICE1
             END-IF
           END-IF.
200423* fine
      *
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED.
      *
           MOVE IC-CODFISARCA    TO FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    FDATAVALUTA
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
      *
           IF FACIMPONIBILE > 0
               MOVE "A" TO FCODCALCOLO
           ELSE
               MOVE SPACES TO FCODCALCOLO
           END-IF.
      *
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
           MOVE DATA-INI-PAG TO DATA-AMG.
           MOVE 01 TO GG-AMG.
           MOVE 01 TO MM-AMG.
           MOVE DATA-AMG TO FDATADAL
                            FACDAL.
           MOVE 31 TO GG-AMG.
           MOVE 12 TO MM-AMG.
           MOVE DATA-AMG TO FDATAAL
                            FACAL.
      *    MOVE DATA-INI-PAG TO FDATADAL
      *                         FACDAL
      *                         FDATAAL
      *                         FACAL.
      *    MOVE "0101" TO FDATADAL(5:4)
      *                   FACDAL(5:4).
      *
      *    MOVE "1231" TO FDATAAL(5:4)
      *                   FACAL(5:4).
      *
           MOVE 365 TO FGGPERANNO.
      *
           MOVE ZEROES TO FAPGGPREST.
           MOVE 365    TO FACGGPREST.
      *
           MOVE ZEROES     TO FAPGGDETRAZ.
           MOVE 365        TO FACGGDETRAZ.
      *-------------------------------------------------------------*
       T60-RA-IRPEF.
      *-------------------------------------------------------------*
200423* inizio
           EVALUATE H-WEBGIOLAV
             WHEN 95  MOVE "V02"   TO FCODPROCED OC-CODICE1
             WHEN OTHER
                      MOVE "G18"   TO FCODPROCED OC-CODICE1
           END-EVALUATE.

200423* fine
           MOVE ZEROES TO FACIMPNETTA
                          FAPIMPNETTA
                          FAPDAL
                          FAPAL.
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
           MOVE ZEROES TO FCONGAC
                          FCONGAP
                          FIMPREGAP
                          FIMPREGAC
                          FIMPCOMAP
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
           IF DATA-TERMINE NOT > DATA-TER-CAL
               MOVE 99 TO C-MESERIF
           ELSE
               IF AA-TERMINE = AA-SIS-AMG
               AND MM-TERMINE = MM-SIS-AMG
               AND GG-TERMINE < 16
                   MOVE 99 TO C-MESERIF
               ELSE
                   MOVE MM-SIS-AMG TO C-MESERIF
               END-IF
           END-IF.
           IF IMPORTO-SPETTANTE > 0
               MOVE DATA-TERMINE TO FADFINE
                                    FACAL
               MOVE IMPORTO-SPETTANTE TO FACIMPONIBILE
               MOVE ZEROES TO FAPIMPONIBILE
               MOVE "A" TO FCODCALCOLO
           END-IF.
      *
           MOVE "  "   TO FCODRICH.
      *
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED.
      *
           MOVE IC-CODFISARCA    TO FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    FDATAVALUTA
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
           MOVE "00"       TO FNUMPRATICA(1:2).
      *
           MOVE IC-CODSEDE TO FCODSEDE.
           MOVE IC-DCOCENOPE TO FCODCENTRO.
      *
           IF FACIMPONIBILE > 0
               MOVE "A" TO FCODCALCOLO
           ELSE
               MOVE SPACES TO FCODCALCOLO
           END-IF.
      *
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
           MOVE DATA-INI-PAG TO DATA-AMG.
           MOVE 01 TO GG-AMG.
           MOVE 01 TO MM-AMG.
           MOVE DATA-AMG TO FDATADAL
                            FACDAL.
           MOVE 31 TO GG-AMG.
           MOVE 12 TO MM-AMG.
           MOVE DATA-AMG TO FDATAAL
                            FACAL.
      *    MOVE DATA-INI-PAG TO FDATADAL
      *                         FACDAL
      *                         FDATAAL
      *                         FACAL.
      *    MOVE "0101" TO FDATADAL(5:4)
      *                   FACDAL(5:4).
      *
      *    MOVE "1231" TO FDATAAL(5:4)
      *                   FACAL(5:4).
      *
           MOVE 365 TO FGGPERANNO.
      *
           MOVE ZEROES TO FAPGGPREST.
           COMPUTE FACGGPREST =
               PERIODO-TOTALE -
                 OC-SSTGGCALC.
      *
           MOVE ZEROES     TO FAPGGDETRAZ.
           MOVE ZEROES     TO FACGGDETRAZ.
      *-------------------------------------------------------------*
       T70-SS-IRPEF.
      *-------------------------------------------------------------*
200423* inizio
           EVALUATE H-WEBGIOLAV
             WHEN 92
             WHEN 93
             WHEN 94  MOVE "V01"   TO FCODPROCED OC-CODICE1
             WHEN OTHER
                      MOVE "G09"   TO FCODPROCED OC-CODICE1
           END-EVALUATE.
200423* fine
      *
           IF DATA-SISTEMA-AMG > 20161231
           AND (   IC-SSTCODIND = "DL76"
                OR IC-SSTCODIND = "TIPO"
                OR IC-SSTCODIND = "TYAD"
                OR IC-SSTCODIND = "TYGM"
                OR IC-SSTCODIND = "TYRG"
                OR IC-SSTCODIND = "TYBL"
                OR IC-SSTCODIND = "TYCR"
                OR IC-SSTCODIND = "APAF"
                OR IC-SSTCODIND = "APAR"
                OR IC-SSTCODIND = "APA2"
110422          OR IC-SSTCODIND = "APA3"
241122          OR IC-SSTCODIND = "APA4"
140323          OR IC-SSTCODIND = "APA5"
                OR IC-SSTCODIND = "DLIA"
                OR IC-SSTCODIND = "COIP"
                OR IC-SSTCODIND = "PORM"
100522          OR IC-SSTCODIND = "POR2"
251023          OR IC-SSTCODIND = "POR3"
251023          OR IC-SSTCODIND = "POR4"
251023          OR IC-SSTCODIND = "POR5"
251023          OR IC-SSTCODIND = "POR6"
                OR IC-SSTCODIND = "EELA"
140223          OR IC-SSTCODIND = "TGOL"
271123          OR IC-SSTCODIND = "DLI2"
060524          OR IC-SSTCODIND = "TISC"
210624          OR IC-SSTCODIND = "TISM"
240624          OR IC-SSTCODIND = "TGOC"
280125          OR IC-SSTCODIND = "APA6"
130325          OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               MOVE "G22"  TO FCODPROCED
                              OC-CODICE1
           END-IF.
201022     if (IC-SSTCODIND  = "E109"  or
               IC-SSTCODIND  = "E110"  or
               IC-SSTCODIND  = "E112"  or
               IC-SSTCODIND  = "E107"  or
130123         IC-SSTCODIND  = "E159"  or
               IC-SSTCODIND  = "E160"  or
               IC-SSTCODIND  = "E162"  or
               IC-SSTCODIND  = "E157")
               move  "G24"   to  FCODPROCED
                                 OC-CODICE1
           end-if
      *
           MOVE ZEROES TO FACIMPNETTA
                          FAPIMPNETTA
                          FACDAL
                          FACAL
                          FAPDAL
                          FAPAL.
           MOVE ZEROES TO FACTREDICESIMA
           MOVE ZEROES TO FIMPPAGA3.
           MOVE SPACES TO FCODPAGA3.
           MOVE ZEROES TO FCONGAC
                          FCONGAP
                          FIMPREGAP
                          FIMPREGAC
                          FIMPCOMAP
                          FIMPCOMAC.
           MOVE IC-DANCCORE TO FCODCOMUN.
           IF DATA-TERMINE NOT > DATA-TER-CAL
               MOVE 99 TO C-MESERIF
           ELSE
               IF AA-TERMINE = AA-SIS-AMG
               AND MM-TERMINE = MM-SIS-AMG
               AND GG-TERMINE < 16
                   MOVE 99 TO C-MESERIF
               ELSE
                   MOVE MM-SIS-AMG TO C-MESERIF
               END-IF
           END-IF.
           IF IMPORTO-SPETTANTE > 0
               MOVE DATA-TERMINE TO FADFINE
                                    FAPAL
               MOVE IMPORTO-SPETTANTE TO FAPIMPONIBILE
               MOVE ZEROES TO FACIMPONIBILE
               MOVE "A" TO FCODCALCOLO
           END-IF.
      *
           MOVE "  "   TO FCODRICH.
      *
           MOVE SPACES TO FKEYPROCED.
           MOVE IC-DCOCODFIS TO FKEYPROCED.
      *
           MOVE IC-CODFISARCA    TO FCODFISCO.
      *
           MOVE DATA-SISTEMA-AMG TO FDATAELAB
                                    FDATAVALUTA
                                    CONTROLLO-2G.
      *
           MOVE IC-DOMANDA TO FNUMPRATICA.
           MOVE "00"       TO FNUMPRATICA(1:2).
      *
           MOVE IC-CODSEDE TO FCODSEDE.
           MOVE IC-DCOCENOPE TO FCODCENTRO.
      *
           IF FACIMPONIBILE > 0
               MOVE "A" TO FCODCALCOLO
           ELSE
               IF FAPIMPONIBILE > 0
                   MOVE "S" TO FCODCALCOLO
               ELSE
                   MOVE SPACES TO FCODCALCOLO
               END-IF
           END-IF.
      *
           MOVE AA-SIS-AMG TO FANNOFISC.
      *
           MOVE DATA-INI-PAG TO DATA-AMG.
           MOVE DATA-AMG TO FDATADAL
                            FAPDAL.
           MOVE DATA-TER-CAL TO FDATAAL
                                FAPAL.
      *    MOVE DATA-INI-PAG TO FDATADAL
      *                         FACDAL
      *                         FDATAAL
      *                         FACAL.
      *    MOVE "0101" TO FDATADAL(5:4)
      *                   FACDAL(5:4).
      *
      *    MOVE "1231" TO FDATAAL(5:4)
      *                   FACAL(5:4).
      *
           MOVE 365 TO FGGPERANNO.
      *
           MOVE ZEROES TO FACGGPREST.
           COMPUTE FAPGGPREST =
               PERIODO-TOTALE -
                 OC-SSTGGCALC.
      *
           MOVE ZEROES     TO FAPGGDETRAZ.
           MOVE ZEROES     TO FACGGDETRAZ.
      *-------------------------------------------------------------*
       B30-RISPONDI.
      *-------------------------------------------------------------*
      **** AGGIORNO TABELLE ****
      *      DATA ELABORAZIONE
           MOVE DATA-SISTEMA-AMG TO OC-DCODTULSP.
      *      DATA ULTIMO PAGAMENTO
           IF DATA-TER-CAL > OC-SSTULASS
               MOVE DATA-TER-CAL TO OC-SSTULASS
           END-IF.
      *      DATA TERMINE PRESTAZIONE
           IF DATA-TERMINE NOT = ZEROES
               IF H-TIPO ="T"
                   MOVE IC-DCODTADEC TO OC-DCODTADEC
               ELSE
                   MOVE DATA-TERMINE TO DATA-AMG
                   PERFORM R10-AGGIUNGI-UNO
                   MOVE DATA-AMG TO OC-DCODTADEC
               END-IF
           END-IF.
      *   SITUAZ. DOMANDA:    "LIQUIDATA"
           IF DEFINIZ NOT > MESE-PREC
           AND DEFINIZ NOT = ZEROES
               MOVE "D" TO OC-DCOULESSP
           ELSE
               MOVE "L" TO OC-DCOULESSP
           END-IF.
           IF IC-SSTCODIND = "TRAD"
               MOVE "D" TO OC-DCOULESSP
           END-IF.
      * 16.01.2020 tentativo per errato calcolo dcodtadec
           IF IC-SSTCODIND = "CRED"
           OR IC-SSTCODIND = "FTAI"
260324     OR IC-SSTCODIND = "FSAI"
              IF O-DCOULESPP NOT = 'D'
                  MOVE "L" TO OC-DCOULESSP
              END-IF
           END-IF.
      * 29.11.2017 correzione per integrazioni di durata altre prestaz.
      *            righe annullate sostituite dalle successive
      *  SOLO PER ASS. EMERG. FONDO CREDITO
      *  Se DEFINITA riempio periodi erogati effettivi
      *    IF ( IC-SSTCODIND = "CRED"
      *        OR IC-SSTCODIND = "FTAI")
      *    AND DEFINIZ >= O-DCODTADEC
      *        IF O-DCODTADEC NOT = 0
      *            MOVE O-DCODTADEC TO OC-PEEPEERED(1)
      *        ELSE
      *            MOVE O-PMEDTRICA TO DATA-AMG
      *            PERFORM R10-AGGIUNGI-UNO
      *            MOVE DATA-AMG TO OC-PEEPEERED(1)
      *        END-IF
      *        MOVE DEFINIZ TO OC-PEEPEEREA(1)
      *        COMPUTE OC-PEENUGIEE(1) = PERIODO-TOTALE -
      *                                  O-PMEINDTOGG
      *    END-IF.
      *
      * 29.11.2017 correzione per integrazioni di durata altre prestaz.
      *            sostituiscono righe precedenti
           IF H-FIGSN = "S"
      *  SOLO PER ASS. EMERG. FONDO CREDITO
      *  Se DEFINITA riempio periodi erogati effettivi
               IF IC-SSTCODIND = "CRED"
                   IF DEFINIZ >= O-DCODTADEC
                   AND DEFINIZ > O-PMEDTRICA
                   AND O-DCOULESPP = 'D'
                       IF O-DCODTADEC NOT = 0
                           MOVE O-DCODTADEC TO OC-PEEPEERED(1)
                       ELSE
                           MOVE O-PMEDTRICA TO DATA-AMG
                           PERFORM R10-AGGIUNGI-UNO
                           MOVE DATA-AMG TO OC-PEEPEERED(1)
                       END-IF
                       MOVE DEFINIZ TO OC-PEEPEEREA(1)
                       IF OC-SSTULASS < DEFINIZ
                           MOVE OC-SSTULASS TO OC-PEEPEEREA(1)
                       END-IF
                       COMPUTE OC-PEENUGIEE(1) = PERIODO-TOTALE -
                                                 O-PMEINDTOGG
                   END-IF
               ELSE
      *  PER ALTRE INTEGRAZIONI DI DURATA
                   IF DEFINIZ >= IC-DCODTDECSP
                       MOVE IC-DCODTDECSP TO OC-PEEPEERED(1)
                       MOVE DEFINIZ     TO OC-PEEPEEREA(1)
                       IF OC-SSTULASS < DEFINIZ
                           MOVE OC-SSTULASS TO OC-PEEPEEREA(1)
                       END-IF
                       MOVE PERIODO-TOTALE TO OC-PEENUGIEE(1)
                   END-IF
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
      * per FTAI come per CRED e altre integr. di importo non ci sono
      * le gg. da pagare
           OR  IC-SSTCODIND = "FTAD"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               IF IC-SSTNUML2 = PERIODO-TOTALE
                   MOVE "D" TO OC-DCOULESSP
               END-IF
           END-IF.
      *
           IF H-TIPO = "T"
           AND PERIODO-TOTALE = H-GGSUSS
               MOVE "D" TO OC-DCOULESSP
           END-IF.
      *
           IF IC-SSTCODIND = "EE27"
           OR IC-SSTCODIND = "EE28"
           OR IC-SSTCODIND = "EE29"
           OR IC-SSTCODIND = "EE30"
           OR IC-SSTCODIND = "EE38"
           OR IC-SSTCODIND = "EE05"
           OR IC-SSTCODIND = "EE10"
           OR IC-SSTCODIND = "EE2A"
           OR IC-SSTCODIND = "EE2B"
           OR IC-SSTCODIND = "EE2C"
           OR IC-SSTCODIND = "EE2D"
           OR IC-SSTCODIND = "EE13"
           OR IC-SSTCODIND = "EE22"
           OR IC-SSTCODIND = "EEMA"
           OR IC-SSTCODIND = "EEZR"
           OR IC-SSTCODIND = "EJ29"
           OR IC-SSTCODIND = "EJ38"
           OR IC-SSTCODIND = "EJ2A"
           OR IC-SSTCODIND = "EJ2B"
           OR IC-SSTCODIND = "EJ2C"
           OR IC-SSTCODIND = "EJ2D"
           OR IC-SSTCODIND = "EJ05"
           OR IC-SSTCODIND = "EJ10"
           OR IC-SSTCODIND = "EJ13"
           OR IC-SSTCODIND = "EK29"
           OR IC-SSTCODIND = "EK38"
           OR IC-SSTCODIND = "EK2A"
           OR IC-SSTCODIND = "EK2B"
           OR IC-SSTCODIND = "EK2C"
           OR IC-SSTCODIND = "EK2D"
           OR IC-SSTCODIND = "EK05"
           OR IC-SSTCODIND = "EK10"
           OR IC-SSTCODIND = "EK13"
           OR IC-SSTCODIND = "EW29"
           OR IC-SSTCODIND = "EW38"
           OR IC-SSTCODIND = "EW2A"
           OR IC-SSTCODIND = "EW2B"
           OR IC-SSTCODIND = "EW2C"
           OR IC-SSTCODIND = "EW2D"
           OR IC-SSTCODIND = "EW05"
           OR IC-SSTCODIND = "EW10"
           OR IC-SSTCODIND = "EW13"
           OR IC-SSTCODIND = "EY29"
           OR IC-SSTCODIND = "EY38"
           OR IC-SSTCODIND = "EY2A"
           OR IC-SSTCODIND = "EY2B"
           OR IC-SSTCODIND = "EY2C"
           OR IC-SSTCODIND = "EY2D"
           OR IC-SSTCODIND = "EY05"
           OR IC-SSTCODIND = "EY10"
           OR IC-SSTCODIND = "EY13"
           OR IC-SSTCODIND = "EY3A"
           OR IC-SSTCODIND = "EX29"
           OR IC-SSTCODIND = "EX38"
           OR IC-SSTCODIND = "EX2A"
           OR IC-SSTCODIND = "EX2B"
           OR IC-SSTCODIND = "EX2C"
           OR IC-SSTCODIND = "EX2D"
           OR IC-SSTCODIND = "EX05"
           OR IC-SSTCODIND = "EX10"
           OR IC-SSTCODIND = "EX13"
           OR IC-SSTCODIND = "EX3A"
           OR IC-SSTCODIND = "EX87"
           OR IC-SSTCODIND = "EX88"
211021     OR IC-SSTCODIND = "EX89"
290322     OR IC-SSTCODIND = "E092"
080722     OR IC-SSTCODIND = "E109"
080722     OR IC-SSTCODIND = "E110"
080722     OR IC-SSTCODIND = "E112"
231122     OR IC-SSTCODIND = "E107"
130123     OR IC-SSTCODIND = "E159"
130123     OR IC-SSTCODIND = "E160"
130123     OR IC-SSTCODIND = "E162"
130123     OR IC-SSTCODIND = "E157"
               IF IC-SSTDADEC = IC-DCODTDECSP
               OR IC-DCODTADEC = IC-DCODTDECSP
               OR OC-SSTULASS >= DEFINIZ
               MOVE "D" TO OC-DCOULESSP
           END-IF.
      * 11.02.2019 COIP
           IF  IC-SSTCODIND = "COIP"
           AND OC-SSTNUML1 > IC-SSTNUML1
               MOVE "L" TO OC-DCOULESSP
           END-IF.
      *
           MOVE ZEROES TO OC-SSTCONG730.
           MOVE ZEROES TO OC-IMPORTO2.
           MOVE SPACES TO OC-CODICE2.
      *
      *  SE NON VI E' INDENNITA' DA PAGARE AGGIORNO CAMPI RELATIVI
      *  SOLO SE LA DOMANDA VIENE DEFINITA
      *
           IF IMPORTO-SPETTANTE > 0
           OR OC-DCOULESSP = "D"
               MOVE WK-RECUPEROUL-E TO OC-RECIMUREE-1
               MOVE WK-RESIDUO-E    TO OC-RECTORERE-1
      * 11.07.2017 gestione acconto
               MOVE WK-ACCONTOUL-E TO OC-RECIMUREE-3
               MOVE WK-RESIDUOACC-E    TO OC-RECTORERE-3
      *
      *      GIORNATE INDENNIZZATE
               MOVE PERIODO-TOTALE TO OC-SSTGGCALC
               IF H-TFISCALE = "13"
                   MOVE ZEROES TO OC-SSTGGCALC
               END-IF
      ***** DELLE DUE L'UNA
      *      IMPORTO TOTALE CORRISPOSTO
               IF IC-SSTCODIND = "TRAC"
               OR IC-SSTCODIND = "TRAF"
               OR IC-SSTCODIND = "TRAS"
               OR IC-SSTCODIND = "TRAP"
      *        OR IC-SSTCODIND = "CRED"
      *        OR  IC-SSTCODIND = "FTMD"
               OR  IC-SSTCODIND = "FTSO"
               OR  IC-SSTCODIND = "FTCG"
               OR  IC-SSTCODIND = "FTCD"
               OR  IC-SSTCODIND = "FTCC"
               OR  IC-SSTCODIND = "FTPL"
      *        OR  IC-SSTCODIND = "FTAI"
      *        OR  IC-SSTCODIND = "FTAD"
100424         OR  IC-SSTCODIND = "FTCI"
                 IF IMPORTO-TOTALE > (OC-SSTIMINT + OC-SSTNUML1)
                   COMPUTE OC-SSTIMINT = IMPORTO-TOTALE - OC-SSTNUML1
                 END-IF
               ELSE
                   IF IMPORTO-TOTALE > OC-SSTIMINT
                       MOVE IMPORTO-TOTALE TO OC-SSTIMINT
                   END-IF
               END-IF
      *      ULTIMO IMPORTO CORRISPOSTO
               IF IMPORTO-SPETTANTE >= 0
                   MOVE IMPORTO-SPETTANTE TO OC-SSTIMINU
      * 11.07.2017 gestione acconto
      * 12.07.2017
100325*            ADD OC-RECIMUREE-3     TO OC-SSTIMINU
      *
                   ADD TRA-SIND           TO OC-SSTIMINU
                   MOVE 0                 TO OC-SSTINDEB
               ELSE
                   MOVE 0                 TO OC-SSTIMINU
                   COMPUTE OC-SSTINDEB = - IMPORTO-SPETTANTE
      *            IF OC-SSTIMINT <= OC-SSTNUML1
      *                MOVE 0 TO OC-SSTINDEB
      *            END-IF
               END-IF
      *      IMPORTO TOTALE PER ANTICIPAZIONE
               IF  IMPORTO-R > 0
               AND IMPORTO-R > OC-SSTIMRIN
                   MOVE IMPORTO-R TO OC-SSTIMRIN
               END-IF
      *      ULTIMO IMPORTO CORRISPOSTO PER ANTICIPAZIONE
               MOVE ULTIMO-IMP-R TO OC-SSTIMRINU
               ADD TRA-SIND-R    TO OC-SSTIMRINU
      *      ULTIMO RECUPERO SU ANTICIPAZIONE
      * correttivo per FTMD FTAD h_sstrecrin contiene contrib. correlata
               IF ULTIMO-IMP-R > 0
                   MOVE RECUPERO-R TO OC-SSTRECRIN
               END-IF
      *      TRATTENUTE SINDACALI
               COMPUTE OC-SSTTRASIND = TRA-SIND + TRA-SIND-R
               MOVE TRA-SIND-R TO OC-SSTTRASINR
      * SOMME CORRISPOSTE NELL'ANNO
               ADD TRA-SIND TO TOT-TRA-SIND
               ADD TRA-SIND-R TO TOT-TRA-SIND
               IF IMPORTO-SPETTANTE > 0
                   ADD IMPORTO-SPETTANTE TO TOT-IMPORTI
                   IF TRA-SIND > 0
                       ADD TRA-SIND TO TOT-IMPORTI
                   END-IF
               END-IF
      *
               IF ULTIMO-IMP-R > 0
                   ADD ULTIMO-IMP-R TO TOT-IMPORTI
                   IF TRA-SIND-R > 0
                       ADD TRA-SIND-R TO TOT-IMPORTI
                   END-IF
               END-IF
      *
               COMPUTE OC-SSTIRPEFU = FACIMPNETTA +
                                      FAPIMPNETTA
      *  valide per operazioni di conguaglio fiscale
               MOVE FCONGAP TO OC-SSTCONGFIS
               ADD  FCONGAC TO OC-SSTCONGFIS
               MOVE FIMPREGAP TO OC-SSTADDIZR
               MOVE FIMPCOMAP TO OC-SSTADDIZC
               MOVE FIMPREGAC TO OC-SSTADDIZRR
               MOVE FIMPCOMAC TO OC-SSTADDIZRC
      *  fine
      *      CODICI SINDACATO
               IF OC-SSTTRASIND > 0
               AND (   IC-DSICODSIN NUMERIC
                    OR IC-DSICATSIN NUMERIC )
                   MOVE IC-DSICODSIN TO OC-SSTTSCONF
                   MOVE IC-DSICATSIN TO OC-SSTTSCAT
               ELSE
                   MOVE ZEROES TO OC-SSTTRASIND
                                  OC-SSTTRASINR
                                  OC-SSTTSCONF
                                  OC-SSTTSCAT
               END-IF
           ELSE
               MOVE ZEROES TO OC-SSTIMINU
               MOVE ZEROES TO OC-RECIMUREE-1
      * 11.07.2017 gestione acconto
               MOVE ZEROES TO OC-RECIMUREE-3
      *
               MOVE ZEROES TO OC-SSTTRASIND
                              OC-SSTTRASINR
                              OC-SSTTSCONF
                              OC-SSTTSCAT
                              OC-SSTIRPEFU
      *  valide per operazioni di conguaglio fiscale
               MOVE ZEROES    TO OC-SSTCONGFIS
               MOVE ZEROES    TO OC-SSTADDIZR
               MOVE ZEROES    TO OC-SSTADDIZC
               MOVE ZEROES    TO OC-SSTADDIZRR
               MOVE ZEROES    TO OC-SSTADDIZRC
      *  fine
           END-IF.
      *      ULTIMO IMPORTO CORRISPOSTO  ANF
           MOVE IMPORTO-ANF-U TO OC-SSTIMANFU.
      *      ULTIMO RECUPERO ANF
           MOVE ULTIMO-RECU-ANF TO OC-RECIMUREE-2.
      *   SITUAZ. DOMANDA:    "LIQUIDATA"
           IF DEFINIZ NOT > MESE-PREC
           AND DEFINIZ NOT = ZEROES
               MOVE "D" TO OC-DCOULESSP
           ELSE
               MOVE "L" TO OC-DCOULESSP
           END-IF.
      *
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
      *    OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
               IF IC-SSTNUML2 = PERIODO-TOTALE
                   MOVE "D" TO OC-DCOULESSP
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "TRAD"
               MOVE "D" TO OC-DCOULESSP
           END-IF.
      *
           IF H-TIPO = "T"
           AND PERIODO-TOTALE = H-GGSUSS
               MOVE "D" TO OC-DCOULESSP
           END-IF.
      * 11.02.2019 COIP
           IF  IC-SSTCODIND = "COIP"
           AND OC-SSTNUML1 > IC-SSTNUML1
               MOVE "L" TO OC-DCOULESSP
           END-IF.
      *
      **** RISPONDO AL CHIAMANTE ****
           IF IMPORTO-SPETTANTE > 0
           OR ULTIMO-IMP-R > 0
      *
      *        COMPUTE WK-NETTO =
      *              (IMPORTO-SPETTANTE +
      *               ULTIMO-IMP-R      -
      *               FACIMPNETTA       -
      *               FAPIMPNETTA       -
      *               FCONGAC           -
      *               FIMPREGAP         -
      *               FIMPREGAC         -
      *               FIMPCOMAP         -
      *               FIMPCOMAC)
      *        IF WK-NETTO > 9.99
      *        AND FCONGAP > (WK-NETTO - 10.00)
      *            COMPUTE FCONGAP = WK-NETTO - 10.00
      *            MOVE FCONGAP TO OC-SSTCONGFIS
      *            ADD  FCONGAC TO OC-SSTCONGFIS
      *        END-IF
      *
               COMPUTE WK-NETTO =
                     (IMPORTO-SPETTANTE +
                      ULTIMO-IMP-R      -
                      FACIMPNETTA       -
                      FAPIMPNETTA)
120515*               FCONGAC)
               IF WK-NETTO > 9.99
               AND FCONGAP > (WK-NETTO - 10.00)
                   COMPUTE FCONGAP = WK-NETTO - 10.00
                   MOVE FCONGAP TO OC-SSTCONGFIS
120515*            ADD  FCONGAC TO OC-SSTCONGFIS
               END-IF
      *
               COMPUTE WK-NETTO =
                     (IMPORTO-SPETTANTE +
                      ULTIMO-IMP-R      -
                      FACIMPNETTA       -
                      FAPIMPNETTA       -
120515*               FCONGAC           -
                      FCONGAP)
               IF WK-NETTO > 9.99
               AND FIMPREGAP > (WK-NETTO - 10.00)
                   COMPUTE FIMPREGAP = WK-NETTO - 10.00
                   MOVE FIMPREGAP TO OC-SSTADDIZR
               END-IF
      *
               COMPUTE WK-NETTO =
                     (IMPORTO-SPETTANTE +
                      ULTIMO-IMP-R      -
                      FACIMPNETTA       -
                      FAPIMPNETTA       -
120515*               FCONGAC           -
                      FCONGAP           -
                      FIMPREGAP)
               IF WK-NETTO > 9.99
               AND FIMPREGAC > (WK-NETTO - 10.00)
                   COMPUTE FIMPREGAC = WK-NETTO - 10.00
                   MOVE FIMPREGAC TO OC-SSTADDIZRR
               END-IF
      *
               COMPUTE WK-NETTO =
                     (IMPORTO-SPETTANTE +
                      ULTIMO-IMP-R      -
                      FACIMPNETTA       -
                      FAPIMPNETTA       -
120515*               FCONGAC           -
                      FCONGAP           -
                      FIMPREGAP         -
                      FIMPREGAC)
               IF WK-NETTO > 9.99
               AND FIMPCOMAP > (WK-NETTO - 10.00)
                   COMPUTE FIMPCOMAP = WK-NETTO - 10.00
                   MOVE FIMPCOMAP TO OC-SSTADDIZC
               END-IF
      *
               COMPUTE WK-NETTO =
                     (IMPORTO-SPETTANTE +
                      ULTIMO-IMP-R      -
                      FACIMPNETTA       -
                      FAPIMPNETTA       -
120515*               FCONGAC           -
                      FCONGAP           -
                      FIMPREGAP         -
                      FIMPREGAC         -
                      FIMPCOMAP)
               IF WK-NETTO > 9.99
               AND FIMPCOMAC > (WK-NETTO - 10.00)
                   COMPUTE FIMPCOMAC = WK-NETTO - 10.00
                   MOVE FIMPCOMAC TO OC-SSTADDIZRC
               END-IF
      *
120515         COMPUTE WK-NETTO =
120515               (IMPORTO-SPETTANTE +
120515                ULTIMO-IMP-R      -
120515                FACIMPNETTA       -
120515                FAPIMPNETTA       -
120515                FCONGAP           -
120515                FIMPREGAP         -
120515                FIMPREGAC         -
120515                FIMPCOMAP         -
120515                FIMPCOMAC)
120515         IF WK-NETTO > 9.99
120515         AND FCONGAC > (WK-NETTO - 10.00)
120515             COMPUTE FCONGAC  = WK-NETTO - 10.00
120515             MOVE FCONGAC  TO OC-SSTCONGFIS
120515         END-IF
           END-IF.
      *
           IF        (IMPORTO-SPETTANTE +
                  ULTIMO-IMP-R          -
                  FACIMPNETTA           -
                  FAPIMPNETTA           -
                  FCONGAC               -
                  FCONGAP               -
                  FIMPREGAP             -
                  FIMPREGAC             -
                  FIMPCOMAP             -
                  FIMPCOMAC)                   > 2.00
           OR IMPORTO-ANF-U                    > 2.00
               IF (   IC-SSTCODIND = "TYGM"
                   OR IC-SSTCODIND = "DL76"
                   OR IC-SSTCODIND = "TIPO"
                   OR IC-SSTCODIND = "TYAD"
                   OR IC-SSTCODIND = "TYRG"
                   OR IC-SSTCODIND = "TYBL"
                   OR IC-SSTCODIND = "TYCR"
                   OR IC-SSTCODIND = "APAF"
                   OR IC-SSTCODIND = "APAR"
                   OR IC-SSTCODIND = "APA2"
110422             OR IC-SSTCODIND = "APA3"
241122             OR IC-SSTCODIND = "APA4"
140323             OR IC-SSTCODIND = "APA5"
                   OR IC-SSTCODIND = "DLIA"
                   OR IC-SSTCODIND = "COIP"
                   OR IC-SSTCODIND = "BRIO"
                   OR IC-SSTCODIND = "PORM"
100522             OR IC-SSTCODIND = "POR2"
251023             OR IC-SSTCODIND = "POR3"
251023             OR IC-SSTCODIND = "POR4"
251023             OR IC-SSTCODIND = "POR5"
251023             OR IC-SSTCODIND = "POR6"
                   OR IC-SSTCODIND = "EELA"
140223             OR IC-SSTCODIND = "TGOL"
271123             OR IC-SSTCODIND = "DLI2"
060524             OR IC-SSTCODIND = "TISC"
210624             OR IC-SSTCODIND = "TISM"
240624             OR IC-SSTCODIND = "TGOC"
280125             OR IC-SSTCODIND = "APA6"
130325             OR IC-SSTCODIND = "TGOV"
140325          OR IC-SSTCODIND = "TYGP"
300725          OR IC-SSTCODIND = "TGOS"
241025          OR IC-SSTCODIND = "TGOP"
150426          OR IC-SSTCODIND = "TIRA"
150426          OR IC-SSTCODIND = "PIAC"
                                        )
               AND IC-SSTNUML2 > 0
               AND (IC-SSTNUML1 / IC-SSTNUML2) > 500
                   INITIALIZE AREA2A
                   INITIALIZE AREA2B
                   INITIALIZE AREA2C
                   MOVE 02 TO OC-RETCODE
                   MOVE "NON ELABORATA PER IMPORTO ECCESSIVO"
                     TO OC-MESSAGGIO
               ELSE
                   MOVE 00 TO OC-RETCODE
                   PERFORM B50-SCRIVI-PAG
               END-IF
           ELSE
               INITIALIZE AREA2A
               INITIALIZE AREA2B
               INITIALIZE AREA2C
               IF (DEFINIZ NOT > MESE-PREC
                   AND DEFINIZ NOT = ZEROES)
               OR OC-DCOULESSP = "D"
                   MOVE 01 TO OC-RETCODE
               ELSE
                   MOVE 02 TO OC-RETCODE
                   MOVE "NON ELABORATA PER CALCOLO = 0"
                     TO OC-MESSAGGIO
               END-IF
           END-IF.
      ****
           IF OC-RETCODE = 0
           OR OC-RETCODE = 1
               IF IMPORTO-SPETTANTE > 0
               OR OC-FADNETTOPAG > 0
               OR (DEFINIZ NOT > MESE-PREC
                   AND DEFINIZ NOT = ZEROES)
                       PERFORM B60-SCRIVI-ASU
               ELSE
                   MOVE ZEROES TO OC-CODFIS
                   MOVE SPACES TO OC-NOMEENTE
               END-IF
           END-IF.
      *
050421     IF IC-SSTCODIND = "EW29"
           OR IC-SSTCODIND = "EW38"
           OR IC-SSTCODIND = "EW2A"
           OR IC-SSTCODIND = "EW2B"
           OR IC-SSTCODIND = "EW2C"
           OR IC-SSTCODIND = "EW2D"
           OR IC-SSTCODIND = "EW05"
           OR IC-SSTCODIND = "EW10"
           OR IC-SSTCODIND = "EW13"
           OR IC-SSTCODIND = "EY29"
           OR IC-SSTCODIND = "EY38"
           OR IC-SSTCODIND = "EY2A"
           OR IC-SSTCODIND = "EY2B"
           OR IC-SSTCODIND = "EY2C"
           OR IC-SSTCODIND = "EY2D"
           OR IC-SSTCODIND = "EY05"
           OR IC-SSTCODIND = "EY10"
           OR IC-SSTCODIND = "EY13"
           OR IC-SSTCODIND = "EY3A"
               IF OC-SSTIMINT < 1600
               AND OC-SSTIMINT > 0
                   MOVE "L" TO OC-DCOULESSP
               END-IF
           END-IF.
      *
220621     IF IC-SSTCODIND = "EX29"
           OR IC-SSTCODIND = "EX38"
           OR IC-SSTCODIND = "EX2A"
           OR IC-SSTCODIND = "EX2B"
           OR IC-SSTCODIND = "EX2C"
           OR IC-SSTCODIND = "EX2D"
           OR IC-SSTCODIND = "EX05"
           OR IC-SSTCODIND = "EX10"
           OR IC-SSTCODIND = "EX13"
           OR IC-SSTCODIND = "EX3A"
               IF OC-SSTIMINT < 1600
               AND OC-SSTIMINT > 0
                   MOVE "L" TO OC-DCOULESSP
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       B50-SCRIVI-PAG.
      *-------------------------------------------------------------*
           MOVE DATA-INI-AC  TO FADINIZIO.
           MOVE DATA-TER-CAL TO FADFINE.
           IF IC-DCODTDECSP > FADINIZIO
               MOVE IC-DCODTDECSP TO FADINIZIO
           END-IF.
           IF IC-SSTCODIND = "TRAD"
           OR H-TIPO = "T"
               MOVE DATA-INIZIO  TO FADINIZIO
           END-IF.
      *
           IF FACDAL NOT NUMERIC
               MOVE ZEROES TO FACDAL
           END-IF.
           IF FACAL NOT NUMERIC
               MOVE ZEROES TO FACAL
           END-IF.
           IF FAPDAL NOT NUMERIC
               MOVE ZEROES TO FAPDAL
           END-IF.
           IF FAPAL NOT NUMERIC
               MOVE ZEROES TO FAPAL
           END-IF.
      * correzione 19.02.2018
           IF FAPIMPNETTA > 0
               MOVE IC-DCODTDECSP TO FADINIZIO
           END-IF.
      *
           IF FACIMPNETTA > 0
               IF FADINIZIO < WK-DATADAL
                   MOVE WK-DATADAL TO FACDAL
               ELSE
                   MOVE FADINIZIO TO FACDAL
               END-IF
               MOVE FADFINE   TO FACAL
               IF FACDAL > FACAL
                   MOVE WK-DATADAL TO FACDAL
               END-IF
           END-IF.
           IF FAPIMPNETTA > 0
031122         IF IC-SSTCODIND = "FTAI"
260324         OR IC-SSTCODIND = "FSAI"
031122           AND DATA-INIZIO > FAPDAL
031122              continue
031122         ELSE
                 MOVE DATA-INIZIO TO FAPDAL
031122         END-IF
               IF IC-SSTCODIND = "TRAD"
               OR H-TFISCALE = "SS"
                   MOVE DATA-TER-CAL TO FAPAL
               ELSE
                   MOVE WK-FAPAL     TO FAPAL
               END-IF
               IF IC-SSTCODIND = "TRAC"
               AND IC-SSTIMRIN NOT = 0
                   MOVE 20100101   TO FAPDAL
                   MOVE 20101130   TO FAPAL
               END-IF
               IF (    IC-SSTCODIND = "FTCG"
                    OR IC-SSTCODIND = "FTCD"
                    OR IC-SSTCODIND = "FTCC"
100424              OR IC-SSTCODIND = "FTCI" )
               AND IC-SSTIMRIN NOT = 0
210222*            MOVE 20200101   TO FAPDAL
210222*            MOVE 20201130   TO FAPAL
210222             COMPUTE WK-ANNODAL = AA-SIS-AMG - 1
210222             MOVE 01         TO WK-MESEDAL
210222             MOVE 01         TO WK-GIORNODAL
210222             MOVE WK-DATADAL TO FAPDAL
210222             COMPUTE WK-ANNOPAL = AA-SIS-AMG - 1
210222             MOVE 11         TO WK-MESEPAL
210222             MOVE 30         TO WK-GIORNOPAL
210222             MOVE WK-FAPAL   TO FAPAL
               END-IF
           END-IF.
      *
           IF ULTIMO-IMP-R > 0
               MOVE TERMINE-R TO FADFINE
                                 FACAL
           END-IF.
      *
           COMPUTE FADANFPAGATI = IMPORTO-ANF-U.
      *
           MOVE REC-ANF-X-ASS TO FADRECSUANF.
           MOVE REC-IND-X-ASS TO FADRECSUIND.
           ADD  RECUPERO-R TO FADRECSUIND.
      * 11.07.2017 gestione acconto
           MOVE ZEROES TO FIMPPAGA1.
           MOVE SPACE TO FCODPAGA1.
           IF REC-ACC-X-ASS > 0
               MOVE REC-ACC-X-ASS TO FIMPPAGA1
               MOVE 'ACC'         TO FCODPAGA1
           END-IF.
      *
           COMPUTE FADTRATSIND =
                   TRA-SIND    +
                   TRA-SIND-R.
      *
           COMPUTE FADNETTOPAG = IMPORTO-ANF-U.
           IF IMPORTO-SPETTANTE > 0
           OR ULTIMO-IMP-R      > 0
               COMPUTE FADNETTOPAG = FADNETTOPAG       +
                                     IMPORTO-SPETTANTE +
                                     ULTIMO-IMP-R      -
                                     FACIMPNETTA       -
                                     FAPIMPNETTA       -
                                     FCONGAC           -
                                     FCONGAP           -
                                     FIMPREGAP         -
                                     FIMPREGAC         -
                                     FIMPCOMAP         -
                                     FIMPCOMAC         -
                                     OC-IMPORTO2
100325                            -  OC-RECIMUREE-3
      **************************
      * rimborso trattenute eseguite applicando la gestione separata
      **************************
      *    ELSE
      *        IF IC-SSTCODIND = "TYGM"
      *            COMPUTE FADNETTOPAG = FADNETTOPAG   -
      *                              FACIMPNETTA
      *        END-IF
      **************************
      **************************
           END-IF.
      ********
      * soltanto per il pagamento degli arretrati ROMA EUR
      *    IF IC-CODSEDE NOT = 7001
      *    OR IC-SSTCODIND NOT = "TRAC"
      ********
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
           IF RIMB-ISOLA = 0
      * 10.08.2020
           AND FCODPROCED = "G10"
      *    AND (   FCODPROCED = "G10"
      *         OR FCODPROCED = "G12"
      *         OR FCODPROCED = "G22")
      *    AND H-TFISCALE = "CD"
               IF MM-SIS-AMG = 08
               OR MM-SIS-AMG = 09
201017***** Sospensione chiamata POPWMAIN ultimi giorni del mese
      ***** valutare se sospendere ogni mese ultimi 2 giorni
               OR  MM-SIS-AMG  = 10
      *        OR  (MM-SIS-AMG  = 10
      *             and GG-SIS-AMG NOT = 30
      *             and GG-SIS-AMG NOT = 31)
               OR  MM-SIS-AMG  = 11
241023         OR  MM-SIS-AMG  = 12
      *        OR  MM-SIS-AMG  = 01
                   PERFORM B70-730
               END-IF
           END-IF.
      *
           IF FADINIZIO > FADFINE
               MOVE DATA-INIZIO TO FADINIZIO
           END-IF.
      *
           IF FACDAL > FACAL
               MOVE DATA-INIZIO TO FACDAL
           END-IF.
      *
           IF FACIMPONIBILE   = 0
           AND FACTREDICESIMA = 0
           AND FAPIMPONIBILE  = 0
               MOVE ZEROES TO FACDAL
                              FACAL
                              FACTREDICESIMA
                              FACIMPLORDA
                              FACGGDETRAZ
                              FACIMPDETRAZ
                              FAPDAL
                              FAPAL
                              FAPGGPREST
                              FAPTREDICESIMA
                              FAPALIQMEDIA
                              FAPIMPLORDA
                              FAPGGDETRAZ
                              FAPIMPDETRAZ
           END-IF.
      ********
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
           IF RIMB-ISOLA NOT = 0
           AND IC-SSTNUML1 = 0
               MOVE RIMB-ISOLA TO FIMPPAGA1
               MOVE "SNI" TO FCODPAGA1
           END-IF.
      ********
      * ESENTASSE
           IF H-TFISCALE = "NO"
               MOVE DATA-INI-PAG TO FDATADAL
      *                             FACDAL
               MOVE DATA-TER-CAL TO FDATAAL
      *                             FACAL
      *25032020
               COMPUTE FIMPPAGA1 = IMPORTO-SPETTANTE + FADTRATSIND
      *        MOVE IMPORTO-SPETTANTE TO FIMPPAGA1
               MOVE "SNI" TO FCODPAGA1
           END-IF.
      * ART.13 TUIR
           IF H-TFISCALE = "13"
               MOVE ZEROES TO FACGGPREST
               MOVE ZEROES TO FACGGDETRAZ
               MOVE DATA-INI-PAG TO DATA-AMG
               MOVE 01 TO GG-AMG
               MOVE 01 TO MM-AMG
               MOVE DATA-AMG TO FADINIZIO
                                FACDAL
                                FDATADAL
               MOVE 31 TO GG-AMG
               MOVE 12 TO MM-AMG
               MOVE DATA-AMG TO FADFINE
                                FACAL
                                FDATAAL
      *        MOVE DATA-INI-PAG TO FADINIZIO
      *                             FADFINE
      *                             FACDAL
      *                             FACAL
      *                             FDATADAL
      *                             FDATAAL
      *        MOVE "0101" TO FADINIZIO(5:4)
      *                       FACDAL(5:4)
      *                       FDATADAL(5:4)
      *        MOVE "1231" TO FADFINE(5:4)
      *                       FACAL(5:4)
      *                       FDATAAL(5:4)
           END-IF.
      *-------------------------------------------------------------*
           MOVE FGGPERANNO     TO OC-FGGPERANNO.
           MOVE FACDAL         TO OC-FACDAL.
           MOVE FACAL          TO OC-FACAL.
           MOVE FACGGPREST     TO OC-FACGGPREST.
           MOVE FACIMPONIBILE  TO OC-FACIMPONIBILE.
           MOVE FACTREDICESIMA TO OC-FACTREDICESIMA.
           MOVE FACIMPLORDA    TO OC-FACIMPLORDA.
           MOVE FACGGDETRAZ    TO OC-FACGGDETRAZ.
           MOVE FACIMPDETRAZ   TO OC-FACIMPDETRAZ.
           MOVE FACIMPNETTA    TO OC-FACIMPNETTA.
           MOVE FAPDAL         TO OC-FAPDAL.
           MOVE FAPAL          TO OC-FAPAL.
           MOVE FAPGGPREST     TO OC-FAPGGPREST.
           MOVE FAPIMPONIBILE  TO OC-FAPIMPONIBILE.
           MOVE FAPTREDICESIMA TO OC-FAPTREDICESIMA.
           MOVE FAPALIQMEDIA   TO OC-FAPALIQMEDIA.
           MOVE FAPIMPLORDA    TO OC-FAPIMPLORDA.
           MOVE FAPGGDETRAZ    TO OC-FAPGGDETRAZ.
           MOVE FAPIMPDETRAZ   TO OC-FAPIMPDETRAZ.
           MOVE FAPIMPNETTA    TO OC-FAPIMPNETTA.
           MOVE FADINIZIO      TO OC-FADINIZIO.
           MOVE FADFINE        TO OC-FADFINE.
           MOVE FADANFPAGATI   TO OC-FADANFPAGATI.
           MOVE FADRECSUANF    TO OC-FADRECSUANF.
           MOVE FADRECSUIND    TO OC-FADRECSUIND.
           MOVE FADTRATSIND    TO OC-FADTRATSIND.
           MOVE FADNETTOPAG    TO OC-FADNETTOPAG.
           MOVE FCONGAC        TO OC-FCONGAC.
           MOVE FCONGAP        TO OC-FCONGAP.
           MOVE FIMPREGAC      TO OC-FIMPREGAC.
           MOVE FIMPREGAP      TO OC-FIMPREGAP.
           MOVE FCODCOMUN      TO OC-FCODCOMUN.
           MOVE FIMPCOMAC      TO OC-FIMPCOMAC.
           MOVE FIMPCOMAP      TO OC-FIMPCOMAP.
           MOVE FIMPPROAC      TO OC-FIMPPROAC.
           MOVE FIMPPROAP      TO OC-FIMPPROAP.
           MOVE FCODPAGA1      TO OC-FCODPAGA1.
           MOVE FIMPPAGA1      TO OC-FIMPPAGA1.
           MOVE FCODPAGA2      TO OC-FCODPAGA2.
           MOVE FIMPPAGA2      TO OC-FIMPPAGA2.
           MOVE FCODPAGA3      TO OC-FCODPAGA3.
           MOVE FIMPPAGA3      TO OC-FIMPPAGA3.
           MOVE FACIMPDETRFAM  TO OC-FACIMPDETRFAM.
           MOVE FACIMPDETRLAV  TO OC-FACIMPDETRLAV.
           IF H-TFISCALE = "CS"
           OR IC-SSTALFL1(1:1) = "N"
           OR IC-SSTCODIND = "SSIS"
      *    OR IC-SSTCODIND = "CRED"
               MOVE 0 TO    FACGGDETRAZ
                         OC-FACGGDETRAZ
      * aggiunto fapggdetraz per addendum lazio TYAD
               MOVE 0 TO    FAPGGDETRAZ
                         OC-FAPGGDETRAZ
           END-IF.
      *-------------------------------------------------------------*
       B60-SCRIVI-ASU.
      *-------------------------------------------------------------*
      * ASU      ( tabella ENTI )
           MOVE IC-PROGCTG TO OC-CODFIS.
           MOVE IC-SSTREGIND TO WK-REGIND.
           MOVE IC-SSTANNIND TO WK-ANNIND.
           STRING IC-SSTCODIND DELIMITED BY SIZE
                  REDEF-REGIND DELIMITED BY SIZE
                  REDEF-ANNIND DELIMITED BY SIZE
             INTO OC-NOMEENTE.
           MOVE 0       TO OC-FLAGT
                           OC-NUMASU
                           OC-NUMMOB
                           OC-NUMCIG
                           OC-CFPRINC
                           OC-CONVDATA
                           OC-CONVALDA
                           OC-CONVALA
                           OC-IMPIND
                           OC-PERCMAT.
           MOVE SPACES  TO OC-SITUAZ
                           OC-NOMEFIN
                           OC-CAMPO.
      * ASU2
           MOVE IC-PROGCTG  TO OC-CODFISD.
           MOVE 1        TO OC-ANNODELIB.
           MOVE 1        TO OC-NUMDELIB.
           MOVE 20040101 TO OC-ASUINID.
           MOVE 20991231 TO OC-ASUFIND.
           MOVE 20040101 TO OC-DATADELIB.
           MOVE 0        TO OC-CODFIND
                            OC-PAGFINOA
                            OC-DATAREND
                            OC-FLAGTD.
           MOVE SPACES  TO OC-SITUAZD
                           OC-FLAGELAB
                           OC-CAMPOD.
      * ASU7
           MOVE IC-PROGCTG      TO OC-CFENTEL.
           MOVE 1               TO OC-ANNODELIBL.
           MOVE 1               TO OC-NUMDELIBL
           MOVE 0               TO OC-CODFINL.
      * ASU8
      * ASU9
           MOVE IC-PROGCTG      TO OC-CFENTEP.
           MOVE 1               TO OC-ANNODELIBP.
           MOVE 1               TO OC-NUMDELIBP.
           MOVE OC-DCODTULSP    TO OC-DATAPAGP.
           MOVE OC-SSTULASS     TO OC-DATAULPAG.
           IF OC-SSTULASS = 0
               MOVE IC-CALCOLOAL TO OC-DATAULPAG
           END-IF.
           COMPUTE OC-IMPASUF = ( OC-SSTIMINU    +
      * 11.07.2017 gestione acconto
      *                           OC-RECIMUREE-3 +
      *
                                  OC-RECIMUREE-1   ) *
                                  100.
           MOVE ZEROES      TO OC-IMPASUE
                               OC-IMPMATE
                               OC-IMPANFE
                               OC-IMPMATF
                               OC-IMPANFF.
      ********
      * PROGETTO ISOLA: pagamento € 500 rimborso spese
           MOVE 0 TO OC-IMPANFF.
           IF IC-SSTCODIND = "SSIS"
           AND FIMPPAGA1 NOT = 0
           AND FCODPAGA1 = "SNI"
               COMPUTE OC-IMPANFF = FIMPPAGA1 * 100
      *        COMPUTE OC-IMPASUF = OC-IMPASUF - OC-IMPANFF
           END-IF.
      ********
           IF H-TFISCALE = "NO"
               COMPUTE OC-IMPASUF = FIMPPAGA1 * 100
           END-IF.
      ********
      * correttivo per FTMD FTAD h_sstrecrin contiene contrib. correlata
           IF OC-SSTIMRINU > 0
               COMPUTE APP-ANTICIPO = (OC-SSTIMRINU    +
                                       OC-SSTTRASINR   +
                                       OC-SSTRECRIN)   *
                                                    100
               IF OC-SSTRECRIN > 0
                   COMPUTE     OC-IMPASUF =
                               OC-IMPASUF -
                       (OC-SSTRECRIN * 100)
               END-IF
           END-IF.
           MOVE APP-ANTICIPO TO OC-CAMPOP(11:10).
      * modifica 06.03.2012 correzione calcolo indebito per TDSPAG
           IF OC-SSTINDEB > 0
               COMPUTE OC-IMPASUF =
               - (OC-SSTINDEB - IC-SSTINDEB) * 100
           END-IF.
      *
      * ASU9 PERIODI
           MOVE 0               TO OC-COD1.
           MOVE IC-DCODTDECSP   TO OC-DATADAL1.
      *
           MOVE IC-DCODTADEC TO DATA-AMG.
           PERFORM R00-TOGLI-UNO.
           MOVE DATA-AMG        TO OC-DATAAL1.
      *
           MOVE ZEROES TO OC-COD2   OC-DATADAL2   OC-DATAAL2
                          OC-COD3   OC-DATADAL3   OC-DATAAL3
                          OC-COD4   OC-DATADAL4   OC-DATAAL4
                          OC-COD5   OC-DATADAL5   OC-DATAAL5
                          OC-COD6   OC-DATADAL6   OC-DATAAL6
                          OC-COD7   OC-DATADAL7   OC-DATAAL7
                          OC-COD8   OC-DATADAL8   OC-DATAAL8
                          OC-COD9   OC-DATADAL9   OC-DATAAL9
                          OC-COD10  OC-DATADAL10  OC-DATAAL10.
      *-------------------------------------------------------------*
       B70-730.
      *-------------------------------------------------------------*
           MOVE ZEROES TO OC-SSTCONG730.
      *                           LK-730FILL1.
      *-------------------------------------------------------------*
           MOVE SPACES    TO OC-CODICE2.
           MOVE ZEROES    TO OC-IMPORTO2.
      * 20072020
           IF WK-CONGUAGLIO-730 > 0
               IF FADNETTOPAG > 10.00
                   COMPUTE OC-SSTCONG730 = FADNETTOPAG - 10.00
                   IF OC-SSTCONG730 > WK-CONGUAGLIO-730
                       MOVE WK-CONGUAGLIO-730 TO OC-SSTCONG730
                   END-IF
                   COMPUTE FADNETTOPAG = FADNETTOPAG - OC-SSTCONG730
                   MOVE "730" TO OC-CODICE2
                   MOVE OC-SSTCONG730 TO OC-IMPORTO2
               END-IF
      *    ELSE
      *        MOVE WK-CONGUAGLIO-730 TO OC-SSTCONG730
      *        COMPUTE FADNETTOPAG = FADNETTOPAG - OC-SSTCONG730
      *        MOVE "730" TO OC-CODICE2
      *        MOVE OC-SSTCONG730 TO OC-IMPORTO2
           END-IF.
      * 20072020 asteriscato tutto il seguito
      *    MOVE ZE OES    TO REC-SEDE-IN.
      *    MOVE ZEROES    TO REC-ANNO-IN.
      *    MOVE ZEROES    TO REC-RATA-IN.
      *    MOVE SPACES    TO REC-CODICE-FISCALE-IN.
      *    MOVE ZEROES    TO REC-IMPORTO-MASSIMO-IN.
      *    MOVE ZEROES    TO REC-IMPORTO-TRATTATO-IN.
      *    MOVE ZEROES    TO REC-DATA-IN.
      *    MOVE ZEROES    TO TIPO-RICHIESTA-IN-5.
      *    MOVE SPACES    TO REC-NUMERO-PRATICA-IN.
      *    MOVE ZEROES    TO REC-PROGRESSIVO-PRATICA-IN.
      *    MOVE SPACES    TO REC-PROCEDURA-CHIAMANTE-IN.
      *    MOVE SPACES    TO REC-CHIAVE-RESTART-IN.
      *    MOVE SPACES    TO REC-UTENZA.
      *    MOVE SPACES    TO REC-RIELABORA.
      *
      *    IF FADNETTOPAG > 10.00
      *        MOVE IC-CODFISARCA  TO REC-CODICE-FISCALE-IN
      *        MOVE FDATAELAB(5:2) TO REC-RATA-IN
      *        MOVE FDATAELAB(1:4) TO REC-ANNO-IN
      *        IF IC-SSTCODIND = "TRAC"
      *        OR IC-SSTCODIND = "TRAF"
      *        OR IC-SSTCODIND = "TRAS"
      *        OR IC-SSTCODIND = "TRAP"
      *        OR IC-SSTCODIND = "TRAD"
      *        OR  IC-SSTCODIND = "FTMD"
      *        OR  IC-SSTCODIND = "FTSO"
      *        OR  IC-SSTCODIND = "FTCG"
      *        OR  IC-SSTCODIND = "FTCD"
      *        OR  IC-SSTCODIND = "FTCC"
      *        OR  IC-SSTCODIND = "FTPL"
      *        OR  IC-SSTCODIND = "FTAI"
      *        OR  IC-SSTCODIND = "FTAD"
      *            MOVE "G10"  TO REC-PROCEDURA-CHIAMANTE-IN
      *        ELSE
      *            IF IC-SSTCODIND = "CRED"
      *                MOVE "G12"  TO REC-PROCEDURA-CHIAMANTE-IN
      *            ELSE
      *                IF H-TFISCALE = "13"
      *                    MOVE "G11"  TO REC-PROCEDURA-CHIAMANTE-IN
      *                ELSE
      *                    MOVE "G09"  TO REC-PROCEDURA-CHIAMANTE-IN
      *                END-IF
      *            END-IF
      *        END-IF
      *        IF DATA-SISTEMA-AMG > 20161231
      *        AND (   IC-SSTCODIND = "DL76"
      *             OR IC-SSTCODIND = "TIPO"
      *             OR IC-SSTCODIND = "TYAD"
      *             OR IC-SSTCODIND = "TYGM"
      *             OR IC-SSTCODIND = "TYRG"
      *             OR IC-SSTCODIND = "TYBL"
      *             OR IC-SSTCODIND = "TYCR"
      *             OR IC-SSTCODIND = "APAF"
      *             OR IC-SSTCODIND = "APAR"
      *             OR IC-SSTCODIND = "APA2"
      *             OR IC-SSTCODIND = "DLIA"
      *             OR IC-SSTCODIND = "COIP"
      *             OR IC-SSTCODIND = "PORM"
      *             OR IC-SSTCODIND = "EELA" )
      *            MOVE "G22"  TO FCODPROCED
      *                           OC-CODICE1
      *        END-IF
      *        MOVE FDATAELAB      TO REC-DATA-IN
      *        COMPUTE REC-IMPORTO-MASSIMO-IN = FADNETTOPAG - 10.00
      *        MOVE IC-CODSEDE     TO REC-SEDE-IN
      *        MOVE IC-DCOCENOPE   TO REC-SEDE-IN(5:2)
      *
      *        IF IC-CHIAMANTE = "SIMULAZI"
      *           MOVE  013           TO TIPO-RICHIESTA-IN-5
      *        ELSE
      *           MOVE  014           TO TIPO-RICHIESTA-IN-5
      *        END-IF
      *
      *        MOVE  0             TO REC-IMPORTO-RECUPERATO-SIN
      *        MOVE  "000000"      TO RETCODE-00
      *
   GGA*        CALL POPCF61 USING LK-730
      *    EXEC CICS LINK PROGRAM('POPWMAIN')                           03050003
      *                  COMMAREA(AREA-POPSIN)                          03050003
      *    END-EXEC                                                     03050003
      *
      * 101401 NON SONO STATI ANCORA CARICATI I DATI DEI 730
      * 101402 L'ASSISTITO NON HA PENDENZE 730
      * 101403 SONO STATE BLOCCATE LE PENDENZE 730 DELL'ASSISTITO
      *
      *        IF RETCODE-00  = "101401"   OR
      *                       = "101402"   OR
      *                       = "101403"
      *           MOVE  0       TO REC-IMPORTO-RECUPERATO-SIN
      *        END-IF
      * SALTA PROVVISORIAMENTE PER BYPASSARE ERRORE
      *        MOVE "000000" TO RETCODE-00
      *****
      *        IF RETCODE-00   NOT = "000000" AND
      *                        NOT = "101401" AND
      *                        NOT = "101402" AND
      *                        NOT = "101403" AND
      *           IC-CHIAMANTE NOT = "SIMULAZI"
      *            MOVE 23 TO OC-RETCODE
      *            STRING DRETCODE-00 " - " RETCODE-00
      *                   DELIMITED BY SIZE INTO OC-MESSAGGIO
      *            GOBACK
      *        ELSE
      *            IF REC-IMPORTO-RECUPERATO-SIN > 0
      *                MOVE REC-IMPORTO-RECUPERATO-SIN TO OC-SSTCONG730
      *                MOVE "730" TO OC-CODICE2
      *                MOVE REC-IMPORTO-RECUPERATO-SIN TO OC-IMPORTO2
      *                COMPUTE FADNETTOPAG = FADNETTOPAG -
      *                                      REC-IMPORTO-RECUPERATO-SIN
      *            END-IF
      *        END-IF
      *    END-IF.
      *-------------------------------------------------------------*
       M20-CALCOLA-PERIODO.
      *-------------------------------------------------------------*
      * gestione ANF
           IF H-ANFSN = "S"
           AND IC-ANFDTDEVA(1) NOT = ZEROES
               MOVE "S" TO FLAG-ANF
           ELSE
               MOVE "N" TO FLAG-ANF
           END-IF.
      *
           MOVE 0 TO PERIODO-TOTALE.
           MOVE 0 TO IMPORTO-TOTALE.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE 0 TO PERIODO-ANF.
           MOVE 0 TO IMPORTO-ANF.
           MOVE DATA-INIZIO  TO LK-DATA1.
           MOVE DATA-TER-CAL TO LK-DATA2.
      *
           IF (IC-SSTCODIND = "PARM"
               OR IC-SSTCODIND = "SARV"
               OR IC-SSTCODIND = "WTWM")
           AND IC-SSTALFL1(2:1) = "S"
               PERFORM M31-NON-SCORRERE
           ELSE
               PERFORM M30-SCORRI-SOSPENSIONI
           END-IF
      *
           MOVE WPERIODO TO PERIODO-TOTALE.
           MOVE WIMPORTO TO IMPORTO-TOTALE.
      *-------------------------------------------------------------*
       C30-CALCOLA-PERIODO.
      *-------------------------------------------------------------*
           IF IC-SSTCODIND = "CRED"
           AND O-DCOCOTIDO = "U"
               MOVE 728 TO IC-GGSUSS
           END-IF.
           MOVE 0 TO PERIODO-TOTALE.
           MOVE 0 TO IMPORTO-TOTALE.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE 0 TO WK-PER-SPET.
           MOVE DATA-INIZIO  TO LK-DATA1.
           MOVE DATA-TER-CAL TO LK-DATA2.
      *
           IF O-DCOULESPP = "L"
      *    periodo corrispondente a DS
               MOVE O-PMEINDTOGG TO WPERIODO
               COMPUTE WIMPORTO ROUNDED  =
                         (WPERIODO       *
                          WK-IMP-MENSILE /
                          30             )
           ELSE
               MOVE O-PMEDTRICA  TO DATA-AMG
               PERFORM R10-AGGIUNGI-UNO
               MOVE DATA-AMG TO LK-DATA1
               PERFORM M30-SCORRI-SOSPENSIONI
      *
               ADD O-PMEINDTOGG TO WPERIODO
               IF WPERIODO > IC-GGSUSS
                   MOVE IC-GGSUSS TO WPERIODO
               END-IF
      *
               COMPUTE WIMPORTO ROUNDED  =
                         (WPERIODO       *
                          WK-IMP-MENSILE /
                          30             )
      * 22.05.2018
      * per integraz. di importo CRED se presente anticipazione naspi
      * dopo termine naspi calcolo detraendo importo giornaliero antic.
               IF O-AASIMPORTO > 0
                   CALL RDSUT20 USING
                                      WDFHEIBLK      WDFHCOMMAREA
                                      LK-DATA1
                                      LK-DATA2
                                      WK-PER-SPET
                   IF WK-PER-SPET > WPERIODO
                       COMPUTE WK-PER-SPET = WK-PER-SPET - WPERIODO
                       COMPUTE WIMPORTO =                   WIMPORTO +
                       (IC-SSTRETRORA - (O-AASIMPORTO / O-AASGGSPE)) *
                                                         WK-PER-SPET
                       ADD WK-PER-SPET TO WPERIODO
                   END-IF
               END-IF
           END-IF
      *
           MOVE WPERIODO TO PERIODO-TOTALE.
           MOVE WIMPORTO TO IMPORTO-TOTALE.
      * 10.01.2018
           IF IMPORTO-TOTALE > O-PMEINDTOTE
               SUBTRACT O-PMEINDTOTE FROM IMPORTO-TOTALE
           ELSE
               MOVE 0 TO IMPORTO-TOTALE
           END-IF.
      *-------------------------------------------------------------*
       C31-CALCOLA-PERIODO-RIP.
      *-------------------------------------------------------------*
           IF IC-SSTCODIND = "CRED"
           AND O-DCOCOTIDO = "U"
               MOVE 728 TO IC-GGSUSS
           END-IF.
           MOVE 0 TO PERIODO-TOTALE.
           MOVE 0 TO IMPORTO-TOTALE.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE DATA-INIZIO  TO LK-DATA1.
           MOVE DATA-TER-CAL TO LK-DATA2.
      *
           PERFORM M35-SCORRI-SOSPENSIONI-DS.
           PERFORM M30-SCORRI-SOSPENSIONI.
      *
           IF WPERIODO > IC-GGSUSS
               MOVE IC-GGSUSS TO WPERIODO
           END-IF.
      *
           COMPUTE WIMPORTO ROUNDED      =
                     (WPERIODO           *
                      WK-IMP-MENSILE /
                      30                 ).
      *
           MOVE WPERIODO TO PERIODO-TOTALE.
           MOVE WIMPORTO TO IMPORTO-TOTALE.
      * 10.01.2018
           IF IMPORTO-TOTALE > O-PMEINDTOTE
               SUBTRACT O-PMEINDTOTE FROM IMPORTO-TOTALE
           ELSE
               MOVE 0 TO IMPORTO-TOTALE
           END-IF.
      *-------------------------------------------------------------*
       F30-CALCOLA-PERIODO.
      *-------------------------------------------------------------*
           IF (IC-SSTCODIND = "FTAI"
               OR IC-SSTCODIND = "FSAI")
           AND O-DCOCOTIDO = "U"
               MOVE 728 TO IC-GGSUSS
           END-IF.
           MOVE 0 TO PERIODO-TOTALE.
           MOVE 0 TO IMPORTO-TOTALE.
           MOVE 0 TO WPERIODO.
           MOVE 0 TO WIMPORTO.
           MOVE 0 TO WK-PER-SPET.
           MOVE DATA-INIZIO  TO LK-DATA1.
           MOVE DATA-TER-CAL TO LK-DATA2.
      * calcolo integrazione per periodo corrispondente a DS
           MOVE O-PMEINDTOGG TO WPERIODO.
           COMPUTE WIMPORTO ROUNDED  =
                     (WPERIODO       *
                      WK-IMP-MENSILE /
                      30             ).
      *    DISPLAY 'ELENA18 WIMPORTO : ' WIMPORTO
      * per integraz. di importo FTAI se presente anticipazione naspi
      * dopo termine naspi calcolo detraendo importo giornaliero antic.
      *    DISPLAY 'ELENA18 O-AASIMPORTO:  ' O-AASIMPORTO
           IF O-AASIMPORTO > 0
               CALL RDSUT20 USING
                                  WDFHEIBLK      WDFHCOMMAREA
                                  LK-DATA1
                                  LK-DATA2
                                  WK-PER-SPET
               IF WK-PER-SPET > WPERIODO
                   COMPUTE WK-PER-SPET = WK-PER-SPET - WPERIODO
                   COMPUTE WIMPORTO =                   WIMPORTO +
                   (IC-SSTRETRORA - (O-AASIMPORTO / O-AASGGSPE)) *
                                                     WK-PER-SPET
                   ADD WK-PER-SPET TO WPERIODO
               END-IF
           END-IF.
      *
           MOVE WPERIODO TO PERIODO-TOTALE.
           MOVE WIMPORTO TO IMPORTO-TOTALE.
      *    DISPLAY 'ELENA18 PERIODO-TOTALE: ' PERIODO-TOTALE
      *    DISPLAY 'ELENA18 IMPORTO-TOTALE: ' IMPORTO-TOTALE
      *    DISPLAY 'ELENA18 O-PMEINDTOTE  : ' O-PMEINDTOTE
      * 10.01.2018
161122     IF (IC-SSTCODIND = "FTAI" OR IC-SSTCODIND = "FSAI")
161122         and O-PMEINDUIME < 0
161122*per sottrarre l'ultimo importo negativo al totale, devo aggiun-
161122*gere
161122       ADD O-PMEINDUIME   TO O-PMEINDTOTE
             IF IMPORTO-TOTALE > O-PMEINDTOTE
               SUBTRACT O-PMEINDTOTE FROM IMPORTO-TOTALE
               IF O-PMEINDUIME < 0
160123*inserita IF per gestire FTAI indebita su naspi parzialmente
160123*indebita
160123           IF OC-SSTIMINT > IMPORTO-TOTALE
160123             continue
160123           ELSE
161122*            SUBTRACT O-PMEINDUIME FROM IMPORTO-TOTALE
161122             ADD O-PMEINDUIME   TO IMPORTO-TOTALE
                 END-IF
               END-IF
             ELSE
                MOVE 0 TO IMPORTO-TOTALE
             END-IF
           ELSE
             IF IMPORTO-TOTALE > O-PMEINDTOTE
                 SUBTRACT O-PMEINDTOTE FROM IMPORTO-TOTALE
                 IF O-PMEINDUIME < 0
                     SUBTRACT O-PMEINDUIME FROM IMPORTO-TOTALE
                 END-IF
             ELSE
                 MOVE 0 TO IMPORTO-TOTALE
             END-IF
           END-IF.
      *-------------------------------------------------------------*
       M30-SCORRI-SOSPENSIONI.
      *-------------------------------------------------------------*
           MOVE ZEROES TO WK-PER-SPET
                          IMPORTO-ANF
                          PERIODO-ANF
                          PERIODO-ANF-DEC.
           MOVE 1 TO IND-SOS.
           PERFORM UNTIL IND-SOS > 400
                      OR IC-SOSDTINSOS(IND-SOS) = 0
                      OR LK-DATA1 > DATA-TER-CAL
               IF IC-SOSDTINSOS(IND-SOS) > LK-DATA1
                   MOVE IC-SOSDTINSOS(IND-SOS) TO DATA-AMG
                   PERFORM R00-TOGLI-UNO
                   IF DATA-TER-CAL < DATA-AMG
                       MOVE DATA-TER-CAL TO LK-DATA2
                   ELSE
                       MOVE DATA-AMG TO LK-DATA2
                   END-IF
                   CALL RDSUT20 USING
                                      WDFHEIBLK  WDFHCOMMAREA
                                      LK-DATA1
                                      LK-DATA2
                                      WK-PER-SPET
                   ADD WK-PER-SPET TO WPERIODO
      * gestione ANF
                   IF FLAG-ANF = "S"
                       PERFORM M40-ANF
                   END-IF
      *
               END-IF
               IF IC-SOSDTFISOS(IND-SOS) = 0
                   MOVE DATA-TER-CAL TO DATA-AMG
                   PERFORM R10-AGGIUNGI-UNO
                   MOVE DATA-AMG TO LK-DATA1
               ELSE
                   MOVE IC-SOSDTFISOS(IND-SOS) TO DATA-AMG
                   PERFORM R10-AGGIUNGI-UNO
                   IF DATA-AMG > LK-DATA1
                       MOVE DATA-AMG TO LK-DATA1
                   END-IF
               END-IF
               ADD 1 TO IND-SOS
           END-PERFORM.
           IF LK-DATA1 NOT > DATA-TER-CAL
               MOVE DATA-TER-CAL TO LK-DATA2
               CALL RDSUT20 USING
                                  WDFHEIBLK  WDFHCOMMAREA
                                  LK-DATA1
                                  LK-DATA2
                                  WK-PER-SPET
               ADD WK-PER-SPET TO WPERIODO
      * gestione ANF
               IF FLAG-ANF = "S"
                   PERFORM M40-ANF
               END-IF
      *
           END-IF.
           EVALUATE IC-SSTCODIND
             WHEN "TRAC"
      *26032019  IF WPERIODO > IC-SSTNUML2
                      MOVE IC-SSTNUML2 TO WPERIODO
      *          END-IF
             WHEN "TRAF"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "TRAS"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "FTMD"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "FTSO"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "FTCG"
      *26032019  IF WPERIODO > IC-SSTNUML2
                     MOVE IC-SSTNUML2 TO WPERIODO
      *          END-IF
             WHEN "FTCD"
      *          IF WPERIODO > IC-SSTNUML2
                     MOVE IC-SSTNUML2 TO WPERIODO
      *          END-IF
             WHEN "FTCC"
      *          IF WPERIODO > IC-SSTNUML2
                     MOVE IC-SSTNUML2 TO WPERIODO
      *          END-IF
             WHEN "FTPL"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
      *      WHEN "FTAI"
      *        IF WPERIODO > IC-SSTNUML2
      *            MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "FTAD"
270324       WHEN "FSAD"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "TYGM"
140325       WHEN "TYGP"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "TIPO"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "DL76"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "TYRG"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "TYBL"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "TYCR"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "RATA"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "RATM"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "TEIG"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
             WHEN "APAF"
140223       WHEN "TGOL"
271123       WHEN "DLI2"
060524       WHEN "TISC"
210624       WHEN "TISM"
240624       WHEN "TGOC"
130325       WHEN "TGOV"
300725       WHEN "TGOS"
241025       WHEN "TGOP"
             WHEN "APAR"
241025       WHEN "TIRA"
241025       WHEN "PIAC"
                   MOVE IC-SSTNUML2 TO WPERIODO
             WHEN "APA2"
110422       WHEN "APA3"
241122       WHEN "APA4"
140323       WHEN "APA5"
280125       WHEN "APA6"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "DLIA"
             WHEN "DLI2"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "COIP"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "BRIO"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "PORM"
100522       WHEN "POR2"
251023       WHEN "POR3"
251023       WHEN "POR4"
251023       WHEN "POR5"
251023       WHEN "POR6"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "EELA"
      *        IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
      *        END-IF
             WHEN "TYAD"
               IF WPERIODO > IC-SSTNUML2
                   MOVE IC-SSTNUML2 TO WPERIODO
               END-IF
100424       WHEN "FTCI"
100424               MOVE IC-SSTNUML2 TO WPERIODO
             WHEN OTHER
      *      anche in caso Fondo Volo codice "TRAP"
               IF (   IC-SSTCODIND = "CRED"
                   OR IC-SSTCODIND = "FTAI"
260324             OR IC-SSTCODIND = "FSAI")
               AND O-DCOCOTIDO = "U"
                   MOVE 728 TO IC-GGSUSS
               END-IF
               IF WPERIODO > IC-GGSUSS
                   MOVE IC-GGSUSS TO WPERIODO
               END-IF
           END-EVALUATE.
      *
           EVALUATE IC-SSTCODIND
             WHEN "SBFC"
      * 2 mensilità € 350 + 4 mensilità € 240
               IF WPERIODO > 60
                   COMPUTE WIMPORTO ROUNDED  =
                                   (350 * 2) +
                           ( (WPERIODO - 60) *
                                         240 /
                                          30 )
               ELSE
                   COMPUTE WIMPORTO ROUNDED  =
                                  (WPERIODO  *
                                        350  /
                                         30  )
               END-IF
             WHEN "SSPV"
      * 3 mensilità € 200 + 1 mensilità € 400
               IF WPERIODO > 90
                   COMPUTE WIMPORTO ROUNDED  =
                                   (200 * 3) +
                           ( (WPERIODO - 90) *
                                         400 /
                                          30 )
               ELSE
                   COMPUTE WIMPORTO ROUNDED  =
                                  (WPERIODO  *
                                        200  /
                                         30  )
               END-IF
      * correzione Garanzia Giovani
             WHEN "TYGM"
140325       WHEN "TYGP"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "TIPO"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "DL76"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "TYAD"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "TYRG"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "TYBL"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "TYCR"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "APAF"
140223       WHEN "TGOL"
060524       WHEN "TISC"
210624       WHEN "TISM"
240624       WHEN "TGOC"
130325       WHEN "TGOV"
300725       WHEN "TGOS"
241025       WHEN "TGOP"
150426       WHEN "TIRA"
150426       WHEN "PIAC"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "APAR"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "APA2"
110422       WHEN "APA3"
241122       WHEN "APA4"
140323       WHEN "APA5"
280125       WHEN "APA6"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "DLIA"
271123       WHEN "DLI2"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "COIP"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "BRIO"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "PORM"
100522       WHEN "POR2"
251023       WHEN "POR3"
251023       WHEN "POR4"
251023       WHEN "POR5"
251023       WHEN "POR6"
                 MOVE IC-SSTNUML1 TO WIMPORTO
             WHEN "EELA"
                 MOVE IC-SSTNUML1 TO WIMPORTO
      * fine correzione
             WHEN OTHER
               COMPUTE WIMPORTO ROUNDED  =
                         (WPERIODO       *
                          WK-IMP-MENSILE /
                          30             )
           END-EVALUATE.
      *-------------------------------------------------------------*
       M35-SCORRI-SOSPENSIONI-DS.
      *-------------------------------------------------------------*
           MOVE  'E30-DB2-FETCH' TO  WABNDB-LABEL.
      *
           MOVE I-DCOCOSEGR TO H-SOSCOSEDE.
           MOVE I-DCOCHIDOM TO H-SOSCHIDOM.
      *
           EXEC SQL
                 OPEN CURSOS
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSOSPE=' DCLTDSSOSPE
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'OPEN   '     TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
               MOVE 16 TO OC-RETCODE
               MOVE "ERRORE SOSPENSIONI DS"
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      *
           EXEC SQL
                 FETCH CURSOS
                  INTO
                   :H-SOSCOSEDE,
                   :H-SOSCODFIS,
                   :H-SOSDTINSOS,
                   :H-SOSCHIDOM,
                   :H-SOSDTFISOS,
                   :H-SOSCODSOS,
                   :H-SOSDTCOM
           END-EXEC.
      *
           PERFORM UNTIL SQLCODE NOT = ZERO
                      OR LK-DATA1 > DATA-TER-CAL
               IF H-SOSDTINSOS > LK-DATA1
                   MOVE H-SOSDTINSOS TO DATA-AMG
                   PERFORM R00-TOGLI-UNO
                   IF DATA-TER-CAL < DATA-AMG
                       MOVE DATA-TER-CAL TO LK-DATA2
                   ELSE
                       MOVE DATA-AMG TO LK-DATA2
                   END-IF
                   CALL RDSUT20 USING
                                      WDFHEIBLK  WDFHCOMMAREA
                                      LK-DATA1
                                      LK-DATA2
                                      WK-PER-SPET
                   ADD WK-PER-SPET TO WPERIODO
               END-IF
               IF H-SOSDTFISOS          = 0
                   MOVE DATA-TER-CAL TO DATA-AMG
                   PERFORM R10-AGGIUNGI-UNO
                   MOVE DATA-AMG TO LK-DATA1
               ELSE
                   MOVE H-SOSDTFISOS TO DATA-AMG
                   PERFORM R10-AGGIUNGI-UNO
                   IF DATA-AMG > LK-DATA1
                       MOVE DATA-AMG TO LK-DATA1
                   END-IF
               END-IF
      *
               EXEC SQL
                     FETCH CURSOS
                      INTO
                       :H-SOSCOSEDE,
                       :H-SOSCODFIS,
                       :H-SOSDTINSOS,
                       :H-SOSCHIDOM,
                       :H-SOSDTFISOS,
                       :H-SOSCODSOS,
                       :H-SOSDTCOM
               END-EXEC
      *
           END-PERFORM.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
               DISPLAY 'DCLTDSSOSPE=' DCLTDSSOSPE
               MOVE 'TDSSOSPE'    TO  WABNDB-TABL
               MOVE 'FETCH '      TO  WABNDB-FUNC
               PERFORM ERRORE-SQL
               MOVE 16 TO OC-RETCODE
               MOVE "ERRORE SOSPENSIONI DS"
                 TO OC-MESSAGGIO
               GOBACK
           END-IF.
      *
           EXEC SQL
                 CLOSE CURSOS
           END-EXEC.
      *-------------------------------------------------------------*
       M31-NON-SCORRERE.
      *-------------------------------------------------------------*
      *    MOVE IC-GGSUSS TO WPERIODO.
           CALL RDSUT20 USING
                              WDFHEIBLK  WDFHCOMMAREA
                              LK-DATA1
                              LK-DATA2
                              WK-PER-SPET
           ADD WK-PER-SPET TO WPERIODO.
      * gestione ANF
           IF FLAG-ANF = "S"
               PERFORM M40-ANF
           END-IF.
      *
           IF (   IC-SSTCODIND = "CRED"
               OR IC-SSTCODIND = "FTAI"
260324         OR IC-SSTCODIND = "FSAI")
           AND O-DCOCOTIDO = "U"
               MOVE 728 TO IC-GGSUSS
           END-IF.
      *
           IF WPERIODO > IC-GGSUSS
               MOVE IC-GGSUSS TO WPERIODO
           END-IF.
      *
           COMPUTE WIMPORTO ROUNDED  =
                     (WPERIODO       *
                      WK-IMP-MENSILE /
                      30             ).
      * correzione Garanzia Giovani
           IF IC-SSTCODIND = "TYGM"
           OR IC-SSTCODIND = "TIPO"
           OR IC-SSTCODIND = "DL76"
           OR IC-SSTCODIND = "TYAD"
           OR IC-SSTCODIND = "TYRG"
           OR IC-SSTCODIND = "TYBL"
           OR IC-SSTCODIND = "TYCR"
           OR IC-SSTCODIND = "APAF"
           OR IC-SSTCODIND = "APAR"
           OR IC-SSTCODIND = "APA2"
110422     OR IC-SSTCODIND = "APA3"
241122     OR IC-SSTCODIND = "APA4"
140323     OR IC-SSTCODIND = "APA5"
           OR IC-SSTCODIND = "DLIA"
           OR IC-SSTCODIND = "COIP"
           OR IC-SSTCODIND = "BRIO"
           OR IC-SSTCODIND = "PORM"
100522     OR IC-SSTCODIND = "POR2"
251023     OR IC-SSTCODIND = "POR3"
251023     OR IC-SSTCODIND = "POR4"
251023     OR IC-SSTCODIND = "POR5"
251023     OR IC-SSTCODIND = "POR6"
           OR IC-SSTCODIND = "EELA"
140223     OR IC-SSTCODIND = "TGOL"
271123     OR IC-SSTCODIND = "DLI2"
060524     OR IC-SSTCODIND = "TISC"
210624     OR IC-SSTCODIND = "TISM"
240624     OR IC-SSTCODIND = "TGOC"
280125     OR IC-SSTCODIND = "APA6"
130325     OR IC-SSTCODIND = "TGOV"
140325     OR IC-SSTCODIND = "TYGP"
300725     OR IC-SSTCODIND = "TGOS"
241025     OR IC-SSTCODIND = "TGOP"
150426     OR IC-SSTCODIND = "TIRA"
150426     OR IC-SSTCODIND = "PIAC"
                 MOVE IC-SSTNUML2 TO WPERIODO
                 MOVE IC-SSTNUML1 TO WIMPORTO
           END-IF.
      * fine correzione
      *-------------------------------------------------------------*
      * gestione ANF
       M40-ANF.
      *-------------------------------------------------------------*
           MOVE 1 TO IND-ANF.
           MOVE ZEROES TO WK-PER-SPET.
           PERFORM UNTIL IND-ANF > 21
               MOVE IC-ANFIMPGIOR(IND-ANF) TO IMP-GIO-ANF
               MOVE IC-ANFDTDEVA(IND-ANF) TO WK-DATA1
               IF IND-ANF = 21
               OR IC-ANFDTDEVA(IND-ANF + 1) = 0
                   MOVE IC-ANFDTDEVA(IND-ANF) TO WK-DATA2
                   IF WK-MM2 < 07
                       MOVE 06 TO WK-MM2
                       MOVE 30 TO WK-GG2
                   ELSE
                       MOVE 06 TO WK-MM2
                       MOVE 30 TO WK-GG2
                       COMPUTE WK-AA2 = WK-AA2 + 1
                   END-IF
               ELSE
                   MOVE IC-ANFDTDEVA(IND-ANF + 1) TO DATA-AMG
                   PERFORM R00-TOGLI-UNO
                   MOVE DATA-AMG TO WK-DATA2
               END-IF
      *
               IF LK-DATA1 > WK-DATA1
                   MOVE LK-DATA1 TO WK-DATA1
               END-IF
               IF LK-DATA2 < WK-DATA2
                   MOVE LK-DATA2 TO WK-DATA2
               END-IF

260422*inizio correttivo per entrata in vigore A.U.
               IF (IC-ANFFIGMIN(IND-ANF) > 0 OR
                    (IC-ANFFIGMIN(IND-ANF) = 0 AND
                     IC-ANFPREINV(IND-ANF) = 'S' AND
                     IC-ANFTIPINV(IND-ANF) = 'F'))
                 IF WK-DATA1   > 20220228
                   initialize WK-DATA2
                 ELSE
                   IF WK-DATA2  > 20220228
                     MOVE 20220228   TO WK-DATA2
                   END-IF
                 END-IF
               END-IF
260422*fine
               IF WK-DATA2 >= WK-DATA1
                   PERFORM M41-CALCOLA-ANF
               END-IF
               ADD 1 TO IND-ANF
           END-PERFORM.
      *-------------------------------------------------------------*
      * gestione ANF
       M41-CALCOLA-ANF.
      *-------------------------------------------------------------*
           CALL RDSUT20 USING
                              WDFHEIBLK  WDFHCOMMAREA
                              WK-DATA1
                              WK-DATA2
                              WK-PER-SPET.
      *
           COMPUTE WK-PER-SPET-ANF = (WK-PER-SPET / 30) * 26.
           ADD WK-PER-SPET-ANF TO PERIODO-ANF-DEC.
      * correttivo per periodo massimo
           IF PERIODO-ANF-DEC > ((IC-GGSUSS * 26) / 30)
               COMPUTE PERIODO-ANF-DEC =((IC-GGSUSS * 26) / 30)
           END-IF.
      *
           COMPUTE WK-PER-SPET ROUNDED = PERIODO-ANF-DEC -
                                         PERIODO-ANF.
           ADD WK-PER-SPET TO PERIODO-ANF.
           COMPUTE  IMPORTO-ANF ROUNDED  =
                          IMPORTO-ANF    +
                         (WK-PER-SPET    *
                          IMP-GIO-ANF    ).
      *-------------------------------------------------------------*
       T20-CALCOLA-PERIODO.
      *-------------------------------------------------------------*
           IF DATA-TER-CAL NOT < DATA-INIZIO
               IF DATA-TER-CAL > ULTIMO-CALCOLATO
                   MOVE DATA-TER-CAL TO ULTIMO-CALCOLATO
               END-IF
           END-IF.
           IF IC-SSTNUML1 > 0
           AND IC-SSTCODIND = "WTWT"
               IF (H-TRA1 + H-TRA2) > IC-SSTNUML1 * (H-GGSUSS / 30)
                   COMPUTE H-TRA1 = IC-SSTNUML1 * (H-GGSUSS / 30) / 2
                   MOVE H-TRA1 TO H-TRA2
               END-IF
           END-IF.
           MOVE ZEROES TO IMPORTO-TOTALE
                          PERIODO-TOTALE.
      * 11.02.2019 APAF CAMPANIA eccezione per pagamento una tantum
           IF IC-SSTCODIND = "APAF"
           AND IC-SSTREGIND = 15
           AND IC-SSTANNIND = 17
               MOVE IC-SSTNUML1 TO H-IMPSUSS
           END-IF.
      ****
      * 03.01.2019 correttivo per pagamenti una tantum
           IF H-NUMTRA = 1
               ADD H-IMPSUSS TO IMPORTO-TOTALE
           ELSE
               ADD H-TRA1 TO IMPORTO-TOTALE
           END-IF.
           COMPUTE PERIODO-TOTALE = PERIODO-TOTALE +
                                   (H-GGSUSS / H-NUMTRA).
      *15.05.2020 COVID
      *14.08.2020 COVID
           MOVE ZEROES TO WK-COVID-DECADENZA.
      *
           IF IC-SSTCODIND = "EE27"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200301 ALSO 20200401
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200501
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200601
                   MOVE 2200 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200501
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200601
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200601
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE29"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200301 ALSO 20200401
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200501
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200601
                   MOVE 2200 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200301 ALSO 20200701
                   MOVE 3200 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200301 ALSO 20200801
                   MOVE 4200 TO IMPORTO-TOTALE
                   MOVE  150 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200301 ALSO 20200901
                   MOVE 5200 TO IMPORTO-TOTALE
                   MOVE  180 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200501
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200601
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200701
                   MOVE 2600 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200801
                   MOVE 3600 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200901
                   MOVE 4600 TO IMPORTO-TOTALE
                   MOVE  150 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200601
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200701
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200801
                   MOVE 3000 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200901
                   MOVE 4000 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200701
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200801
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200901
                   MOVE 3000 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE28"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200301 ALSO 20200401
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200501
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200501
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE30"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200301 ALSO 20200401
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200501
                   MOVE 1100 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200501
                   MOVE  500 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE38"
           OR IC-SSTCODIND = "EE2A"
           OR IC-SSTCODIND = "EE2B"
           OR IC-SSTCODIND = "EE2C"
           OR IC-SSTCODIND = "EE2D"
           OR IC-SSTCODIND = "EE13"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200301 ALSO 20200401
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200501
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200601
                   MOVE 1800 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200301 ALSO 20200701
                   MOVE 2800 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200301 ALSO 20200801
                   MOVE 3800 TO IMPORTO-TOTALE
                   MOVE  150 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200301 ALSO 20200901
                   MOVE 4800 TO IMPORTO-TOTALE
                   MOVE  180 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200501
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200601
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200701
                   MOVE 2200 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200801
                   MOVE 3200 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200901
                   MOVE 4200 TO IMPORTO-TOTALE
                   MOVE  150 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200601
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200701
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200801
                   MOVE 2600 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200901
                   MOVE 3600 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200701
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200801
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200901
                   MOVE 3000 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE05"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200401 ALSO 20200501
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200601
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200701
                   MOVE 2600 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200801
                   MOVE 3600 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200901
                   MOVE 4600 TO IMPORTO-TOTALE
                   MOVE  150 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200601
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200701
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200801
                   MOVE 3000 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200901
                   MOVE 4000 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200701
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200801
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200901
                   MOVE 3000 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE10"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200401 ALSO 20200501
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200601
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200701
                   MOVE 2200 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200801
                   MOVE 3200 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200901
                   MOVE 4200 TO IMPORTO-TOTALE
                   MOVE  150 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200601
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200701
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200801
                   MOVE 2600 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200901
                   MOVE 3600 TO IMPORTO-TOTALE
                   MOVE  120 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200701
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200801
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200901
                   MOVE 3000 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EE22"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200501 ALSO 20200601
                   MOVE  950 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EEMA"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200601 ALSO 20200701
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200601 ALSO 20200801
                   MOVE 1200 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-GIUGNO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200701 ALSO 20200801
                   MOVE  600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT  600 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EEZR"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200301 ALSO 20200401
                   MOVE  500 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200501
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20200301 ALSO 20200601
                   MOVE 1500 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  500 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200401 ALSO 20200501
                   MOVE  500 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20200401 ALSO 20200601
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-MAGGIO = "SI"
                       SUBTRACT  500 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200501 ALSO 20200601
                   MOVE  500 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EJ29"
           OR IC-SSTCODIND = "EJ38"
           OR IC-SSTCODIND = "EJ2A"
           OR IC-SSTCODIND = "EJ2B"
           OR IC-SSTCODIND = "EJ2C"
           OR IC-SSTCODIND = "EJ2D"
           OR IC-SSTCODIND = "EJ05"
           OR IC-SSTCODIND = "EJ10"
           OR IC-SSTCODIND = "EJ13"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200701 ALSO 20200801
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200701 ALSO 20200901
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                   IF SOSP-LUGLIO = "SI"
                       SUBTRACT 1000 FROM IMPORTO-TOTALE
                       SUBTRACT   30 FROM PERIODO-TOTALE
                   END-IF
                 WHEN 20200801 ALSO 20200901
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EK29"
           OR IC-SSTCODIND = "EK38"
           OR IC-SSTCODIND = "EK2A"
           OR IC-SSTCODIND = "EK2B"
           OR IC-SSTCODIND = "EK2C"
           OR IC-SSTCODIND = "EK2D"
           OR IC-SSTCODIND = "EK05"
           OR IC-SSTCODIND = "EK10"
           OR IC-SSTCODIND = "EK13"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20200801 ALSO 20200901
                   MOVE 1000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EW29"
           OR IC-SSTCODIND = "EW38"
           OR IC-SSTCODIND = "EW2A"
           OR IC-SSTCODIND = "EW2B"
           OR IC-SSTCODIND = "EW2C"
           OR IC-SSTCODIND = "EW2D"
           OR IC-SSTCODIND = "EW05"
           OR IC-SSTCODIND = "EW10"
           OR IC-SSTCODIND = "EW13"
           OR IC-SSTCODIND = "EY29"
           OR IC-SSTCODIND = "EY38"
           OR IC-SSTCODIND = "EY2A"
           OR IC-SSTCODIND = "EY2B"
           OR IC-SSTCODIND = "EY2C"
           OR IC-SSTCODIND = "EY2D"
           OR IC-SSTCODIND = "EY05"
           OR IC-SSTCODIND = "EY10"
           OR IC-SSTCODIND = "EY13"
           OR IC-SSTCODIND = "EY3A"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20210401 ALSO 20210501
                   MOVE 2400 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
                 WHEN 20210401 ALSO 20210601
                   MOVE 4000 TO IMPORTO-TOTALE
                   MOVE   60 TO PERIODO-TOTALE
                 WHEN 20210501 ALSO 20210601
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EX29"
           OR IC-SSTCODIND = "EX38"
           OR IC-SSTCODIND = "EX2A"
           OR IC-SSTCODIND = "EX2B"
           OR IC-SSTCODIND = "EX2C"
           OR IC-SSTCODIND = "EX2D"
           OR IC-SSTCODIND = "EX05"
           OR IC-SSTCODIND = "EX10"
           OR IC-SSTCODIND = "EX13"
           OR IC-SSTCODIND = "EX3A"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20210501 ALSO 20210601
                   MOVE 1600 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EX87"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20210501 ALSO 20210601
                   MOVE  800 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
           IF IC-SSTCODIND = "EX88"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20210501 ALSO 20210601
                   MOVE  950 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
211021     IF IC-SSTCODIND = "EX89"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
270522*          WHEN 20210401 ALSO 20210701
270522           WHEN 20210101 ALSO 20210401
                   MOVE 3600 TO IMPORTO-TOTALE
                   MOVE   90 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
290322     IF IC-SSTCODIND = "E092"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20211201 ALSO 20220101
                   MOVE 2000 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
807322     IF IC-SSTCODIND = "E109" or "E110" or "E112" or "E107"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20220701 ALSO 20220801
                   MOVE  200 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
130123     IF IC-SSTCODIND = "E159" or "E160" or "E162" or "E157"
               MOVE ZEROES TO IMPORTO-TOTALE
                              PERIODO-TOTALE
               MOVE IC-DCODTADEC TO WK-COVID-DECADENZA
               IF IC-SSTDADEC > 0
               AND IC-SSTDADEC < IC-DCODTADEC
                   MOVE IC-SSTDADEC TO WK-COVID-DECADENZA
               END-IF
               EVALUATE IC-DCODTDECSP ALSO WK-COVID-DECADENZA
                 WHEN 20221101 ALSO 20221201
                   MOVE  150 TO IMPORTO-TOTALE
                   MOVE   30 TO PERIODO-TOTALE
               END-EVALUATE
           END-IF.
      *
      *14.08.2020 COVID
           IF WK-COVID-DECADENZA NOT = ZEROES
               MOVE WK-COVID-DECADENZA TO DATA-AMG
               PERFORM R00-TOGLI-UNO
               MOVE DATA-AMG TO DATA-TER-CAL
                                MESE-PREC
           END-IF.
      *
      * per COVID se non vi è iban e importo > 1000 pago solo 1 mese
           IF IC-SSTCODIND = "EE27"
           OR IC-SSTCODIND = "EE28"
           OR IC-SSTCODIND = "EE29"
           OR IC-SSTCODIND = "EE38"
           OR IC-SSTCODIND = "EE2A"
           OR IC-SSTCODIND = "EE2B"
           OR IC-SSTCODIND = "EE2C"
           OR IC-SSTCODIND = "EE2D"
           OR IC-SSTCODIND = "EE05"
           OR IC-SSTCODIND = "EE10"
           OR IC-SSTCODIND = "EE13"
           OR IC-SSTCODIND = "EJ29"
           OR IC-SSTCODIND = "EJ38"
           OR IC-SSTCODIND = "EJ2A"
           OR IC-SSTCODIND = "EJ2B"
           OR IC-SSTCODIND = "EJ2C"
           OR IC-SSTCODIND = "EJ2D"
           OR IC-SSTCODIND = "EJ05"
           OR IC-SSTCODIND = "EJ10"
           OR IC-SSTCODIND = "EJ13"
           OR IC-SSTCODIND = "EK29"
           OR IC-SSTCODIND = "EK38"
           OR IC-SSTCODIND = "EK2A"
           OR IC-SSTCODIND = "EK2B"
           OR IC-SSTCODIND = "EK2C"
           OR IC-SSTCODIND = "EK2D"
           OR IC-SSTCODIND = "EK05"
           OR IC-SSTCODIND = "EK10"
           OR IC-SSTCODIND = "EK13"
              IF (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
              AND (IMPORTO-TOTALE - IC-SSTIMINT - IC-RECTORERE-1) > 1000
              AND (IMPORTO-TOTALE NOT = IC-RECTORERE-1)
                  IF (IMPORTO-TOTALE - IC-SSTIMINT
                                     - IC-RECTORERE-1) = 2000
                  OR (IMPORTO-TOTALE - IC-SSTIMINT
                                     - IC-RECTORERE-1) = 3000
                  OR (IMPORTO-TOTALE - IC-SSTIMINT
                                     - IC-RECTORERE-1) = 4000
                      COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 1000
                                             + IC-RECTORERE-1
                  ELSE
                      COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 600
                                             + IC-RECTORERE-1
                  END-IF
                  COMPUTE PERIODO-TOTALE = IC-SSTGGCALC + 30
                  EVALUATE IC-SSTULASS ALSO IC-DCODTDECSP
                    WHEN ZEROES ALSO 20200301
                        MOVE 20200331 TO DATA-TER-CAL
                                         MESE-PREC
                    WHEN ZEROES ALSO 20200401
                        MOVE 20200430 TO DATA-TER-CAL
                                         MESE-PREC
                    WHEN ZEROES ALSO 20200501
                        MOVE 20200531 TO DATA-TER-CAL
                                         MESE-PREC
                    WHEN ZEROES ALSO 20200601
                        MOVE 20200630 TO DATA-TER-CAL
                                         MESE-PREC
                    WHEN ZEROES ALSO 20200701
                        MOVE 20200731 TO DATA-TER-CAL
                                         MESE-PREC
                    WHEN ZEROES ALSO 20200801
                        MOVE 20200831 TO DATA-TER-CAL
                                         MESE-PREC
                    WHEN 20200331 ALSO ANY
                      MOVE 20200430 TO DATA-TER-CAL
                                       MESE-PREC
                    WHEN 20200430 ALSO ANY
                      MOVE 20200531 TO DATA-TER-CAL
                                       MESE-PREC
                    WHEN 20200531 ALSO ANY
                      MOVE 20200630 TO DATA-TER-CAL
                                       MESE-PREC
                    WHEN 20200630 ALSO ANY
                      MOVE 20200731 TO DATA-TER-CAL
                                       MESE-PREC
                    WHEN 20200731 ALSO ANY
                      MOVE 20200831 TO DATA-TER-CAL
                                       MESE-PREC
                  END-EVALUATE
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "EE30"
              IF (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
              AND (IMPORTO-TOTALE - IC-SSTIMINT - IC-RECTORERE-1) > 1000
              AND (IMPORTO-TOTALE NOT = IC-RECTORERE-1)
                   EVALUATE IC-SSTIMINT
                     WHEN 0
                       COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 600
                                              + IC-RECTORERE-1
                       COMPUTE PERIODO-TOTALE = IC-SSTGGCALC + 30
                     WHEN 600
                       COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 500
                                              + IC-RECTORERE-1
                       COMPUTE PERIODO-TOTALE = IC-SSTGGCALC + 30
      * rivedere se l'importo di maggio > 1000
                     WHEN OTHER
                       COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 500
                                              + IC-RECTORERE-1
                       COMPUTE PERIODO-TOTALE = IC-SSTGGCALC + 30
                   END-EVALUATE
                   EVALUATE IC-SSTULASS
                     WHEN ZEROES
                       MOVE 20200331 TO DATA-TER-CAL
                                        MESE-PREC
                     WHEN 20200331
                       MOVE 20200430 TO DATA-TER-CAL
                                        MESE-PREC
                     WHEN 20200430
                       MOVE 20200531 TO DATA-TER-CAL
                                        MESE-PREC
                   END-EVALUATE
              END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "EEMA"
              IF (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
              AND (IMPORTO-TOTALE - IC-SSTIMINT - IC-RECTORERE-1) > 1000
              AND (IMPORTO-TOTALE NOT = IC-RECTORERE-1)
                   COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 600
                                          + IC-RECTORERE-1
                   COMPUTE PERIODO-TOTALE = IC-SSTGGCALC + 30
                   EVALUATE IC-SSTULASS
                     WHEN ZEROES
                       IF IC-DCODTDECSP = 20200601
                         MOVE 20200630 TO DATA-TER-CAL
                                          MESE-PREC
                       ELSE
                         IF IC-DCODTDECSP = 20200701
                           MOVE 20200731 TO DATA-TER-CAL
                                            MESE-PREC
                         END-IF
                       END-IF
                     WHEN 20200630
                       MOVE 20200731 TO DATA-TER-CAL
                                        MESE-PREC
                     WHEN 20200731
                       MOVE 20200731 TO DATA-TER-CAL
                                        MESE-PREC
                   END-EVALUATE
               END-IF
           END-IF.
      *
           IF IC-SSTCODIND = "EEZR"
              IF (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
              AND (IMPORTO-TOTALE - IC-SSTIMINT - IC-RECTORERE-1) > 1000
              AND (IMPORTO-TOTALE NOT = IC-RECTORERE-1)
                   COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 1000
                                          + IC-RECTORERE-1
                   COMPUTE PERIODO-TOTALE = IC-SSTGGCALC + 60
                   EVALUATE IC-SSTULASS
                     WHEN ZEROES
                       IF IC-DCODTDECSP = 20200301
                         MOVE 20200430 TO DATA-TER-CAL
                                          MESE-PREC
                       ELSE
                         IF IC-DCODTDECSP = 20200401
                           MOVE 20200531 TO DATA-TER-CAL
                                            MESE-PREC
                         END-IF
                       END-IF
                     WHEN 20200331
                       MOVE 20200531 TO DATA-TER-CAL
                                        MESE-PREC
                     WHEN 20200430
                       MOVE 20200531 TO DATA-TER-CAL
                                        MESE-PREC
                   END-EVALUATE
              END-IF
           END-IF.
      *
      *    IF IC-SSTCODIND = "EW29"
      *    OR IC-SSTCODIND = "EW38"
      *    OR IC-SSTCODIND = "EW2A"
      *    OR IC-SSTCODIND = "EW2B"
      *    OR IC-SSTCODIND = "EW2C"
      *    OR IC-SSTCODIND = "EW2D"
      *    OR IC-SSTCODIND = "EW05"
      *    OR IC-SSTCODIND = "EW10"
      *    OR IC-SSTCODIND = "EW13"
      *    OR IC-SSTCODIND = "EY29"
      *    OR IC-SSTCODIND = "EY38"
      *    OR IC-SSTCODIND = "EY2A"
      *    OR IC-SSTCODIND = "EY2B"
      *    OR IC-SSTCODIND = "EY2C"
      *    OR IC-SSTCODIND = "EY2D"
      *    OR IC-SSTCODIND = "EY05"
      *    OR IC-SSTCODIND = "EY10"
      *    OR IC-SSTCODIND = "EY13"
      *    OR IC-SSTCODIND = "EY3A"
      *       IF (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
      *       AND (IMPORTO-TOTALE - IC-SSTIMINT - IC-RECTORERE-1) > 1000
      *       AND (IMPORTO-TOTALE NOT = IC-RECTORERE-1)
220621* temporaneamente non pago se l'importo è > 1000 euro e NO IBAN
220621*            MOVE 25 TO OC-RETCODE
220621*            MOVE "TEMPORANEAMENTE SOSPESO BONIFICO DOMICILIATO"
220621*              TO OC-MESSAGGIO
220621*            GOBACK
220621*
      *            COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 800
      *                                   + IC-RECTORERE-1
      *            COMPUTE PERIODO-TOTALE = 60
      *            EVALUATE IC-SSTULASS
      *              WHEN ZEROES
      *                IF IC-DCODTDECSP = 20210401
      *                  MOVE 20210531 TO DATA-TER-CAL
      *                                   MESE-PREC
      *                ELSE
      *                  NEXT SENTENCE
      *                END-IF
      *              WHEN 20210430
      *                MOVE 20210531 TO DATA-TER-CAL
      *                                 MESE-PREC
      *              WHEN 20210531
      *                MOVE 20210531 TO DATA-TER-CAL
      *                                 MESE-PREC
      *            END-EVALUATE
      *        END-IF
      *    END-IF.
      *
      *    IF IC-SSTCODIND = "EX29"
      *    OR IC-SSTCODIND = "EX38"
      *    OR IC-SSTCODIND = "EX2A"
      *    OR IC-SSTCODIND = "EX2B"
      *    OR IC-SSTCODIND = "EX2C"
      *    OR IC-SSTCODIND = "EX2D"
      *    OR IC-SSTCODIND = "EX05"
      *    OR IC-SSTCODIND = "EX10"
      *    OR IC-SSTCODIND = "EX13"
      *    OR IC-SSTCODIND = "EX3A"
      *       IF (IC-DCOCOOBAN = SPACES OR IC-DCOCOOBAN = LOW-VALUE)
      *       AND (IMPORTO-TOTALE - IC-SSTIMINT - IC-RECTORERE-1) > 1000
      *       AND (IMPORTO-TOTALE NOT = IC-RECTORERE-1)
220621* temporaneamente non pago se l'importo è > 1000 euro e NO IBAN
220621*            MOVE 25 TO OC-RETCODE
220621*            MOVE "TEMPORANEAMENTE SOSPESO BONIFICO DOMICILIATO"
220621*              TO OC-MESSAGGIO
220621*            GOBACK
220621*
      *            COMPUTE IMPORTO-TOTALE = IC-SSTIMINT + 800
      *                                   + IC-RECTORERE-1
      *            COMPUTE PERIODO-TOTALE = 30
      *            EVALUATE IC-SSTULASS
      *              WHEN ZEROES
      *                IF IC-DCODTDECSP = 20210501
      *                  MOVE 20210531 TO DATA-TER-CAL
      *                                   MESE-PREC
      *                ELSE
      *                  NEXT SENTENCE
      *                END-IF
      *              WHEN 20210531
      *                MOVE 20210531 TO DATA-TER-CAL
      *                                 MESE-PREC
      *            END-EVALUATE
      *        END-IF
      *    END-IF.
      *
           IF IC-SSTCODIND = "SRPT"
               MOVE 60 TO PERIODO-TOTALE
               IF IC-SSTDTA2T NOT = ZEROES
               AND IC-SSTDTA2T NOT > DATA-SISTEMA-AMG
                   ADD H-TRA2 TO IMPORTO-TOTALE
                   ADD 90 TO PERIODO-TOTALE
               END-IF
           ELSE
               IF IC-SSTDTA2T NOT = ZEROES
               AND IC-SSTDTA2T NOT > DATA-SISTEMA-AMG
                   ADD H-TRA2 TO IMPORTO-TOTALE
                   COMPUTE PERIODO-TOTALE = PERIODO-TOTALE +
                                           (H-GGSUSS / H-NUMTRA)
               END-IF
           END-IF.
           IF IC-SSTDTA3T NOT = ZEROES
           AND IC-SSTDTA3T NOT > DATA-SISTEMA-AMG
               ADD H-TRA3 TO IMPORTO-TOTALE
               COMPUTE PERIODO-TOTALE = PERIODO-TOTALE +
                                       (H-GGSUSS / H-NUMTRA)
           END-IF.
           IF IC-SSTDTA4T NOT = ZEROES
           AND IC-SSTDTA4T NOT > DATA-SISTEMA-AMG
               ADD H-TRA4 TO IMPORTO-TOTALE
               COMPUTE PERIODO-TOTALE = PERIODO-TOTALE +
                                       (H-GGSUSS / H-NUMTRA)
           END-IF.
      *-------------------------------------------------------------*
       T21-COVID-SOSPE.
      *-------------------------------------------------------------*
           MOVE "NO" TO SOSP-MAGGIO
                        SOSP-GIUGNO
                        SOSP-LUGLIO.
           EXEC SQL
                 SELECT
                    H_SOSDTINSOS,
                    H_SOSCHIDOM,
                    H_SOSDTFISOS
                 INTO
                   :H-SOSDTINSOS,
                   :H-SOSCHIDOM,
                   :H-SOSDTFISOS
                 FROM TDSSOSPE
                 WHERE
                    H_SOSCHIDOM      =  :IC-DCOCHIDOM
                 AND
                    H_SOSDTINSOS     =  20200501
           END-EXEC.
      *
           IF SQLCODE = ZERO
              IF  H-SOSDTINSOS = 20200501
              AND H-SOSDTFISOS = 20200531
              AND IC-SSTCODIND = "EE29"
                 MOVE "SI" TO SOSP-MAGGIO
              END-IF
           END-IF.
      *
           EXEC SQL
                 SELECT
                    H_SOSDTINSOS,
                    H_SOSCHIDOM,
                    H_SOSDTFISOS
                 INTO
                   :H-SOSDTINSOS,
                   :H-SOSCHIDOM,
                   :H-SOSDTFISOS
                 FROM TDSSOSPE
                 WHERE
                    H_SOSCHIDOM      =  :IC-DCOCHIDOM
                  AND
                    H_SOSDTINSOS     =  20200601
           END-EXEC.
      *
           IF SQLCODE = ZERO
              IF  H-SOSDTINSOS = 20200601
              AND H-SOSDTFISOS = 20200630
                 MOVE "SI" TO SOSP-GIUGNO
              ELSE
                 IF  H-SOSDTINSOS = 20200601
                 AND H-SOSDTFISOS = 20200731
                     MOVE "SI" TO SOSP-GIUGNO
                     MOVE "SI" TO SOSP-LUGLIO
                 END-IF
              END-IF
           END-IF.
      *
           EXEC SQL
                 SELECT
                    H_SOSDTINSOS,
                    H_SOSCHIDOM,
                    H_SOSDTFISOS
                 INTO
                   :H-SOSDTINSOS,
                   :H-SOSCHIDOM,
                   :H-SOSDTFISOS
                 FROM TDSSOSPE
                 WHERE
                    H_SOSCHIDOM      =  :IC-DCOCHIDOM
                  AND
                    H_SOSDTINSOS     =  20200701
           END-EXEC.
      *
           IF SQLCODE = ZERO
              IF  H-SOSDTINSOS = 20200701
              AND H-SOSDTFISOS = 20200731
                 MOVE "SI" TO SOSP-LUGLIO
              END-IF
           END-IF.
      *-------------------------------------------------------------*
       R00-TOGLI-UNO.
      *-------------------------------------------------------------*
           COMPUTE GG-AMG = GG-AMG - 1.
           IF GG-AMG = 0
               IF MM-AMG = 1
                   MOVE 31 TO GG-AMG
                   MOVE 12 TO MM-AMG
                   COMPUTE AA-AMG = AA-AMG - 1
               ELSE
                   IF MM-AMG = 2
                          OR = 4
                          OR = 6
                          OR = 8
                          OR = 9
                          OR = 11
                       MOVE 31 TO GG-AMG
                   ELSE
                       IF MM-AMG = 5
                              OR = 7
                              OR = 10
                              OR = 12
                           MOVE 30 TO GG-AMG
                       ELSE
                           DIVIDE 4 INTO AA-AMG GIVING NUMERO
                                              REMAINDER RESTO
                           IF RESTO = 0
                               MOVE 29 TO GG-AMG
                           ELSE
                               MOVE 28 TO GG-AMG
                           END-IF
                       END-IF
                   END-IF
               COMPUTE MM-AMG = MM-AMG - 1
               END-IF
           END-IF.
      *-------------------------------------------------------------*
       R10-AGGIUNGI-UNO.
      *-------------------------------------------------------------*
           COMPUTE GG-AMG = GG-AMG + 1.
           IF MM-AMG = 1
                  OR = 3
                  OR = 5
                  OR = 7
                  OR = 8
                  OR = 10
               IF GG-AMG > 31
                   MOVE 1 TO GG-AMG
                   COMPUTE MM-AMG = MM-AMG + 1
               END-IF
           ELSE
               IF MM-AMG = 4
                      OR = 6
                      OR = 9
                      OR = 11
                   IF GG-AMG > 30
                       MOVE 1 TO GG-AMG
                       COMPUTE MM-AMG = MM-AMG + 1
                   END-IF
               ELSE
                   IF MM-AMG = 12
                       IF GG-AMG > 31
                           MOVE 1 TO GG-AMG
                           MOVE 1 TO MM-AMG
                           COMPUTE AA-AMG = AA-AMG + 1
                       END-IF
                   ELSE
                       IF MM-AMG = 2
                           IF GG-AMG = 29
                               DIVIDE 4 INTO AA-AMG GIVING NUMERO
                                                  REMAINDER RESTO
                               IF RESTO NOT = 0
                                   MOVE 1 TO GG-AMG
                                   COMPUTE MM-AMG = MM-AMG + 1
                               END-IF
                           ELSE
                               IF GG-AMG = 30
                                   MOVE 1 TO GG-AMG
                                   COMPUTE MM-AMG = MM-AMG + 1
                               END-IF
                           END-IF
                       END-IF
                   END-IF
               END-IF
           END-IF.
      *
      *
       B00-DB2-SELECT.
      *
           MOVE  'B00-DB2-SELECT' TO  WABNDB-LABEL.
      *
           EXEC SQL
                 SELECT
                    H_ANFSN,
                    H_ANNOCTG,
                    H_CFENTE,
                    H_CODCTG,
                    H_COMPDS,
                    H_CONTO1,
                    H_CONTO2,
                    H_CONTO3,
                    H_CONTO4,
                    H_CONTO5,
                    H_CONTO6,
                    H_DECMAX,
                    H_DECMIN,
                    H_DENENTE,
                    H_DESCTG,
                    H_FIGSN,
                    H_FINANZ,
                    H_GGMINSERV,
                    H_GGSUSS,
                    H_IMPSUSS,
                    H_NUMTRA,
                    H_ORECONTR,
                    H_PERCENTE,
                    H_PERCSUSS,
                    H_PROGCTG,
                    H_REGCTG,
                    H_REGIONE1,
                    H_REGIONE2,
                    H_REGIONE3,
                    H_REGIONE4,
                    H_REGIONE5,
                    H_SLITTA,
                    H_TFISCALE,
                    H_TIPO,
                    H_TRA1,
                    H_TRA2,
                    H_TRA3,
                    H_TRA4
                 INTO
                   :H-ANFSN,
                   :H-ANNOCTG,
                   :H-CFENTE,
                   :H-CODCTG,
                   :H-COMPDS,
                   :H-CONTO1,
                   :H-CONTO2,
                   :H-CONTO3,
                   :H-CONTO4,
                   :H-CONTO5,
                   :H-CONTO6,
                   :H-DECMAX,
                   :H-DECMIN,
                   :H-DENENTE,
                   :H-DESCTG,
                   :H-FIGSN,
                   :H-FINANZ,
                   :H-GGMINSERV,
                   :H-GGSUSS,
                   :H-IMPSUSS,
                   :H-NUMTRA,
                   :H-ORECONTR,
                   :H-PERCENTE,
                   :H-PERCSUSS,
                   :H-PROGCTG,
                   :H-REGCTG,
                   :H-REGIONE1,
                   :H-REGIONE2,
                   :H-REGIONE3,
                   :H-REGIONE4,
                   :H-REGIONE5,
                   :H-SLITTA,
                   :H-TFISCALE,
                   :H-TIPO,
                   :H-TRA1,
                   :H-TRA2,
                   :H-TRA3,
                   :H-TRA4
                 FROM TDSSX00
                 WHERE
                    H_CODCTG         =  :H-CODCTG
               AND  H_REGCTG         =  :H-REGCTG
               AND  H_ANNOCTG        =  :H-ANNOCTG
           END-EXEC.
      *
           IF SQLCODE NOT = ZERO AND NOT = 100
                DISPLAY 'DCLTDSSX00 =' DCLTDSSX00
                MOVE 'TDSSX00 '      TO  WABNDB-TABL
                MOVE 'SELECT'        TO  WABNDB-FUNC
                PERFORM ERRORE-SQL
           END-IF.
           move  SQLCODE               to  STATUS-CATEGORIE.
      *
       B00-DB2-SELECT-EX.
           EXIT.
      *
       PNPGF-CC-NUOVO.
      *10.08.2020
           MOVE ZEROES TO WK-CONGUAGLIO-730.
      *
           move  'CC'           to  TIPO-RICHIESTA.
           INITIALIZE LK-AREA-CONGUAGLI.
           move  FANNOFISC      to  ANNOFISC-CC.
           move  C-MESERIF      to  LK-C-MESERIF.
           MOVE FCODPROCED      TO LK-PROCED.
           MOVE FDATAELAB(5:2)  TO LK-MMELAB.
           MOVE FDATAELAB       TO LK-DTELAB.
           MOVE SPACES          TO RET-CODE.
           call  RDSUT29  using
                               WDFHEIBLK  WDFHCOMMAREA
                               RICHIESTA
                               LINK-CONGUAGLIO.
           cancel  RDSUT29.
           IF  RET-CODE NOT = SPACES
               move zeroes to WK-CONGUAGLIO-730
               move 16 to   OC-RETCODE
               string "Errore  In Procedura Fiscale -"
                                   RET-CODE  " - "
                                   RET-CODE-CHIARO DELIMITED BY SIZE
                           into  OC-MESSAGGIO
               GO TO PNPGF-CC-NUOVO-EX
           END-IF.
      *
      * AREA CONGUAGLIO
      *
           IF IMPIRPEF-LK NUMERIC
               MOVE IMPIRPEF-LK    TO    FCONGAP
           ELSE
               MOVE ZEROES         TO    FCONGAP
           END-IF.
           IF IMPREGIO-LK NUMERIC
               MOVE IMPREGIO-LK    TO    FIMPREGAP
           ELSE
               MOVE ZEROES         TO    FIMPREGAP
           END-IF.
           IF IMPCOMUN-LK NUMERIC
               MOVE IMPCOMUN-LK    TO    FIMPCOMAP
           ELSE
               MOVE ZEROES         TO    FIMPCOMAP
           END-IF.
      * 10.08.2020
           IF DIFFPROV-CC(1) NUMERIC
               MOVE DIFFPROV-CC(1) TO    WK-CONGUAGLIO-730
           ELSE
               MOVE ZEROES         TO    WK-CONGUAGLIO-730
           END-IF.
120515*    MOVE PRECONG-CC(1)  TO    FCONGAC.
      *
      * acconto add. comunale
      *
           IF IC-SSTCODIND = "TRAC"
           OR IC-SSTCODIND = "TRAF"
           OR IC-SSTCODIND = "TRAS"
           OR IC-SSTCODIND = "TRAP"
           OR IC-SSTCODIND = "TRAD"
           OR IC-SSTCODIND = "CRED"
           OR  IC-SSTCODIND = "FTMD"
           OR  IC-SSTCODIND = "FTSO"
           OR  IC-SSTCODIND = "FTCG"
           OR  IC-SSTCODIND = "FTCD"
           OR  IC-SSTCODIND = "FTCC"
           OR  IC-SSTCODIND = "FTPL"
           OR  IC-SSTCODIND = "FTAI"
           OR  IC-SSTCODIND = "FTAD"
260324     OR  IC-SSTCODIND = "FSAI"
270324     OR  IC-SSTCODIND = "FSAD"
100424     OR  IC-SSTCODIND = "FTCI"
      * 10.05.2018 inserito conguaglio fiscale anche per SSEP
      *    OR  IC-SSTCODIND = "SSEP"
      *
           THEN
              IF IMPACCCOM-LK NUMERIC
                  MOVE IMPACCCOM-LK   TO    FIMPCOMAC
              ELSE
                  MOVE ZEROES         TO    FIMPCOMAC
              END-IF
           ELSE
              MOVE 0              TO    FIMPCOMAC
           END-IF.
      *
       PNPGF-CC-NUOVO-EX.
           EXIT.
      *
      *
       PNPGF-AL-NUOVO.
      *
      * chiamata PCOCO                                        *
           if  IC-DANCCORE   > zeros
               MOVE IC-DANCCORE TO    L-CODICECOMUNE
               MOVE SPACES      TO    L-NOMECOMUNE
               CALL RDSUT17 USING
                    WDFHEIBLK  WDFHCOMMAREA
                    L-AREA-COMUNE
               IF  L-RETCODE = "00"
                   MOVE L-COMUNE-FISCO TO COMUNE-FISCO
               ELSE
                   MOVE SPACES         TO COMUNE-FISCO
               END-IF
           else
               move  SPACES          to COMUNE-FISCO
           end-if.
           move  SPACES         to  RET-CODE RET-CODE-CHIARO.
           move  IC-CODSEDE     to  CODSEDE.
           move  IC-DCOCENOPE   to  CENTROOP.
           move  FCODPROCED     to  CODIPROC.
           move  IC-CODFISARCA  to  CODFISC.
           move  FDATADAL       to  DATAINIZ.
           move  FDATAAL        to  DATAFINE.
      *
      * AREA INVIO
      *
           move  FCODCALCOLO    to  TIPO-CALCOLO.
           move  FDATAELAB      to  DATAELAB.
   FIS*    move  'S'            to  PENSIONATO.
      *
           MOVE CAMPO           TO  WRK-APPOGGIO.
           MOVE ZEROES          TO  WK-CONGUAGLIO-730.
      * chiamata conguaglio fiscale
      * escluso per CRED, FTAI e altre integr. di importo
           IF H-TFISCALE NOT = "13"
      *     AND IC-SSTCODIND NOT = "CRED"
               IF IC-SSTCODIND = "TRAC"
               OR IC-SSTCODIND = "TRAF"
               OR IC-SSTCODIND = "TRAP"
               OR IC-SSTCODIND = "TRAS"
      *        OR IC-SSTCODIND = "TRAD"
      *        OR IC-SSTCODIND = "CRED"
               OR  IC-SSTCODIND = "FTMD"
               OR  IC-SSTCODIND = "FTSO"
               OR  IC-SSTCODIND = "FTCG"
               OR  IC-SSTCODIND = "FTCD"
               OR  IC-SSTCODIND = "FTCC"
               OR  IC-SSTCODIND = "FTPL"
      *        OR  IC-SSTCODIND = "FTAI"
               OR  IC-SSTCODIND = "FTAD"
270324         OR  IC-SSTCODIND = "FSAD"
100424         OR  IC-SSTCODIND = "FTCI"
      * 10.05.2018 inserito conguaglio fiscale anche per SSEP
      *        OR  IC-SSTCODIND = "SSEP"
                   PERFORM PNPGF-CC-NUOVO  THRU PNPGF-CC-NUOVO-EX
               END-IF
           END-IF.
           MOVE WRK-APPOGGIO    TO  CAMPO.
      *
           move  'CT'           to  TIPO-RICHIESTA.
      *------------------------------------------- TASSAZIONE CORRENTE
           move  FACGGPREST     to  GG-CALCOLO-TC.
           move  FACGGDETRAZ    to  GG-DETRAZ-TC.
           move  FACIMPONIBILE  to  IMPORTO-TC.
           move  FACTREDICESIMA to  IMPORTO-NO-TC.
      *------------------------------------------- TASSAZIONE SEPARATA
           move  FAPGGPREST     to  GG-CALCOLO-TS.
           move  FAPIMPONIBILE  to  IMPORTO-TS.
           move  zeroes         to  ALIQMEDIA-TS.
      *
       PNPGF-AL-NUOVO-EX.
           EXIT.
      *
       PNPGF-DAL-NUOVO.
      *
      * tassazione corrente
      *
      *    move  TC-DAL            to FDATADAL.
      *    move  TC-AL             to FDATAAL.
           move  TC-IMPOSTA-LORDA  to FACIMPLORDA.
           move  TC-IMPDETRAZLAV   to FACIMPDETRLAV.
           move  TC-IMPDETRAZFAM   to FACIMPDETRFAM.
           move  TC-IMPDETRAZ      to FACIMPDETRAZ.
           move  TC-GGDETRAZ       to FACGGDETRAZ.
           move  TC-IMPOSTA-NETTA  to FACIMPNETTA.
      *
      * Addizionali Anno Corrente vengono gestite solo le comunali
      * dal programma di Conguaglio Fiscale 'CC'
      *
    GG*    move  TC-ADDIZ-REG      to FIMPREGAC .
    GG*    move  TC-ADDIZ-COM      to FIMPCOMAC .
           move  TC-CODPAGA2       to FCODPAGA2 .
           move  TC-IMPPAGA2       to FIMPPAGA2 .
      *
      * tassazione separata
      *
      *    move  TS-DAL            to FDATADAL.
      *    move  TS-AL             to FDATAAL.
           move  TS-IMPOSTA-LORDA  to FAPIMPLORDA.
      *    move  TS-IMPDETRAZLAV   to FAPIMPDETRLAV.
      *    move  TS-IMPDETRAZFAM   to FAPIMPDETRFAM.
           move  TS-IMPDETRAZ      to FAPIMPDETRAZ.
           move  TS-GGDETRAZ       to FAPGGDETRAZ.
           move  TS-IMPOSTA-NETTA  to FAPIMPNETTA.
      *    move  TS-ALIQUOTA-MEDIA to XXXXXXX   .
   gg *    move  TS-ADDIZ-REG      to FIMPREGAP .
   gg *    move  TS-ADDIZ-COM      to FIMPCOMAP .
           move  TS-CODPAGA3       to FCODPAGA3 .
           move  TS-IMPPAGA3       to FIMPPAGA3 .
      *
       PNPGF-DAL-NUOVO-EX.
      *
           EXIT.
      *
      *----------- AREA RIEPILOGO
      *
       PNPGF-RP-NUOVO.
      *
           INITIALIZE AREA-INVIO of CAMPO-CALC-FISC.
           move  FCODSEDE                TO  CODSEDE.
           move  FCODCENTRO              TO  CENTROOP.
           move  FCODPROCED              TO  CODIPROC.
           move  FCODFISCO               TO  CODFISC.
      *    move  FDATAELAB               TO  DATAELAB.
           move  FDATADAL                TO  DATAINIZ.
           move  FDATAAL                 TO  DATAFINE.
      ****
           move  "RP"           to  TIPO-RICHIESTA.
           INITIALIZE CAMPO-RIEPILOGO-CONT.
           move FANNOFISC       to ANNOFISC-RP.
           MOVE FNUMPRATICA     TO NUMEPRAT-RP.
           MOVE SPACES          TO RET-CODE.
      *
           call    PNPGF8E  using
                                  WDFHEIBLK
                                  RICHIESTA.

           IF  RET-CODE  = SPACES        OR
               RET-CODE  = ' 000000100'  OR
               RET-CODE  = '-000000305'
                   move spaces       to RET-CODE
                   MOVE IMPOCDAC-RP  TO RACIMPONIBILE
                   MOVE GGDETRAC-RP  TO RACGGDETRAZ
                   MOVE GGPRESAP-RP  TO RACGGPREST
           ELSE
                   move  9 to    FCODRITORNO
           END-IF.
      *
       PNPGF-RP-NUOVO-EX.
           EXIT.
      *
      *
      *----------------------------------------- COPY PER GESTIONE
      *
           EXEC SQL INCLUDE CDSABNDB END-EXEC.
